#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserMatchOptionButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ActivityBrowserMatchOptionButton.ActivityBrowserMatchOptionButton_C.ExecuteUbergraph_ActivityBrowserMatchOptionButton
// 0x0098 (0x0098 - 0x0000)
struct ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsPublic;                       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x005C(0x0014)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0080(0x0014)()
};
static_assert(alignof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton) == 0x000008, "Wrong alignment on ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton");
static_assert(sizeof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton) == 0x000098, "Wrong size on ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, EntryPoint) == 0x000000, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000018, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000020, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000030, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000038, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result) == 0x000040, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue) == 0x000048, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x000050, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, K2Node_CustomEvent_IsPublic) == 0x000059, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::K2Node_CustomEvent_IsPublic' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, K2Node_MakeStruct_SlateColor) == 0x00005C, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton, K2Node_MakeStruct_SlateColor_1) == 0x000080, "Member 'ActivityBrowserMatchOptionButton_C_ExecuteUbergraph_ActivityBrowserMatchOptionButton::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function ActivityBrowserMatchOptionButton.ActivityBrowserMatchOptionButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserMatchOptionButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserMatchOptionButton_C_PreConstruct) == 0x000001, "Wrong alignment on ActivityBrowserMatchOptionButton_C_PreConstruct");
static_assert(sizeof(ActivityBrowserMatchOptionButton_C_PreConstruct) == 0x000001, "Wrong size on ActivityBrowserMatchOptionButton_C_PreConstruct");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ActivityBrowserMatchOptionButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ActivityBrowserMatchOptionButton.ActivityBrowserMatchOptionButton_C.SetButtonMaterial
// 0x00C0 (0x00C0 - 0x0000)
struct ActivityBrowserMatchOptionButton_C_SetButtonMaterial final
{
public:
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x00B0)()
};
static_assert(alignof(ActivityBrowserMatchOptionButton_C_SetButtonMaterial) == 0x000010, "Wrong alignment on ActivityBrowserMatchOptionButton_C_SetButtonMaterial");
static_assert(sizeof(ActivityBrowserMatchOptionButton_C_SetButtonMaterial) == 0x0000C0, "Wrong size on ActivityBrowserMatchOptionButton_C_SetButtonMaterial");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_SetButtonMaterial, CallFunc_MakeVector2D_ReturnValue) == 0x000000, "Member 'ActivityBrowserMatchOptionButton_C_SetButtonMaterial::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_SetButtonMaterial, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'ActivityBrowserMatchOptionButton_C_SetButtonMaterial::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_SetButtonMaterial, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'ActivityBrowserMatchOptionButton_C_SetButtonMaterial::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function ActivityBrowserMatchOptionButton.ActivityBrowserMatchOptionButton_C.SetFontMaterial
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserMatchOptionButton_C_SetFontMaterial final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserMatchOptionButton_C_SetFontMaterial) == 0x000008, "Wrong alignment on ActivityBrowserMatchOptionButton_C_SetFontMaterial");
static_assert(sizeof(ActivityBrowserMatchOptionButton_C_SetFontMaterial) == 0x000008, "Wrong size on ActivityBrowserMatchOptionButton_C_SetFontMaterial");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_SetFontMaterial, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000000, "Member 'ActivityBrowserMatchOptionButton_C_SetFontMaterial::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");

// Function ActivityBrowserMatchOptionButton.ActivityBrowserMatchOptionButton_C.SetPublicState
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserMatchOptionButton_C_SetPublicState final
{
public:
	bool                                          IsPublic;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserMatchOptionButton_C_SetPublicState) == 0x000001, "Wrong alignment on ActivityBrowserMatchOptionButton_C_SetPublicState");
static_assert(sizeof(ActivityBrowserMatchOptionButton_C_SetPublicState) == 0x000001, "Wrong size on ActivityBrowserMatchOptionButton_C_SetPublicState");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_SetPublicState, IsPublic) == 0x000000, "Member 'ActivityBrowserMatchOptionButton_C_SetPublicState::IsPublic' has a wrong offset!");

// Function ActivityBrowserMatchOptionButton.ActivityBrowserMatchOptionButton_C.SetText
// 0x0020 (0x0020 - 0x0000)
struct ActivityBrowserMatchOptionButton_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserMatchOptionButton_C_SetText) == 0x000008, "Wrong alignment on ActivityBrowserMatchOptionButton_C_SetText");
static_assert(sizeof(ActivityBrowserMatchOptionButton_C_SetText) == 0x000020, "Wrong size on ActivityBrowserMatchOptionButton_C_SetText");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_SetText, Text) == 0x000000, "Member 'ActivityBrowserMatchOptionButton_C_SetText::Text' has a wrong offset!");
static_assert(offsetof(ActivityBrowserMatchOptionButton_C_SetText, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'ActivityBrowserMatchOptionButton_C_SetText::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

}

