#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserSoloButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortTextButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserSoloButton.ActivityBrowserSoloButton_C
// 0x00C0 (0x1050 - 0x0F90)
class UActivityBrowserSoloButton_C final : public UFortTextButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pressed;                                           // 0x0F98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0FA0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                ButtonMaterialBorder;                              // 0x0FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentHB;                                         // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DynamicPaddingBorder;                              // 0x0FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MinSizesSB;                                        // 0x0FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_Description;                                // 0x0FC8(0x0018)(Edit, BlueprintVisible)
	float                                         TextShearX;                                        // 0x0FE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TextShearY;                                        // 0x0FE4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                TextPadding;                                       // 0x0FE8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsDisabled;                                        // 0x0FF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FF9[0x7];                                      // 0x0FF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ButtonMaterial;                                    // 0x1000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ButtonSharpnessX;                                  // 0x1008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ButtonSharpnessY;                                  // 0x100C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UseBoxScalingX;                                    // 0x1010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UseBoxScalingY;                                    // 0x1014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ButtonBoxScaleSizeX;                               // 0x1018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ButtonBoxScaleSizeY;                               // 0x101C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DisabledParamName;                                 // 0x1020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SharpnessVParamName;                               // 0x1028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SharpnessUParamName;                               // 0x1030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UseBoxScaleUParamName;                             // 0x1038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UseBoxScaleVParamName;                             // 0x1040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideButtonBackingOnGamepad;                        // 0x1048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnDeselected();
	void BP_OnDisabled();
	void BP_OnEnabled();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void Construct();
	void Destruct();
	void EventOnInputMethodChanged(ECommonInputType bNewInputType);
	void ExecuteUbergraph_ActivityBrowserSoloButton(int32 EntryPoint);
	void Finished_3B04A1D04A2128E7C8B3D5BC22792871();
	void PreConstruct(bool IsDesignTime);
	void ResetFontMaterial();
	void ResetMaterials();
	void SetButtonMaterial();
	void SetText(const class FText& Text);
	void SetTextStyle();
	void UpdateStylingOnInputType(ECommonInputType Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserSoloButton_C">();
	}
	static class UActivityBrowserSoloButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserSoloButton_C>();
	}
};
static_assert(alignof(UActivityBrowserSoloButton_C) == 0x000010, "Wrong alignment on UActivityBrowserSoloButton_C");
static_assert(sizeof(UActivityBrowserSoloButton_C) == 0x001050, "Wrong size on UActivityBrowserSoloButton_C");
static_assert(offsetof(UActivityBrowserSoloButton_C, UberGraphFrame) == 0x000F90, "Member 'UActivityBrowserSoloButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, Pressed) == 0x000F98, "Member 'UActivityBrowserSoloButton_C::Pressed' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, Hover) == 0x000FA0, "Member 'UActivityBrowserSoloButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, ButtonMaterialBorder) == 0x000FA8, "Member 'UActivityBrowserSoloButton_C::ButtonMaterialBorder' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, ContentHB) == 0x000FB0, "Member 'UActivityBrowserSoloButton_C::ContentHB' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, DynamicPaddingBorder) == 0x000FB8, "Member 'UActivityBrowserSoloButton_C::DynamicPaddingBorder' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, MinSizesSB) == 0x000FC0, "Member 'UActivityBrowserSoloButton_C::MinSizesSB' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, Button_Description) == 0x000FC8, "Member 'UActivityBrowserSoloButton_C::Button_Description' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, TextShearX) == 0x000FE0, "Member 'UActivityBrowserSoloButton_C::TextShearX' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, TextShearY) == 0x000FE4, "Member 'UActivityBrowserSoloButton_C::TextShearY' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, TextPadding) == 0x000FE8, "Member 'UActivityBrowserSoloButton_C::TextPadding' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, IsDisabled) == 0x000FF8, "Member 'UActivityBrowserSoloButton_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, ButtonMaterial) == 0x001000, "Member 'UActivityBrowserSoloButton_C::ButtonMaterial' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, ButtonSharpnessX) == 0x001008, "Member 'UActivityBrowserSoloButton_C::ButtonSharpnessX' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, ButtonSharpnessY) == 0x00100C, "Member 'UActivityBrowserSoloButton_C::ButtonSharpnessY' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, UseBoxScalingX) == 0x001010, "Member 'UActivityBrowserSoloButton_C::UseBoxScalingX' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, UseBoxScalingY) == 0x001014, "Member 'UActivityBrowserSoloButton_C::UseBoxScalingY' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, ButtonBoxScaleSizeX) == 0x001018, "Member 'UActivityBrowserSoloButton_C::ButtonBoxScaleSizeX' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, ButtonBoxScaleSizeY) == 0x00101C, "Member 'UActivityBrowserSoloButton_C::ButtonBoxScaleSizeY' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, DisabledParamName) == 0x001020, "Member 'UActivityBrowserSoloButton_C::DisabledParamName' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, SharpnessVParamName) == 0x001028, "Member 'UActivityBrowserSoloButton_C::SharpnessVParamName' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, SharpnessUParamName) == 0x001030, "Member 'UActivityBrowserSoloButton_C::SharpnessUParamName' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, UseBoxScaleUParamName) == 0x001038, "Member 'UActivityBrowserSoloButton_C::UseBoxScaleUParamName' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, UseBoxScaleVParamName) == 0x001040, "Member 'UActivityBrowserSoloButton_C::UseBoxScaleVParamName' has a wrong offset!");
static_assert(offsetof(UActivityBrowserSoloButton_C, HideButtonBackingOnGamepad) == 0x001048, "Member 'UActivityBrowserSoloButton_C::HideButtonBackingOnGamepad' has a wrong offset!");

}

