#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserLobbyTileButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActivityBrowserLobbyTileButton.ActivityBrowserLobbyTileButton_C.ExecuteUbergraph_ActivityBrowserLobbyTileButton
// 0x0048 (0x0048 - 0x0000)
struct ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsLoading;                           // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         K2Node_Event_Texture;                              // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton) == 0x000008, "Wrong alignment on ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton");
static_assert(sizeof(ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton) == 0x000048, "Wrong size on ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton");
static_assert(offsetof(ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton, EntryPoint) == 0x000000, "Member 'ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton, K2Node_Event_bIsLoading) == 0x000004, "Member 'ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton::K2Node_Event_bIsLoading' has a wrong offset!");
static_assert(offsetof(ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton, K2Node_Event_Texture) == 0x000008, "Member 'ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton::K2Node_Event_Texture' has a wrong offset!");
static_assert(offsetof(ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000030, "Member 'ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000038, "Member 'ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton, CallFunc_K2_GetTextureParameterValue_ReturnValue) == 0x000040, "Member 'ActivityBrowserLobbyTileButton_C_ExecuteUbergraph_ActivityBrowserLobbyTileButton::CallFunc_K2_GetTextureParameterValue_ReturnValue' has a wrong offset!");

// Function ActivityBrowserLobbyTileButton.ActivityBrowserLobbyTileButton_C.OnPreviewImageChanged
// 0x0010 (0x0010 - 0x0000)
struct ActivityBrowserLobbyTileButton_C_OnPreviewImageChanged final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         Texture;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserLobbyTileButton_C_OnPreviewImageChanged) == 0x000008, "Wrong alignment on ActivityBrowserLobbyTileButton_C_OnPreviewImageChanged");
static_assert(sizeof(ActivityBrowserLobbyTileButton_C_OnPreviewImageChanged) == 0x000010, "Wrong size on ActivityBrowserLobbyTileButton_C_OnPreviewImageChanged");
static_assert(offsetof(ActivityBrowserLobbyTileButton_C_OnPreviewImageChanged, bIsLoading) == 0x000000, "Member 'ActivityBrowserLobbyTileButton_C_OnPreviewImageChanged::bIsLoading' has a wrong offset!");
static_assert(offsetof(ActivityBrowserLobbyTileButton_C_OnPreviewImageChanged, Texture) == 0x000008, "Member 'ActivityBrowserLobbyTileButton_C_OnPreviewImageChanged::Texture' has a wrong offset!");

// Function ActivityBrowserLobbyTileButton.ActivityBrowserLobbyTileButton_C.OnSelectedMatchmaking
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserLobbyTileButton_C_OnSelectedMatchmaking final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserLobbyTileButton_C_OnSelectedMatchmaking) == 0x000008, "Wrong alignment on ActivityBrowserLobbyTileButton_C_OnSelectedMatchmaking");
static_assert(sizeof(ActivityBrowserLobbyTileButton_C_OnSelectedMatchmaking) == 0x000008, "Wrong size on ActivityBrowserLobbyTileButton_C_OnSelectedMatchmaking");
static_assert(offsetof(ActivityBrowserLobbyTileButton_C_OnSelectedMatchmaking, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'ActivityBrowserLobbyTileButton_C_OnSelectedMatchmaking::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function ActivityBrowserLobbyTileButton.ActivityBrowserLobbyTileButton_C.OnUnSelectedMatchmakingCanceled
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserLobbyTileButton_C_OnUnSelectedMatchmakingCanceled final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserLobbyTileButton_C_OnUnSelectedMatchmakingCanceled) == 0x000008, "Wrong alignment on ActivityBrowserLobbyTileButton_C_OnUnSelectedMatchmakingCanceled");
static_assert(sizeof(ActivityBrowserLobbyTileButton_C_OnUnSelectedMatchmakingCanceled) == 0x000008, "Wrong size on ActivityBrowserLobbyTileButton_C_OnUnSelectedMatchmakingCanceled");
static_assert(offsetof(ActivityBrowserLobbyTileButton_C_OnUnSelectedMatchmakingCanceled, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'ActivityBrowserLobbyTileButton_C_OnUnSelectedMatchmakingCanceled::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

}

