#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AffiliateKeyModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AffiliateKeyModal.AffiliateKeyModal_C
// 0x00D0 (0x0588 - 0x04B8)
class UAffiliateKeyModal_C final : public UFortAffilateModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SuccessAnim;                                       // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Shake;                                             // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CloseButton;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton_Mobile;                                // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_2;                                 // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ConnectionError;                                   // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Description;                                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    EditTextActionWidget;                              // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       EntryError;                                        // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ErrorPart2;                                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      LaunchWebsite;                                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 McpWaitingSpinner;                                 // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortSimpleWidgetAnimationsPanel*       SimpleWidgetAnimationsPanel;                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Warning;                                           // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ConnectionTimeout;                                 // 0x0549(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54A[0x6];                                      // 0x054A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnPopupClosed;                                     // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bSkipAutoPopulate;                                 // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnSuccess;                                         // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bShakeAnimationIsPlaying;                          // 0x0578(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x3];                                      // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ShakeAnimation;                                    // 0x057C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__CloseButton_Mobile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BP_OnActivated();
	void Construct();
	void ExecuteUbergraph_AffiliateKeyModal(int32 EntryPoint);
	void OnCheckComplete(bool bSuccess, bool bWasValidAffiliateName, const class FString& AffilateNameChecked);
	void OnInputModeChanged(bool bUsingGamepad);
	void OnSet(bool bSuccess);
	void SetMobileButtons();
	void SetupAffiliateField(const class FString& AffilateName);
	void WidgetAnimationEvt_SuccessAnim_K2Node_WidgetAnimationEvent_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AffiliateKeyModal_C">();
	}
	static class UAffiliateKeyModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAffiliateKeyModal_C>();
	}
};
static_assert(alignof(UAffiliateKeyModal_C) == 0x000008, "Wrong alignment on UAffiliateKeyModal_C");
static_assert(sizeof(UAffiliateKeyModal_C) == 0x000588, "Wrong size on UAffiliateKeyModal_C");
static_assert(offsetof(UAffiliateKeyModal_C, UberGraphFrame) == 0x0004B8, "Member 'UAffiliateKeyModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, SuccessAnim) == 0x0004C0, "Member 'UAffiliateKeyModal_C::SuccessAnim' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Shake) == 0x0004C8, "Member 'UAffiliateKeyModal_C::Shake' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Check) == 0x0004D0, "Member 'UAffiliateKeyModal_C::Check' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, CloseButton) == 0x0004D8, "Member 'UAffiliateKeyModal_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, CloseButton_Mobile) == 0x0004E0, "Member 'UAffiliateKeyModal_C::CloseButton_Mobile' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, CommonTextBlock_0) == 0x0004E8, "Member 'UAffiliateKeyModal_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, CommonTextBlock_2) == 0x0004F0, "Member 'UAffiliateKeyModal_C::CommonTextBlock_2' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, ConnectionError) == 0x0004F8, "Member 'UAffiliateKeyModal_C::ConnectionError' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Description) == 0x000500, "Member 'UAffiliateKeyModal_C::Description' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, EditTextActionWidget) == 0x000508, "Member 'UAffiliateKeyModal_C::EditTextActionWidget' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, EntryError) == 0x000510, "Member 'UAffiliateKeyModal_C::EntryError' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, ErrorPart2) == 0x000518, "Member 'UAffiliateKeyModal_C::ErrorPart2' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, LaunchWebsite) == 0x000520, "Member 'UAffiliateKeyModal_C::LaunchWebsite' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Lightbox) == 0x000528, "Member 'UAffiliateKeyModal_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, McpWaitingSpinner) == 0x000530, "Member 'UAffiliateKeyModal_C::McpWaitingSpinner' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, SimpleWidgetAnimationsPanel) == 0x000538, "Member 'UAffiliateKeyModal_C::SimpleWidgetAnimationsPanel' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Warning) == 0x000540, "Member 'UAffiliateKeyModal_C::Warning' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Found) == 0x000548, "Member 'UAffiliateKeyModal_C::Found' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, ConnectionTimeout) == 0x000549, "Member 'UAffiliateKeyModal_C::ConnectionTimeout' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, OnPopupClosed) == 0x000550, "Member 'UAffiliateKeyModal_C::OnPopupClosed' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, bSkipAutoPopulate) == 0x000560, "Member 'UAffiliateKeyModal_C::bSkipAutoPopulate' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, OnSuccess) == 0x000568, "Member 'UAffiliateKeyModal_C::OnSuccess' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, bShakeAnimationIsPlaying) == 0x000578, "Member 'UAffiliateKeyModal_C::bShakeAnimationIsPlaying' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, ShakeAnimation) == 0x00057C, "Member 'UAffiliateKeyModal_C::ShakeAnimation' has a wrong offset!");

}

