#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AffiliateKeyModal

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AffiliateKeyModal.AffiliateKeyModal_C.BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AffiliateKeyModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AffiliateKeyModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AffiliateKeyModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AffiliateKeyModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AffiliateKeyModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AffiliateKeyModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AffiliateKeyModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AffiliateKeyModal.AffiliateKeyModal_C.BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct AffiliateKeyModal_C_BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AffiliateKeyModal_C_BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on AffiliateKeyModal_C_BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(AffiliateKeyModal_C_BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature) == 0x000018, "Wrong size on AffiliateKeyModal_C_BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(AffiliateKeyModal_C_BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'AffiliateKeyModal_C_BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function AffiliateKeyModal.AffiliateKeyModal_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AffiliateKeyModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AffiliateKeyModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AffiliateKeyModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AffiliateKeyModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AffiliateKeyModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AffiliateKeyModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AffiliateKeyModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AffiliateKeyModal.AffiliateKeyModal_C.BndEvt__CloseButton_Mobile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AffiliateKeyModal_C_BndEvt__CloseButton_Mobile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AffiliateKeyModal_C_BndEvt__CloseButton_Mobile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AffiliateKeyModal_C_BndEvt__CloseButton_Mobile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AffiliateKeyModal_C_BndEvt__CloseButton_Mobile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AffiliateKeyModal_C_BndEvt__CloseButton_Mobile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AffiliateKeyModal_C_BndEvt__CloseButton_Mobile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AffiliateKeyModal_C_BndEvt__CloseButton_Mobile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AffiliateKeyModal.AffiliateKeyModal_C.BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AffiliateKeyModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AffiliateKeyModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AffiliateKeyModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AffiliateKeyModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AffiliateKeyModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AffiliateKeyModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AffiliateKeyModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AffiliateKeyModal.AffiliateKeyModal_C.ExecuteUbergraph_AffiliateKeyModal
// 0x0348 (0x0348 - 0x0000)
struct AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAffiliateName_ReturnValue;             // 0x0020(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_2;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAffiliateName_ReturnValue_1;           // 0x0048(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_3;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_2;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_3;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_1;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAffiliateName_ReturnValue_2;           // 0x0080(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetValidAffiliateNames_ReturnValue;       // 0x0090(0x0010)(ConstParm, ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0018)()
	bool                                          K2Node_CustomEvent_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bSuccess)>                K2Node_CreateDelegate_OutputDelegate;              // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_4;                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x00E0(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0100(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_2;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0140(0x0018)()
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_3;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0160(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01B0(0x0018)()
	bool                                          CallFunc_CanLaunchURL_ReturnValue;                 // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_4;          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x01E0(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_5;          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_3;                    // 0x0228(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bSuccess, bool bWasValidAffiliateName, const class FString& AffilateNameChecked)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0254(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_4;                    // 0x0268(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_6;          // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWasValidAffiliateName;         // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_AffilateNameChecked;            // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_5;                    // 0x02B0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_6;                    // 0x02E0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_5;          // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUsingGamepad;                        // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0320(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0328(0x0018)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LimitTextLength_WasTrimmed;               // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal) == 0x000008, "Wrong alignment on AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal");
static_assert(sizeof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal) == 0x000348, "Wrong size on AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, EntryPoint) == 0x000000, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000008, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, Temp_bool_Variable) == 0x000018, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetAffiliateName_ReturnValue) == 0x000020, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetAffiliateName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, Temp_byte_Variable) == 0x000030, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, Temp_byte_Variable_1) == 0x000031, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetContext_ReturnValue_1) == 0x000038, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetContext_ReturnValue_2) == 0x000040, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetAffiliateName_ReturnValue_1) == 0x000048, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetAffiliateName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, K2Node_ComponentBoundEvent_Button_3) == 0x000058, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, K2Node_ComponentBoundEvent_Button_2) == 0x000060, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_PlayAnimation_ReturnValue) == 0x000068, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetContext_ReturnValue_3) == 0x000070, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetContext_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetRuntimeOptions_ReturnValue_1) == 0x000078, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetRuntimeOptions_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetAffiliateName_ReturnValue_2) == 0x000080, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetAffiliateName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetValidAffiliateNames_ReturnValue) == 0x000090, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetValidAffiliateNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, K2Node_CustomEvent_bSuccess_1) == 0x0000B8, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::K2Node_CustomEvent_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, K2Node_CreateDelegate_OutputDelegate) == 0x0000BC, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, K2Node_ComponentBoundEvent_Button_1) == 0x0000D0, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetContext_ReturnValue_4) == 0x0000D8, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetContext_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetText_ReturnValue) == 0x0000E0, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, Temp_byte_Variable_2) == 0x0000F8, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetText_ReturnValue_1) == 0x000100, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_Conv_TextToString_ReturnValue) == 0x000118, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_Array_Find_ReturnValue) == 0x000128, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetRuntimeOptions_ReturnValue_2) == 0x000130, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetRuntimeOptions_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000138, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000140, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetRuntimeOptions_ReturnValue_3) == 0x000158, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetRuntimeOptions_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, K2Node_MakeStruct_FormatArgumentData) == 0x000160, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, K2Node_MakeArray_Array) == 0x0001A0, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_Format_ReturnValue) == 0x0001B0, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_CanLaunchURL_ReturnValue) == 0x0001C8, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_CanLaunchURL_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetRuntimeOptions_ReturnValue_4) == 0x0001D0, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetRuntimeOptions_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_Len_ReturnValue) == 0x0001D8, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetText_ReturnValue_2) == 0x0001E0, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_Greater_IntInt_ReturnValue) == 0x0001F8, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000200, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, K2Node_Select_Default) == 0x000210, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetRuntimeOptions_ReturnValue_5) == 0x000218, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetRuntimeOptions_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, Temp_byte_Variable_3) == 0x000220, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetText_ReturnValue_3) == 0x000228, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000240, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000250, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, Temp_bool_Variable_1) == 0x000251, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, K2Node_CreateDelegate_OutputDelegate_1) == 0x000254, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, K2Node_Select_Default_1) == 0x000264, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetText_ReturnValue_4) == 0x000268, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000280, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetRuntimeOptions_ReturnValue_6) == 0x000290, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetRuntimeOptions_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, K2Node_CustomEvent_bSuccess) == 0x000298, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::K2Node_CustomEvent_bSuccess' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, K2Node_CustomEvent_bWasValidAffiliateName) == 0x000299, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::K2Node_CustomEvent_bWasValidAffiliateName' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, K2Node_CustomEvent_AffilateNameChecked) == 0x0002A0, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::K2Node_CustomEvent_AffilateNameChecked' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetText_ReturnValue_5) == 0x0002B0, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_Conv_TextToString_ReturnValue_4) == 0x0002C8, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x0002D8, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_GetText_ReturnValue_6) == 0x0002E0, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_GetText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_Conv_TextToString_ReturnValue_5) == 0x0002F8, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_Conv_TextToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000308, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_PlayAnimation_ReturnValue_1) == 0x000310, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, K2Node_Event_bUsingGamepad) == 0x000318, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::K2Node_Event_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, K2Node_ComponentBoundEvent_Button) == 0x000320, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, K2Node_ComponentBoundEvent_Text) == 0x000328, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_Not_PreBool_ReturnValue) == 0x000340, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_LimitTextLength_WasTrimmed) == 0x000341, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_LimitTextLength_WasTrimmed' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_PlayAnimationByName_ReturnValue) == 0x000342, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal, CallFunc_BooleanAND_ReturnValue) == 0x000343, "Member 'AffiliateKeyModal_C_ExecuteUbergraph_AffiliateKeyModal::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function AffiliateKeyModal.AffiliateKeyModal_C.OnCheckComplete
// 0x0018 (0x0018 - 0x0000)
struct AffiliateKeyModal_C_OnCheckComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWasValidAffiliateName;                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AffilateNameChecked;                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AffiliateKeyModal_C_OnCheckComplete) == 0x000008, "Wrong alignment on AffiliateKeyModal_C_OnCheckComplete");
static_assert(sizeof(AffiliateKeyModal_C_OnCheckComplete) == 0x000018, "Wrong size on AffiliateKeyModal_C_OnCheckComplete");
static_assert(offsetof(AffiliateKeyModal_C_OnCheckComplete, bSuccess) == 0x000000, "Member 'AffiliateKeyModal_C_OnCheckComplete::bSuccess' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_OnCheckComplete, bWasValidAffiliateName) == 0x000001, "Member 'AffiliateKeyModal_C_OnCheckComplete::bWasValidAffiliateName' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_OnCheckComplete, AffilateNameChecked) == 0x000008, "Member 'AffiliateKeyModal_C_OnCheckComplete::AffilateNameChecked' has a wrong offset!");

// Function AffiliateKeyModal.AffiliateKeyModal_C.OnInputModeChanged
// 0x0001 (0x0001 - 0x0000)
struct AffiliateKeyModal_C_OnInputModeChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AffiliateKeyModal_C_OnInputModeChanged) == 0x000001, "Wrong alignment on AffiliateKeyModal_C_OnInputModeChanged");
static_assert(sizeof(AffiliateKeyModal_C_OnInputModeChanged) == 0x000001, "Wrong size on AffiliateKeyModal_C_OnInputModeChanged");
static_assert(offsetof(AffiliateKeyModal_C_OnInputModeChanged, bUsingGamepad) == 0x000000, "Member 'AffiliateKeyModal_C_OnInputModeChanged::bUsingGamepad' has a wrong offset!");

// Function AffiliateKeyModal.AffiliateKeyModal_C.OnSet
// 0x0001 (0x0001 - 0x0000)
struct AffiliateKeyModal_C_OnSet final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AffiliateKeyModal_C_OnSet) == 0x000001, "Wrong alignment on AffiliateKeyModal_C_OnSet");
static_assert(sizeof(AffiliateKeyModal_C_OnSet) == 0x000001, "Wrong size on AffiliateKeyModal_C_OnSet");
static_assert(offsetof(AffiliateKeyModal_C_OnSet, bSuccess) == 0x000000, "Member 'AffiliateKeyModal_C_OnSet::bSuccess' has a wrong offset!");

// Function AffiliateKeyModal.AffiliateKeyModal_C.SetMobileButtons
// 0x0005 (0x0005 - 0x0000)
struct AffiliateKeyModal_C_SetMobileButtons final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AffiliateKeyModal_C_SetMobileButtons) == 0x000001, "Wrong alignment on AffiliateKeyModal_C_SetMobileButtons");
static_assert(sizeof(AffiliateKeyModal_C_SetMobileButtons) == 0x000005, "Wrong size on AffiliateKeyModal_C_SetMobileButtons");
static_assert(offsetof(AffiliateKeyModal_C_SetMobileButtons, Temp_bool_Variable) == 0x000000, "Member 'AffiliateKeyModal_C_SetMobileButtons::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_SetMobileButtons, Temp_byte_Variable) == 0x000001, "Member 'AffiliateKeyModal_C_SetMobileButtons::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_SetMobileButtons, Temp_byte_Variable_1) == 0x000002, "Member 'AffiliateKeyModal_C_SetMobileButtons::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_SetMobileButtons, CallFunc_IsUsingTouch_ReturnValue) == 0x000003, "Member 'AffiliateKeyModal_C_SetMobileButtons::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_SetMobileButtons, K2Node_Select_Default) == 0x000004, "Member 'AffiliateKeyModal_C_SetMobileButtons::K2Node_Select_Default' has a wrong offset!");

// Function AffiliateKeyModal.AffiliateKeyModal_C.SetupAffiliateField
// 0x0028 (0x0028 - 0x0000)
struct AffiliateKeyModal_C_SetupAffiliateField final
{
public:
	class FString                                 AffilateName;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(AffiliateKeyModal_C_SetupAffiliateField) == 0x000008, "Wrong alignment on AffiliateKeyModal_C_SetupAffiliateField");
static_assert(sizeof(AffiliateKeyModal_C_SetupAffiliateField) == 0x000028, "Wrong size on AffiliateKeyModal_C_SetupAffiliateField");
static_assert(offsetof(AffiliateKeyModal_C_SetupAffiliateField, AffilateName) == 0x000000, "Member 'AffiliateKeyModal_C_SetupAffiliateField::AffilateName' has a wrong offset!");
static_assert(offsetof(AffiliateKeyModal_C_SetupAffiliateField, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'AffiliateKeyModal_C_SetupAffiliateField::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

