#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnnualRefundTokenUI

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "AnnualRefundTokenUI_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class AnnualRefundTokenUI.FortReturnReasonEntry
// 0x0010 (0x0EC0 - 0x0EB0)
class UFortReturnReasonEntry final : public UCommonButtonBase
{
public:
	uint8                                         Pad_EA8[0x8];                                      // 0x0EA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InternalData;                                      // 0x0EB0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Name;                                         // 0x0EB8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortReturnReasonEntry">();
	}
	static class UFortReturnReasonEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortReturnReasonEntry>();
	}
};
static_assert(alignof(UFortReturnReasonEntry) == 0x000010, "Wrong alignment on UFortReturnReasonEntry");
static_assert(sizeof(UFortReturnReasonEntry) == 0x000EC0, "Wrong size on UFortReturnReasonEntry");
static_assert(offsetof(UFortReturnReasonEntry, InternalData) == 0x000EB0, "Member 'UFortReturnReasonEntry::InternalData' has a wrong offset!");
static_assert(offsetof(UFortReturnReasonEntry, Text_Name) == 0x000EB8, "Member 'UFortReturnReasonEntry::Text_Name' has a wrong offset!");

// Class AnnualRefundTokenUI.FortAnnualRefundTicket
// 0x0008 (0x0250 - 0x0248)
class UFortAnnualRefundTicket final : public UUserWidget
{
public:
	class UCommonTextBlock*                       Text_AvailableDate;                                // 0x0248(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnPlayLockingAnimation();
	void OnUpdateAvailableState(const bool bIsAvailable);
	void OnUpdatePendingState(const bool bIsPending);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnnualRefundTicket">();
	}
	static class UFortAnnualRefundTicket* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnnualRefundTicket>();
	}
};
static_assert(alignof(UFortAnnualRefundTicket) == 0x000008, "Wrong alignment on UFortAnnualRefundTicket");
static_assert(sizeof(UFortAnnualRefundTicket) == 0x000250, "Wrong size on UFortAnnualRefundTicket");
static_assert(offsetof(UFortAnnualRefundTicket, Text_AvailableDate) == 0x000248, "Member 'UFortAnnualRefundTicket::Text_AvailableDate' has a wrong offset!");

// Class AnnualRefundTokenUI.FortAnnualRefundTokenData
// 0x0028 (0x04F0 - 0x04C8)
class UFortAnnualRefundTokenData final : public UFortGameFeatureData
{
public:
	TSoftClassPtr<class UClass>                   PurchaseHistoryScreenClass;                        // 0x04C8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnnualRefundTokenData">();
	}
	static class UFortAnnualRefundTokenData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnnualRefundTokenData>();
	}
};
static_assert(alignof(UFortAnnualRefundTokenData) == 0x000008, "Wrong alignment on UFortAnnualRefundTokenData");
static_assert(sizeof(UFortAnnualRefundTokenData) == 0x0004F0, "Wrong size on UFortAnnualRefundTokenData");
static_assert(offsetof(UFortAnnualRefundTokenData, PurchaseHistoryScreenClass) == 0x0004C8, "Member 'UFortAnnualRefundTokenData::PurchaseHistoryScreenClass' has a wrong offset!");

// Class AnnualRefundTokenUI.FortPurchaseHistoryEntry
// 0x0030 (0x0EE0 - 0x0EB0)
class UFortPurchaseHistoryEntry final : public UCommonButtonBase
{
public:
	uint8                                         Pad_EA8[0x8];                                      // 0x0EA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortCosmeticItemCard>      ItemCardClass;                                     // 0x0EB0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CardWidthOverride;                                 // 0x0EB8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EBC[0x4];                                      // 0x0EBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_Name;                                         // 0x0EC0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FString>                         LootEntryItemTypesToExclude;                       // 0x0EC8(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_ED8[0x8];                                      // 0x0ED8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSetHistory(bool bHasBeenRefunded, bool bIsTokenlessRefund, bool bPlayerHasTokens);
	void SetPurchaseText(const class FText& PurchaseText, bool bHasBeenRefunded);
	void SetupItemCard(const class UFortCosmeticItemCard* ItemCard, const class UFortItem* Item);
	void UpdateItemList(const TArray<class UFortCosmeticItemCard*>& ItemCards);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPurchaseHistoryEntry">();
	}
	static class UFortPurchaseHistoryEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchaseHistoryEntry>();
	}
};
static_assert(alignof(UFortPurchaseHistoryEntry) == 0x000010, "Wrong alignment on UFortPurchaseHistoryEntry");
static_assert(sizeof(UFortPurchaseHistoryEntry) == 0x000EE0, "Wrong size on UFortPurchaseHistoryEntry");
static_assert(offsetof(UFortPurchaseHistoryEntry, ItemCardClass) == 0x000EB0, "Member 'UFortPurchaseHistoryEntry::ItemCardClass' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryEntry, CardWidthOverride) == 0x000EB8, "Member 'UFortPurchaseHistoryEntry::CardWidthOverride' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryEntry, Text_Name) == 0x000EC0, "Member 'UFortPurchaseHistoryEntry::Text_Name' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryEntry, LootEntryItemTypesToExclude) == 0x000EC8, "Member 'UFortPurchaseHistoryEntry::LootEntryItemTypesToExclude' has a wrong offset!");

// Class AnnualRefundTokenUI.FortPurchaseHistoryListView
// 0x00E0 (0x02F8 - 0x0218)
class UFortPurchaseHistoryListView final : public UListViewBase
{
public:
	uint8                                         Pad_218[0xE0];                                     // 0x0218(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPurchaseHistoryListView">();
	}
	static class UFortPurchaseHistoryListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchaseHistoryListView>();
	}
};
static_assert(alignof(UFortPurchaseHistoryListView) == 0x000008, "Wrong alignment on UFortPurchaseHistoryListView");
static_assert(sizeof(UFortPurchaseHistoryListView) == 0x0002F8, "Wrong size on UFortPurchaseHistoryListView");

// Class AnnualRefundTokenUI.ReturnReasonDataWrapper
// 0x0018 (0x0040 - 0x0028)
class UReturnReasonDataWrapper final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReturnReasonDataWrapper">();
	}
	static class UReturnReasonDataWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReturnReasonDataWrapper>();
	}
};
static_assert(alignof(UReturnReasonDataWrapper) == 0x000008, "Wrong alignment on UReturnReasonDataWrapper");
static_assert(sizeof(UReturnReasonDataWrapper) == 0x000040, "Wrong size on UReturnReasonDataWrapper");

// Class AnnualRefundTokenUI.FortPurchaseHistoryScreen
// 0x0130 (0x0460 - 0x0330)
class UFortPurchaseHistoryScreen final : public UCommonActivatableWidget
{
public:
	struct FDataTableRowHandle                    BackAction;                                        // 0x0330(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortRefundConfirmation>    RefundConfirmationClass;                           // 0x0340(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupBase*                 TabButtonGroup;                                    // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonActivatableWidgetSwitcher*       Switcher_ItemList;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinRefundSubmissionDelay;                          // 0x0358(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxRefundSubmissionDelay;                          // 0x035C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FText>                           ReturnReasons;                                     // 0x0360(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UReturnReasonDataWrapper*>       WrapperArray;                                      // 0x0370(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_380[0x10];                                     // 0x0380(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortItemDefinition*>            SelectedItemDefs;                                  // 0x0390(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A0[0x40];                                     // 0x03A0(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPurchaseHistoryListView*           ListView_Purchases;                                // 0x03E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonListView*                        ListView_Reasons;                                  // 0x03E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_RequestRefund;                              // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CloseMobile;                                // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PostApproval;                               // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Desc;                                         // 0x0408(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RefundCount;                                  // 0x0410(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ResultTitle;                                  // 0x0418(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ResultDesc;                                   // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ResultMtxMsg;                                 // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RefundValue;                                  // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_WarningMsg;                               // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                             ScrollBox_ItemsToReturn;                           // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Left;                                 // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Center;                               // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Right;                                // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandlePreviousStepAction();
	void HandleTabButtonClicked(EPurchaseReturnStep ClickedStep);
	void OnBeginRefundSubmission();
	void OnEndRefundSubmission();
	void OnItemRefresh(const struct FMtxPurchaseHistory& PurchaseHistory);
	void OnNoPurchasesAvailable();
	void OnOpenSubmitRequest(bool bIsSelectionTokenlessRefundable);
	void OnPopulateView(EPurchaseReturnStep CurrentStep);
	void UpdateItemList(const TArray<class UCommonTextBlock*>& ItemsToReturn);

	EPurchaseReturnStep GetCurrentStep() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPurchaseHistoryScreen">();
	}
	static class UFortPurchaseHistoryScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchaseHistoryScreen>();
	}
};
static_assert(alignof(UFortPurchaseHistoryScreen) == 0x000008, "Wrong alignment on UFortPurchaseHistoryScreen");
static_assert(sizeof(UFortPurchaseHistoryScreen) == 0x000460, "Wrong size on UFortPurchaseHistoryScreen");
static_assert(offsetof(UFortPurchaseHistoryScreen, BackAction) == 0x000330, "Member 'UFortPurchaseHistoryScreen::BackAction' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, RefundConfirmationClass) == 0x000340, "Member 'UFortPurchaseHistoryScreen::RefundConfirmationClass' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, TabButtonGroup) == 0x000348, "Member 'UFortPurchaseHistoryScreen::TabButtonGroup' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Switcher_ItemList) == 0x000350, "Member 'UFortPurchaseHistoryScreen::Switcher_ItemList' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, MinRefundSubmissionDelay) == 0x000358, "Member 'UFortPurchaseHistoryScreen::MinRefundSubmissionDelay' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, MaxRefundSubmissionDelay) == 0x00035C, "Member 'UFortPurchaseHistoryScreen::MaxRefundSubmissionDelay' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, ReturnReasons) == 0x000360, "Member 'UFortPurchaseHistoryScreen::ReturnReasons' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, WrapperArray) == 0x000370, "Member 'UFortPurchaseHistoryScreen::WrapperArray' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, SelectedItemDefs) == 0x000390, "Member 'UFortPurchaseHistoryScreen::SelectedItemDefs' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, ListView_Purchases) == 0x0003E0, "Member 'UFortPurchaseHistoryScreen::ListView_Purchases' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, ListView_Reasons) == 0x0003E8, "Member 'UFortPurchaseHistoryScreen::ListView_Reasons' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Button_RequestRefund) == 0x0003F0, "Member 'UFortPurchaseHistoryScreen::Button_RequestRefund' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Button_CloseMobile) == 0x0003F8, "Member 'UFortPurchaseHistoryScreen::Button_CloseMobile' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Button_PostApproval) == 0x000400, "Member 'UFortPurchaseHistoryScreen::Button_PostApproval' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Text_Desc) == 0x000408, "Member 'UFortPurchaseHistoryScreen::Text_Desc' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Text_RefundCount) == 0x000410, "Member 'UFortPurchaseHistoryScreen::Text_RefundCount' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Text_ResultTitle) == 0x000418, "Member 'UFortPurchaseHistoryScreen::Text_ResultTitle' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Text_ResultDesc) == 0x000420, "Member 'UFortPurchaseHistoryScreen::Text_ResultDesc' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Text_ResultMtxMsg) == 0x000428, "Member 'UFortPurchaseHistoryScreen::Text_ResultMtxMsg' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Text_RefundValue) == 0x000430, "Member 'UFortPurchaseHistoryScreen::Text_RefundValue' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, RichText_WarningMsg) == 0x000438, "Member 'UFortPurchaseHistoryScreen::RichText_WarningMsg' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, ScrollBox_ItemsToReturn) == 0x000440, "Member 'UFortPurchaseHistoryScreen::ScrollBox_ItemsToReturn' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, RefundTicket_Left) == 0x000448, "Member 'UFortPurchaseHistoryScreen::RefundTicket_Left' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, RefundTicket_Center) == 0x000450, "Member 'UFortPurchaseHistoryScreen::RefundTicket_Center' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, RefundTicket_Right) == 0x000458, "Member 'UFortPurchaseHistoryScreen::RefundTicket_Right' has a wrong offset!");

// Class AnnualRefundTokenUI.FortRefundConfirmation
// 0x0058 (0x0388 - 0x0330)
class UFortRefundConfirmation final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0x10];                                     // 0x0330(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_RefundsRemaining;                             // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RefundCount;                                  // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AreYouSure;                                   // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Yes;                                        // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_No;                                         // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CloseMobile;                                // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Left;                                 // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Center;                               // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Right;                                // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortRefundConfirmation">();
	}
	static class UFortRefundConfirmation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRefundConfirmation>();
	}
};
static_assert(alignof(UFortRefundConfirmation) == 0x000008, "Wrong alignment on UFortRefundConfirmation");
static_assert(sizeof(UFortRefundConfirmation) == 0x000388, "Wrong size on UFortRefundConfirmation");
static_assert(offsetof(UFortRefundConfirmation, Text_RefundsRemaining) == 0x000340, "Member 'UFortRefundConfirmation::Text_RefundsRemaining' has a wrong offset!");
static_assert(offsetof(UFortRefundConfirmation, Text_RefundCount) == 0x000348, "Member 'UFortRefundConfirmation::Text_RefundCount' has a wrong offset!");
static_assert(offsetof(UFortRefundConfirmation, Text_AreYouSure) == 0x000350, "Member 'UFortRefundConfirmation::Text_AreYouSure' has a wrong offset!");
static_assert(offsetof(UFortRefundConfirmation, Button_Yes) == 0x000358, "Member 'UFortRefundConfirmation::Button_Yes' has a wrong offset!");
static_assert(offsetof(UFortRefundConfirmation, Button_No) == 0x000360, "Member 'UFortRefundConfirmation::Button_No' has a wrong offset!");
static_assert(offsetof(UFortRefundConfirmation, Button_CloseMobile) == 0x000368, "Member 'UFortRefundConfirmation::Button_CloseMobile' has a wrong offset!");
static_assert(offsetof(UFortRefundConfirmation, RefundTicket_Left) == 0x000370, "Member 'UFortRefundConfirmation::RefundTicket_Left' has a wrong offset!");
static_assert(offsetof(UFortRefundConfirmation, RefundTicket_Center) == 0x000378, "Member 'UFortRefundConfirmation::RefundTicket_Center' has a wrong offset!");
static_assert(offsetof(UFortRefundConfirmation, RefundTicket_Right) == 0x000380, "Member 'UFortRefundConfirmation::RefundTicket_Right' has a wrong offset!");

}

