#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AOE_Commando_KeepOutExplosion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C
// 0x03D8 (0x0990 - 0x05B8)
class AAOE_Commando_KeepOutExplosion_C final : public AFortAreaOfEffectCloud
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AOE_Audio_Effect;                                  // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Grenade_Linger;                                  // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       DamageArea;                                        // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x05E0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundAttenuationSettings              AOE_Sound_Attenuation_Based_On_Radius;             // 0x05E8(0x03A8)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AOE_Commando_KeepOutExplosion(int32 EntryPoint);
	void OnRep_Radius();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void Send_Info(float Radius_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AOE_Commando_KeepOutExplosion_C">();
	}
	static class AAOE_Commando_KeepOutExplosion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAOE_Commando_KeepOutExplosion_C>();
	}
};
static_assert(alignof(AAOE_Commando_KeepOutExplosion_C) == 0x000008, "Wrong alignment on AAOE_Commando_KeepOutExplosion_C");
static_assert(sizeof(AAOE_Commando_KeepOutExplosion_C) == 0x000990, "Wrong size on AAOE_Commando_KeepOutExplosion_C");
static_assert(offsetof(AAOE_Commando_KeepOutExplosion_C, UberGraphFrame) == 0x0005B8, "Member 'AAOE_Commando_KeepOutExplosion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAOE_Commando_KeepOutExplosion_C, AOE_Audio_Effect) == 0x0005C0, "Member 'AAOE_Commando_KeepOutExplosion_C::AOE_Audio_Effect' has a wrong offset!");
static_assert(offsetof(AAOE_Commando_KeepOutExplosion_C, P_Grenade_Linger) == 0x0005C8, "Member 'AAOE_Commando_KeepOutExplosion_C::P_Grenade_Linger' has a wrong offset!");
static_assert(offsetof(AAOE_Commando_KeepOutExplosion_C, DamageArea) == 0x0005D0, "Member 'AAOE_Commando_KeepOutExplosion_C::DamageArea' has a wrong offset!");
static_assert(offsetof(AAOE_Commando_KeepOutExplosion_C, DefaultSceneRoot) == 0x0005D8, "Member 'AAOE_Commando_KeepOutExplosion_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AAOE_Commando_KeepOutExplosion_C, Radius) == 0x0005E0, "Member 'AAOE_Commando_KeepOutExplosion_C::Radius' has a wrong offset!");
static_assert(offsetof(AAOE_Commando_KeepOutExplosion_C, AOE_Sound_Attenuation_Based_On_Radius) == 0x0005E8, "Member 'AAOE_Commando_KeepOutExplosion_C::AOE_Sound_Attenuation_Based_On_Radius' has a wrong offset!");

}

