#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArgonUI

#include "Basic.hpp"

#include "ArgonRuntime_structs.hpp"


namespace SDK::Params
{

// Function ArgonUI.ArgonWidgetBase.GetTeamPlayerStates
// 0x0018 (0x0018 - 0x0000)
struct ArgonWidgetBase_GetTeamPlayerStates final
{
public:
	uint8                                         Team;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerStateAthena*>         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArgonWidgetBase_GetTeamPlayerStates) == 0x000008, "Wrong alignment on ArgonWidgetBase_GetTeamPlayerStates");
static_assert(sizeof(ArgonWidgetBase_GetTeamPlayerStates) == 0x000018, "Wrong size on ArgonWidgetBase_GetTeamPlayerStates");
static_assert(offsetof(ArgonWidgetBase_GetTeamPlayerStates, Team) == 0x000000, "Member 'ArgonWidgetBase_GetTeamPlayerStates::Team' has a wrong offset!");
static_assert(offsetof(ArgonWidgetBase_GetTeamPlayerStates, ReturnValue) == 0x000008, "Member 'ArgonWidgetBase_GetTeamPlayerStates::ReturnValue' has a wrong offset!");

// Function ArgonUI.ArgonHUDAlertWidget.DisplayPlayerFinishedMessage
// 0x0060 (0x0060 - 0x0000)
struct ArgonHUDAlertWidget_DisplayPlayerFinishedMessage final
{
public:
	struct FArgonFinishedPlayerInfo               FinishedInfo;                                      // 0x0000(0x0060)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArgonHUDAlertWidget_DisplayPlayerFinishedMessage) == 0x000008, "Wrong alignment on ArgonHUDAlertWidget_DisplayPlayerFinishedMessage");
static_assert(sizeof(ArgonHUDAlertWidget_DisplayPlayerFinishedMessage) == 0x000060, "Wrong size on ArgonHUDAlertWidget_DisplayPlayerFinishedMessage");
static_assert(offsetof(ArgonHUDAlertWidget_DisplayPlayerFinishedMessage, FinishedInfo) == 0x000000, "Member 'ArgonHUDAlertWidget_DisplayPlayerFinishedMessage::FinishedInfo' has a wrong offset!");

// Function ArgonUI.ArgonHUDAlertWidget.OnPlayerFinished
// 0x0060 (0x0060 - 0x0000)
struct ArgonHUDAlertWidget_OnPlayerFinished final
{
public:
	struct FArgonFinishedPlayerInfo               FinishedPlayerInfo;                                // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArgonHUDAlertWidget_OnPlayerFinished) == 0x000008, "Wrong alignment on ArgonHUDAlertWidget_OnPlayerFinished");
static_assert(sizeof(ArgonHUDAlertWidget_OnPlayerFinished) == 0x000060, "Wrong size on ArgonHUDAlertWidget_OnPlayerFinished");
static_assert(offsetof(ArgonHUDAlertWidget_OnPlayerFinished, FinishedPlayerInfo) == 0x000000, "Member 'ArgonHUDAlertWidget_OnPlayerFinished::FinishedPlayerInfo' has a wrong offset!");

}

