#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingPlayButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchmakingPlayButton.AthenaMatchmakingPlayButton_C
// 0x0040 (0x0F60 - 0x0F20)
class UAthenaMatchmakingPlayButton_C final : public UAthenaMatchmakingPlayButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Disabled;                                          // 0x0F28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlayShine;                                         // 0x0F30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHovered;                                         // 0x0F38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ButtonTop;                                   // 0x0F48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMatchmakingInputIndicator_C*           MatchmakingInputIndicator;                         // 0x0F58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_AthenaMatchmakingPlayButton(int32 EntryPoint);
	void SetButtonText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMatchmakingPlayButton_C">();
	}
	static class UAthenaMatchmakingPlayButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchmakingPlayButton_C>();
	}
};
static_assert(alignof(UAthenaMatchmakingPlayButton_C) == 0x000010, "Wrong alignment on UAthenaMatchmakingPlayButton_C");
static_assert(sizeof(UAthenaMatchmakingPlayButton_C) == 0x000F60, "Wrong size on UAthenaMatchmakingPlayButton_C");
static_assert(offsetof(UAthenaMatchmakingPlayButton_C, UberGraphFrame) == 0x000F20, "Member 'UAthenaMatchmakingPlayButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayButton_C, Disabled) == 0x000F28, "Member 'UAthenaMatchmakingPlayButton_C::Disabled' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayButton_C, PlayShine) == 0x000F30, "Member 'UAthenaMatchmakingPlayButton_C::PlayShine' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayButton_C, OnHovered) == 0x000F38, "Member 'UAthenaMatchmakingPlayButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayButton_C, CenterButtonTextWidget) == 0x000F40, "Member 'UAthenaMatchmakingPlayButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayButton_C, Image_ButtonTop) == 0x000F48, "Member 'UAthenaMatchmakingPlayButton_C::Image_ButtonTop' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayButton_C, Image_Shadow) == 0x000F50, "Member 'UAthenaMatchmakingPlayButton_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayButton_C, MatchmakingInputIndicator) == 0x000F58, "Member 'UAthenaMatchmakingPlayButton_C::MatchmakingInputIndicator' has a wrong offset!");

}

