#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaWatchers

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaWatchers.AthenaWatchers_C.ExecuteUbergraph_AthenaWatchers
// 0x0018 (0x0018 - 0x0000)
struct AthenaWatchers_C_ExecuteUbergraph_AthenaWatchers final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bBigGroup_1;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bBigGroup;                            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NewCount;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaWatchers_C_ExecuteUbergraph_AthenaWatchers) == 0x000008, "Wrong alignment on AthenaWatchers_C_ExecuteUbergraph_AthenaWatchers");
static_assert(sizeof(AthenaWatchers_C_ExecuteUbergraph_AthenaWatchers) == 0x000018, "Wrong size on AthenaWatchers_C_ExecuteUbergraph_AthenaWatchers");
static_assert(offsetof(AthenaWatchers_C_ExecuteUbergraph_AthenaWatchers, EntryPoint) == 0x000000, "Member 'AthenaWatchers_C_ExecuteUbergraph_AthenaWatchers::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaWatchers_C_ExecuteUbergraph_AthenaWatchers, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'AthenaWatchers_C_ExecuteUbergraph_AthenaWatchers::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaWatchers_C_ExecuteUbergraph_AthenaWatchers, K2Node_Event_bBigGroup_1) == 0x000010, "Member 'AthenaWatchers_C_ExecuteUbergraph_AthenaWatchers::K2Node_Event_bBigGroup_1' has a wrong offset!");
static_assert(offsetof(AthenaWatchers_C_ExecuteUbergraph_AthenaWatchers, K2Node_Event_bBigGroup) == 0x000011, "Member 'AthenaWatchers_C_ExecuteUbergraph_AthenaWatchers::K2Node_Event_bBigGroup' has a wrong offset!");
static_assert(offsetof(AthenaWatchers_C_ExecuteUbergraph_AthenaWatchers, K2Node_Event_NewCount) == 0x000014, "Member 'AthenaWatchers_C_ExecuteUbergraph_AthenaWatchers::K2Node_Event_NewCount' has a wrong offset!");

// Function AthenaWatchers.AthenaWatchers_C.SpectatorCountChanged_BP
// 0x0004 (0x0004 - 0x0000)
struct AthenaWatchers_C_SpectatorCountChanged_BP final
{
public:
	int32                                         NewCount;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaWatchers_C_SpectatorCountChanged_BP) == 0x000004, "Wrong alignment on AthenaWatchers_C_SpectatorCountChanged_BP");
static_assert(sizeof(AthenaWatchers_C_SpectatorCountChanged_BP) == 0x000004, "Wrong size on AthenaWatchers_C_SpectatorCountChanged_BP");
static_assert(offsetof(AthenaWatchers_C_SpectatorCountChanged_BP, NewCount) == 0x000000, "Member 'AthenaWatchers_C_SpectatorCountChanged_BP::NewCount' has a wrong offset!");

// Function AthenaWatchers.AthenaWatchers_C.SpectatorsAdded
// 0x0001 (0x0001 - 0x0000)
struct AthenaWatchers_C_SpectatorsAdded final
{
public:
	bool                                          bBigGroup;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaWatchers_C_SpectatorsAdded) == 0x000001, "Wrong alignment on AthenaWatchers_C_SpectatorsAdded");
static_assert(sizeof(AthenaWatchers_C_SpectatorsAdded) == 0x000001, "Wrong size on AthenaWatchers_C_SpectatorsAdded");
static_assert(offsetof(AthenaWatchers_C_SpectatorsAdded, bBigGroup) == 0x000000, "Member 'AthenaWatchers_C_SpectatorsAdded::bBigGroup' has a wrong offset!");

// Function AthenaWatchers.AthenaWatchers_C.SpectatorsBegan
// 0x0001 (0x0001 - 0x0000)
struct AthenaWatchers_C_SpectatorsBegan final
{
public:
	bool                                          bBigGroup;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaWatchers_C_SpectatorsBegan) == 0x000001, "Wrong alignment on AthenaWatchers_C_SpectatorsBegan");
static_assert(sizeof(AthenaWatchers_C_SpectatorsBegan) == 0x000001, "Wrong size on AthenaWatchers_C_SpectatorsBegan");
static_assert(offsetof(AthenaWatchers_C_SpectatorsBegan, bBigGroup) == 0x000000, "Member 'AthenaWatchers_C_SpectatorsBegan::bBigGroup' has a wrong offset!");

}

