#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCustomizationPickerTileButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaCustomizationPickerTileButton.AthenaCustomizationPickerTileButton_C
// 0x0060 (0x0FA0 - 0x0F40)
class UAthenaCustomizationPickerTileButton_C final : public UAthenaCustomizationPickerTileButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0F48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ExclusiveFill;                                     // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ExclusiveWarningOvr;                               // 0x0F58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         Image_Equipped;                                    // 0x0F60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NullItemOverlay;                                   // 0x0F68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        RootWidgetSwitcher;                                // 0x0F70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnownedDampen;                                     // 0x0F78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSlottedSomewhere;                                // 0x0F80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F81[0x7];                                      // 0x0F81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UWidgetSwitcher* WidgetSwitcher)> PickedButtonHovered;                               // 0x0F88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_AthenaCustomizationPickerTileButton(int32 EntryPoint);
	void HandleEquippedStateChanged(bool bEquipped, bool bOnDifferentSlot);
	void OnChangeOwnedState(bool bOwned);
	void OnEquippedStateChanged(bool bEquipped, bool bOnDifferentSlot);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnUpdateExclusiveWarning(bool bShouldWarn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaCustomizationPickerTileButton_C">();
	}
	static class UAthenaCustomizationPickerTileButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationPickerTileButton_C>();
	}
};
static_assert(alignof(UAthenaCustomizationPickerTileButton_C) == 0x000010, "Wrong alignment on UAthenaCustomizationPickerTileButton_C");
static_assert(sizeof(UAthenaCustomizationPickerTileButton_C) == 0x000FA0, "Wrong size on UAthenaCustomizationPickerTileButton_C");
static_assert(offsetof(UAthenaCustomizationPickerTileButton_C, UberGraphFrame) == 0x000F40, "Member 'UAthenaCustomizationPickerTileButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPickerTileButton_C, OnHover) == 0x000F48, "Member 'UAthenaCustomizationPickerTileButton_C::OnHover' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPickerTileButton_C, ExclusiveFill) == 0x000F50, "Member 'UAthenaCustomizationPickerTileButton_C::ExclusiveFill' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPickerTileButton_C, ExclusiveWarningOvr) == 0x000F58, "Member 'UAthenaCustomizationPickerTileButton_C::ExclusiveWarningOvr' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPickerTileButton_C, Image_Equipped) == 0x000F60, "Member 'UAthenaCustomizationPickerTileButton_C::Image_Equipped' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPickerTileButton_C, NullItemOverlay) == 0x000F68, "Member 'UAthenaCustomizationPickerTileButton_C::NullItemOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPickerTileButton_C, RootWidgetSwitcher) == 0x000F70, "Member 'UAthenaCustomizationPickerTileButton_C::RootWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPickerTileButton_C, UnownedDampen) == 0x000F78, "Member 'UAthenaCustomizationPickerTileButton_C::UnownedDampen' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPickerTileButton_C, IsSlottedSomewhere) == 0x000F80, "Member 'UAthenaCustomizationPickerTileButton_C::IsSlottedSomewhere' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPickerTileButton_C, PickedButtonHovered) == 0x000F88, "Member 'UAthenaCustomizationPickerTileButton_C::PickedButtonHovered' has a wrong offset!");

}

