#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemCustomizationSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C
// 0x00F0 (0x0920 - 0x0830)
class UAthenaItemCustomizationSelector_C final : public UAthenaItemSelectorScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0830(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PulseAnim;                                         // 0x0838(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CannotSlide;                                       // 0x0840(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NormalState;                                       // 0x0848(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SlideRight;                                        // 0x0850(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SlideLeft;                                         // 0x0858(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideTextSearch;                                    // 0x0860(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowTextSearch;                                    // 0x0868(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ItemInfoIntroOutro;                                // 0x0870(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0878(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortTextButton_C*                      Button_HitBlockerLeft;                             // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortTextButton_C*                      Button_HitBlockerRight;                            // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CameraFrameContainer;                              // 0x0890(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton;                                       // 0x0898(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ExclusiveCalloutBox;                               // 0x08A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   ExclusiveCalloutText;                              // 0x08A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              LeftSideContentSZ;                                 // 0x08B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              RightSideContentSZ;                                // 0x08B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_MainContent;                                    // 0x08C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShortDescriptionText;                              // 0x08C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SlotImage;                                         // 0x08D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Vignette;                                          // 0x08D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            WidgetSwitcher_InteractionMethod;                  // 0x08E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            WidgetSwitcher_ItemEditor;                         // 0x08E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressModalWidget_C*                 ProgressModal;                                     // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPickingStyle;                                     // 0x08F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHandledBackRequest;                               // 0x08F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FA[0x6];                                      // 0x08FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           AutoHideInfoPanelEventTimer;                       // 0x0900(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TextEntryTimer;                                    // 0x0908(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         SeasonFilter;                                      // 0x0910(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxSeason;                                         // 0x0914(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ItemInfoHideDelayTime;                             // 0x0918(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Blade_SortAndFilter_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void BndEvt__Button_HitBlockerLeft_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_HitBlockerRight_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BP_HandleBack();
	void BP_OnActivated();
	void Construct();
	void ExecuteUbergraph_AthenaItemCustomizationSelector(int32 EntryPoint);
	class UMaterialInstance* GetCategoryImage(EAthenaCustomizationCategory Index_0, class UMaterialInstance* OverrideImage);
	void GetCurrentItemCosmeticDefinition(class UAthenaCosmeticItemDefinition** Cosmetic_Item_Definition);
	void HandleAlternateActionHoveredChanged(bool bIsHovered);
	void HandleBack(bool* PassThrough);
	void HandleHideInfoPanel();
	void HandleItemSetupFinished(const class FText& InText, EAthenaCustomizationCategory Category, class UMaterialInstance* OverrideImage);
	void HandleShowInfoPanel(class UFortItem* SelectedItem);
	void HandleTextChanged(const class FText& NewText);
	void OnCurrentItemChanged(class UFortItem* SelectedItem);
	void OnFinishedItemSetup(const class FText& CategoryDisplayName, const class FText& ItemDisplayTypeName, EAthenaCustomizationCategory SelectedCategory, class UMaterialInstance* OverrideSlotImage);
	void OnFinsihedItemSave();
	void OnHideItemInfoHeader(bool bShouldHide);
	void OnSavingItemStarted();
	void OnTabSelectionChanged(bool bShowingVariants);
	void OnUpdateExclusiveItemCallout(bool bShouldShow, const class FText& CalloutText);
	void ShowSavingModal();
	void UpdateSeasonButtonEnabledState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaItemCustomizationSelector_C">();
	}
	static class UAthenaItemCustomizationSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaItemCustomizationSelector_C>();
	}
};
static_assert(alignof(UAthenaItemCustomizationSelector_C) == 0x000010, "Wrong alignment on UAthenaItemCustomizationSelector_C");
static_assert(sizeof(UAthenaItemCustomizationSelector_C) == 0x000920, "Wrong size on UAthenaItemCustomizationSelector_C");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, UberGraphFrame) == 0x000830, "Member 'UAthenaItemCustomizationSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, PulseAnim) == 0x000838, "Member 'UAthenaItemCustomizationSelector_C::PulseAnim' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, CannotSlide) == 0x000840, "Member 'UAthenaItemCustomizationSelector_C::CannotSlide' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, NormalState) == 0x000848, "Member 'UAthenaItemCustomizationSelector_C::NormalState' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, SlideRight) == 0x000850, "Member 'UAthenaItemCustomizationSelector_C::SlideRight' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, SlideLeft) == 0x000858, "Member 'UAthenaItemCustomizationSelector_C::SlideLeft' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, HideTextSearch) == 0x000860, "Member 'UAthenaItemCustomizationSelector_C::HideTextSearch' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ShowTextSearch) == 0x000868, "Member 'UAthenaItemCustomizationSelector_C::ShowTextSearch' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ItemInfoIntroOutro) == 0x000870, "Member 'UAthenaItemCustomizationSelector_C::ItemInfoIntroOutro' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, Intro) == 0x000878, "Member 'UAthenaItemCustomizationSelector_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, Button_HitBlockerLeft) == 0x000880, "Member 'UAthenaItemCustomizationSelector_C::Button_HitBlockerLeft' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, Button_HitBlockerRight) == 0x000888, "Member 'UAthenaItemCustomizationSelector_C::Button_HitBlockerRight' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, CameraFrameContainer) == 0x000890, "Member 'UAthenaItemCustomizationSelector_C::CameraFrameContainer' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, CloseButton) == 0x000898, "Member 'UAthenaItemCustomizationSelector_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ExclusiveCalloutBox) == 0x0008A0, "Member 'UAthenaItemCustomizationSelector_C::ExclusiveCalloutBox' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ExclusiveCalloutText) == 0x0008A8, "Member 'UAthenaItemCustomizationSelector_C::ExclusiveCalloutText' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, LeftSideContentSZ) == 0x0008B0, "Member 'UAthenaItemCustomizationSelector_C::LeftSideContentSZ' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, RightSideContentSZ) == 0x0008B8, "Member 'UAthenaItemCustomizationSelector_C::RightSideContentSZ' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, SB_MainContent) == 0x0008C0, "Member 'UAthenaItemCustomizationSelector_C::SB_MainContent' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ShortDescriptionText) == 0x0008C8, "Member 'UAthenaItemCustomizationSelector_C::ShortDescriptionText' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, SlotImage) == 0x0008D0, "Member 'UAthenaItemCustomizationSelector_C::SlotImage' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, Vignette) == 0x0008D8, "Member 'UAthenaItemCustomizationSelector_C::Vignette' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, WidgetSwitcher_InteractionMethod) == 0x0008E0, "Member 'UAthenaItemCustomizationSelector_C::WidgetSwitcher_InteractionMethod' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, WidgetSwitcher_ItemEditor) == 0x0008E8, "Member 'UAthenaItemCustomizationSelector_C::WidgetSwitcher_ItemEditor' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ProgressModal) == 0x0008F0, "Member 'UAthenaItemCustomizationSelector_C::ProgressModal' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, bPickingStyle) == 0x0008F8, "Member 'UAthenaItemCustomizationSelector_C::bPickingStyle' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, bHandledBackRequest) == 0x0008F9, "Member 'UAthenaItemCustomizationSelector_C::bHandledBackRequest' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, AutoHideInfoPanelEventTimer) == 0x000900, "Member 'UAthenaItemCustomizationSelector_C::AutoHideInfoPanelEventTimer' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, TextEntryTimer) == 0x000908, "Member 'UAthenaItemCustomizationSelector_C::TextEntryTimer' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, SeasonFilter) == 0x000910, "Member 'UAthenaItemCustomizationSelector_C::SeasonFilter' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, MaxSeason) == 0x000914, "Member 'UAthenaItemCustomizationSelector_C::MaxSeason' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ItemInfoHideDelayTime) == 0x000918, "Member 'UAthenaItemCustomizationSelector_C::ItemInfoHideDelayTime' has a wrong offset!");

}

