#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLockedStyleNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLockedStyleNotification.AthenaLockedStyleNotification_C
// 0x0040 (0x0310 - 0x02D0)
class UAthenaLockedStyleNotification_C final : public UAthenaCosmeticUnlockingInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DataUpdate;                                        // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ProgressInfo;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_StaticText;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_LockedInfo;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           AutoHideTimer;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         HideDelayTime;                                     // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoHide;                                          // 0x030C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaLockedStyleNotification(int32 EntryPoint);
	void OnUnlockingInfoSet(bool bShowProgression);
	void OutroFinished();
	void RequestIntroAnim();
	void RequestOutroAnim();
	void RequestUpdateAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLockedStyleNotification_C">();
	}
	static class UAthenaLockedStyleNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLockedStyleNotification_C>();
	}
};
static_assert(alignof(UAthenaLockedStyleNotification_C) == 0x000008, "Wrong alignment on UAthenaLockedStyleNotification_C");
static_assert(sizeof(UAthenaLockedStyleNotification_C) == 0x000310, "Wrong size on UAthenaLockedStyleNotification_C");
static_assert(offsetof(UAthenaLockedStyleNotification_C, UberGraphFrame) == 0x0002D0, "Member 'UAthenaLockedStyleNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLockedStyleNotification_C, DataUpdate) == 0x0002D8, "Member 'UAthenaLockedStyleNotification_C::DataUpdate' has a wrong offset!");
static_assert(offsetof(UAthenaLockedStyleNotification_C, Intro) == 0x0002E0, "Member 'UAthenaLockedStyleNotification_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaLockedStyleNotification_C, SizeBox_ProgressInfo) == 0x0002E8, "Member 'UAthenaLockedStyleNotification_C::SizeBox_ProgressInfo' has a wrong offset!");
static_assert(offsetof(UAthenaLockedStyleNotification_C, SizeBox_StaticText) == 0x0002F0, "Member 'UAthenaLockedStyleNotification_C::SizeBox_StaticText' has a wrong offset!");
static_assert(offsetof(UAthenaLockedStyleNotification_C, Switcher_LockedInfo) == 0x0002F8, "Member 'UAthenaLockedStyleNotification_C::Switcher_LockedInfo' has a wrong offset!");
static_assert(offsetof(UAthenaLockedStyleNotification_C, AutoHideTimer) == 0x000300, "Member 'UAthenaLockedStyleNotification_C::AutoHideTimer' has a wrong offset!");
static_assert(offsetof(UAthenaLockedStyleNotification_C, HideDelayTime) == 0x000308, "Member 'UAthenaLockedStyleNotification_C::HideDelayTime' has a wrong offset!");
static_assert(offsetof(UAthenaLockedStyleNotification_C, AutoHide) == 0x00030C, "Member 'UAthenaLockedStyleNotification_C::AutoHide' has a wrong offset!");

}

