#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaPlayerLevelCompact

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaPlayerLevelCompact.AthenaPlayerLevelCompact_C.ExecuteUbergraph_AthenaPlayerLevelCompact
// 0x0058 (0x0058 - 0x0000)
struct AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Progress;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsMaxLevel;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortItem*                        K2Node_Event_RewardItem;                           // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_RewardTexture;                        // 0x0020(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasAdditionalStylesToDisplay;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_RewardLevel;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRequiresBattlePass;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact) == 0x000008, "Wrong alignment on AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact");
static_assert(sizeof(AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact) == 0x000058, "Wrong size on AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact");
static_assert(offsetof(AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact, EntryPoint) == 0x000000, "Member 'AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact, K2Node_Event_Progress) == 0x000004, "Member 'AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact::K2Node_Event_Progress' has a wrong offset!");
static_assert(offsetof(AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact, K2Node_Event_bIsMaxLevel) == 0x000008, "Member 'AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact::K2Node_Event_bIsMaxLevel' has a wrong offset!");
static_assert(offsetof(AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact, K2Node_Event_RewardItem) == 0x000018, "Member 'AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact::K2Node_Event_RewardItem' has a wrong offset!");
static_assert(offsetof(AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact, K2Node_Event_RewardTexture) == 0x000020, "Member 'AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact::K2Node_Event_RewardTexture' has a wrong offset!");
static_assert(offsetof(AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact, K2Node_Event_bHasAdditionalStylesToDisplay) == 0x000048, "Member 'AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact::K2Node_Event_bHasAdditionalStylesToDisplay' has a wrong offset!");
static_assert(offsetof(AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact, K2Node_Event_RewardLevel) == 0x00004C, "Member 'AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact::K2Node_Event_RewardLevel' has a wrong offset!");
static_assert(offsetof(AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact, K2Node_Event_bRequiresBattlePass) == 0x000050, "Member 'AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact::K2Node_Event_bRequiresBattlePass' has a wrong offset!");
static_assert(offsetof(AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'AthenaPlayerLevelCompact_C_ExecuteUbergraph_AthenaPlayerLevelCompact::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AthenaPlayerLevelCompact.AthenaPlayerLevelCompact_C.OnUpdateRewardIcon_1
// 0x0040 (0x0040 - 0x0000)
struct AthenaPlayerLevelCompact_C_OnUpdateRewardIcon_1 final
{
public:
	const class UFortItem*                        RewardItem;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              RewardTexture;                                     // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          bHasAdditionalStylesToDisplay;                     // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RewardLevel;                                       // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRequiresBattlePass;                               // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaPlayerLevelCompact_C_OnUpdateRewardIcon_1) == 0x000008, "Wrong alignment on AthenaPlayerLevelCompact_C_OnUpdateRewardIcon_1");
static_assert(sizeof(AthenaPlayerLevelCompact_C_OnUpdateRewardIcon_1) == 0x000040, "Wrong size on AthenaPlayerLevelCompact_C_OnUpdateRewardIcon_1");
static_assert(offsetof(AthenaPlayerLevelCompact_C_OnUpdateRewardIcon_1, RewardItem) == 0x000000, "Member 'AthenaPlayerLevelCompact_C_OnUpdateRewardIcon_1::RewardItem' has a wrong offset!");
static_assert(offsetof(AthenaPlayerLevelCompact_C_OnUpdateRewardIcon_1, RewardTexture) == 0x000008, "Member 'AthenaPlayerLevelCompact_C_OnUpdateRewardIcon_1::RewardTexture' has a wrong offset!");
static_assert(offsetof(AthenaPlayerLevelCompact_C_OnUpdateRewardIcon_1, bHasAdditionalStylesToDisplay) == 0x000030, "Member 'AthenaPlayerLevelCompact_C_OnUpdateRewardIcon_1::bHasAdditionalStylesToDisplay' has a wrong offset!");
static_assert(offsetof(AthenaPlayerLevelCompact_C_OnUpdateRewardIcon_1, RewardLevel) == 0x000034, "Member 'AthenaPlayerLevelCompact_C_OnUpdateRewardIcon_1::RewardLevel' has a wrong offset!");
static_assert(offsetof(AthenaPlayerLevelCompact_C_OnUpdateRewardIcon_1, bRequiresBattlePass) == 0x000038, "Member 'AthenaPlayerLevelCompact_C_OnUpdateRewardIcon_1::bRequiresBattlePass' has a wrong offset!");

// Function AthenaPlayerLevelCompact.AthenaPlayerLevelCompact_C.OnUpdateXpBar_1
// 0x0008 (0x0008 - 0x0000)
struct AthenaPlayerLevelCompact_C_OnUpdateXpBar_1 final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsMaxLevel;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaPlayerLevelCompact_C_OnUpdateXpBar_1) == 0x000004, "Wrong alignment on AthenaPlayerLevelCompact_C_OnUpdateXpBar_1");
static_assert(sizeof(AthenaPlayerLevelCompact_C_OnUpdateXpBar_1) == 0x000008, "Wrong size on AthenaPlayerLevelCompact_C_OnUpdateXpBar_1");
static_assert(offsetof(AthenaPlayerLevelCompact_C_OnUpdateXpBar_1, Progress) == 0x000000, "Member 'AthenaPlayerLevelCompact_C_OnUpdateXpBar_1::Progress' has a wrong offset!");
static_assert(offsetof(AthenaPlayerLevelCompact_C_OnUpdateXpBar_1, bIsMaxLevel) == 0x000004, "Member 'AthenaPlayerLevelCompact_C_OnUpdateXpBar_1::bIsMaxLevel' has a wrong offset!");

}

