#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaFrontend

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S12_CineTransitionData_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaFrontend.AthenaFrontend_C
// 0x00A0 (0x0878 - 0x07D8)
class UAthenaFrontend_C final : public UAthenaUIStateWidget_Frontend
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaFPS_C*                           AthenaFPS;                                         // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaTemperature_C*                   AthenaTemperature;                                 // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBuildWatermark_C*                      BuildWatermark;                                    // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_PTT;                                        // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_FrontendFlowDebug;                 // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UContentOnDemand_C*                     ContentOnDemand;                                   // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortVoiceChannelSpeakerContainer_C*    FortVoiceChannelSpeakerContainer;                  // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PTT_Image;                                         // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Bottom;                                   // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxPTT;                                        // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          StartedPlayingVideo;                               // 0x0838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_839[0x3];                                      // 0x0839(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TransitionIndex;                                   // 0x083C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS12_CineTransitionData>        TransitionAudioData;                               // 0x0840(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMediaPlayer*                           MovieMediaPlayer;                                  // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             TransitionSound01;                                 // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             TransitionSound02;                                 // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTimerHandle>                   AudioTimerHandles;                                 // 0x0868(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__Button_PTT_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ButtonToggleChat_K2Node_ComponentBoundEvent_39_CommonSelectedStateChanged__DelegateSignature(class UCommonButtonLegacy* Button, bool Selected);
	void Construct();
	void DisplayDebugFlowText(const class FText& DebugFlowText);
	void ExecuteUbergraph_AthenaFrontend(int32 EntryPoint);
	void HideDebugFlowText();
	void InitChatVisibilityButton();
	void On_Can_PTT();
	void OnSetFrontendVisibilityMode(EFrontendVisibilityMode InFrontendVisibilityMode);
	void OnTrailerMediaEnded();
	void OnTrailerMediaOpened(const class FString& OpenedUrl);
	void OnTrailerTransitionAudioCheck();
	void PlayTrailer();
	void SetChatWidgetVisibility(bool Visible);
	void SetOverlayTitleBarVisibility(bool Visible);
	void StartTrailerTransitionAudioCheck(class UMediaPlayer* MediaPlayer);
	void StopTrailerTransitionAudioCheck();
	void UpdatePttVisibility(EPTTState PTTState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaFrontend_C">();
	}
	static class UAthenaFrontend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaFrontend_C>();
	}
};
static_assert(alignof(UAthenaFrontend_C) == 0x000008, "Wrong alignment on UAthenaFrontend_C");
static_assert(sizeof(UAthenaFrontend_C) == 0x000878, "Wrong size on UAthenaFrontend_C");
static_assert(offsetof(UAthenaFrontend_C, UberGraphFrame) == 0x0007D8, "Member 'UAthenaFrontend_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, AthenaFPS) == 0x0007E0, "Member 'UAthenaFrontend_C::AthenaFPS' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, AthenaTemperature) == 0x0007E8, "Member 'UAthenaFrontend_C::AthenaTemperature' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, BuildWatermark) == 0x0007F0, "Member 'UAthenaFrontend_C::BuildWatermark' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, Button_PTT) == 0x0007F8, "Member 'UAthenaFrontend_C::Button_PTT' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, CommonTextBlock_FrontendFlowDebug) == 0x000800, "Member 'UAthenaFrontend_C::CommonTextBlock_FrontendFlowDebug' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, ContentOnDemand) == 0x000808, "Member 'UAthenaFrontend_C::ContentOnDemand' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, FortVoiceChannelSpeakerContainer) == 0x000810, "Member 'UAthenaFrontend_C::FortVoiceChannelSpeakerContainer' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, PTT_Image) == 0x000818, "Member 'UAthenaFrontend_C::PTT_Image' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, SafeZone_1) == 0x000820, "Member 'UAthenaFrontend_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, SafeZone_Bottom) == 0x000828, "Member 'UAthenaFrontend_C::SafeZone_Bottom' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, SizeBoxPTT) == 0x000830, "Member 'UAthenaFrontend_C::SizeBoxPTT' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, StartedPlayingVideo) == 0x000838, "Member 'UAthenaFrontend_C::StartedPlayingVideo' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, TransitionIndex) == 0x00083C, "Member 'UAthenaFrontend_C::TransitionIndex' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, TransitionAudioData) == 0x000840, "Member 'UAthenaFrontend_C::TransitionAudioData' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, MovieMediaPlayer) == 0x000850, "Member 'UAthenaFrontend_C::MovieMediaPlayer' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, TransitionSound01) == 0x000858, "Member 'UAthenaFrontend_C::TransitionSound01' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, TransitionSound02) == 0x000860, "Member 'UAthenaFrontend_C::TransitionSound02' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, AudioTimerHandles) == 0x000868, "Member 'UAthenaFrontend_C::AudioTimerHandles' has a wrong offset!");

}

