#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLobbyMatchmakingPlay

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLobbyMatchmakingPlay.AthenaLobbyMatchmakingPlay_C
// 0x0170 (0x05D8 - 0x0468)
class UAthenaLobbyMatchmakingPlay_C final : public UFortAthenaMatchmakingWidgetLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowMatchmakingDetails;                            // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewModeViolation;                                  // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_BasePanel;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Box_LimitedMatchmaking;                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      DebugCreativeServerSelect;                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MatchmakingSpinner;                                // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NewModeBorder;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SpinnerAndTextContainer;                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ModeTitle;                                    // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_ContentDownloadingHeader;                // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_NewMode;                                 // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ViolatorContent;                                   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ViolatorSwitcher;                                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              PlaylistsUpdated;                                  // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           ShowNewPlaylistTimer;                              // 0x04E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FPlaylistFrontEndData& Playlist_Data, class FText Playlist_CMS_Override, EFortLobbyType Lobby_Type)> OnPlaylistChanged;                                 // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USoundBase*                             MatchmakingSucceededSound;                         // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaylistAthena*                    PlaylistData;                                      // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShowingMatchmakingDetails;                       // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         PlaylistMainFont;                                  // 0x0518(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         PlaylistActivityFont;                              // 0x0570(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UFont*                                  PlaylistActivityFontFamily;                        // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CreativeMatchmakingSucceededSound;                 // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimateViolator();
	void BndEvt__PlayButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void Construct();
	void ExecuteUbergraph_AthenaLobbyMatchmakingPlay(int32 EntryPoint);
	void InitFonts();
	void OnAvailablePlaylistsUpdated();
	void OnCrossplayPreferencesChanged(bool IsCrossplayEnabled);
	void OnInitialized();
	void OnMatchmakingFinishedBlueprint(bool bSuccess, const class UFortPlaylistAthena* Playlist);
	void OnSetCancelButtonText(const class FText& CancelButtonText);
	void OnSetPlayButtonText(const class FText& PlayButtonText);
	void OnViolatorStyleRefreshed(const EFortMatchmakingViolatorStyle NewViolatorStyle);
	void PickMatchmakingSucceededSound(class USoundBase** SelectedMatchmakingSucceededSound);
	void PlaylistActivityChanged(const struct FPlaylistFrontEndData& NewPlaylist, const class FText& ActivityName, EFortLobbyType LobbyType);
	void PlaylistChanged(const struct FPlaylistFrontEndData& NewPlaylist, const class FText& PlaylistCMSOverrideName, EFortLobbyType LobbyType);
	void SetBasePanelColor(const struct FLinearColor& NewColor);
	void ShouldShowMatchmakingDetails(bool bShow);
	void Update_Playlist_Info(struct FPlaylistFrontEndData& NewPlaylist, class FText& PlaylistTitleOverride, EFortLobbyType& LobbyType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLobbyMatchmakingPlay_C">();
	}
	static class UAthenaLobbyMatchmakingPlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLobbyMatchmakingPlay_C>();
	}
};
static_assert(alignof(UAthenaLobbyMatchmakingPlay_C) == 0x000008, "Wrong alignment on UAthenaLobbyMatchmakingPlay_C");
static_assert(sizeof(UAthenaLobbyMatchmakingPlay_C) == 0x0005D8, "Wrong size on UAthenaLobbyMatchmakingPlay_C");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, UberGraphFrame) == 0x000468, "Member 'UAthenaLobbyMatchmakingPlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, ShowMatchmakingDetails) == 0x000470, "Member 'UAthenaLobbyMatchmakingPlay_C::ShowMatchmakingDetails' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, NewModeViolation) == 0x000478, "Member 'UAthenaLobbyMatchmakingPlay_C::NewModeViolation' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, Border_BasePanel) == 0x000480, "Member 'UAthenaLobbyMatchmakingPlay_C::Border_BasePanel' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, Box_LimitedMatchmaking) == 0x000488, "Member 'UAthenaLobbyMatchmakingPlay_C::Box_LimitedMatchmaking' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, DebugCreativeServerSelect) == 0x000490, "Member 'UAthenaLobbyMatchmakingPlay_C::DebugCreativeServerSelect' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, MatchmakingSpinner) == 0x000498, "Member 'UAthenaLobbyMatchmakingPlay_C::MatchmakingSpinner' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, NewModeBorder) == 0x0004A0, "Member 'UAthenaLobbyMatchmakingPlay_C::NewModeBorder' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, SpinnerAndTextContainer) == 0x0004A8, "Member 'UAthenaLobbyMatchmakingPlay_C::SpinnerAndTextContainer' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, Text_ModeTitle) == 0x0004B0, "Member 'UAthenaLobbyMatchmakingPlay_C::Text_ModeTitle' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, TextBlock_ContentDownloadingHeader) == 0x0004B8, "Member 'UAthenaLobbyMatchmakingPlay_C::TextBlock_ContentDownloadingHeader' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, TextBlock_NewMode) == 0x0004C0, "Member 'UAthenaLobbyMatchmakingPlay_C::TextBlock_NewMode' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, ViolatorContent) == 0x0004C8, "Member 'UAthenaLobbyMatchmakingPlay_C::ViolatorContent' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, ViolatorSwitcher) == 0x0004D0, "Member 'UAthenaLobbyMatchmakingPlay_C::ViolatorSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, PlaylistsUpdated) == 0x0004D8, "Member 'UAthenaLobbyMatchmakingPlay_C::PlaylistsUpdated' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, ShowNewPlaylistTimer) == 0x0004E8, "Member 'UAthenaLobbyMatchmakingPlay_C::ShowNewPlaylistTimer' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, OnPlaylistChanged) == 0x0004F0, "Member 'UAthenaLobbyMatchmakingPlay_C::OnPlaylistChanged' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, MatchmakingSucceededSound) == 0x000500, "Member 'UAthenaLobbyMatchmakingPlay_C::MatchmakingSucceededSound' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, PlaylistData) == 0x000508, "Member 'UAthenaLobbyMatchmakingPlay_C::PlaylistData' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, IsShowingMatchmakingDetails) == 0x000510, "Member 'UAthenaLobbyMatchmakingPlay_C::IsShowingMatchmakingDetails' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, PlaylistMainFont) == 0x000518, "Member 'UAthenaLobbyMatchmakingPlay_C::PlaylistMainFont' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, PlaylistActivityFont) == 0x000570, "Member 'UAthenaLobbyMatchmakingPlay_C::PlaylistActivityFont' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, PlaylistActivityFontFamily) == 0x0005C8, "Member 'UAthenaLobbyMatchmakingPlay_C::PlaylistActivityFontFamily' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, CreativeMatchmakingSucceededSound) == 0x0005D0, "Member 'UAthenaLobbyMatchmakingPlay_C::CreativeMatchmakingSucceededSound' has a wrong offset!");

}

