#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingModeButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchmakingModeButton.AthenaMatchmakingModeButton_C
// 0x0060 (0x0F60 - 0x0F00)
class UAthenaMatchmakingModeButton_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_EF8[0x8];                                      // 0x0EF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ConfirmSelection;                                  // 0x0F10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ConfirmSelectionFlash;                             // 0x0F18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConfirmSelectionShine;                             // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GameModeIcon;                                      // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       GameModeName;                                      // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LTMModeSubIcon;                                    // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SubGameModeName;                                   // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SubGameModeNameHB;                                 // 0x0F48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          FillSquad;                                         // 0x0F50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F51[0x7];                                      // 0x0F51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylistAthena*                    PlaylistData;                                      // 0x0F58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaMatchmakingModeButton(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PlaylistChanged(class UFortPlaylistAthena* NewPlaylist, const class FText& OverrideName);
	void RefreshFillText();
	void RefreshLimitedPoolWarning(bool IsCrossplayEnabled);
	void SetSquadFillText(bool bFill);
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMatchmakingModeButton_C">();
	}
	static class UAthenaMatchmakingModeButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchmakingModeButton_C>();
	}
};
static_assert(alignof(UAthenaMatchmakingModeButton_C) == 0x000010, "Wrong alignment on UAthenaMatchmakingModeButton_C");
static_assert(sizeof(UAthenaMatchmakingModeButton_C) == 0x000F60, "Wrong size on UAthenaMatchmakingModeButton_C");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, UberGraphFrame) == 0x000F00, "Member 'UAthenaMatchmakingModeButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, OnHover) == 0x000F08, "Member 'UAthenaMatchmakingModeButton_C::OnHover' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, ConfirmSelection) == 0x000F10, "Member 'UAthenaMatchmakingModeButton_C::ConfirmSelection' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, ConfirmSelectionFlash) == 0x000F18, "Member 'UAthenaMatchmakingModeButton_C::ConfirmSelectionFlash' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, ConfirmSelectionShine) == 0x000F20, "Member 'UAthenaMatchmakingModeButton_C::ConfirmSelectionShine' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, GameModeIcon) == 0x000F28, "Member 'UAthenaMatchmakingModeButton_C::GameModeIcon' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, GameModeName) == 0x000F30, "Member 'UAthenaMatchmakingModeButton_C::GameModeName' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, LTMModeSubIcon) == 0x000F38, "Member 'UAthenaMatchmakingModeButton_C::LTMModeSubIcon' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, SubGameModeName) == 0x000F40, "Member 'UAthenaMatchmakingModeButton_C::SubGameModeName' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, SubGameModeNameHB) == 0x000F48, "Member 'UAthenaMatchmakingModeButton_C::SubGameModeNameHB' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, FillSquad) == 0x000F50, "Member 'UAthenaMatchmakingModeButton_C::FillSquad' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, PlaylistData) == 0x000F58, "Member 'UAthenaMatchmakingModeButton_C::PlaylistData' has a wrong offset!");

}

