#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_ConfirmationWindow

#include "Basic.hpp"


namespace SDK::Params
{

// Function Athena_ConfirmationWindow.Athena_ConfirmationWindow_C.ExecuteUbergraph_Athena_ConfirmationWindow
// 0x0038 (0x0038 - 0x0000)
struct Athena_ConfirmationWindow_C_ExecuteUbergraph_Athena_ConfirmationWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_Event_Button;                               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Text;                                 // 0x0010(0x0018)(ConstParm)
	class UAthena_ConfirmationButton_C*           K2Node_DynamicCast_AsAthena_Confirmation_Button;   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_ConfirmationWindow_C_ExecuteUbergraph_Athena_ConfirmationWindow) == 0x000008, "Wrong alignment on Athena_ConfirmationWindow_C_ExecuteUbergraph_Athena_ConfirmationWindow");
static_assert(sizeof(Athena_ConfirmationWindow_C_ExecuteUbergraph_Athena_ConfirmationWindow) == 0x000038, "Wrong size on Athena_ConfirmationWindow_C_ExecuteUbergraph_Athena_ConfirmationWindow");
static_assert(offsetof(Athena_ConfirmationWindow_C_ExecuteUbergraph_Athena_ConfirmationWindow, EntryPoint) == 0x000000, "Member 'Athena_ConfirmationWindow_C_ExecuteUbergraph_Athena_ConfirmationWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_ConfirmationWindow_C_ExecuteUbergraph_Athena_ConfirmationWindow, K2Node_Event_Button) == 0x000008, "Member 'Athena_ConfirmationWindow_C_ExecuteUbergraph_Athena_ConfirmationWindow::K2Node_Event_Button' has a wrong offset!");
static_assert(offsetof(Athena_ConfirmationWindow_C_ExecuteUbergraph_Athena_ConfirmationWindow, K2Node_Event_Text) == 0x000010, "Member 'Athena_ConfirmationWindow_C_ExecuteUbergraph_Athena_ConfirmationWindow::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(Athena_ConfirmationWindow_C_ExecuteUbergraph_Athena_ConfirmationWindow, K2Node_DynamicCast_AsAthena_Confirmation_Button) == 0x000028, "Member 'Athena_ConfirmationWindow_C_ExecuteUbergraph_Athena_ConfirmationWindow::K2Node_DynamicCast_AsAthena_Confirmation_Button' has a wrong offset!");
static_assert(offsetof(Athena_ConfirmationWindow_C_ExecuteUbergraph_Athena_ConfirmationWindow, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Athena_ConfirmationWindow_C_ExecuteUbergraph_Athena_ConfirmationWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Athena_ConfirmationWindow.Athena_ConfirmationWindow_C.OnSetButtonText
// 0x0020 (0x0020 - 0x0000)
struct Athena_ConfirmationWindow_C_OnSetButtonText final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Athena_ConfirmationWindow_C_OnSetButtonText) == 0x000008, "Wrong alignment on Athena_ConfirmationWindow_C_OnSetButtonText");
static_assert(sizeof(Athena_ConfirmationWindow_C_OnSetButtonText) == 0x000020, "Wrong size on Athena_ConfirmationWindow_C_OnSetButtonText");
static_assert(offsetof(Athena_ConfirmationWindow_C_OnSetButtonText, Button) == 0x000000, "Member 'Athena_ConfirmationWindow_C_OnSetButtonText::Button' has a wrong offset!");
static_assert(offsetof(Athena_ConfirmationWindow_C_OnSetButtonText, Text) == 0x000008, "Member 'Athena_ConfirmationWindow_C_OnSetButtonText::Text' has a wrong offset!");

}

