#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCustomizationSlotButtonWrapper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaCustomizationSlotButtonWrapper.AthenaCustomizationSlotButtonWrapper_C
// 0x00C8 (0x0338 - 0x0270)
class UAthenaCustomizationSlotButtonWrapper_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Populate;                                          // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       SlotButton;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   BannerDisplayName;                                 // 0x0288(0x0018)(Edit, BlueprintVisible)
	EAthenaCustomizationCategory                  CustomizationType;                                 // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* Button, const struct FAthenaCustomizationParams& CustomizationParams)> OnSlotClicked;                                     // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UAthenaCustomizationSlotButtonWrapper_C* ButtonWrapper, EAthenaCustomizationCategory CustomizationType, class FText BannerLabel, class FText CustomizationDescription, int32 SubslotIndex)> OnSlotHovered;                                     // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   CategoryDescription;                               // 0x02C8(0x0018)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void()>              OnSlotUnhovered;                                   // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         SubslotIndex;                                      // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllowUnownedItems;                                // 0x02F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOneItemPerSlot;                                   // 0x02F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F6[0x2];                                      // 0x02F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      OverrideSlotImage;                                 // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RequiredSlotTag;                                   // 0x0300(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	float                                         SlottedItemCardWidth;                              // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              emptytexture;                                      // 0x0310(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void AnimPopulateInternal(int32 ButtonIndex);
	void BndEvt__SlotButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__SlotButton_K2Node_ComponentBoundEvent_13_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__SlotButton_K2Node_ComponentBoundEvent_47_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void Construct();
	void ExecuteUbergraph_AthenaCustomizationSlotButtonWrapper(int32 EntryPoint);
	void GetCustomizationSlotActiveState(bool* bCosmeticAvaialble, bool* bActive);
	void ResetPopulateAnimVisual();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaCustomizationSlotButtonWrapper_C">();
	}
	static class UAthenaCustomizationSlotButtonWrapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationSlotButtonWrapper_C>();
	}
};
static_assert(alignof(UAthenaCustomizationSlotButtonWrapper_C) == 0x000008, "Wrong alignment on UAthenaCustomizationSlotButtonWrapper_C");
static_assert(sizeof(UAthenaCustomizationSlotButtonWrapper_C) == 0x000338, "Wrong size on UAthenaCustomizationSlotButtonWrapper_C");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, UberGraphFrame) == 0x000270, "Member 'UAthenaCustomizationSlotButtonWrapper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, Populate) == 0x000278, "Member 'UAthenaCustomizationSlotButtonWrapper_C::Populate' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, SlotButton) == 0x000280, "Member 'UAthenaCustomizationSlotButtonWrapper_C::SlotButton' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, BannerDisplayName) == 0x000288, "Member 'UAthenaCustomizationSlotButtonWrapper_C::BannerDisplayName' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, CustomizationType) == 0x0002A0, "Member 'UAthenaCustomizationSlotButtonWrapper_C::CustomizationType' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, OnSlotClicked) == 0x0002A8, "Member 'UAthenaCustomizationSlotButtonWrapper_C::OnSlotClicked' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, OnSlotHovered) == 0x0002B8, "Member 'UAthenaCustomizationSlotButtonWrapper_C::OnSlotHovered' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, CategoryDescription) == 0x0002C8, "Member 'UAthenaCustomizationSlotButtonWrapper_C::CategoryDescription' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, OnSlotUnhovered) == 0x0002E0, "Member 'UAthenaCustomizationSlotButtonWrapper_C::OnSlotUnhovered' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, SubslotIndex) == 0x0002F0, "Member 'UAthenaCustomizationSlotButtonWrapper_C::SubslotIndex' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, bAllowUnownedItems) == 0x0002F4, "Member 'UAthenaCustomizationSlotButtonWrapper_C::bAllowUnownedItems' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, bOneItemPerSlot) == 0x0002F5, "Member 'UAthenaCustomizationSlotButtonWrapper_C::bOneItemPerSlot' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, OverrideSlotImage) == 0x0002F8, "Member 'UAthenaCustomizationSlotButtonWrapper_C::OverrideSlotImage' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, RequiredSlotTag) == 0x000300, "Member 'UAthenaCustomizationSlotButtonWrapper_C::RequiredSlotTag' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, SlottedItemCardWidth) == 0x000308, "Member 'UAthenaCustomizationSlotButtonWrapper_C::SlottedItemCardWidth' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButtonWrapper_C, emptytexture) == 0x000310, "Member 'UAthenaCustomizationSlotButtonWrapper_C::emptytexture' has a wrong offset!");

}

