#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingTile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaMatchmakingTile.AthenaMatchmakingTile_C.ExecuteUbergraph_AthenaMatchmakingTile
// 0x0400 (0x0400 - 0x0000)
struct AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlaylistAdvertisementType                    Temp_byte_Variable_2;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlaylistAdvertisementType                    Temp_byte_Variable_6;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0050(0x0018)()
	EFortMatchmakingTileStyle                     Temp_byte_Variable_7;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMatchmakingTileStyle                     Temp_byte_Variable_8;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMatchmakingTileStyle                     Temp_byte_Variable_13;                             // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Temp_object_Variable_1;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCMSContext*                            CallFunc_GetContext_ReturnValue;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNewPlaylistInformationAvailable_ReturnValue; // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_16;                             // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_17;                             // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_18;                             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_19;                             // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB[0x1];                                       // 0x00BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_4;                             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NumRowTiles;                          // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlaylistFrontEndData                  K2Node_Event_PlaylistToRepresent;                  // 0x00F8(0x0028)(ConstParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x0130(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0150(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextTrimPrecedingAndTrailing_ReturnValue; // 0x0170(0x0018)()
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0190(0x00B0)()
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue_1;       // 0x0240(0x00B0)()
	bool                                          Temp_bool_Variable_6;                              // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_20;                             // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_21;                             // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F3[0x5];                                      // 0x02F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0300(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_Available;                            // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0312(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_22;                             // 0x0313(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_6;                           // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_23;                             // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_7;                           // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_8;                           // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_6;                             // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_7;                             // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x036B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x036E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F[0x1];                                      // 0x036F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_9;                           // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_10;                          // 0x037D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_11;                          // 0x037E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x037F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0382(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0383(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0385(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0386(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_12;                          // 0x0387(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_13;                          // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_14;                          // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_15;                          // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_16;                          // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTimespanAsText_ReturnValue;            // 0x03C0(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x03D8(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x03E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_DateTimeMinValue_ReturnValue;             // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DateTimeDateTime_ReturnValue;  // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile) == 0x000010, "Wrong alignment on AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile");
static_assert(sizeof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile) == 0x000400, "Wrong size on AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, EntryPoint) == 0x000000, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable) == 0x000018, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_1) == 0x000019, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_2) == 0x00001A, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_3) == 0x00001B, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_4) == 0x00001C, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_5) == 0x00001D, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_6) == 0x00001E, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_text_Variable) == 0x000020, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_text_Variable_1) == 0x000038, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_text_Variable_2) == 0x000050, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_7) == 0x000068, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_object_Variable) == 0x000070, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_8) == 0x000078, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_9) == 0x000079, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_10) == 0x00007A, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_11) == 0x00007B, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_12) == 0x00007C, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_13) == 0x00007D, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_object_Variable_1) == 0x000080, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable) == 0x000088, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_14) == 0x000089, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_15) == 0x00008A, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_GetContext_ReturnValue) == 0x000090, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_1) == 0x000098, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_IsNewPlaylistInformationAvailable_ReturnValue) == 0x000099, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_IsNewPlaylistInformationAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_int_Variable) == 0x00009C, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_int_Variable_1) == 0x0000A0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable) == 0x0000A4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable_1) == 0x0000A8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable_2) == 0x0000AC, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable_3) == 0x0000B0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_2) == 0x0000B4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_16) == 0x0000B5, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_17) == 0x0000B6, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_17' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_3) == 0x0000B7, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_18) == 0x0000B8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_18' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_19) == 0x0000B9, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_19' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_4) == 0x0000BA, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable_4) == 0x0000BC, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable_5) == 0x0000C0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_int_Variable_2) == 0x0000C4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000C8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_struct_Variable) == 0x0000CC, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default) == 0x0000D4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_struct_Variable_1) == 0x0000D8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_1) == 0x0000E0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_struct_Variable_2) == 0x0000E4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_5) == 0x0000EC, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_int_Variable_3) == 0x0000F0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Event_NumRowTiles) == 0x0000F4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Event_NumRowTiles' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Event_PlaylistToRepresent) == 0x0000F8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Event_PlaylistToRepresent' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000120, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_2) == 0x000128, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_3) == 0x000130, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000148, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000149, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue) == 0x00014A, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_TextToUpper_ReturnValue) == 0x000150, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_TextIsEmpty_ReturnValue) == 0x000168, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_TextTrimPrecedingAndTrailing_ReturnValue) == 0x000170, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_TextTrimPrecedingAndTrailing_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000190, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_MakeBrushFromTexture_ReturnValue_1) == 0x000240, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_MakeBrushFromTexture_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_6) == 0x0002F0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_20) == 0x0002F1, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_20' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_21) == 0x0002F2, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_21' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimation_ReturnValue) == 0x0002F8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_CreateDelegate_OutputDelegate) == 0x000300, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Event_Available) == 0x000310, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Event_Available' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_4) == 0x000311, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_7) == 0x000312, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_22) == 0x000313, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_22' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_5) == 0x000314, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_6) == 0x000318, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_23) == 0x000320, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_23' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_7) == 0x000328, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000330, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000338, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimation_ReturnValue_1) == 0x000340, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_8) == 0x000348, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_8) == 0x000349, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimation_ReturnValue_2) == 0x000350, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimation_ReturnValue_3) == 0x000358, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable_6) == 0x000360, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable_7) == 0x000364, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue_1) == 0x000368, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanAND_ReturnValue) == 0x000369, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_9) == 0x00036A, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00036B, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00036C, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue_2) == 0x00036D, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue_3) == 0x00036E, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Len_ReturnValue) == 0x000370, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Greater_IntInt_ReturnValue) == 0x000374, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_9) == 0x000378, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Not_PreBool_ReturnValue) == 0x00037C, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_10) == 0x00037D, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_10' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_11) == 0x00037E, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_11' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x00037F, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x000380, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue_4) == 0x000381, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000382, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_SwitchEnum_CmpSuccess) == 0x000383, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue_5) == 0x000384, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanAND_ReturnValue_1) == 0x000385, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000386, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_12) == 0x000387, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_12' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_13) == 0x000388, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_13' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_14) == 0x00038C, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_14' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_15) == 0x000390, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_15' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_UtcNow_ReturnValue) == 0x000398, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_UtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Clamp_ReturnValue) == 0x0003A0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0003A4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_MakeVector2D_ReturnValue) == 0x0003A8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x0003B0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_16) == 0x0003B8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_16' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_GetTimespanAsText_ReturnValue) == 0x0003C0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_GetTimespanAsText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003D8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0003E8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_DateTimeMinValue_ReturnValue) == 0x0003F0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_DateTimeMinValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_DateTimeDateTime_ReturnValue) == 0x0003F8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_DateTimeDateTime_ReturnValue' has a wrong offset!");

// Function AthenaMatchmakingTile.AthenaMatchmakingTile_C.PlayIntroOrOutro
// 0x0018 (0x0018 - 0x0000)
struct AthenaMatchmakingTile_C_PlayIntroOrOutro final
{
public:
	bool                                          PlayIntro;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingTile_C_PlayIntroOrOutro) == 0x000008, "Wrong alignment on AthenaMatchmakingTile_C_PlayIntroOrOutro");
static_assert(sizeof(AthenaMatchmakingTile_C_PlayIntroOrOutro) == 0x000018, "Wrong size on AthenaMatchmakingTile_C_PlayIntroOrOutro");
static_assert(offsetof(AthenaMatchmakingTile_C_PlayIntroOrOutro, PlayIntro) == 0x000000, "Member 'AthenaMatchmakingTile_C_PlayIntroOrOutro::PlayIntro' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_PlayIntroOrOutro, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingTile_C_PlayIntroOrOutro::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_PlayIntroOrOutro, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'AthenaMatchmakingTile_C_PlayIntroOrOutro::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function AthenaMatchmakingTile.AthenaMatchmakingTile_C.PlaylistChanged
// 0x0028 (0x0028 - 0x0000)
struct AthenaMatchmakingTile_C_PlaylistChanged final
{
public:
	struct FPlaylistFrontEndData                  PlaylistToRepresent;                               // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMatchmakingTile_C_PlaylistChanged) == 0x000008, "Wrong alignment on AthenaMatchmakingTile_C_PlaylistChanged");
static_assert(sizeof(AthenaMatchmakingTile_C_PlaylistChanged) == 0x000028, "Wrong size on AthenaMatchmakingTile_C_PlaylistChanged");
