#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLoadoutTile

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaLoadoutTile.AthenaLoadoutTile_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaLoadoutTile_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLoadoutTile_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on AthenaLoadoutTile_C_BP_OnItemSelectionChanged");
static_assert(sizeof(AthenaLoadoutTile_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on AthenaLoadoutTile_C_BP_OnItemSelectionChanged");
static_assert(offsetof(AthenaLoadoutTile_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'AthenaLoadoutTile_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function AthenaLoadoutTile.AthenaLoadoutTile_C.ExecuteUbergraph_AthenaLoadoutTile
// 0x0058 (0x0058 - 0x0000)
struct AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCosmeticLoadoutCard_C*                 K2Node_DynamicCast_AsCosmetic_Loadout_Card;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCosmeticLoadoutCard_C*                 K2Node_DynamicCast_AsCosmetic_Loadout_Card_1;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCosmeticLoadoutCard_C*                 K2Node_DynamicCast_AsCosmetic_Loadout_Card_2;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCosmeticLoadoutCard_C*                 K2Node_DynamicCast_AsCosmetic_Loadout_Card_3;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCosmeticLoadoutCard_C*                 K2Node_DynamicCast_AsCosmetic_Loadout_Card_4;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile) == 0x000008, "Wrong alignment on AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile");
static_assert(sizeof(AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile) == 0x000058, "Wrong size on AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile");
static_assert(offsetof(AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile, EntryPoint) == 0x000000, "Member 'AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile, K2Node_Event_bIsSelected) == 0x000004, "Member 'AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile, K2Node_DynamicCast_AsCosmetic_Loadout_Card) == 0x000008, "Member 'AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile::K2Node_DynamicCast_AsCosmetic_Loadout_Card' has a wrong offset!");
static_assert(offsetof(AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile, K2Node_DynamicCast_AsCosmetic_Loadout_Card_1) == 0x000018, "Member 'AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile::K2Node_DynamicCast_AsCosmetic_Loadout_Card_1' has a wrong offset!");
static_assert(offsetof(AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile, K2Node_DynamicCast_AsCosmetic_Loadout_Card_2) == 0x000028, "Member 'AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile::K2Node_DynamicCast_AsCosmetic_Loadout_Card_2' has a wrong offset!");
static_assert(offsetof(AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile, K2Node_DynamicCast_bSuccess_2) == 0x000030, "Member 'AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile, K2Node_DynamicCast_AsCosmetic_Loadout_Card_3) == 0x000038, "Member 'AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile::K2Node_DynamicCast_AsCosmetic_Loadout_Card_3' has a wrong offset!");
static_assert(offsetof(AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile, K2Node_DynamicCast_bSuccess_3) == 0x000040, "Member 'AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile, K2Node_DynamicCast_AsCosmetic_Loadout_Card_4) == 0x000048, "Member 'AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile::K2Node_DynamicCast_AsCosmetic_Loadout_Card_4' has a wrong offset!");
static_assert(offsetof(AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile, K2Node_DynamicCast_bSuccess_4) == 0x000050, "Member 'AthenaLoadoutTile_C_ExecuteUbergraph_AthenaLoadoutTile::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

}

