#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMOTDTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMOTDTile.AthenaMOTDTile_C
// 0x0090 (0x0FE0 - 0x0F50)
class UAthenaMOTDTile_C final : public UFortAthenaMOTDTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHovered;                                         // 0x0F58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0F60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Details;                                    // 0x0F68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_PipDisplay;                                 // 0x0F70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLoadGuard*                       CommonLoadGuard_0;                                 // 0x0F78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fill;                                              // 0x0F80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_196;                                         // 0x0F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ClickCatcher;                                // 0x0F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadingImage;                                      // 0x0F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LoadingImageOvr;                                   // 0x0FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            LoadSwitcher;                                      // 0x0FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              NewsItemScale;                                     // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Tile;                                      // 0x0FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bShowImageOnly;                                    // 0x0FC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC1[0x7];                                      // 0x0FC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool NewIsHovered)> OnHoveredChanged;                                  // 0x0FC8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_AthenaMOTDTile(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void ShowImageOnly();
	void UpdateDisplay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMOTDTile_C">();
	}
	static class UAthenaMOTDTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMOTDTile_C>();
	}
};
static_assert(alignof(UAthenaMOTDTile_C) == 0x000010, "Wrong alignment on UAthenaMOTDTile_C");
static_assert(sizeof(UAthenaMOTDTile_C) == 0x000FE0, "Wrong size on UAthenaMOTDTile_C");
static_assert(offsetof(UAthenaMOTDTile_C, UberGraphFrame) == 0x000F50, "Member 'UAthenaMOTDTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, OnHovered) == 0x000F58, "Member 'UAthenaMOTDTile_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Intro) == 0x000F60, "Member 'UAthenaMOTDTile_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Border_Details) == 0x000F68, "Member 'UAthenaMOTDTile_C::Border_Details' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Border_PipDisplay) == 0x000F70, "Member 'UAthenaMOTDTile_C::Border_PipDisplay' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, CommonLoadGuard_0) == 0x000F78, "Member 'UAthenaMOTDTile_C::CommonLoadGuard_0' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Fill) == 0x000F80, "Member 'UAthenaMOTDTile_C::Fill' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Image_196) == 0x000F88, "Member 'UAthenaMOTDTile_C::Image_196' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Image_ClickCatcher) == 0x000F90, "Member 'UAthenaMOTDTile_C::Image_ClickCatcher' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, LoadingImage) == 0x000F98, "Member 'UAthenaMOTDTile_C::LoadingImage' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, LoadingImageOvr) == 0x000FA0, "Member 'UAthenaMOTDTile_C::LoadingImageOvr' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, LoadSwitcher) == 0x000FA8, "Member 'UAthenaMOTDTile_C::LoadSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, NewsItemScale) == 0x000FB0, "Member 'UAthenaMOTDTile_C::NewsItemScale' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, SizeBox_Tile) == 0x000FB8, "Member 'UAthenaMOTDTile_C::SizeBox_Tile' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, bShowImageOnly) == 0x000FC0, "Member 'UAthenaMOTDTile_C::bShowImageOnly' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, OnHoveredChanged) == 0x000FC8, "Member 'UAthenaMOTDTile_C::OnHoveredChanged' has a wrong offset!");

}

