#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMOTDWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.DialogResult_B7839D98483DEF9593D448BA28AE74F7
// 0x000C (0x000C - 0x0000)
struct AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7 final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7) == 0x000004, "Wrong alignment on AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7");
static_assert(sizeof(AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7) == 0x00000C, "Wrong size on AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7");
static_assert(offsetof(AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7, Result) == 0x000000, "Member 'AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7::Result' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7, ResultName) == 0x000004, "Member 'AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7::ResultName' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.ExecuteUbergraph_AthenaMOTDWidget
// 0x0250 (0x0250 - 0x0000)
struct AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFort_Entry_Music_Controller_BP_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0040(0x0010)(ReferenceParm)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFort_Entry_Music_Controller_BP_C*      CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InText_3;                             // 0x0060(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InText_2;                             // 0x0078(0x0018)(ConstParm)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAthenaMOTDBase                        K2Node_Event_NewsEntry;                            // 0x00A0(0x00D0)(ConstParm)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InText_1;                             // 0x0178(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InText;                               // 0x0190(0x0018)(ConstParm)
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoloButton_C*                          K2Node_DynamicCast_AsSolo_Button;                  // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button_1;           // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoloButton_C*                          K2Node_DynamicCast_AsSolo_Button_1;                // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue_1;              // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue_2;              // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue_3;              // 0x01E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x01E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsLoading;                           // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue_2;                 // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumPlayersInLocalParty_ReturnValue;    // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_212[0x2];                                      // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0214(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate;              // 0x021C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0230(0x0020)()
};
static_assert(alignof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget");
static_assert(sizeof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget) == 0x000250, "Wrong size on AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, EntryPoint) == 0x000000, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue) == 0x000020, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_ComponentBoundEvent_Button) == 0x000038, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_GetAllActorsOfClass_OutActors) == 0x000040, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_ComponentBoundEvent_Button_1) == 0x000050, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_Array_Get_Item) == 0x000058, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_Event_InText_3) == 0x000060, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_Event_InText_3' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_Event_InText_2) == 0x000078, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_Event_InText_2' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_GetContext_ReturnValue) == 0x000090, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000098, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_Event_NewsEntry) == 0x0000A0, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_Event_NewsEntry' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_GetContext_ReturnValue_1) == 0x000170, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_Event_InText_1) == 0x000178, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_Event_InText_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_Event_InText) == 0x000190, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_Event_InText' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_DynamicCast_AsIcon_Text_Button) == 0x0001A8, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_DynamicCast_bSuccess) == 0x0001B0, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_DynamicCast_AsSolo_Button) == 0x0001B8, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_DynamicCast_AsSolo_Button' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_DynamicCast_bSuccess_1) == 0x0001C0, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_DynamicCast_AsIcon_Text_Button_1) == 0x0001C8, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_DynamicCast_AsIcon_Text_Button_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_DynamicCast_bSuccess_2) == 0x0001D0, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_DynamicCast_AsSolo_Button_1) == 0x0001D8, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_DynamicCast_AsSolo_Button_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_DynamicCast_bSuccess_3) == 0x0001E0, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_GetVisibility_ReturnValue) == 0x0001E1, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_GetVisibility_ReturnValue_1) == 0x0001E2, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_GetVisibility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001E3, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001E4, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_GetVisibility_ReturnValue_2) == 0x0001E5, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_GetVisibility_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_GetVisibility_ReturnValue_3) == 0x0001E6, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_GetVisibility_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0001E7, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0001E8, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_Event_bIsLoading) == 0x0001E9, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_Event_bIsLoading' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_GetContext_ReturnValue_2) == 0x0001F0, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_BooleanAND_ReturnValue) == 0x0001F8, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_GetNumPlayersInLocalParty_ReturnValue) == 0x0001FC, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_GetNumPlayersInLocalParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000200, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_BooleanAND_ReturnValue_1) == 0x000201, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_BooleanAND_ReturnValue_2) == 0x000202, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_BooleanAND_ReturnValue_3) == 0x000203, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, Temp_byte_Variable) == 0x000204, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, Temp_name_Variable) == 0x000208, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000210, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_CustomEvent_Result) == 0x000211, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_CustomEvent_ResultName) == 0x000214, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_CreateDelegate_OutputDelegate) == 0x00021C, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000230, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct AthenaMOTDWidget_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UCommonButtonLegacy*                    CallFunc_GetSelectedButton_ReturnValue;            // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDWidget_C_OnFocusReceived) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_OnFocusReceived");
static_assert(sizeof(AthenaMOTDWidget_C_OnFocusReceived) == 0x0001B8, "Wrong size on AthenaMOTDWidget_C_OnFocusReceived");
static_assert(offsetof(AthenaMOTDWidget_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'AthenaMOTDWidget_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'AthenaMOTDWidget_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'AthenaMOTDWidget_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'AthenaMOTDWidget_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_OnFocusReceived, CallFunc_GetSelectedButton_ReturnValue) == 0x0001B0, "Member 'AthenaMOTDWidget_C_OnFocusReceived::CallFunc_GetSelectedButton_ReturnValue' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.OnIsActivityLoadingChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaMOTDWidget_C_OnIsActivityLoadingChanged final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDWidget_C_OnIsActivityLoadingChanged) == 0x000001, "Wrong alignment on AthenaMOTDWidget_C_OnIsActivityLoadingChanged");
static_assert(sizeof(AthenaMOTDWidget_C_OnIsActivityLoadingChanged) == 0x000001, "Wrong size on AthenaMOTDWidget_C_OnIsActivityLoadingChanged");
static_assert(offsetof(AthenaMOTDWidget_C_OnIsActivityLoadingChanged, bIsLoading) == 0x000000, "Member 'AthenaMOTDWidget_C_OnIsActivityLoadingChanged::bIsLoading' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.OnSelectedNews
// 0x00D0 (0x00D0 - 0x0000)
struct AthenaMOTDWidget_C_OnSelectedNews final
{
public:
	struct FAthenaMOTDBase                        NewsEntry;                                         // 0x0000(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMOTDWidget_C_OnSelectedNews) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_OnSelectedNews");
static_assert(sizeof(AthenaMOTDWidget_C_OnSelectedNews) == 0x0000D0, "Wrong size on AthenaMOTDWidget_C_OnSelectedNews");
static_assert(offsetof(AthenaMOTDWidget_C_OnSelectedNews, NewsEntry) == 0x000000, "Member 'AthenaMOTDWidget_C_OnSelectedNews::NewsEntry' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.SetNormalButtonText
// 0x0018 (0x0018 - 0x0000)
struct AthenaMOTDWidget_C_SetNormalButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMOTDWidget_C_SetNormalButtonText) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_SetNormalButtonText");
static_assert(sizeof(AthenaMOTDWidget_C_SetNormalButtonText) == 0x000018, "Wrong size on AthenaMOTDWidget_C_SetNormalButtonText");
static_assert(offsetof(AthenaMOTDWidget_C_SetNormalButtonText, InText) == 0x000000, "Member 'AthenaMOTDWidget_C_SetNormalButtonText::InText' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.SetSecondaryNormalButtonText
// 0x0018 (0x0018 - 0x0000)
struct AthenaMOTDWidget_C_SetSecondaryNormalButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMOTDWidget_C_SetSecondaryNormalButtonText) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_SetSecondaryNormalButtonText");
static_assert(sizeof(AthenaMOTDWidget_C_SetSecondaryNormalButtonText) == 0x000018, "Wrong size on AthenaMOTDWidget_C_SetSecondaryNormalButtonText");
static_assert(offsetof(AthenaMOTDWidget_C_SetSecondaryNormalButtonText, InText) == 0x000000, "Member 'AthenaMOTDWidget_C_SetSecondaryNormalButtonText::InText' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.SetSecondarySpecialButtonText
// 0x0018 (0x0018 - 0x0000)
struct AthenaMOTDWidget_C_SetSecondarySpecialButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMOTDWidget_C_SetSecondarySpecialButtonText) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_SetSecondarySpecialButtonText");
static_assert(sizeof(AthenaMOTDWidget_C_SetSecondarySpecialButtonText) == 0x000018, "Wrong size on AthenaMOTDWidget_C_SetSecondarySpecialButtonText");
static_assert(offsetof(AthenaMOTDWidget_C_SetSecondarySpecialButtonText, InText) == 0x000000, "Member 'AthenaMOTDWidget_C_SetSecondarySpecialButtonText::InText' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.SetSpecialButtonText
// 0x0018 (0x0018 - 0x0000)
struct AthenaMOTDWidget_C_SetSpecialButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMOTDWidget_C_SetSpecialButtonText) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_SetSpecialButtonText");
static_assert(sizeof(AthenaMOTDWidget_C_SetSpecialButtonText) == 0x000018, "Wrong size on AthenaMOTDWidget_C_SetSpecialButtonText");
static_assert(offsetof(AthenaMOTDWidget_C_SetSpecialButtonText, InText) == 0x000000, "Member 'AthenaMOTDWidget_C_SetSpecialButtonText::InText' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.UpdateCustomColorStyle
// 0x0088 (0x0088 - 0x0000)
struct AthenaMOTDWidget_C_UpdateCustomColorStyle final
{
public:
	bool                                          bHasCustomColor;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 CustomDarkColor;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CustomLightColor;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0064(0x0014)()
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDWidget_C_UpdateCustomColorStyle) == 0x000004, "Wrong alignment on AthenaMOTDWidget_C_UpdateCustomColorStyle");
static_assert(sizeof(AthenaMOTDWidget_C_UpdateCustomColorStyle) == 0x000088, "Wrong size on AthenaMOTDWidget_C_UpdateCustomColorStyle");
static_assert(offsetof(AthenaMOTDWidget_C_UpdateCustomColorStyle, bHasCustomColor) == 0x000000, "Member 'AthenaMOTDWidget_C_UpdateCustomColorStyle::bHasCustomColor' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_UpdateCustomColorStyle, CustomDarkColor) == 0x000004, "Member 'AthenaMOTDWidget_C_UpdateCustomColorStyle::CustomDarkColor' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_UpdateCustomColorStyle, CustomLightColor) == 0x000008, "Member 'AthenaMOTDWidget_C_UpdateCustomColorStyle::CustomLightColor' has a wrong offset!");
