#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLockerTab

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLockerTab.AthenaLockerTab_C
// 0x01C8 (0x0EC8 - 0x0D00)
class UAthenaLockerTab_C final : public UAthenaCustomizationScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LoopingRandomEnabled_1;                            // 0x0D08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LoopingRandomEnabled;                              // 0x0D10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PresetAppliedToast_1;                              // 0x0D18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PresetAppliedToast_2;                              // 0x0D20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PresetAppliedToast;                                // 0x0D28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RandomDisabledDisclaimer;                          // 0x0D30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RandomEnabledDisclaimer;                           // 0x0D38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ItemInfoIntroOutro;                                // 0x0D40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       BackpackButton;                                    // 0x0D48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoloButton_C*                          Button_ChangeName;                                 // 0x0D50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       CharacterButton;                                   // 0x0D58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ClearAllBangsBang;                                 // 0x0D60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadoutSaveConfirmation_C*             Confirmation_Save;                                 // 0x0D68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       DanceButton1;                                      // 0x0D70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       DanceButton2;                                      // 0x0D78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       DanceButton3;                                      // 0x0D80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       DanceButton4;                                      // 0x0D88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       DanceButton5;                                      // 0x0D90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       DanceButton6;                                      // 0x0D98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0DA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_73;                                          // 0x0DA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_93;                                          // 0x0DB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_131;                                         // 0x0DB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       ItemWrapButton1;                                   // 0x0DC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       ItemWrapButton2;                                   // 0x0DC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       ItemWrapButton3;                                   // 0x0DD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       ItemWrapButton4;                                   // 0x0DD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       ItemWrapButton5;                                   // 0x0DE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       ItemWrapButton6;                                   // 0x0DE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       ItemWrapButton7;                                   // 0x0DF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULockerBuiltInEmoteWidget_C*            LockerBuiltInEmoteWidget;                          // 0x0DF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULockerBuiltInEmoteWidget_C*            LockerBuiltInEmoteWidget_2;                        // 0x0E00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       MusicPackButton;                                   // 0x0E08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NextRandom;                                        // 0x0E10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Random_Disclaimer;                                 // 0x0E18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RandomDisclaimerText_Enabled;                      // 0x0E20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_2;                                        // 0x0E28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_iteminfo;                                 // 0x0E30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_nextrando;                                 // 0x0E38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonAnimatedSwitcher*                Switcher_BangButton;                               // 0x0E40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_HoldForRandom;                                // 0x0E48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       UnsavedText_1;                                     // 0x0E50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_buttons;                               // 0x0E58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoloButton_C*                          xButton_Loadouts;                                  // 0x0E60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoloButton_C*                          xButton_RandomPresets;                             // 0x0E68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoloButton_C*                          xButton_SavePreset;                                // 0x0E70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UAthenaCustomizationSlotButtonWrapper_C*> AllSlots;                                          // 0x0E78(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	EAthenaCustomizationCategory                  CurrentCustomizationType;                          // 0x0E88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E89[0x3];                                      // 0x0E89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentSubslotIndex;                               // 0x0E8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaItemCustomizationSelector_C*     ItemCustomizationSelector;                         // 0x0E90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       CustomizationSlotButtonToPlayConfirmationOn;       // 0x0E98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           AutoHideDetailsForDances;                          // 0x0EA0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* FirstSlotInMenu;                                   // 0x0EA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                LastHoveredSlot_0;                                 // 0x0EB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAthenaCustomizationSlotButtonWrapper_C*> AnimBoundSlotArray;                                // 0x0EB8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void AnimShowRandomDisclaimerEnabled(bool Show);
	void BeginPickingCustomization(class UCommonButtonLegacy* WidgetToReturnFocusTo, const struct FAthenaCustomizationParams& CustomizationParams_0);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_AthenaLockerTab(int32 EntryPoint);
	void OnBeginPickingCustomizationSlot(class UAthenaCustomizationSlotSelectorButton* SlotButton);
	void OnBeginPickingLoadouts();
	void OnBeginSavingLoadouts();
	void OnRefreshForNewLoadout(const class FString& LoadoutName, bool bIsShuffleTile);
	void PlayEquippedLockerMusic_STW();
	void PlaySlotAnimationAndCenterSlot();
	void PlaySlotClickedAnimation(class UAthenaCustomizationSlotButton_C* SlotToPlayAnimOn);
	void TriggerRandomLoopingAnim();
	void UpdateInput(ECommonInputType InputType);
	void UpdatePresetButtonStyles(ECommonInputType InputPin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLockerTab_C">();
	}
	static class UAthenaLockerTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLockerTab_C>();
	}
};
static_assert(alignof(UAthenaLockerTab_C) == 0x000008, "Wrong alignment on UAthenaLockerTab_C");
static_assert(sizeof(UAthenaLockerTab_C) == 0x000EC8, "Wrong size on UAthenaLockerTab_C");
static_assert(offsetof(UAthenaLockerTab_C, UberGraphFrame) == 0x000D00, "Member 'UAthenaLockerTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, LoopingRandomEnabled_1) == 0x000D08, "Member 'UAthenaLockerTab_C::LoopingRandomEnabled_1' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, LoopingRandomEnabled) == 0x000D10, "Member 'UAthenaLockerTab_C::LoopingRandomEnabled' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, PresetAppliedToast_1) == 0x000D18, "Member 'UAthenaLockerTab_C::PresetAppliedToast_1' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, PresetAppliedToast_2) == 0x000D20, "Member 'UAthenaLockerTab_C::PresetAppliedToast_2' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, PresetAppliedToast) == 0x000D28, "Member 'UAthenaLockerTab_C::PresetAppliedToast' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, RandomDisabledDisclaimer) == 0x000D30, "Member 'UAthenaLockerTab_C::RandomDisabledDisclaimer' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, RandomEnabledDisclaimer) == 0x000D38, "Member 'UAthenaLockerTab_C::RandomEnabledDisclaimer' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemInfoIntroOutro) == 0x000D40, "Member 'UAthenaLockerTab_C::ItemInfoIntroOutro' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, BackpackButton) == 0x000D48, "Member 'UAthenaLockerTab_C::BackpackButton' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, Button_ChangeName) == 0x000D50, "Member 'UAthenaLockerTab_C::Button_ChangeName' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CharacterButton) == 0x000D58, "Member 'UAthenaLockerTab_C::CharacterButton' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ClearAllBangsBang) == 0x000D60, "Member 'UAthenaLockerTab_C::ClearAllBangsBang' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, Confirmation_Save) == 0x000D68, "Member 'UAthenaLockerTab_C::Confirmation_Save' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceButton1) == 0x000D70, "Member 'UAthenaLockerTab_C::DanceButton1' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceButton2) == 0x000D78, "Member 'UAthenaLockerTab_C::DanceButton2' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceButton3) == 0x000D80, "Member 'UAthenaLockerTab_C::DanceButton3' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceButton4) == 0x000D88, "Member 'UAthenaLockerTab_C::DanceButton4' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceButton5) == 0x000D90, "Member 'UAthenaLockerTab_C::DanceButton5' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceButton6) == 0x000D98, "Member 'UAthenaLockerTab_C::DanceButton6' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, Image) == 0x000DA0, "Member 'UAthenaLockerTab_C::Image' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, Image_73) == 0x000DA8, "Member 'UAthenaLockerTab_C::Image_73' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, Image_93) == 0x000DB0, "Member 'UAthenaLockerTab_C::Image_93' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, Image_131) == 0x000DB8, "Member 'UAthenaLockerTab_C::Image_131' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapButton1) == 0x000DC0, "Member 'UAthenaLockerTab_C::ItemWrapButton1' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapButton2) == 0x000DC8, "Member 'UAthenaLockerTab_C::ItemWrapButton2' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapButton3) == 0x000DD0, "Member 'UAthenaLockerTab_C::ItemWrapButton3' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapButton4) == 0x000DD8, "Member 'UAthenaLockerTab_C::ItemWrapButton4' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapButton5) == 0x000DE0, "Member 'UAthenaLockerTab_C::ItemWrapButton5' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapButton6) == 0x000DE8, "Member 'UAthenaLockerTab_C::ItemWrapButton6' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapButton7) == 0x000DF0, "Member 'UAthenaLockerTab_C::ItemWrapButton7' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, LockerBuiltInEmoteWidget) == 0x000DF8, "Member 'UAthenaLockerTab_C::LockerBuiltInEmoteWidget' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, LockerBuiltInEmoteWidget_2) == 0x000E00, "Member 'UAthenaLockerTab_C::LockerBuiltInEmoteWidget_2' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, MusicPackButton) == 0x000E08, "Member 'UAthenaLockerTab_C::MusicPackButton' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, NextRandom) == 0x000E10, "Member 'UAthenaLockerTab_C::NextRandom' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, Random_Disclaimer) == 0x000E18, "Member 'UAthenaLockerTab_C::Random_Disclaimer' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, RandomDisclaimerText_Enabled) == 0x000E20, "Member 'UAthenaLockerTab_C::RandomDisclaimerText_Enabled' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, SafeZone_2) == 0x000E28, "Member 'UAthenaLockerTab_C::SafeZone_2' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, SafeZone_iteminfo) == 0x000E30, "Member 'UAthenaLockerTab_C::SafeZone_iteminfo' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, SizeBox_nextrando) == 0x000E38, "Member 'UAthenaLockerTab_C::SizeBox_nextrando' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, Switcher_BangButton) == 0x000E40, "Member 'UAthenaLockerTab_C::Switcher_BangButton' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, Text_HoldForRandom) == 0x000E48, "Member 'UAthenaLockerTab_C::Text_HoldForRandom' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, UnsavedText_1) == 0x000E50, "Member 'UAthenaLockerTab_C::UnsavedText_1' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, VerticalBox_buttons) == 0x000E58, "Member 'UAthenaLockerTab_C::VerticalBox_buttons' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, xButton_Loadouts) == 0x000E60, "Member 'UAthenaLockerTab_C::xButton_Loadouts' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, xButton_RandomPresets) == 0x000E68, "Member 'UAthenaLockerTab_C::xButton_RandomPresets' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, xButton_SavePreset) == 0x000E70, "Member 'UAthenaLockerTab_C::xButton_SavePreset' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, AllSlots) == 0x000E78, "Member 'UAthenaLockerTab_C::AllSlots' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CurrentCustomizationType) == 0x000E88, "Member 'UAthenaLockerTab_C::CurrentCustomizationType' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CurrentSubslotIndex) == 0x000E8C, "Member 'UAthenaLockerTab_C::CurrentSubslotIndex' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemCustomizationSelector) == 0x000E90, "Member 'UAthenaLockerTab_C::ItemCustomizationSelector' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CustomizationSlotButtonToPlayConfirmationOn) == 0x000E98, "Member 'UAthenaLockerTab_C::CustomizationSlotButtonToPlayConfirmationOn' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, AutoHideDetailsForDances) == 0x000EA0, "Member 'UAthenaLockerTab_C::AutoHideDetailsForDances' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, FirstSlotInMenu) == 0x000EA8, "Member 'UAthenaLockerTab_C::FirstSlotInMenu' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, LastHoveredSlot_0) == 0x000EB0, "Member 'UAthenaLockerTab_C::LastHoveredSlot_0' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, AnimBoundSlotArray) == 0x000EB8, "Member 'UAthenaLockerTab_C::AnimBoundSlotArray' has a wrong offset!");

}

