#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBannerSelectModal

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaBannerSelectModal.AthenaBannerSelectModal_C.BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature final
{
public:
	class FName                                   IconId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ColorId;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature) == 0x000004, "Wrong alignment on AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature");
static_assert(sizeof(AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature) == 0x000010, "Wrong size on AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature");
static_assert(offsetof(AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature, IconId) == 0x000000, "Member 'AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature::IconId' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature, ColorId) == 0x000008, "Member 'AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature::ColorId' has a wrong offset!");

// Function AthenaBannerSelectModal.AthenaBannerSelectModal_C.ExecuteUbergraph_AthenaBannerSelectModal
// 0x0030 (0x0030 - 0x0000)
struct AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleCloseAction_PassThrough;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleCloseAction_PassThrough_1;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_ComponentBoundEvent_IconId;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_ColorId;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal) == 0x000008, "Wrong alignment on AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal");
static_assert(sizeof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal) == 0x000030, "Wrong size on AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal");
static_assert(offsetof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal, EntryPoint) == 0x000000, "Member 'AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal, CallFunc_HandleCloseAction_PassThrough) == 0x000005, "Member 'AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal::CallFunc_HandleCloseAction_PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal, CallFunc_HandleCloseAction_PassThrough_1) == 0x000006, "Member 'AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal::CallFunc_HandleCloseAction_PassThrough_1' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000008, "Member 'AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal, K2Node_MakeStruct_Margin) == 0x000010, "Member 'AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal, K2Node_ComponentBoundEvent_IconId) == 0x000020, "Member 'AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal::K2Node_ComponentBoundEvent_IconId' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal, K2Node_ComponentBoundEvent_ColorId) == 0x000028, "Member 'AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal::K2Node_ComponentBoundEvent_ColorId' has a wrong offset!");

// Function AthenaBannerSelectModal.AthenaBannerSelectModal_C.HandleCloseAction
// 0x0002 (0x0002 - 0x0000)
struct AthenaBannerSelectModal_C_HandleCloseAction final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Attempt_Leave_Picker_Left;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBannerSelectModal_C_HandleCloseAction) == 0x000001, "Wrong alignment on AthenaBannerSelectModal_C_HandleCloseAction");
static_assert(sizeof(AthenaBannerSelectModal_C_HandleCloseAction) == 0x000002, "Wrong size on AthenaBannerSelectModal_C_HandleCloseAction");
static_assert(offsetof(AthenaBannerSelectModal_C_HandleCloseAction, PassThrough) == 0x000000, "Member 'AthenaBannerSelectModal_C_HandleCloseAction::PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_HandleCloseAction, CallFunc_Attempt_Leave_Picker_Left) == 0x000001, "Member 'AthenaBannerSelectModal_C_HandleCloseAction::CallFunc_Attempt_Leave_Picker_Left' has a wrong offset!");

// Function AthenaBannerSelectModal.AthenaBannerSelectModal_C.On_BorderTouch_MouseButtonDown_0
// 0x02D8 (0x02D8 - 0x0000)
struct AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0160(0x00B8)()
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0220(0x00B8)()
};
static_assert(alignof(AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0) == 0x000008, "Wrong alignment on AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0");
static_assert(sizeof(AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0) == 0x0002D8, "Wrong size on AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0");
static_assert(offsetof(AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0, MyGeometry) == 0x000000, "Member 'AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0, MouseEvent) == 0x000038, "Member 'AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0, ReturnValue) == 0x0000A8, "Member 'AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0, CallFunc_Unhandled_ReturnValue) == 0x000160, "Member 'AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0, CallFunc_IsMobileGame_ReturnValue) == 0x000218, "Member 'AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0, CallFunc_Handled_ReturnValue) == 0x000220, "Member 'AthenaBannerSelectModal_C_On_BorderTouch_MouseButtonDown_0::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function AthenaBannerSelectModal.AthenaBannerSelectModal_C.Setup Input Action Handlers
// 0x0010 (0x0010 - 0x0000)
struct AthenaBannerSelectModal_C_Setup_Input_Action_Handlers final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaBannerSelectModal_C_Setup_Input_Action_Handlers) == 0x000004, "Wrong alignment on AthenaBannerSelectModal_C_Setup_Input_Action_Handlers");
static_assert(sizeof(AthenaBannerSelectModal_C_Setup_Input_Action_Handlers) == 0x000010, "Wrong size on AthenaBannerSelectModal_C_Setup_Input_Action_Handlers");
static_assert(offsetof(AthenaBannerSelectModal_C_Setup_Input_Action_Handlers, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaBannerSelectModal_C_Setup_Input_Action_Handlers::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

