#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonItemRewardIcon

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaSeasonItemRewardIcon.AthenaSeasonItemRewardIcon_C.DeselectedAnim
// 0x0010 (0x0010 - 0x0000)
struct AthenaSeasonItemRewardIcon_C_DeselectedAnim final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonItemRewardIcon_C_DeselectedAnim) == 0x000008, "Wrong alignment on AthenaSeasonItemRewardIcon_C_DeselectedAnim");
static_assert(sizeof(AthenaSeasonItemRewardIcon_C_DeselectedAnim) == 0x000010, "Wrong size on AthenaSeasonItemRewardIcon_C_DeselectedAnim");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_DeselectedAnim, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000000, "Member 'AthenaSeasonItemRewardIcon_C_DeselectedAnim::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_DeselectedAnim, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'AthenaSeasonItemRewardIcon_C_DeselectedAnim::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function AthenaSeasonItemRewardIcon.AthenaSeasonItemRewardIcon_C.ExecuteUbergraph_AthenaSeasonItemRewardIcon
// 0x00D8 (0x00D8 - 0x0000)
struct AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortItemSeriesDefinition*        K2Node_Event_SeriesData;                           // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpProfileAthena*                  CallFunc_GetAthenaProfile_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPurchasedSeasonBook_ReturnValue;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           K2Node_DynamicCast_AsOverlay_Slot;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UFortItem*                        K2Node_Event_RewardItem;                           // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_RewardTexture;                        // 0x0060(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasAdditionalStylesToDisplay;        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_RewardLevel;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRequiresBattlePass;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPersistableItem*                   K2Node_DynamicCast_AsFort_Persistable_Item;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00A8(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF[0x1];                                       // 0x00CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon) == 0x000008, "Wrong alignment on AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon");
static_assert(sizeof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon) == 0x0000D8, "Wrong size on AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, EntryPoint) == 0x000000, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_Event_SeriesData) == 0x000008, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_Event_SeriesData' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_byte_Variable) == 0x000010, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_bool_Variable) == 0x000011, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_byte_Variable_1) == 0x000012, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_byte_Variable_2) == 0x000013, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_bool_Variable_1) == 0x000014, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_byte_Variable_3) == 0x000015, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_byte_Variable_4) == 0x000016, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_bool_Variable_2) == 0x000020, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, CallFunc_GetAthenaProfile_ReturnValue) == 0x000028, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::CallFunc_GetAthenaProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_byte_Variable_5) == 0x000030, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, CallFunc_HasPurchasedSeasonBook_ReturnValue) == 0x000031, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::CallFunc_HasPurchasedSeasonBook_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, CallFunc_Not_PreBool_ReturnValue) == 0x000032, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_byte_Variable_6) == 0x000033, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_Event_IsDesignTime) == 0x000034, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, CallFunc_BooleanAND_ReturnValue) == 0x000035, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_DynamicCast_AsOverlay_Slot) == 0x000038, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_DynamicCast_AsOverlay_Slot' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_byte_Variable_7) == 0x000041, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000044, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_MakeStruct_Margin) == 0x000048, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_Event_RewardItem) == 0x000058, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_Event_RewardItem' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_Event_RewardTexture) == 0x000060, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_Event_RewardTexture' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_Event_bHasAdditionalStylesToDisplay) == 0x000088, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_Event_bHasAdditionalStylesToDisplay' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_Event_RewardLevel) == 0x00008C, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_Event_RewardLevel' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_Event_bRequiresBattlePass) == 0x000090, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_Event_bRequiresBattlePass' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, CallFunc_BooleanAND_ReturnValue_1) == 0x000091, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_DynamicCast_AsFort_Persistable_Item) == 0x000098, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_DynamicCast_AsFort_Persistable_Item' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_Select_Default) == 0x0000A1, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, CallFunc_Conv_IntToText_ReturnValue) == 0x0000A8, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C0, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, CallFunc_IsValid_ReturnValue) == 0x0000C1, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_Select_Default_1) == 0x0000C2, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_bool_Variable_3) == 0x0000C3, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_byte_Variable_8) == 0x0000C4, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_Select_Default_2) == 0x0000C5, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_byte_Variable_9) == 0x0000C6, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_bool_Variable_4) == 0x0000C7, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_byte_Variable_10) == 0x0000C8, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_Select_Default_3) == 0x0000C9, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_byte_Variable_11) == 0x0000CA, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, CallFunc_BooleanAND_ReturnValue_2) == 0x0000CB, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_Select_Default_4) == 0x0000CC, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, Temp_bool_Variable_5) == 0x0000CD, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, K2Node_Select_Default_5) == 0x0000CE, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000D0, "Member 'AthenaSeasonItemRewardIcon_C_ExecuteUbergraph_AthenaSeasonItemRewardIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function AthenaSeasonItemRewardIcon.AthenaSeasonItemRewardIcon_C.HandleMultipleRewardSelctedAnim
// 0x0018 (0x0018 - 0x0000)
struct AthenaSeasonItemRewardIcon_C_HandleMultipleRewardSelctedAnim final
{
public:
	bool                                          bLeftRewardSelected;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonItemRewardIcon_C_HandleMultipleRewardSelctedAnim) == 0x000008, "Wrong alignment on AthenaSeasonItemRewardIcon_C_HandleMultipleRewardSelctedAnim");
static_assert(sizeof(AthenaSeasonItemRewardIcon_C_HandleMultipleRewardSelctedAnim) == 0x000018, "Wrong size on AthenaSeasonItemRewardIcon_C_HandleMultipleRewardSelctedAnim");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_HandleMultipleRewardSelctedAnim, bLeftRewardSelected) == 0x000000, "Member 'AthenaSeasonItemRewardIcon_C_HandleMultipleRewardSelctedAnim::bLeftRewardSelected' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_HandleMultipleRewardSelctedAnim, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'AthenaSeasonItemRewardIcon_C_HandleMultipleRewardSelctedAnim::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_HandleMultipleRewardSelctedAnim, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'AthenaSeasonItemRewardIcon_C_HandleMultipleRewardSelctedAnim::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function AthenaSeasonItemRewardIcon.AthenaSeasonItemRewardIcon_C.Hover
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonItemRewardIcon_C_Hover final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonItemRewardIcon_C_Hover) == 0x000008, "Wrong alignment on AthenaSeasonItemRewardIcon_C_Hover");
static_assert(sizeof(AthenaSeasonItemRewardIcon_C_Hover) == 0x000008, "Wrong size on AthenaSeasonItemRewardIcon_C_Hover");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_Hover, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'AthenaSeasonItemRewardIcon_C_Hover::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function AthenaSeasonItemRewardIcon.AthenaSeasonItemRewardIcon_C.OnInitializeReward
// 0x0040 (0x0040 - 0x0000)
struct AthenaSeasonItemRewardIcon_C_OnInitializeReward final
{
public:
	const class UFortItem*                        RewardItem;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              RewardTexture;                                     // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          bHasAdditionalStylesToDisplay;                     // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RewardLevel;                                       // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRequiresBattlePass;                               // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonItemRewardIcon_C_OnInitializeReward) == 0x000008, "Wrong alignment on AthenaSeasonItemRewardIcon_C_OnInitializeReward");
static_assert(sizeof(AthenaSeasonItemRewardIcon_C_OnInitializeReward) == 0x000040, "Wrong size on AthenaSeasonItemRewardIcon_C_OnInitializeReward");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_OnInitializeReward, RewardItem) == 0x000000, "Member 'AthenaSeasonItemRewardIcon_C_OnInitializeReward::RewardItem' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_OnInitializeReward, RewardTexture) == 0x000008, "Member 'AthenaSeasonItemRewardIcon_C_OnInitializeReward::RewardTexture' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_OnInitializeReward, bHasAdditionalStylesToDisplay) == 0x000030, "Member 'AthenaSeasonItemRewardIcon_C_OnInitializeReward::bHasAdditionalStylesToDisplay' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_OnInitializeReward, RewardLevel) == 0x000034, "Member 'AthenaSeasonItemRewardIcon_C_OnInitializeReward::RewardLevel' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_OnInitializeReward, bRequiresBattlePass) == 0x000038, "Member 'AthenaSeasonItemRewardIcon_C_OnInitializeReward::bRequiresBattlePass' has a wrong offset!");

// Function AthenaSeasonItemRewardIcon.AthenaSeasonItemRewardIcon_C.OnInitializeSeriesReward
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonItemRewardIcon_C_OnInitializeSeriesReward final
{
public:
	const class UFortItemSeriesDefinition*        SeriesData;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonItemRewardIcon_C_OnInitializeSeriesReward) == 0x000008, "Wrong alignment on AthenaSeasonItemRewardIcon_C_OnInitializeSeriesReward");
static_assert(sizeof(AthenaSeasonItemRewardIcon_C_OnInitializeSeriesReward) == 0x000008, "Wrong size on AthenaSeasonItemRewardIcon_C_OnInitializeSeriesReward");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_OnInitializeSeriesReward, SeriesData) == 0x000000, "Member 'AthenaSeasonItemRewardIcon_C_OnInitializeSeriesReward::SeriesData' has a wrong offset!");

// Function AthenaSeasonItemRewardIcon.AthenaSeasonItemRewardIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaSeasonItemRewardIcon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonItemRewardIcon_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaSeasonItemRewardIcon_C_PreConstruct");
static_assert(sizeof(AthenaSeasonItemRewardIcon_C_PreConstruct) == 0x000001, "Wrong size on AthenaSeasonItemRewardIcon_C_PreConstruct");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaSeasonItemRewardIcon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaSeasonItemRewardIcon.AthenaSeasonItemRewardIcon_C.SelectedAnim
// 0x0010 (0x0010 - 0x0000)
struct AthenaSeasonItemRewardIcon_C_SelectedAnim final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonItemRewardIcon_C_SelectedAnim) == 0x000008, "Wrong alignment on AthenaSeasonItemRewardIcon_C_SelectedAnim");
static_assert(sizeof(AthenaSeasonItemRewardIcon_C_SelectedAnim) == 0x000010, "Wrong size on AthenaSeasonItemRewardIcon_C_SelectedAnim");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SelectedAnim, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000000, "Member 'AthenaSeasonItemRewardIcon_C_SelectedAnim::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SelectedAnim, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'AthenaSeasonItemRewardIcon_C_SelectedAnim::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function AthenaSeasonItemRewardIcon.AthenaSeasonItemRewardIcon_C.SetRarityColors
// 0x0070 (0x0070 - 0x0000)
struct AthenaSeasonItemRewardIcon_C_SetRarityColors final
{
public:
	struct FLinearColor                           Color1;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color2;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color3;                                            // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color4;                                            // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color5;                                            // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicOutlineMaterial_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonItemRewardIcon_C_SetRarityColors) == 0x000008, "Wrong alignment on AthenaSeasonItemRewardIcon_C_SetRarityColors");
static_assert(sizeof(AthenaSeasonItemRewardIcon_C_SetRarityColors) == 0x000070, "Wrong size on AthenaSeasonItemRewardIcon_C_SetRarityColors");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetRarityColors, Color1) == 0x000000, "Member 'AthenaSeasonItemRewardIcon_C_SetRarityColors::Color1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetRarityColors, Color2) == 0x000010, "Member 'AthenaSeasonItemRewardIcon_C_SetRarityColors::Color2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetRarityColors, Color3) == 0x000020, "Member 'AthenaSeasonItemRewardIcon_C_SetRarityColors::Color3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetRarityColors, Color4) == 0x000030, "Member 'AthenaSeasonItemRewardIcon_C_SetRarityColors::Color4' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetRarityColors, Color5) == 0x000040, "Member 'AthenaSeasonItemRewardIcon_C_SetRarityColors::Color5' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetRarityColors, CallFunc_GetDynamicOutlineMaterial_ReturnValue) == 0x000050, "Member 'AthenaSeasonItemRewardIcon_C_SetRarityColors::CallFunc_GetDynamicOutlineMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetRarityColors, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000058, "Member 'AthenaSeasonItemRewardIcon_C_SetRarityColors::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetRarityColors, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000060, "Member 'AthenaSeasonItemRewardIcon_C_SetRarityColors::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetRarityColors, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000068, "Member 'AthenaSeasonItemRewardIcon_C_SetRarityColors::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function AthenaSeasonItemRewardIcon.AthenaSeasonItemRewardIcon_C.SetupItemCardStyle
// 0x00F8 (0x00F8 - 0x0000)
struct AthenaSeasonItemRewardIcon_C_SetupItemCardStyle final
{
public:
	class UFortItem*                              RewardItem;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0010(0x0080)()
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaEmojiItemDefinition*             K2Node_DynamicCast_AsAthena_Emoji_Item_Definition; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_4;                             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_6;                             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_7;                             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D7[0x1];                                       // 0x00D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_8;                             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_9;                             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_4;                           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle) == 0x000008, "Wrong alignment on AthenaSeasonItemRewardIcon_C_SetupItemCardStyle");
static_assert(sizeof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle) == 0x0000F8, "Wrong size on AthenaSeasonItemRewardIcon_C_SetupItemCardStyle");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, RewardItem) == 0x000000, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::RewardItem' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, Temp_float_Variable) == 0x000008, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, CallFunc_GetRarity_ReturnValue) == 0x00000C, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, CallFunc_BPGetRarityData_ReturnValue) == 0x000010, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000090, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, K2Node_DynamicCast_AsAthena_Emoji_Item_Definition) == 0x000098, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::K2Node_DynamicCast_AsAthena_Emoji_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, CallFunc_GetType_ReturnValue) == 0x0000A1, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, Temp_float_Variable_1) == 0x0000A4, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A8, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000A9, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, Temp_bool_Variable) == 0x0000AA, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, CallFunc_BooleanOR_ReturnValue) == 0x0000AB, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, Temp_float_Variable_2) == 0x0000AC, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, K2Node_Select_Default) == 0x0000B0, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, Temp_float_Variable_3) == 0x0000B4, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, Temp_bool_Variable_1) == 0x0000B8, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, Temp_float_Variable_4) == 0x0000BC, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, Temp_float_Variable_5) == 0x0000C0, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, Temp_bool_Variable_2) == 0x0000C4, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, Temp_float_Variable_6) == 0x0000C8, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::Temp_float_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, K2Node_Select_Default_1) == 0x0000CC, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, Temp_float_Variable_7) == 0x0000D0, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::Temp_float_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, CallFunc_BooleanOR_ReturnValue_1) == 0x0000D4, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, CallFunc_BooleanOR_ReturnValue_2) == 0x0000D5, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, Temp_bool_Variable_3) == 0x0000D6, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, K2Node_Select_Default_2) == 0x0000D8, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, Temp_float_Variable_8) == 0x0000DC, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::Temp_float_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, K2Node_Select_Default_3) == 0x0000E0, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, Temp_float_Variable_9) == 0x0000E4, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::Temp_float_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, Temp_bool_Variable_4) == 0x0000E8, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, K2Node_Select_Default_4) == 0x0000EC, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_SetupItemCardStyle, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000F0, "Member 'AthenaSeasonItemRewardIcon_C_SetupItemCardStyle::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function AthenaSeasonItemRewardIcon.AthenaSeasonItemRewardIcon_C.Unhover
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonItemRewardIcon_C_Unhover final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonItemRewardIcon_C_Unhover) == 0x000008, "Wrong alignment on AthenaSeasonItemRewardIcon_C_Unhover");
static_assert(sizeof(AthenaSeasonItemRewardIcon_C_Unhover) == 0x000008, "Wrong size on AthenaSeasonItemRewardIcon_C_Unhover");
static_assert(offsetof(AthenaSeasonItemRewardIcon_C_Unhover, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'AthenaSeasonItemRewardIcon_C_Unhover::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

}

