#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMOTDTileMainPage

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaMOTDTileMainPage_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDTileMainPage_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on AthenaMOTDTileMainPage_C_BP_OnItemSelectionChanged");
static_assert(sizeof(AthenaMOTDTileMainPage_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on AthenaMOTDTileMainPage_C_BP_OnItemSelectionChanged");
static_assert(offsetof(AthenaMOTDTileMainPage_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'AthenaMOTDTileMainPage_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C.ExecuteUbergraph_AthenaMOTDTileMainPage
// 0x05D0 (0x05D0 - 0x0000)
struct AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B0(0x0070)(ConstParm)
	bool                                          CallFunc_IsListItemSelected_ReturnValue;           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x1];                                      // 0x0163(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0164(0x0014)()
	struct FAthenaMOTDBase                        K2Node_Event_NewsEntry;                            // 0x0178(0x00D0)(ConstParm)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x025C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x026D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26E[0x2];                                      // 0x026E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x0270(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0290(0x0058)(HasGetValueTypeHash)
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextBlockStyle                        K2Node_MakeStruct_TextBlockStyle;                  // 0x02F0(0x02E0)()
};
static_assert(alignof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage) == 0x000010, "Wrong alignment on AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage");
static_assert(sizeof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage) == 0x0005D0, "Wrong size on AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, EntryPoint) == 0x000000, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, Temp_byte_Variable) == 0x000004, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, Temp_byte_Variable_1) == 0x000005, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, Temp_bool_Variable) == 0x000006, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_Event_IsDesignTime) == 0x000007, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_Event_MyGeometry) == 0x000008, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_Event_MouseEvent) == 0x0000B0, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_IsListItemSelected_ReturnValue) == 0x000120, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_IsListItemSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000128, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_PlayAnimationForward_ReturnValue) == 0x000130, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000138, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000140, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_Event_bIsSelected) == 0x000148, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000150, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000158, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, Temp_bool_Variable_1) == 0x000160, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_Select_Default) == 0x000161, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_IsValid_ReturnValue) == 0x000162, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_MakeStruct_SlateColor) == 0x000164, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_Event_NewsEntry) == 0x000178, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_Event_NewsEntry' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000248, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_GetSelected_ReturnValue) == 0x000258, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_Select_Default_1) == 0x00025C, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_BooleanOR_ReturnValue) == 0x00026C, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_Not_PreBool_ReturnValue) == 0x00026D, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_MakeStruct_FontOutlineSettings) == 0x000270, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_MakeStruct_FontOutlineSettings' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_MakeStruct_SlateFontInfo) == 0x000290, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_MakeStruct_TextBlockStyle) == 0x0002F0, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_MakeStruct_TextBlockStyle' has a wrong offset!");

// Function AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct AthenaMOTDTileMainPage_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMOTDTileMainPage_C_OnMouseEnter) == 0x000008, "Wrong alignment on AthenaMOTDTileMainPage_C_OnMouseEnter");
static_assert(sizeof(AthenaMOTDTileMainPage_C_OnMouseEnter) == 0x0000A8, "Wrong size on AthenaMOTDTileMainPage_C_OnMouseEnter");
static_assert(offsetof(AthenaMOTDTileMainPage_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'AthenaMOTDTileMainPage_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'AthenaMOTDTileMainPage_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct AthenaMOTDTileMainPage_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMOTDTileMainPage_C_OnMouseLeave) == 0x000008, "Wrong alignment on AthenaMOTDTileMainPage_C_OnMouseLeave");
static_assert(sizeof(AthenaMOTDTileMainPage_C_OnMouseLeave) == 0x000070, "Wrong size on AthenaMOTDTileMainPage_C_OnMouseLeave");
static_assert(offsetof(AthenaMOTDTileMainPage_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'AthenaMOTDTileMainPage_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C.OnPopulateNews
// 0x00D0 (0x00D0 - 0x0000)
struct AthenaMOTDTileMainPage_C_OnPopulateNews final
{
public:
	struct FAthenaMOTDBase                        NewsEntry;                                         // 0x0000(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMOTDTileMainPage_C_OnPopulateNews) == 0x000008, "Wrong alignment on AthenaMOTDTileMainPage_C_OnPopulateNews");
static_assert(sizeof(AthenaMOTDTileMainPage_C_OnPopulateNews) == 0x0000D0, "Wrong size on AthenaMOTDTileMainPage_C_OnPopulateNews");
static_assert(offsetof(AthenaMOTDTileMainPage_C_OnPopulateNews, NewsEntry) == 0x000000, "Member 'AthenaMOTDTileMainPage_C_OnPopulateNews::NewsEntry' has a wrong offset!");

// Function AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaMOTDTileMainPage_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDTileMainPage_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaMOTDTileMainPage_C_PreConstruct");
static_assert(sizeof(AthenaMOTDTileMainPage_C_PreConstruct) == 0x000001, "Wrong size on AthenaMOTDTileMainPage_C_PreConstruct");
static_assert(offsetof(AthenaMOTDTileMainPage_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaMOTDTileMainPage_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C.ShowImageOnly
// 0x0004 (0x0004 - 0x0000)
struct AthenaMOTDTileMainPage_C_ShowImageOnly final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDTileMainPage_C_ShowImageOnly) == 0x000001, "Wrong alignment on AthenaMOTDTileMainPage_C_ShowImageOnly");
static_assert(sizeof(AthenaMOTDTileMainPage_C_ShowImageOnly) == 0x000004, "Wrong size on AthenaMOTDTileMainPage_C_ShowImageOnly");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ShowImageOnly, Temp_bool_Variable) == 0x000000, "Member 'AthenaMOTDTileMainPage_C_ShowImageOnly::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ShowImageOnly, Temp_byte_Variable) == 0x000001, "Member 'AthenaMOTDTileMainPage_C_ShowImageOnly::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ShowImageOnly, Temp_byte_Variable_1) == 0x000002, "Member 'AthenaMOTDTileMainPage_C_ShowImageOnly::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ShowImageOnly, K2Node_Select_Default) == 0x000003, "Member 'AthenaMOTDTileMainPage_C_ShowImageOnly::K2Node_Select_Default' has a wrong offset!");

// Function AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C.UpdateDisplay
// 0x0004 (0x0004 - 0x0000)
struct AthenaMOTDTileMainPage_C_UpdateDisplay final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDTileMainPage_C_UpdateDisplay) == 0x000001, "Wrong alignment on AthenaMOTDTileMainPage_C_UpdateDisplay");
static_assert(sizeof(AthenaMOTDTileMainPage_C_UpdateDisplay) == 0x000004, "Wrong size on AthenaMOTDTileMainPage_C_UpdateDisplay");
static_assert(offsetof(AthenaMOTDTileMainPage_C_UpdateDisplay, Temp_bool_Variable) == 0x000000, "Member 'AthenaMOTDTileMainPage_C_UpdateDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_UpdateDisplay, Temp_byte_Variable) == 0x000001, "Member 'AthenaMOTDTileMainPage_C_UpdateDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_UpdateDisplay, Temp_byte_Variable_1) == 0x000002, "Member 'AthenaMOTDTileMainPage_C_UpdateDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_UpdateDisplay, K2Node_Select_Default) == 0x000003, "Member 'AthenaMOTDTileMainPage_C_UpdateDisplay::K2Node_Select_Default' has a wrong offset!");

}

