#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMOTDTeaserWidget

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaMOTDTeaserWidget.AthenaMOTDTeaserWidget_C.BndEvt__FortAthenaMOTDTileListView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMOTDTeaserWidget_C_BndEvt__FortAthenaMOTDTileListView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDTeaserWidget_C_BndEvt__FortAthenaMOTDTileListView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMOTDTeaserWidget_C_BndEvt__FortAthenaMOTDTileListView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(sizeof(AthenaMOTDTeaserWidget_C_BndEvt__FortAthenaMOTDTileListView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong size on AthenaMOTDTeaserWidget_C_BndEvt__FortAthenaMOTDTileListView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_BndEvt__FortAthenaMOTDTileListView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'AthenaMOTDTeaserWidget_C_BndEvt__FortAthenaMOTDTileListView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function AthenaMOTDTeaserWidget.AthenaMOTDTeaserWidget_C.BndEvt__FortAthenaMOTDTileListView_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMOTDTeaserWidget_C_BndEvt__FortAthenaMOTDTileListView_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDTeaserWidget_C_BndEvt__FortAthenaMOTDTileListView_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMOTDTeaserWidget_C_BndEvt__FortAthenaMOTDTileListView_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature");
static_assert(sizeof(AthenaMOTDTeaserWidget_C_BndEvt__FortAthenaMOTDTileListView_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature) == 0x000008, "Wrong size on AthenaMOTDTeaserWidget_C_BndEvt__FortAthenaMOTDTileListView_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_BndEvt__FortAthenaMOTDTileListView_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'AthenaMOTDTeaserWidget_C_BndEvt__FortAthenaMOTDTileListView_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function AthenaMOTDTeaserWidget.AthenaMOTDTeaserWidget_C.BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMOTDTeaserWidget_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDTeaserWidget_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMOTDTeaserWidget_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMOTDTeaserWidget_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMOTDTeaserWidget_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMOTDTeaserWidget_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMOTDTeaserWidget.AthenaMOTDTeaserWidget_C.ExecuteUbergraph_AthenaMOTDTeaserWidget
// 0x00D0 (0x00D0 - 0x0000)
struct AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewIsHovered;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaMOTDTile_C*                      K2Node_DynamicCast_AsAthena_MOTDTile;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool NewIsHovered)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool NewIsHovered)>            K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_1;               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaMOTDTile_C*                      K2Node_DynamicCast_AsAthena_MOTDTile_1;            // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_CustomEvent_Button;                         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonLegacy* Button)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UCommonButtonLegacy* Button)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget) == 0x000008, "Wrong alignment on AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget");
static_assert(sizeof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget) == 0x0000D0, "Wrong size on AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, EntryPoint) == 0x000000, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, K2Node_ComponentBoundEvent_Widget) == 0x000008, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, K2Node_CustomEvent_NewIsHovered) == 0x000010, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::K2Node_CustomEvent_NewIsHovered' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, K2Node_DynamicCast_AsAthena_MOTDTile) == 0x000018, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::K2Node_DynamicCast_AsAthena_MOTDTile' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000038, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000040, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, K2Node_ComponentBoundEvent_Button) == 0x000058, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, CallFunc_Max_ReturnValue) == 0x000060, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000064, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000078, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000080, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, Temp_int_Variable) == 0x000088, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, K2Node_Event_IsDesignTime) == 0x00008C, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, K2Node_ComponentBoundEvent_Widget_1) == 0x000090, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, K2Node_DynamicCast_AsAthena_MOTDTile_1) == 0x000098, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::K2Node_DynamicCast_AsAthena_MOTDTile_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, K2Node_CustomEvent_Button) == 0x0000A8, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B0, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000C0, "Member 'AthenaMOTDTeaserWidget_C_ExecuteUbergraph_AthenaMOTDTeaserWidget::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function AthenaMOTDTeaserWidget.AthenaMOTDTeaserWidget_C.HandleEntryWidgetHoveredChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaMOTDTeaserWidget_C_HandleEntryWidgetHoveredChanged final
{
public:
	bool                                          NewIsHovered;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDTeaserWidget_C_HandleEntryWidgetHoveredChanged) == 0x000001, "Wrong alignment on AthenaMOTDTeaserWidget_C_HandleEntryWidgetHoveredChanged");
static_assert(sizeof(AthenaMOTDTeaserWidget_C_HandleEntryWidgetHoveredChanged) == 0x000001, "Wrong size on AthenaMOTDTeaserWidget_C_HandleEntryWidgetHoveredChanged");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_HandleEntryWidgetHoveredChanged, NewIsHovered) == 0x000000, "Member 'AthenaMOTDTeaserWidget_C_HandleEntryWidgetHoveredChanged::NewIsHovered' has a wrong offset!");

// Function AthenaMOTDTeaserWidget.AthenaMOTDTeaserWidget_C.OnClicked
// 0x0008 (0x0008 - 0x0000)
struct AthenaMOTDTeaserWidget_C_OnClicked final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDTeaserWidget_C_OnClicked) == 0x000008, "Wrong alignment on AthenaMOTDTeaserWidget_C_OnClicked");
static_assert(sizeof(AthenaMOTDTeaserWidget_C_OnClicked) == 0x000008, "Wrong size on AthenaMOTDTeaserWidget_C_OnClicked");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_OnClicked, Button) == 0x000000, "Member 'AthenaMOTDTeaserWidget_C_OnClicked::Button' has a wrong offset!");

// Function AthenaMOTDTeaserWidget.AthenaMOTDTeaserWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaMOTDTeaserWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDTeaserWidget_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaMOTDTeaserWidget_C_PreConstruct");
static_assert(sizeof(AthenaMOTDTeaserWidget_C_PreConstruct) == 0x000001, "Wrong size on AthenaMOTDTeaserWidget_C_PreConstruct");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaMOTDTeaserWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaMOTDTeaserWidget.AthenaMOTDTeaserWidget_C.SetDynamicColors
// 0x0030 (0x0030 - 0x0000)
struct AthenaMOTDTeaserWidget_C_SetDynamicColors final
{
public:
	struct FLinearColor                           DarkColor;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightColor;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDTeaserWidget_C_SetDynamicColors) == 0x000008, "Wrong alignment on AthenaMOTDTeaserWidget_C_SetDynamicColors");
static_assert(sizeof(AthenaMOTDTeaserWidget_C_SetDynamicColors) == 0x000030, "Wrong size on AthenaMOTDTeaserWidget_C_SetDynamicColors");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_SetDynamicColors, DarkColor) == 0x000000, "Member 'AthenaMOTDTeaserWidget_C_SetDynamicColors::DarkColor' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_SetDynamicColors, LightColor) == 0x000010, "Member 'AthenaMOTDTeaserWidget_C_SetDynamicColors::LightColor' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_SetDynamicColors, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AthenaMOTDTeaserWidget_C_SetDynamicColors::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_SetDynamicColors, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'AthenaMOTDTeaserWidget_C_SetDynamicColors::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function AthenaMOTDTeaserWidget.AthenaMOTDTeaserWidget_C.UpdateCurDisplayedNewsVisual
// 0x0130 (0x0130 - 0x0000)
struct AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAthenaMOTDBase                        CallFunc_GetNewsByIndex_ReturnValue;               // 0x0008(0x00D0)()
	int32                                         CallFunc_GetNewsCount_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0100(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual) == 0x000008, "Wrong alignment on AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual");
static_assert(sizeof(AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual) == 0x000130, "Wrong size on AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual, Temp_bool_Variable) == 0x000000, "Member 'AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual, CallFunc_GetNewsByIndex_ReturnValue) == 0x000008, "Member 'AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual::CallFunc_GetNewsByIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual, CallFunc_GetNewsCount_ReturnValue) == 0x0000D8, "Member 'AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual::CallFunc_GetNewsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000DC, "Member 'AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x0000E0, "Member 'AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual, K2Node_Select_Default) == 0x0000F0, "Member 'AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual, CallFunc_Conv_StringToText_ReturnValue) == 0x000100, "Member 'AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000118, "Member 'AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000120, "Member 'AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000128, "Member 'AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x00012C, "Member 'AthenaMOTDTeaserWidget_C_UpdateCurDisplayedNewsVisual::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");

}

