#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioExtensions

#include "Basic.hpp"


namespace SDK::Params
{

// Function AudioExtensions.AudioParameterInterface.SetBoolArrayParameter
// 0x0018 (0x0018 - 0x0000)
struct AudioParameterInterface_SetBoolArrayParameter final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<bool>                                  InValue;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioParameterInterface_SetBoolArrayParameter) == 0x000008, "Wrong alignment on AudioParameterInterface_SetBoolArrayParameter");
static_assert(sizeof(AudioParameterInterface_SetBoolArrayParameter) == 0x000018, "Wrong size on AudioParameterInterface_SetBoolArrayParameter");
static_assert(offsetof(AudioParameterInterface_SetBoolArrayParameter, InName) == 0x000000, "Member 'AudioParameterInterface_SetBoolArrayParameter::InName' has a wrong offset!");
static_assert(offsetof(AudioParameterInterface_SetBoolArrayParameter, InValue) == 0x000008, "Member 'AudioParameterInterface_SetBoolArrayParameter::InValue' has a wrong offset!");

// Function AudioExtensions.AudioParameterInterface.SetBoolParameter
// 0x000C (0x000C - 0x0000)
struct AudioParameterInterface_SetBoolParameter final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InBool;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AudioParameterInterface_SetBoolParameter) == 0x000004, "Wrong alignment on AudioParameterInterface_SetBoolParameter");
static_assert(sizeof(AudioParameterInterface_SetBoolParameter) == 0x00000C, "Wrong size on AudioParameterInterface_SetBoolParameter");
static_assert(offsetof(AudioParameterInterface_SetBoolParameter, InName) == 0x000000, "Member 'AudioParameterInterface_SetBoolParameter::InName' has a wrong offset!");
static_assert(offsetof(AudioParameterInterface_SetBoolParameter, InBool) == 0x000008, "Member 'AudioParameterInterface_SetBoolParameter::InBool' has a wrong offset!");

// Function AudioExtensions.AudioParameterInterface.SetFloatArrayParameter
// 0x0018 (0x0018 - 0x0000)
struct AudioParameterInterface_SetFloatArrayParameter final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 InValue;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioParameterInterface_SetFloatArrayParameter) == 0x000008, "Wrong alignment on AudioParameterInterface_SetFloatArrayParameter");
static_assert(sizeof(AudioParameterInterface_SetFloatArrayParameter) == 0x000018, "Wrong size on AudioParameterInterface_SetFloatArrayParameter");
static_assert(offsetof(AudioParameterInterface_SetFloatArrayParameter, InName) == 0x000000, "Member 'AudioParameterInterface_SetFloatArrayParameter::InName' has a wrong offset!");
static_assert(offsetof(AudioParameterInterface_SetFloatArrayParameter, InValue) == 0x000008, "Member 'AudioParameterInterface_SetFloatArrayParameter::InValue' has a wrong offset!");

// Function AudioExtensions.AudioParameterInterface.SetFloatParameter
// 0x000C (0x000C - 0x0000)
struct AudioParameterInterface_SetFloatParameter final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InFloat;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioParameterInterface_SetFloatParameter) == 0x000004, "Wrong alignment on AudioParameterInterface_SetFloatParameter");
static_assert(sizeof(AudioParameterInterface_SetFloatParameter) == 0x00000C, "Wrong size on AudioParameterInterface_SetFloatParameter");
static_assert(offsetof(AudioParameterInterface_SetFloatParameter, InName) == 0x000000, "Member 'AudioParameterInterface_SetFloatParameter::InName' has a wrong offset!");
static_assert(offsetof(AudioParameterInterface_SetFloatParameter, InFloat) == 0x000008, "Member 'AudioParameterInterface_SetFloatParameter::InFloat' has a wrong offset!");

// Function AudioExtensions.AudioParameterInterface.SetIntArrayParameter
// 0x0018 (0x0018 - 0x0000)
struct AudioParameterInterface_SetIntArrayParameter final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 InValue;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioParameterInterface_SetIntArrayParameter) == 0x000008, "Wrong alignment on AudioParameterInterface_SetIntArrayParameter");
static_assert(sizeof(AudioParameterInterface_SetIntArrayParameter) == 0x000018, "Wrong size on AudioParameterInterface_SetIntArrayParameter");
static_assert(offsetof(AudioParameterInterface_SetIntArrayParameter, InName) == 0x000000, "Member 'AudioParameterInterface_SetIntArrayParameter::InName' has a wrong offset!");
static_assert(offsetof(AudioParameterInterface_SetIntArrayParameter, InValue) == 0x000008, "Member 'AudioParameterInterface_SetIntArrayParameter::InValue' has a wrong offset!");

// Function AudioExtensions.AudioParameterInterface.SetIntParameter
// 0x000C (0x000C - 0x0000)
struct AudioParameterInterface_SetIntParameter final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         inInt;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioParameterInterface_SetIntParameter) == 0x000004, "Wrong alignment on AudioParameterInterface_SetIntParameter");
static_assert(sizeof(AudioParameterInterface_SetIntParameter) == 0x00000C, "Wrong size on AudioParameterInterface_SetIntParameter");
static_assert(offsetof(AudioParameterInterface_SetIntParameter, InName) == 0x000000, "Member 'AudioParameterInterface_SetIntParameter::InName' has a wrong offset!");
static_assert(offsetof(AudioParameterInterface_SetIntParameter, inInt) == 0x000008, "Member 'AudioParameterInterface_SetIntParameter::inInt' has a wrong offset!");

// Function AudioExtensions.AudioParameterInterface.SetObjectArrayParameter
// 0x0018 (0x0018 - 0x0000)
struct AudioParameterInterface_SetObjectArrayParameter final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        InValue;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioParameterInterface_SetObjectArrayParameter) == 0x000008, "Wrong alignment on AudioParameterInterface_SetObjectArrayParameter");
static_assert(sizeof(AudioParameterInterface_SetObjectArrayParameter) == 0x000018, "Wrong size on AudioParameterInterface_SetObjectArrayParameter");
static_assert(offsetof(AudioParameterInterface_SetObjectArrayParameter, InName) == 0x000000, "Member 'AudioParameterInterface_SetObjectArrayParameter::InName' has a wrong offset!");
static_assert(offsetof(AudioParameterInterface_SetObjectArrayParameter, InValue) == 0x000008, "Member 'AudioParameterInterface_SetObjectArrayParameter::InValue' has a wrong offset!");

// Function AudioExtensions.AudioParameterInterface.SetObjectParameter
// 0x0010 (0x0010 - 0x0000)
struct AudioParameterInterface_SetObjectParameter final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InValue;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioParameterInterface_SetObjectParameter) == 0x000008, "Wrong alignment on AudioParameterInterface_SetObjectParameter");
static_assert(sizeof(AudioParameterInterface_SetObjectParameter) == 0x000010, "Wrong size on AudioParameterInterface_SetObjectParameter");
static_assert(offsetof(AudioParameterInterface_SetObjectParameter, InName) == 0x000000, "Member 'AudioParameterInterface_SetObjectParameter::InName' has a wrong offset!");
static_assert(offsetof(AudioParameterInterface_SetObjectParameter, InValue) == 0x000008, "Member 'AudioParameterInterface_SetObjectParameter::InValue' has a wrong offset!");

// Function AudioExtensions.AudioParameterInterface.SetStringArrayParameter
// 0x0018 (0x0018 - 0x0000)
struct AudioParameterInterface_SetStringArrayParameter final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         InValue;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioParameterInterface_SetStringArrayParameter) == 0x000008, "Wrong alignment on AudioParameterInterface_SetStringArrayParameter");
static_assert(sizeof(AudioParameterInterface_SetStringArrayParameter) == 0x000018, "Wrong size on AudioParameterInterface_SetStringArrayParameter");
static_assert(offsetof(AudioParameterInterface_SetStringArrayParameter, InName) == 0x000000, "Member 'AudioParameterInterface_SetStringArrayParameter::InName' has a wrong offset!");
static_assert(offsetof(AudioParameterInterface_SetStringArrayParameter, InValue) == 0x000008, "Member 'AudioParameterInterface_SetStringArrayParameter::InValue' has a wrong offset!");

// Function AudioExtensions.AudioParameterInterface.SetStringParameter
// 0x0018 (0x0018 - 0x0000)
struct AudioParameterInterface_SetStringParameter final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InValue;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioParameterInterface_SetStringParameter) == 0x000008, "Wrong alignment on AudioParameterInterface_SetStringParameter");
static_assert(sizeof(AudioParameterInterface_SetStringParameter) == 0x000018, "Wrong size on AudioParameterInterface_SetStringParameter");
static_assert(offsetof(AudioParameterInterface_SetStringParameter, InName) == 0x000000, "Member 'AudioParameterInterface_SetStringParameter::InName' has a wrong offset!");
static_assert(offsetof(AudioParameterInterface_SetStringParameter, InValue) == 0x000008, "Member 'AudioParameterInterface_SetStringParameter::InValue' has a wrong offset!");

// Function AudioExtensions.AudioParameterInterface.SetTriggerParameter
// 0x0008 (0x0008 - 0x0000)
struct AudioParameterInterface_SetTriggerParameter final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioParameterInterface_SetTriggerParameter) == 0x000004, "Wrong alignment on AudioParameterInterface_SetTriggerParameter");
static_assert(sizeof(AudioParameterInterface_SetTriggerParameter) == 0x000008, "Wrong size on AudioParameterInterface_SetTriggerParameter");
static_assert(offsetof(AudioParameterInterface_SetTriggerParameter, InName) == 0x000000, "Member 'AudioParameterInterface_SetTriggerParameter::InName' has a wrong offset!");

}

