#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioGameplayVolume

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AudioGameplayVolume.AudioGameplayVolumeComponentBase.SetPriority
// 0x0004 (0x0004 - 0x0000)
struct AudioGameplayVolumeComponentBase_SetPriority final
{
public:
	int32                                         InPriority;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioGameplayVolumeComponentBase_SetPriority) == 0x000004, "Wrong alignment on AudioGameplayVolumeComponentBase_SetPriority");
static_assert(sizeof(AudioGameplayVolumeComponentBase_SetPriority) == 0x000004, "Wrong size on AudioGameplayVolumeComponentBase_SetPriority");
static_assert(offsetof(AudioGameplayVolumeComponentBase_SetPriority, InPriority) == 0x000000, "Member 'AudioGameplayVolumeComponentBase_SetPriority::InPriority' has a wrong offset!");

// Function AudioGameplayVolume.AttenuationVolumeComponent.SetExteriorVolume
// 0x0008 (0x0008 - 0x0000)
struct AttenuationVolumeComponent_SetExteriorVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolateTime;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AttenuationVolumeComponent_SetExteriorVolume) == 0x000004, "Wrong alignment on AttenuationVolumeComponent_SetExteriorVolume");
static_assert(sizeof(AttenuationVolumeComponent_SetExteriorVolume) == 0x000008, "Wrong size on AttenuationVolumeComponent_SetExteriorVolume");
static_assert(offsetof(AttenuationVolumeComponent_SetExteriorVolume, Volume) == 0x000000, "Member 'AttenuationVolumeComponent_SetExteriorVolume::Volume' has a wrong offset!");
static_assert(offsetof(AttenuationVolumeComponent_SetExteriorVolume, InterpolateTime) == 0x000004, "Member 'AttenuationVolumeComponent_SetExteriorVolume::InterpolateTime' has a wrong offset!");

// Function AudioGameplayVolume.AttenuationVolumeComponent.SetInteriorVolume
// 0x0008 (0x0008 - 0x0000)
struct AttenuationVolumeComponent_SetInteriorVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolateTime;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AttenuationVolumeComponent_SetInteriorVolume) == 0x000004, "Wrong alignment on AttenuationVolumeComponent_SetInteriorVolume");
static_assert(sizeof(AttenuationVolumeComponent_SetInteriorVolume) == 0x000008, "Wrong size on AttenuationVolumeComponent_SetInteriorVolume");
static_assert(offsetof(AttenuationVolumeComponent_SetInteriorVolume, Volume) == 0x000000, "Member 'AttenuationVolumeComponent_SetInteriorVolume::Volume' has a wrong offset!");
static_assert(offsetof(AttenuationVolumeComponent_SetInteriorVolume, InterpolateTime) == 0x000004, "Member 'AttenuationVolumeComponent_SetInteriorVolume::InterpolateTime' has a wrong offset!");

// Function AudioGameplayVolume.AudioGameplayVolume.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct AudioGameplayVolume_SetEnabled final
{
public:
	bool                                          bNewEnabled;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioGameplayVolume_SetEnabled) == 0x000001, "Wrong alignment on AudioGameplayVolume_SetEnabled");
static_assert(sizeof(AudioGameplayVolume_SetEnabled) == 0x000001, "Wrong size on AudioGameplayVolume_SetEnabled");
static_assert(offsetof(AudioGameplayVolume_SetEnabled, bNewEnabled) == 0x000000, "Member 'AudioGameplayVolume_SetEnabled::bNewEnabled' has a wrong offset!");

// Function AudioGameplayVolume.FilterVolumeComponent.SetExteriorLPF
// 0x0008 (0x0008 - 0x0000)
struct FilterVolumeComponent_SetExteriorLPF final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolateTime;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FilterVolumeComponent_SetExteriorLPF) == 0x000004, "Wrong alignment on FilterVolumeComponent_SetExteriorLPF");
static_assert(sizeof(FilterVolumeComponent_SetExteriorLPF) == 0x000008, "Wrong size on FilterVolumeComponent_SetExteriorLPF");
static_assert(offsetof(FilterVolumeComponent_SetExteriorLPF, Volume) == 0x000000, "Member 'FilterVolumeComponent_SetExteriorLPF::Volume' has a wrong offset!");
static_assert(offsetof(FilterVolumeComponent_SetExteriorLPF, InterpolateTime) == 0x000004, "Member 'FilterVolumeComponent_SetExteriorLPF::InterpolateTime' has a wrong offset!");

// Function AudioGameplayVolume.FilterVolumeComponent.SetInteriorLPF
// 0x0008 (0x0008 - 0x0000)
struct FilterVolumeComponent_SetInteriorLPF final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolateTime;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FilterVolumeComponent_SetInteriorLPF) == 0x000004, "Wrong alignment on FilterVolumeComponent_SetInteriorLPF");
static_assert(sizeof(FilterVolumeComponent_SetInteriorLPF) == 0x000008, "Wrong size on FilterVolumeComponent_SetInteriorLPF");
static_assert(offsetof(FilterVolumeComponent_SetInteriorLPF, Volume) == 0x000000, "Member 'FilterVolumeComponent_SetInteriorLPF::Volume' has a wrong offset!");
static_assert(offsetof(FilterVolumeComponent_SetInteriorLPF, InterpolateTime) == 0x000004, "Member 'FilterVolumeComponent_SetInteriorLPF::InterpolateTime' has a wrong offset!");

// Function AudioGameplayVolume.SubmixSendVolumeComponent.SetSubmixSendSettings
// 0x0010 (0x0010 - 0x0000)
struct SubmixSendVolumeComponent_SetSubmixSendSettings final
{
public:
	TArray<struct FAudioVolumeSubmixSendSettings> NewSubmixSendSettings;                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubmixSendVolumeComponent_SetSubmixSendSettings) == 0x000008, "Wrong alignment on SubmixSendVolumeComponent_SetSubmixSendSettings");
static_assert(sizeof(SubmixSendVolumeComponent_SetSubmixSendSettings) == 0x000010, "Wrong size on SubmixSendVolumeComponent_SetSubmixSendSettings");
static_assert(offsetof(SubmixSendVolumeComponent_SetSubmixSendSettings, NewSubmixSendSettings) == 0x000000, "Member 'SubmixSendVolumeComponent_SetSubmixSendSettings::NewSubmixSendSettings' has a wrong offset!");

}

