#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_AnimBP_HightowerRadish

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct B_AnimBP_HightowerRadish.B_AnimBP_HightowerRadish_C.AnimBlueprintGeneratedConstantData
// 0x03AF (0x03B0 - 0x0001)
struct B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_1145;                                 // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_1146;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1147;                                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1148;                                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1149;                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1150;                                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1151;                               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1152;                                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1153;                                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1154;                               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1155;                                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1156;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1157;                                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1158;                               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1159;                                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1160;                               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1161;                                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1162;                               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1163;                                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1164;                               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1165;                                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_1166;                               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1167;                                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1168;                               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1169;                                 // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1170;                               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1171;                                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 ArrayProperty_1172;                                // 0x00E0(0x0010)()
	float                                         FloatProperty_1173;                                // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1174;                                 // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1175;                                 // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_1176;                               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1177;                               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1178;                                 // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1179;                               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1180;                                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1181;                               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1182;                                 // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1183;                               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_1184;                               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ERefPoseType                                  ByteProperty_1185;                                 // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_1186;                               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             EnumProperty_1187;                                 // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ArrayProperty_1188;                                // 0x0168(0x0010)()
	class UBlendSpace*                            ObjectProperty_1189;                               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         FloatProperty_1190;                                // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1191;                                 // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_1192;                               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 ArrayProperty_1193;                                // 0x0198(0x0010)()
	class FName                                   NameProperty_1194;                                 // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1195;                                 // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1196;                               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1197;                                 // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_1198;                                // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_1199;                               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1200;                               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1201;                                 // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 ArrayProperty_1202;                                // 0x01E8(0x0010)()
	class UAnimSequenceBase*                      ObjectProperty_1203;                               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1204;                                 // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          ObjectProperty_1205;                               // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            ObjectProperty_1206;                               // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             EnumProperty_1207;                                 // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      EnumProperty_1208;                                 // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ArrayProperty_1209;                                // 0x0220(0x0010)()
	class UAnimSequenceBase*                      ObjectProperty_1210;                               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1211;                               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1212;                                 // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1213;                               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1214;                                 // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1215;                               // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1216;                                 // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1217;                               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1218;                                 // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_1219;                                // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_1220;                               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               EnumProperty_1221;                                 // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_1222;                                 // 0x028C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_1223;                                 // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputScaleBiasClampConstants          StructProperty_1224;                               // 0x0298(0x002C)(NoDestructor)
	float                                         FloatProperty_1225;                                // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1226;                               // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BoolProperty_1227;                                 // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               EnumProperty_1228;                                 // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                ByteProperty_1229;                                 // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D3[0x1];                                      // 0x02D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_1230;                                 // 0x02D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1231;                                 // 0x02DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1232;                                 // 0x02E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1233;                                 // 0x02EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   StructProperty_1234;                               // 0x02F8(0x0020)(NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0318(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0398(0x0018)()
};
static_assert(alignof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData) == 0x0003B0, "Wrong size on B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1145) == 0x000004, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1145' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1146) == 0x000010, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1146' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1147) == 0x000018, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1147' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1148) == 0x000020, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1148' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1149) == 0x000028, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1149' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1150) == 0x000030, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1150' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1151) == 0x000038, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1151' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1152) == 0x000040, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1152' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1153) == 0x000048, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1153' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1154) == 0x000050, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1154' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1155) == 0x000058, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1155' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1156) == 0x000060, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1156' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1157) == 0x000068, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1157' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1158) == 0x000070, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1158' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1159) == 0x000078, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1159' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1160) == 0x000080, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1160' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1161) == 0x000088, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1161' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1162) == 0x000090, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1162' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1163) == 0x000098, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1163' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1164) == 0x0000A0, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1164' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1165) == 0x0000A8, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1165' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1166) == 0x0000B0, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1166' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1167) == 0x0000B8, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1167' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1168) == 0x0000C0, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1168' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1169) == 0x0000C8, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1169' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1170) == 0x0000D0, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1170' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1171) == 0x0000D8, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1171' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ArrayProperty_1172) == 0x0000E0, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ArrayProperty_1172' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, FloatProperty_1173) == 0x0000F0, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::FloatProperty_1173' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1174) == 0x0000F4, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1174' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1175) == 0x0000FC, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1175' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1176) == 0x000108, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1176' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1177) == 0x000110, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1177' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1178) == 0x000118, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1178' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1179) == 0x000120, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1179' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1180) == 0x000128, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1180' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1181) == 0x000130, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1181' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1182) == 0x000138, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1182' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1183) == 0x000140, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1183' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1184) == 0x000148, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1184' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ByteProperty_1185) == 0x000150, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ByteProperty_1185' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1186) == 0x000158, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1186' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, EnumProperty_1187) == 0x000160, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::EnumProperty_1187' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ArrayProperty_1188) == 0x000168, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ArrayProperty_1188' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1189) == 0x000178, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1189' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, FloatProperty_1190) == 0x000180, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::FloatProperty_1190' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1191) == 0x000184, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1191' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1192) == 0x000190, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1192' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ArrayProperty_1193) == 0x000198, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ArrayProperty_1193' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1194) == 0x0001A8, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1194' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1195) == 0x0001B0, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1195' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1196) == 0x0001B8, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1196' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1197) == 0x0001C0, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1197' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, FloatProperty_1198) == 0x0001C8, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::FloatProperty_1198' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1199) == 0x0001D0, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1199' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1200) == 0x0001D8, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1200' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1201) == 0x0001E0, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1201' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ArrayProperty_1202) == 0x0001E8, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ArrayProperty_1202' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1203) == 0x0001F8, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1203' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1204) == 0x000200, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1204' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1205) == 0x000208, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1205' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1206) == 0x000210, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1206' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, EnumProperty_1207) == 0x000218, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::EnumProperty_1207' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, EnumProperty_1208) == 0x000219, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::EnumProperty_1208' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ArrayProperty_1209) == 0x000220, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ArrayProperty_1209' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1210) == 0x000230, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1210' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1211) == 0x000238, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1211' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1212) == 0x000240, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1212' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1213) == 0x000248, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1213' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1214) == 0x000250, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1214' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1215) == 0x000258, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1215' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1216) == 0x000260, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1216' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1217) == 0x000268, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1217' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1218) == 0x000270, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1218' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, FloatProperty_1219) == 0x000278, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::FloatProperty_1219' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1220) == 0x000280, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1220' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, EnumProperty_1221) == 0x000288, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::EnumProperty_1221' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1222) == 0x00028C, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1222' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, BoolProperty_1223) == 0x000294, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::BoolProperty_1223' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, StructProperty_1224) == 0x000298, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::StructProperty_1224' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, FloatProperty_1225) == 0x0002C4, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::FloatProperty_1225' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ObjectProperty_1226) == 0x0002C8, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ObjectProperty_1226' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, BoolProperty_1227) == 0x0002D0, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::BoolProperty_1227' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, EnumProperty_1228) == 0x0002D1, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::EnumProperty_1228' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, ByteProperty_1229) == 0x0002D2, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::ByteProperty_1229' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1230) == 0x0002D4, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1230' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1231) == 0x0002DC, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1231' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1232) == 0x0002E4, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1232' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, NameProperty_1233) == 0x0002EC, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::NameProperty_1233' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, StructProperty_1234) == 0x0002F8, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::StructProperty_1234' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000318, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000398, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct B_AnimBP_HightowerRadish.B_AnimBP_HightowerRadish_C.AnimBlueprintGeneratedMutableData
// 0x0057 (0x0058 - 0x0001)
struct B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty;                                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_0;                                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_1;                                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_2;                                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_3;                                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_4;                                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_5;                                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_6;                                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_7;                                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IntProperty_8;                                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_9;                                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_10;                                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_11;                                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_12;                                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_13;                                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_14;                                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_15;                                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_16;                                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_17;                                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_18;                                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_19;                                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_20;                                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_21;                                   // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_22;                                   // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedMutableData) == 0x000058, "Wrong size on B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedMutableData, FloatProperty) == 0x000004, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedMutableData::FloatProperty' has a wrong offset!");
static_assert(offsetof(B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedMutableData, FloatProperty_0) == 0x000008, "Member 'B_AnimBP_HightowerRadish::FAnimBlueprintGeneratedMutableData::FloatProperty_0' has a wrong offset!");
