#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_Galileo_Lobster_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_Galileo_Lobster_Parent.B_Athena_Galileo_Lobster_Parent_C.CreateSkeletalAudioComp
// 0x0050 (0x0050 - 0x0000)
struct B_Athena_Galileo_Lobster_Parent_C_CreateSkeletalAudioComp final
{
public:
	class UFortSkeletalAudioComponent*            Component;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UFortSkeletalAudioComponent*            CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Galileo_Lobster_Parent_C_CreateSkeletalAudioComp) == 0x000010, "Wrong alignment on B_Athena_Galileo_Lobster_Parent_C_CreateSkeletalAudioComp");
static_assert(sizeof(B_Athena_Galileo_Lobster_Parent_C_CreateSkeletalAudioComp) == 0x000050, "Wrong size on B_Athena_Galileo_Lobster_Parent_C_CreateSkeletalAudioComp");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_CreateSkeletalAudioComp, Component) == 0x000000, "Member 'B_Athena_Galileo_Lobster_Parent_C_CreateSkeletalAudioComp::Component' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_CreateSkeletalAudioComp, Temp_struct_Variable) == 0x000010, "Member 'B_Athena_Galileo_Lobster_Parent_C_CreateSkeletalAudioComp::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_CreateSkeletalAudioComp, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'B_Athena_Galileo_Lobster_Parent_C_CreateSkeletalAudioComp::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function B_Athena_Galileo_Lobster_Parent.B_Athena_Galileo_Lobster_Parent_C.CurrentPoiseChanged
// 0x0004 (0x0004 - 0x0000)
struct B_Athena_Galileo_Lobster_Parent_C_CurrentPoiseChanged final
{
public:
	float                                         CurrentPoise_0;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Galileo_Lobster_Parent_C_CurrentPoiseChanged) == 0x000004, "Wrong alignment on B_Athena_Galileo_Lobster_Parent_C_CurrentPoiseChanged");
static_assert(sizeof(B_Athena_Galileo_Lobster_Parent_C_CurrentPoiseChanged) == 0x000004, "Wrong size on B_Athena_Galileo_Lobster_Parent_C_CurrentPoiseChanged");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_CurrentPoiseChanged, CurrentPoise_0) == 0x000000, "Member 'B_Athena_Galileo_Lobster_Parent_C_CurrentPoiseChanged::CurrentPoise_0' has a wrong offset!");

// Function B_Athena_Galileo_Lobster_Parent.B_Athena_Galileo_Lobster_Parent_C.DoBulletBlockEffect
// 0x000C (0x000C - 0x0000)
struct B_Athena_Galileo_Lobster_Parent_C_DoBulletBlockEffect final
{
public:
	struct FVector                                ImpactLocation;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Galileo_Lobster_Parent_C_DoBulletBlockEffect) == 0x000004, "Wrong alignment on B_Athena_Galileo_Lobster_Parent_C_DoBulletBlockEffect");
static_assert(sizeof(B_Athena_Galileo_Lobster_Parent_C_DoBulletBlockEffect) == 0x00000C, "Wrong size on B_Athena_Galileo_Lobster_Parent_C_DoBulletBlockEffect");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_DoBulletBlockEffect, ImpactLocation) == 0x000000, "Member 'B_Athena_Galileo_Lobster_Parent_C_DoBulletBlockEffect::ImpactLocation' has a wrong offset!");

// Function B_Athena_Galileo_Lobster_Parent.B_Athena_Galileo_Lobster_Parent_C.ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent
// 0x0350 (0x0350 - 0x0000)
struct B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_GetPrimaryParticleComponent_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_ImpactLocation;                 // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0050(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPhysicalSurface                              K2Node_Event_ImpactPhysicalSurface;                // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     K2Node_Event_SpawnedPSC;                           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Galileo_Lobster_Block_Collision_C*   K2Node_DynamicCast_AsB_Galileo_Lobster_Block_Collision; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_CanPlayIdleAudio;               // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01C4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F3[0x5];                                      // 0x01F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible_1;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetHudKeyActionVisibility_ReturnValue;    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_CurrentPoise;                   // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0238(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_2;           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSetForLocalControllerOnly;           // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_253[0x1];                                      // 0x0253(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0254(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0264(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0274(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_3;              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSkeletalAudioComponent*            CallFunc_CreateSkeletalAudioComp_Component;        // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_3;           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Hide;                           // 0x02CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x02D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICameraLensEffectInterface> CallFunc_SpawnGenericCameraLensEffect_ReturnValue; // 0x02F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0303(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0308(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0318(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_4;              // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_4;           // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x0338(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent) == 0x000008, "Wrong alignment on B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent");
static_assert(sizeof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent) == 0x000350, "Wrong size on B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, EntryPoint) == 0x000000, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_GetPrimaryParticleComponent_ReturnValue) == 0x000008, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_GetPrimaryParticleComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_CustomEvent_ImpactLocation) == 0x000014, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_CustomEvent_ImpactLocation' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00002C, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_MakeRotFromX_ReturnValue) == 0x000038, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_GetContext_ReturnValue) == 0x000048, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_Event_HitResult) == 0x000050, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_Event_ImpactPhysicalSurface) == 0x0000EC, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_Event_ImpactPhysicalSurface' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_Event_SpawnedPSC) == 0x0000F0, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_Event_SpawnedPSC' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_bBlockingHit) == 0x0000F8, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000F9, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_Time) == 0x0000FC, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_Distance) == 0x000100, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_Location) == 0x000104, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_ImpactPoint) == 0x000110, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_Normal) == 0x00011C, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_ImpactNormal) == 0x000128, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_PhysMat) == 0x000138, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_HitActor) == 0x000140, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_HitComponent) == 0x000148, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_HitBoneName) == 0x000150, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_BoneName) == 0x000158, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_HitItem) == 0x000160, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_ElementIndex) == 0x000164, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_FaceIndex) == 0x000168, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_TraceStart) == 0x00016C, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BreakHitResult_TraceEnd) == 0x000178, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_DynamicCast_AsB_Galileo_Lobster_Block_Collision) == 0x000188, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_DynamicCast_AsB_Galileo_Lobster_Block_Collision' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000198, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_DynamicCast_bSuccess_1) == 0x0001A0, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_Add_VectorVector_ReturnValue) == 0x0001A4, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0001B0, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x0001B8, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_CustomEvent_CanPlayIdleAudio) == 0x0001C0, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_CustomEvent_CanPlayIdleAudio' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x0001C4, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001D8, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_GetInstigator_ReturnValue) == 0x0001E0, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x0001E8, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_DynamicCast_bSuccess_2) == 0x0001F0, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_IsLocallyControlled_ReturnValue) == 0x0001F1, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BooleanAND_ReturnValue) == 0x0001F2, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_GetInstigator_ReturnValue_1) == 0x0001F8, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_GetContext_ReturnValue_1) == 0x000200, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000208, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_CustomEvent_Visible_1) == 0x000210, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_CustomEvent_Visible_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000218, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_SetHudKeyActionVisibility_ReturnValue) == 0x000220, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_SetHudKeyActionVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_CustomEvent_CurrentPoise) == 0x000224, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_CustomEvent_CurrentPoise' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000228, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_CustomEvent_Visible) == 0x00022C, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_CustomEvent_Visible' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_GetInstigator_ReturnValue_2) == 0x000230, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_GetInstigator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000238, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_DynamicCast_AsFort_Player_Pawn_2) == 0x000248, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_DynamicCast_AsFort_Player_Pawn_2' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_DynamicCast_bSuccess_3) == 0x000250, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_Event_bVisible) == 0x000251, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_Event_bSetForLocalControllerOnly) == 0x000252, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_Event_bSetForLocalControllerOnly' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000254, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000264, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_CreateDelegate_OutputDelegate_4) == 0x000274, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000284, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000290, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00029C, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x0002A8, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_GetInstigator_ReturnValue_3) == 0x0002B0, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_GetInstigator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_CreateSkeletalAudioComp_Component) == 0x0002B8, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_CreateSkeletalAudioComp_Component' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_DynamicCast_AsFort_Player_Pawn_3) == 0x0002C0, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_DynamicCast_AsFort_Player_Pawn_3' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_DynamicCast_bSuccess_4) == 0x0002C8, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0002C9, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_IsValid_ReturnValue_1) == 0x0002CA, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_CustomEvent_Hide) == 0x0002CB, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_CustomEvent_Hide' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x0002CC, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0002D0, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0002D8, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0002E8, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_SpawnGenericCameraLensEffect_ReturnValue) == 0x0002F0, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_SpawnGenericCameraLensEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_IsValid_ReturnValue_2) == 0x000300, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000301, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_Less_FloatFloat_ReturnValue) == 0x000302, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_BooleanAND_ReturnValue_1) == 0x000303, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_Lerp_ReturnValue) == 0x000304, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_CreateDelegate_OutputDelegate_5) == 0x000308, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000318, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_GetInstigator_ReturnValue_4) == 0x000320, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_GetInstigator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_DynamicCast_AsFort_Player_Pawn_4) == 0x000328, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_DynamicCast_AsFort_Player_Pawn_4' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, K2Node_DynamicCast_bSuccess_5) == 0x000330, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x000338, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x000348, "Member 'B_Athena_Galileo_Lobster_Parent_C_ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");

// Function B_Athena_Galileo_Lobster_Parent.B_Athena_Galileo_Lobster_Parent_C.Holstered
// 0x0038 (0x0038 - 0x0000)
struct B_Athena_Galileo_Lobster_Parent_C_Holstered final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Galileo_Lobster_Parent_C_Holstered) == 0x000008, "Wrong alignment on B_Athena_Galileo_Lobster_Parent_C_Holstered");
static_assert(sizeof(B_Athena_Galileo_Lobster_Parent_C_Holstered) == 0x000038, "Wrong size on B_Athena_Galileo_Lobster_Parent_C_Holstered");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_Holstered, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'B_Athena_Galileo_Lobster_Parent_C_Holstered::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_Holstered, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'B_Athena_Galileo_Lobster_Parent_C_Holstered::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_Holstered, CallFunc_GetInstigator_ReturnValue) == 0x000020, "Member 'B_Athena_Galileo_Lobster_Parent_C_Holstered::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_Holstered, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000028, "Member 'B_Athena_Galileo_Lobster_Parent_C_Holstered::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_Holstered, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'B_Athena_Galileo_Lobster_Parent_C_Holstered::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function B_Athena_Galileo_Lobster_Parent.B_Athena_Galileo_Lobster_Parent_C.OnPlayImpactFX
// 0x00A8 (0x00A8 - 0x0000)
struct B_Athena_Galileo_Lobster_Parent_C_OnPlayImpactFX final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x009C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPhysicalSurface                              ImpactPhysicalSurface;                             // 0x009C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     SpawnedPSC;                                        // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Galileo_Lobster_Parent_C_OnPlayImpactFX) == 0x000008, "Wrong alignment on B_Athena_Galileo_Lobster_Parent_C_OnPlayImpactFX");
static_assert(sizeof(B_Athena_Galileo_Lobster_Parent_C_OnPlayImpactFX) == 0x0000A8, "Wrong size on B_Athena_Galileo_Lobster_Parent_C_OnPlayImpactFX");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_OnPlayImpactFX, HitResult) == 0x000000, "Member 'B_Athena_Galileo_Lobster_Parent_C_OnPlayImpactFX::HitResult' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_OnPlayImpactFX, ImpactPhysicalSurface) == 0x00009C, "Member 'B_Athena_Galileo_Lobster_Parent_C_OnPlayImpactFX::ImpactPhysicalSurface' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_OnPlayImpactFX, SpawnedPSC) == 0x0000A0, "Member 'B_Athena_Galileo_Lobster_Parent_C_OnPlayImpactFX::SpawnedPSC' has a wrong offset!");

// Function B_Athena_Galileo_Lobster_Parent.B_Athena_Galileo_Lobster_Parent_C.OnRep_BladeVisibility
// 0x0004 (0x0004 - 0x0000)
struct B_Athena_Galileo_Lobster_Parent_C_OnRep_BladeVisibility final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAudioComponentPlayState                      CallFunc_GetPlayState_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Galileo_Lobster_Parent_C_OnRep_BladeVisibility) == 0x000001, "Wrong alignment on B_Athena_Galileo_Lobster_Parent_C_OnRep_BladeVisibility");
static_assert(sizeof(B_Athena_Galileo_Lobster_Parent_C_OnRep_BladeVisibility) == 0x000004, "Wrong size on B_Athena_Galileo_Lobster_Parent_C_OnRep_BladeVisibility");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_OnRep_BladeVisibility, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'B_Athena_Galileo_Lobster_Parent_C_OnRep_BladeVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_OnRep_BladeVisibility, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'B_Athena_Galileo_Lobster_Parent_C_OnRep_BladeVisibility::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_OnRep_BladeVisibility, CallFunc_GetPlayState_ReturnValue) == 0x000002, "Member 'B_Athena_Galileo_Lobster_Parent_C_OnRep_BladeVisibility::CallFunc_GetPlayState_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Galileo_Lobster_Parent_C_OnRep_BladeVisibility, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000003, "Member 'B_Athena_Galileo_Lobster_Parent_C_OnRep_BladeVisibility::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function B_Athena_Galileo_Lobster_Parent.B_Athena_Galileo_Lobster_Parent_C.OnWeaponVisibilityChanged
// 0x0002 (0x0002 - 0x0000)
struct B_Athena_Galileo_Lobster_Parent_C_OnWeaponVisibilityChanged final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSetForLocalControllerOnly;                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
