#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_AthenaMapMarkerBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_AthenaMapMarkerBase.B_AthenaMapMarkerBase_C
// 0x0178 (0x05C8 - 0x0450)
class AB_AthenaMapMarkerBase_C : public AFortPlayerMarkerBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   PingMarkerProto;                                   // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Target;                                         // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OnProtoMarkerPlaced_RampPow_83EEC58A4783B077FB03728C433B4B7E; // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnProtoMarkerPlaced_Pinch_83EEC58A4783B077FB03728C433B4B7E; // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnProtoMarkerPlaced_Glow_83EEC58A4783B077FB03728C433B4B7E; // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OnProtoMarkerPlaced__Direction_83EEC58A4783B077FB03728C433B4B7E; // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_475[0x3];                                      // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OnProtoMarkerPlaced;                               // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseProtoMarker;                                   // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MIDProtoMarker;                                    // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortWorldMarkerData                   MarkerData;                                        // 0x0490(0x0138)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_AthenaMapMarkerBase(int32 EntryPoint);
	void OnMarkerColorChanged(const struct FLinearColor& InColor);
	void OnMarkerPlaced();
	void OnProtoMarkerPlaced__FinishedFunc();
	void OnProtoMarkerPlaced__UpdateFunc();
	void OnSetupMarker(const struct FFortWorldMarkerData& MarkerData_0);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_AthenaMapMarkerBase_C">();
	}
	static class AB_AthenaMapMarkerBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_AthenaMapMarkerBase_C>();
	}
};
static_assert(alignof(AB_AthenaMapMarkerBase_C) == 0x000008, "Wrong alignment on AB_AthenaMapMarkerBase_C");
static_assert(sizeof(AB_AthenaMapMarkerBase_C) == 0x0005C8, "Wrong size on AB_AthenaMapMarkerBase_C");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, UberGraphFrame) == 0x000450, "Member 'AB_AthenaMapMarkerBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, PingMarkerProto) == 0x000458, "Member 'AB_AthenaMapMarkerBase_C::PingMarkerProto' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, SM_Target) == 0x000460, "Member 'AB_AthenaMapMarkerBase_C::SM_Target' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, OnProtoMarkerPlaced_RampPow_83EEC58A4783B077FB03728C433B4B7E) == 0x000468, "Member 'AB_AthenaMapMarkerBase_C::OnProtoMarkerPlaced_RampPow_83EEC58A4783B077FB03728C433B4B7E' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, OnProtoMarkerPlaced_Pinch_83EEC58A4783B077FB03728C433B4B7E) == 0x00046C, "Member 'AB_AthenaMapMarkerBase_C::OnProtoMarkerPlaced_Pinch_83EEC58A4783B077FB03728C433B4B7E' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, OnProtoMarkerPlaced_Glow_83EEC58A4783B077FB03728C433B4B7E) == 0x000470, "Member 'AB_AthenaMapMarkerBase_C::OnProtoMarkerPlaced_Glow_83EEC58A4783B077FB03728C433B4B7E' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, OnProtoMarkerPlaced__Direction_83EEC58A4783B077FB03728C433B4B7E) == 0x000474, "Member 'AB_AthenaMapMarkerBase_C::OnProtoMarkerPlaced__Direction_83EEC58A4783B077FB03728C433B4B7E' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, OnProtoMarkerPlaced) == 0x000478, "Member 'AB_AthenaMapMarkerBase_C::OnProtoMarkerPlaced' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, bUseProtoMarker) == 0x000480, "Member 'AB_AthenaMapMarkerBase_C::bUseProtoMarker' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, MIDProtoMarker) == 0x000488, "Member 'AB_AthenaMapMarkerBase_C::MIDProtoMarker' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, MarkerData) == 0x000490, "Member 'AB_AthenaMapMarkerBase_C::MarkerData' has a wrong offset!");

}

