#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Galileo_Lobster_Block_Collision

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function B_Galileo_Lobster_Block_Collision.B_Galileo_Lobster_Block_Collision_C.BlockedLobsterImpulse
// 0x0188 (0x0188 - 0x0000)
struct B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse final
{
public:
	struct FHitResult                             HitInfo;                                           // 0x0000(0x009C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             Instigator_0;                                      // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse) == 0x000008, "Wrong alignment on B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse");
static_assert(sizeof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse) == 0x000188, "Wrong size on B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, HitInfo) == 0x000000, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::HitInfo' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, Instigator_0) == 0x0000A0, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::Instigator_0' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_bBlockingHit) == 0x0000A9, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000AA, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_Time) == 0x0000AC, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_Distance) == 0x0000B0, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_Location) == 0x0000B4, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_ImpactPoint) == 0x0000C0, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_Normal) == 0x0000CC, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_ImpactNormal) == 0x0000D8, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_PhysMat) == 0x0000E8, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_HitActor) == 0x0000F0, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_HitComponent) == 0x0000F8, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_HitBoneName) == 0x000100, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_BoneName) == 0x000108, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_HitItem) == 0x000110, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_ElementIndex) == 0x000114, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_FaceIndex) == 0x000118, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_TraceStart) == 0x00011C, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_BreakHitResult_TraceEnd) == 0x000128, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000134, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_Normal_ReturnValue) == 0x000140, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_GetValueAtLevel_ReturnValue) == 0x00014C, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000150, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_MakeVector_ReturnValue) == 0x000154, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000160, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00016C, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse, CallFunc_Add_VectorVector_ReturnValue) == 0x000178, "Member 'B_Galileo_Lobster_Block_Collision_C_BlockedLobsterImpulse::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function B_Galileo_Lobster_Block_Collision.B_Galileo_Lobster_Block_Collision_C.CustomEvent_0
// 0x0050 (0x0050 - 0x0000)
struct B_Galileo_Lobster_Block_Collision_C_CustomEvent_0 final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Galileo_Lobster_Block_Collision_C_CustomEvent_0) == 0x000008, "Wrong alignment on B_Galileo_Lobster_Block_Collision_C_CustomEvent_0");
static_assert(sizeof(B_Galileo_Lobster_Block_Collision_C_CustomEvent_0) == 0x000050, "Wrong size on B_Galileo_Lobster_Block_Collision_C_CustomEvent_0");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_CustomEvent_0, DamagedActor) == 0x000000, "Member 'B_Galileo_Lobster_Block_Collision_C_CustomEvent_0::DamagedActor' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_CustomEvent_0, Damage) == 0x000008, "Member 'B_Galileo_Lobster_Block_Collision_C_CustomEvent_0::Damage' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_CustomEvent_0, InstigatedBy) == 0x000010, "Member 'B_Galileo_Lobster_Block_Collision_C_CustomEvent_0::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_CustomEvent_0, DamageCauser) == 0x000018, "Member 'B_Galileo_Lobster_Block_Collision_C_CustomEvent_0::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_CustomEvent_0, HitLocation) == 0x000020, "Member 'B_Galileo_Lobster_Block_Collision_C_CustomEvent_0::HitLocation' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_CustomEvent_0, FHitComponent) == 0x000030, "Member 'B_Galileo_Lobster_Block_Collision_C_CustomEvent_0::FHitComponent' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_CustomEvent_0, BoneName) == 0x000038, "Member 'B_Galileo_Lobster_Block_Collision_C_CustomEvent_0::BoneName' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_CustomEvent_0, Momentum) == 0x000040, "Member 'B_Galileo_Lobster_Block_Collision_C_CustomEvent_0::Momentum' has a wrong offset!");

// Function B_Galileo_Lobster_Block_Collision.B_Galileo_Lobster_Block_Collision_C.ExecuteBlockGameplayCue
// 0x0240 (0x0240 - 0x0000)
struct B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector                                ImpactColor;                                       // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Instigator_0;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0040(0x009C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          WasGalileoBun;                                     // 0x00DC(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            K2Node_DynamicCast_AsFort_Weapon;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetWeaponDataGameplayTags_GameplayTags;   // 0x0120(0x0020)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x014C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0158(0x00C0)(ContainsInstancedReference)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0218(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue) == 0x000008, "Wrong alignment on B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue");
static_assert(sizeof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue) == 0x000240, "Wrong size on B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, Damage) == 0x000000, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::Damage' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, DamageCauser) == 0x000008, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, EffectContext) == 0x000010, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::EffectContext' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, ImpactColor) == 0x000028, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::ImpactColor' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, Instigator_0) == 0x000038, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::Instigator_0' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, HitResult) == 0x000040, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::HitResult' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, WasGalileoBun) == 0x0000DC, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::WasGalileoBun' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, K2Node_CreateDelegate_OutputDelegate) == 0x0000E0, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, CallFunc_GetOwner_ReturnValue) == 0x0000F0, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000F8, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, K2Node_DynamicCast_AsCharacter) == 0x000100, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, K2Node_DynamicCast_AsFort_Weapon) == 0x000110, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::K2Node_DynamicCast_AsFort_Weapon' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, CallFunc_GetWeaponDataGameplayTags_GameplayTags) == 0x000120, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::CallFunc_GetWeaponDataGameplayTags_GameplayTags' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000140, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, CallFunc_GetTeamAffiliation_ReturnValue) == 0x000148, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, K2Node_SwitchEnum_CmpSuccess) == 0x000149, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00014C, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000158, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000218, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue, CallFunc_HasAnyTags_ReturnValue) == 0x000238, "Member 'B_Galileo_Lobster_Block_Collision_C_ExecuteBlockGameplayCue::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");

// Function B_Galileo_Lobster_Block_Collision.B_Galileo_Lobster_Block_Collision_C.ExecuteUbergraph_B_Galileo_Lobster_Block_Collision
// 0x0960 (0x0960 - 0x0000)
struct B_Galileo_Lobster_Block_Collision_C_ExecuteUbergraph_B_Galileo_Lobster_Block_Collision final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0018(0x00C0)(ConstParm, ContainsInstancedReference)
	float                                         K2Node_Event_Damage_1;                             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x00E0(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x010C(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy_1;                       // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x01B8(0x0018)()
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x01D8(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x01F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x01F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0200(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0220(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x028C(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32A[0x2];                                      // 0x032A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x039C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x03A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           K2Node_MakeStruct_GameplayEffectContextHandle;     // 0x03D0(0x0018)()
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x03F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x03FC(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0418(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0438(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0444(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x04F0(0x0018)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0510(0x00C0)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC[0x4];                                      // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0600(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0610(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0620(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_CustomEvent_PlayerPawn;                     // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_1; // 0x0638(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x0648(0x0008)(NoDestructor, HasGetValueTypeHash)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0651(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_652[0x2];                                      // 0x0652(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0654(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x065C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_671[0x3];                                      // 0x0671(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_HitInfo;                        // 0x0674(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_WasGalileoBun;                  // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_711[0x3];                                      // 0x0711(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0714(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0721(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_722[0x2];                                      // 0x0722(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x072C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0738(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0744(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0750(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75C[0x4];                                      // 0x075C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0770(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x078C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0794(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x07A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x07AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B9[0x3];                                      // 0x07B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x07BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C8[0x8];                                      // 0x07C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x07D0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Prj_Galileo_Lobster_Reflect_C*       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0810(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0821(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_822[0x2];                                      // 0x0822(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0824(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_831[0x3];                                      // 0x0831(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0834(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_839[0x3];                                      // 0x0839(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x083C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0840(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0844(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0848(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x084C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_851[0x7];                                      // 0x0851(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0858(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_MakeStruct_GameplayEffectContextHandle_1;   // 0x0860(0x0018)()
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_2; // 0x0878(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0880(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0888(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2; // 0x0890(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_899[0x7];                                      // 0x0899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_GetActiveEffectsWithAllTags_ReturnValue;  // 0x08A0(0x0010)(ReferenceParm)
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item;                           // 0x08B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActiveGameplayEffectRemainingDuration_ReturnValue; // 0x08BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAtLocation_ReturnValue; // 0x08C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x08C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x08CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x08D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x08D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x08D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D3[0x5];                                      // 0x08D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
