#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HeavyRainPost

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_HeavyRainPost.B_HeavyRainPost_C.ExecuteUbergraph_B_HeavyRainPost
// 0x0008 (0x0008 - 0x0000)
struct B_HeavyRainPost_C_ExecuteUbergraph_B_HeavyRainPost final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_HeavyRainPost_C_ExecuteUbergraph_B_HeavyRainPost) == 0x000004, "Wrong alignment on B_HeavyRainPost_C_ExecuteUbergraph_B_HeavyRainPost");
static_assert(sizeof(B_HeavyRainPost_C_ExecuteUbergraph_B_HeavyRainPost) == 0x000008, "Wrong size on B_HeavyRainPost_C_ExecuteUbergraph_B_HeavyRainPost");
static_assert(offsetof(B_HeavyRainPost_C_ExecuteUbergraph_B_HeavyRainPost, EntryPoint) == 0x000000, "Member 'B_HeavyRainPost_C_ExecuteUbergraph_B_HeavyRainPost::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_HeavyRainPost_C_ExecuteUbergraph_B_HeavyRainPost, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'B_HeavyRainPost_C_ExecuteUbergraph_B_HeavyRainPost::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function B_HeavyRainPost.B_HeavyRainPost_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct B_HeavyRainPost_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(B_HeavyRainPost_C_UserConstructionScript) == 0x000008, "Wrong alignment on B_HeavyRainPost_C_UserConstructionScript");
static_assert(sizeof(B_HeavyRainPost_C_UserConstructionScript) == 0x000018, "Wrong size on B_HeavyRainPost_C_UserConstructionScript");
static_assert(offsetof(B_HeavyRainPost_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'B_HeavyRainPost_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HeavyRainPost_C_UserConstructionScript, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000008, "Member 'B_HeavyRainPost_C_UserConstructionScript::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");

}

