#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Melee_Generic

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function B_Melee_Generic.B_Melee_Generic_C.ActivateSwingFX
// 0x0002 (0x0002 - 0x0000)
struct B_Melee_Generic_C_ActivateSwingFX final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Melee_Generic_C_ActivateSwingFX) == 0x000001, "Wrong alignment on B_Melee_Generic_C_ActivateSwingFX");
static_assert(sizeof(B_Melee_Generic_C_ActivateSwingFX) == 0x000002, "Wrong size on B_Melee_Generic_C_ActivateSwingFX");
static_assert(offsetof(B_Melee_Generic_C_ActivateSwingFX, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'B_Melee_Generic_C_ActivateSwingFX::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ActivateSwingFX, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'B_Melee_Generic_C_ActivateSwingFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function B_Melee_Generic.B_Melee_Generic_C.Bind Swing and Anim Trail Events
// 0x0118 (0x0118 - 0x0000)
struct B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UNiagaraSystem*                         CallFunc_GetAsset_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CallFunc_GetAsset_ReturnValue_1;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_GetAsset_ReturnValue_2;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CallFunc_GetAsset_ReturnValue_3;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bActive)>                 K2Node_CreateDelegate_OutputDelegate_9;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x00CC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bActive)>                 K2Node_CreateDelegate_OutputDelegate_11;           // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Generic_C*                  K2Node_DynamicCast_AsPlayer_Pawn_Generic;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events) == 0x000008, "Wrong alignment on B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events");
static_assert(sizeof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events) == 0x000118, "Wrong size on B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, K2Node_CreateDelegate_OutputDelegate_3) == 0x000030, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, CallFunc_GetAsset_ReturnValue) == 0x000040, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::CallFunc_GetAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, CallFunc_GetAsset_ReturnValue_1) == 0x000048, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::CallFunc_GetAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, K2Node_CreateDelegate_OutputDelegate_4) == 0x000054, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, K2Node_CreateDelegate_OutputDelegate_5) == 0x000064, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, K2Node_CreateDelegate_OutputDelegate_6) == 0x000074, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, K2Node_CreateDelegate_OutputDelegate_7) == 0x000084, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, CallFunc_GetAsset_ReturnValue_2) == 0x000098, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::CallFunc_GetAsset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, CallFunc_GetAsset_ReturnValue_3) == 0x0000A0, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::CallFunc_GetAsset_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, CallFunc_IsValid_ReturnValue_2) == 0x0000A8, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, CallFunc_IsValid_ReturnValue_3) == 0x0000A9, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000AC, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000BC, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, K2Node_CreateDelegate_OutputDelegate_10) == 0x0000CC, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, K2Node_CreateDelegate_OutputDelegate_11) == 0x0000DC, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000EC, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, CallFunc_GetInstigator_ReturnValue) == 0x0000F0, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, K2Node_DynamicCast_AsPlayer_Pawn_Generic) == 0x0000F8, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::K2Node_DynamicCast_AsPlayer_Pawn_Generic' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000108, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'B_Melee_Generic_C_Bind_Swing_and_Anim_Trail_Events::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function B_Melee_Generic.B_Melee_Generic_C.ExecuteUbergraph_B_Melee_Generic
// 0x0C70 (0x0C70 - 0x0000)
struct B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0018(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPhysicalSurface                              K2Node_Event_ImpactPhysicalSurface;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     K2Node_Event_SpawnedPSC;                           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF[0x1];                                       // 0x00CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentActiveMontage_ReturnValue;      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_First_Left;                           // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_First_Right;                          // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_3;              // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_2;       // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_3;      // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue_1;          // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue_2;                     // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue_1;       // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXY_ReturnValue;                // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortCosmeticModification              K2Node_Event_CosmeticMod;                          // 0x0320(0x0608)()
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAssetNull_ReturnValue;                  // 0x0929(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x092A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSetForLocalControllerOnly;           // 0x092B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x092C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92D[0x3];                                      // 0x092D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPI_ReturnValue;                        // 0x0934(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0938(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x093C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x093D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x093E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93F[0x1];                                      // 0x093F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponItemDefinition*              CallFunc_GetWeaponData_ReturnValue;                // 0x0940(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue;         // 0x0948(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetOrLoadSynchronously_ReturnValue;       // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0979(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97A[0x6];                                      // 0x097A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0980(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0988(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x0990(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0998(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0999(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x099A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x099B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99C[0x4];                                      // 0x099C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     K2Node_Select_Default;                             // 0x09A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x09A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x09A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9AA[0x6];                                      // 0x09AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     K2Node_Select_Default_1;                           // 0x09B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_2;                           // 0x09B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bActive;                        // 0x09C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C5[0x3];                                      // 0x09C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x09C8(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_A64[0x4];                                      // 0x0A64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_4;              // 0x0A68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Generic_Parent_C*           K2Node_DynamicCast_AsPlayer_Pawn_Generic_Parent;   // 0x0A70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0A78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A79[0x7];                                      // 0x0A79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0A80(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0AB0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0ABC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0AC8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD4[0xC];                                      // 0x0AD4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0AE0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0B10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0B14(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0B18(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0B1C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0B28(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0B34(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0B40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0B44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0B48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0B4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0B50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_3;          // 0x0B54(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0B60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_4;          // 0x0B64(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_3;       // 0x0B70(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_4;      // 0x0B78(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0B84(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x0B90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0B94(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0C30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0C34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0C38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0C3C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0C48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x0C4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0C50(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0C5C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0C68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue_1;            // 0x0C69(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0C6A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic) == 0x000010, "Wrong alignment on B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic");
static_assert(sizeof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic) == 0x000C70, "Wrong size on B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, EntryPoint) == 0x000000, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_Event_bPersistentFire) == 0x000014, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_Event_bSecondaryFire) == 0x000015, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_Event_HitResult) == 0x000018, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_Event_ImpactPhysicalSurface) == 0x0000B4, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_Event_ImpactPhysicalSurface' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_Event_SpawnedPSC) == 0x0000B8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_Event_SpawnedPSC' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_IsValid_ReturnValue_1) == 0x0000C1, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C2, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000C3, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000C4, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BooleanOR_ReturnValue) == 0x0000C5, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0000C6, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BooleanOR_ReturnValue_1) == 0x0000C7, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x0000C8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BooleanOR_ReturnValue_2) == 0x0000C9, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x0000CA, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x0000CB, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BooleanOR_ReturnValue_3) == 0x0000CC, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_bBlockingHit) == 0x0000CD, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000CE, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_Time) == 0x0000D0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_Distance) == 0x0000D4, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_Location) == 0x0000D8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_ImpactPoint) == 0x0000E4, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_Normal) == 0x0000F0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_ImpactNormal) == 0x0000FC, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_PhysMat) == 0x000108, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_HitActor) == 0x000110, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_HitComponent) == 0x000118, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_HitBoneName) == 0x000120, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_BoneName) == 0x000128, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_HitItem) == 0x000130, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_ElementIndex) == 0x000134, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_FaceIndex) == 0x000138, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_TraceStart) == 0x00013C, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_TraceEnd) == 0x000148, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetInstigator_ReturnValue) == 0x000158, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000160, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_DynamicCast_AsFort_Pawn) == 0x000170, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetAnimInstance_ReturnValue) == 0x000180, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetSocketRotation_ReturnValue) == 0x000188, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_IsValid_ReturnValue_2) == 0x000194, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000198, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Normal_ReturnValue) == 0x0001A4, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetCurrentActiveMontage_ReturnValue) == 0x0001B0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetCurrentActiveMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetSocketLocation_ReturnValue) == 0x0001B8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001C4, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0001D0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakVector_X) == 0x0001DC, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakVector_Y) == 0x0001E0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakVector_Z) == 0x0001E4, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_VSize_ReturnValue) == 0x0001E8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_MakeVector_ReturnValue) == 0x0001EC, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Normal_ReturnValue_1) == 0x0001F8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
