#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Galileo_Lobster_Reflect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Galileo_Lobster_Reflect.B_Prj_Galileo_Lobster_Reflect_C.ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect
// 0x0278 (0x0278 - 0x0000)
struct B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0008(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetMuzzleLocation_ReturnValue;            // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_1; // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x01C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x01CC(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect) == 0x000008, "Wrong alignment on B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect");
static_assert(sizeof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect) == 0x000278, "Wrong size on B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, EntryPoint) == 0x000000, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, Temp_bool_Variable) == 0x000004, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_IsMobilePlatform_ReturnValue) == 0x000005, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_IsDedicatedServer_ReturnValue) == 0x000006, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, K2Node_Event_Hit) == 0x000008, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A4, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_bBlockingHit) == 0x0000B0, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000B1, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_Time) == 0x0000B4, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_Distance) == 0x0000B8, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_Location) == 0x0000BC, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_ImpactPoint) == 0x0000C8, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_Normal) == 0x0000D4, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_ImpactNormal) == 0x0000E0, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_PhysMat) == 0x0000F0, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_HitActor) == 0x0000F8, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_HitComponent) == 0x000100, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_HitBoneName) == 0x000108, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_BoneName) == 0x000110, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_HitItem) == 0x000118, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_ElementIndex) == 0x00011C, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_FaceIndex) == 0x000120, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_TraceStart) == 0x000124, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BreakHitResult_TraceEnd) == 0x000130, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000140, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_IsValid_ReturnValue) == 0x000148, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, K2Node_DynamicCast_AsFort_Pawn) == 0x000150, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BooleanOR_ReturnValue) == 0x000159, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, K2Node_Select_Default) == 0x000160, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000168, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000174, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000180, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000188, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, K2Node_DynamicCast_bSuccess_1) == 0x000190, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_GetMuzzleLocation_ReturnValue) == 0x000194, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_GetMuzzleLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x0001A0, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_GetVelocity_ReturnValue) == 0x0001A4, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_VSize_ReturnValue) == 0x0001B0, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_MapRangeClamped_ReturnValue) == 0x0001B4, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_GetFortAbilitySystemComponent_ReturnValue_1) == 0x0001B8, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_GetFortAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0001C0, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0001C8, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0001CC, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000268, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect, CallFunc_SetStaticMesh_ReturnValue) == 0x000270, "Member 'B_Prj_Galileo_Lobster_Reflect_C_ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function B_Prj_Galileo_Lobster_Reflect.B_Prj_Galileo_Lobster_Reflect_C.OnStop
// 0x009C (0x009C - 0x0000)
struct B_Prj_Galileo_Lobster_Reflect_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x009C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Galileo_Lobster_Reflect_C_OnStop) == 0x000004, "Wrong alignment on B_Prj_Galileo_Lobster_Reflect_C_OnStop");
static_assert(sizeof(B_Prj_Galileo_Lobster_Reflect_C_OnStop) == 0x00009C, "Wrong size on B_Prj_Galileo_Lobster_Reflect_C_OnStop");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_OnStop, Hit) == 0x000000, "Member 'B_Prj_Galileo_Lobster_Reflect_C_OnStop::Hit' has a wrong offset!");

// Function B_Prj_Galileo_Lobster_Reflect.B_Prj_Galileo_Lobster_Reflect_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct B_Prj_Galileo_Lobster_Reflect_C_UserConstructionScript final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Galileo_Lobster_Reflect_C_UserConstructionScript) == 0x000004, "Wrong alignment on B_Prj_Galileo_Lobster_Reflect_C_UserConstructionScript");
static_assert(sizeof(B_Prj_Galileo_Lobster_Reflect_C_UserConstructionScript) == 0x000004, "Wrong size on B_Prj_Galileo_Lobster_Reflect_C_UserConstructionScript");
static_assert(offsetof(B_Prj_Galileo_Lobster_Reflect_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue) == 0x000000, "Member 'B_Prj_Galileo_Lobster_Reflect_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");

}

