#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Ostrich_Rocket

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Ostrich_Rocket.B_Prj_Ostrich_Rocket_C
// 0x00C0 (0x0988 - 0x08C8)
class AB_Prj_Ostrich_Rocket_C final : public AFortProjectile_DrunkHoming
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               _RocketTrailPS;                                    // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_OstrichRocket;                                  // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Rocket_AudioComponent;                             // 0x08E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Ribbon_Trail_PSC;                                  // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Ribbon_Trail_PS;                                   // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Explosion_Generic_PS;                              // 0x08F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Explosion_Generic_PSC;                             // 0x0900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Rocket_Projectile_Explosion_Sound;                 // 0x0908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StopLocation;                                      // 0x0910(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91C[0x4];                                      // 0x091C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Explosion_Flesh_Damage_PS;                         // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               StopRotZ;                                          // 0x0928(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_934[0x4];                                      // 0x0934(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               Explosion_Flesh_Damage_PSC;                        // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Rocket_Projectile_Explosion_Water_Sound;           // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tick_Delta;                                        // 0x0948(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RocketSpinRate;                                    // 0x094C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Explosion_Impact_Offset;                           // 0x0950(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RocketSpin;                                        // 0x0954(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          TimerMaxReached_;                                  // 0x0960(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_961[0x3];                                      // 0x0961(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DecalLocation;                                     // 0x0964(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              SurfaceType;                                       // 0x0970(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_971[0x3];                                      // 0x0971(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           FeedbackCue;                                       // 0x0974(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97C[0x4];                                      // 0x097C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Explosion_Water;                                   // 0x0980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Ostrich_Rocket(int32 EntryPoint);
	void FuseTimerMax();
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void OnHomingPassedTarget();
	void OnStop(const struct FHitResult& Hit);
	void OnTouched(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FHitResult& HitResult, bool bIsOverlap);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Ostrich_Rocket_C">();
	}
	static class AB_Prj_Ostrich_Rocket_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Ostrich_Rocket_C>();
	}
};
static_assert(alignof(AB_Prj_Ostrich_Rocket_C) == 0x000008, "Wrong alignment on AB_Prj_Ostrich_Rocket_C");
static_assert(sizeof(AB_Prj_Ostrich_Rocket_C) == 0x000988, "Wrong size on AB_Prj_Ostrich_Rocket_C");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, UberGraphFrame) == 0x0008C8, "Member 'AB_Prj_Ostrich_Rocket_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, _RocketTrailPS) == 0x0008D0, "Member 'AB_Prj_Ostrich_Rocket_C::_RocketTrailPS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, SM_OstrichRocket) == 0x0008D8, "Member 'AB_Prj_Ostrich_Rocket_C::SM_OstrichRocket' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, Rocket_AudioComponent) == 0x0008E0, "Member 'AB_Prj_Ostrich_Rocket_C::Rocket_AudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, Ribbon_Trail_PSC) == 0x0008E8, "Member 'AB_Prj_Ostrich_Rocket_C::Ribbon_Trail_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, Ribbon_Trail_PS) == 0x0008F0, "Member 'AB_Prj_Ostrich_Rocket_C::Ribbon_Trail_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, Explosion_Generic_PS) == 0x0008F8, "Member 'AB_Prj_Ostrich_Rocket_C::Explosion_Generic_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, Explosion_Generic_PSC) == 0x000900, "Member 'AB_Prj_Ostrich_Rocket_C::Explosion_Generic_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, Rocket_Projectile_Explosion_Sound) == 0x000908, "Member 'AB_Prj_Ostrich_Rocket_C::Rocket_Projectile_Explosion_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, StopLocation) == 0x000910, "Member 'AB_Prj_Ostrich_Rocket_C::StopLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, Explosion_Flesh_Damage_PS) == 0x000920, "Member 'AB_Prj_Ostrich_Rocket_C::Explosion_Flesh_Damage_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, StopRotZ) == 0x000928, "Member 'AB_Prj_Ostrich_Rocket_C::StopRotZ' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, Explosion_Flesh_Damage_PSC) == 0x000938, "Member 'AB_Prj_Ostrich_Rocket_C::Explosion_Flesh_Damage_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, Rocket_Projectile_Explosion_Water_Sound) == 0x000940, "Member 'AB_Prj_Ostrich_Rocket_C::Rocket_Projectile_Explosion_Water_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, Tick_Delta) == 0x000948, "Member 'AB_Prj_Ostrich_Rocket_C::Tick_Delta' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, RocketSpinRate) == 0x00094C, "Member 'AB_Prj_Ostrich_Rocket_C::RocketSpinRate' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, Explosion_Impact_Offset) == 0x000950, "Member 'AB_Prj_Ostrich_Rocket_C::Explosion_Impact_Offset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, RocketSpin) == 0x000954, "Member 'AB_Prj_Ostrich_Rocket_C::RocketSpin' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, TimerMaxReached_) == 0x000960, "Member 'AB_Prj_Ostrich_Rocket_C::TimerMaxReached_' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, DecalLocation) == 0x000964, "Member 'AB_Prj_Ostrich_Rocket_C::DecalLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, SurfaceType) == 0x000970, "Member 'AB_Prj_Ostrich_Rocket_C::SurfaceType' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, FeedbackCue) == 0x000974, "Member 'AB_Prj_Ostrich_Rocket_C::FeedbackCue' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ostrich_Rocket_C, Explosion_Water) == 0x000980, "Member 'AB_Prj_Ostrich_Rocket_C::Explosion_Water' has a wrong offset!");

}

