#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacchusItemShopNavigationButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BacchusItemShopNavigationButton.BacchusItemShopNavigationButton_C.ExecuteUbergraph_BacchusItemShopNavigationButton
// 0x00C8 (0x00C8 - 0x0000)
struct BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable;                                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable_1;                              // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default_2;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_3;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_4;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            K2Node_Select_Default_5;                           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton) == 0x000008, "Wrong alignment on BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton");
static_assert(sizeof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton) == 0x0000C8, "Wrong size on BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, EntryPoint) == 0x000000, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, Temp_object_Variable) == 0x000010, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, Temp_object_Variable_1) == 0x000018, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, Temp_bool_Variable) == 0x000020, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, Temp_object_Variable_2) == 0x000028, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, Temp_object_Variable_3) == 0x000030, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, Temp_bool_Variable_1) == 0x000038, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, Temp_struct_Variable) == 0x00003C, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, Temp_struct_Variable_1) == 0x000044, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, Temp_bool_Variable_2) == 0x00004C, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, Temp_bool_Variable_3) == 0x00004D, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, Temp_struct_Variable_2) == 0x000050, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, Temp_struct_Variable_3) == 0x000058, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, Temp_bool_Variable_4) == 0x000060, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, Temp_byte_Variable) == 0x000061, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, Temp_byte_Variable_1) == 0x000062, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, K2Node_Event_IsDesignTime) == 0x000063, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, K2Node_Select_Default) == 0x000068, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, K2Node_Select_Default_1) == 0x000070, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, Temp_bool_Variable_5) == 0x000078, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, K2Node_Select_Default_2) == 0x000080, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, K2Node_Select_Default_3) == 0x000088, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000090, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, K2Node_Select_Default_4) == 0x000098, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000A0, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x0000A8, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000B0, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, CallFunc_PlayAnimation_ReturnValue) == 0x0000B8, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton, K2Node_Select_Default_5) == 0x0000C0, "Member 'BacchusItemShopNavigationButton_C_ExecuteUbergraph_BacchusItemShopNavigationButton::K2Node_Select_Default_5' has a wrong offset!");

// Function BacchusItemShopNavigationButton.BacchusItemShopNavigationButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BacchusItemShopNavigationButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusItemShopNavigationButton_C_PreConstruct) == 0x000001, "Wrong alignment on BacchusItemShopNavigationButton_C_PreConstruct");
static_assert(sizeof(BacchusItemShopNavigationButton_C_PreConstruct) == 0x000001, "Wrong size on BacchusItemShopNavigationButton_C_PreConstruct");
static_assert(offsetof(BacchusItemShopNavigationButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BacchusItemShopNavigationButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

