#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacchusBoundActionButton

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BacchusBoundActionButton.BacchusBoundActionButton_C.ExecuteUbergraph_BacchusBoundActionButton
// 0x01A0 (0x01A0 - 0x0000)
struct BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUISubsystemLegacy*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_NoResourceBrush_ReturnValue;              // 0x0010(0x00B0)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCurrentGamepadName_ReturnValue;        // 0x00D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetInputActionButtonIcon_ReturnValue;     // 0x00E0(0x00B0)()
	bool                                          CallFunc_EqualEqual_SlateBrush_ReturnValue;        // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton) == 0x000010, "Wrong alignment on BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton");
static_assert(sizeof(BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton) == 0x0001A0, "Wrong size on BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton");
static_assert(offsetof(BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton, EntryPoint) == 0x000000, "Member 'BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton, CallFunc_NoResourceBrush_ReturnValue) == 0x000010, "Member 'BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton::CallFunc_NoResourceBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C4, "Member 'BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000C8, "Member 'BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton, CallFunc_GetCurrentGamepadName_ReturnValue) == 0x0000D0, "Member 'BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton::CallFunc_GetCurrentGamepadName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton, CallFunc_GetInputActionButtonIcon_ReturnValue) == 0x0000E0, "Member 'BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton::CallFunc_GetInputActionButtonIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton, CallFunc_EqualEqual_SlateBrush_ReturnValue) == 0x000190, "Member 'BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton::CallFunc_EqualEqual_SlateBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton, CallFunc_BooleanAND_ReturnValue) == 0x000191, "Member 'BacchusBoundActionButton_C_ExecuteUbergraph_BacchusBoundActionButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BacchusBoundActionButton.BacchusBoundActionButton_C.UpdateInputActionIconSize
// 0x0018 (0x0018 - 0x0000)
struct BacchusBoundActionButton_C_UpdateInputActionIconSize final
{
public:
	float                                         Temp_float_Variable;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusBoundActionButton_C_UpdateInputActionIconSize) == 0x000008, "Wrong alignment on BacchusBoundActionButton_C_UpdateInputActionIconSize");
static_assert(sizeof(BacchusBoundActionButton_C_UpdateInputActionIconSize) == 0x000018, "Wrong size on BacchusBoundActionButton_C_UpdateInputActionIconSize");
static_assert(offsetof(BacchusBoundActionButton_C_UpdateInputActionIconSize, Temp_float_Variable) == 0x000000, "Member 'BacchusBoundActionButton_C_UpdateInputActionIconSize::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BacchusBoundActionButton_C_UpdateInputActionIconSize, Temp_float_Variable_1) == 0x000004, "Member 'BacchusBoundActionButton_C_UpdateInputActionIconSize::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BacchusBoundActionButton_C_UpdateInputActionIconSize, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'BacchusBoundActionButton_C_UpdateInputActionIconSize::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusBoundActionButton_C_UpdateInputActionIconSize, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'BacchusBoundActionButton_C_UpdateInputActionIconSize::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusBoundActionButton_C_UpdateInputActionIconSize, Temp_bool_Variable) == 0x000011, "Member 'BacchusBoundActionButton_C_UpdateInputActionIconSize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BacchusBoundActionButton_C_UpdateInputActionIconSize, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'BacchusBoundActionButton_C_UpdateInputActionIconSize::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusBoundActionButton_C_UpdateInputActionIconSize, K2Node_Select_Default) == 0x000014, "Member 'BacchusBoundActionButton_C_UpdateInputActionIconSize::K2Node_Select_Default' has a wrong offset!");

}

