#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacchusItemShopRefreshTimerButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BacchusItemShopRefreshTimerButton.BacchusItemShopRefreshTimerButton_C
// 0x0020 (0x0FC0 - 0x0FA0)
class UBacchusItemShopRefreshTimerButton_C final : public UAthenaItemShopRefreshTimerButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0FA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_42;                                          // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_BacchusItemShopRefreshTimerButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BacchusItemShopRefreshTimerButton_C">();
	}
	static class UBacchusItemShopRefreshTimerButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusItemShopRefreshTimerButton_C>();
	}
};
static_assert(alignof(UBacchusItemShopRefreshTimerButton_C) == 0x000010, "Wrong alignment on UBacchusItemShopRefreshTimerButton_C");
static_assert(sizeof(UBacchusItemShopRefreshTimerButton_C) == 0x000FC0, "Wrong size on UBacchusItemShopRefreshTimerButton_C");
static_assert(offsetof(UBacchusItemShopRefreshTimerButton_C, UberGraphFrame) == 0x000FA0, "Member 'UBacchusItemShopRefreshTimerButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopRefreshTimerButton_C, Hover) == 0x000FA8, "Member 'UBacchusItemShopRefreshTimerButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopRefreshTimerButton_C, Image_42) == 0x000FB0, "Member 'UBacchusItemShopRefreshTimerButton_C::Image_42' has a wrong offset!");

}

