#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacchusItemShopCreatorButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BacchusItemShopCreatorButton.BacchusItemShopCreatorButton_C
// 0x0030 (0x0FC0 - 0x0F90)
class UBacchusItemShopCreatorButton_C final : public UFortTextButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0F98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x0FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Arrow;                                         // 0x0FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bFlipArrow;                                        // 0x0FB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsTop;                                            // 0x0FB1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_BacchusItemShopCreatorButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BacchusItemShopCreatorButton_C">();
	}
	static class UBacchusItemShopCreatorButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusItemShopCreatorButton_C>();
	}
};
static_assert(alignof(UBacchusItemShopCreatorButton_C) == 0x000010, "Wrong alignment on UBacchusItemShopCreatorButton_C");
static_assert(sizeof(UBacchusItemShopCreatorButton_C) == 0x000FC0, "Wrong size on UBacchusItemShopCreatorButton_C");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, UberGraphFrame) == 0x000F90, "Member 'UBacchusItemShopCreatorButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, Hover) == 0x000F98, "Member 'UBacchusItemShopCreatorButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, Backing) == 0x000FA0, "Member 'UBacchusItemShopCreatorButton_C::Backing' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, IMG_Arrow) == 0x000FA8, "Member 'UBacchusItemShopCreatorButton_C::IMG_Arrow' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, bFlipArrow) == 0x000FB0, "Member 'UBacchusItemShopCreatorButton_C::bFlipArrow' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, bIsTop) == 0x000FB1, "Member 'UBacchusItemShopCreatorButton_C::bIsTop' has a wrong offset!");

}

