#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacchusItemShopCreatorButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function BacchusItemShopCreatorButton.BacchusItemShopCreatorButton_C.ExecuteUbergraph_BacchusItemShopCreatorButton
// 0x0018 (0x0018 - 0x0000)
struct BacchusItemShopCreatorButton_C_ExecuteUbergraph_BacchusItemShopCreatorButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusItemShopCreatorButton_C_ExecuteUbergraph_BacchusItemShopCreatorButton) == 0x000008, "Wrong alignment on BacchusItemShopCreatorButton_C_ExecuteUbergraph_BacchusItemShopCreatorButton");
static_assert(sizeof(BacchusItemShopCreatorButton_C_ExecuteUbergraph_BacchusItemShopCreatorButton) == 0x000018, "Wrong size on BacchusItemShopCreatorButton_C_ExecuteUbergraph_BacchusItemShopCreatorButton");
static_assert(offsetof(BacchusItemShopCreatorButton_C_ExecuteUbergraph_BacchusItemShopCreatorButton, EntryPoint) == 0x000000, "Member 'BacchusItemShopCreatorButton_C_ExecuteUbergraph_BacchusItemShopCreatorButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BacchusItemShopCreatorButton_C_ExecuteUbergraph_BacchusItemShopCreatorButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BacchusItemShopCreatorButton_C_ExecuteUbergraph_BacchusItemShopCreatorButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusItemShopCreatorButton_C_ExecuteUbergraph_BacchusItemShopCreatorButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'BacchusItemShopCreatorButton_C_ExecuteUbergraph_BacchusItemShopCreatorButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

