#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacchusItemShopNavigationButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BacchusItemShopNavigationButton.BacchusItemShopNavigationButton_C
// 0x0050 (0x0F60 - 0x0F10)
class UBacchusItemShopNavigationButton_C final : public UAthenaItemShopNavigationButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutBacking;                                    // 0x0F18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Translate_Bottom;                                  // 0x0F20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Translate_Top;                                     // 0x0F28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InitialState;                                      // 0x0F30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderButton;                                      // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                GridBoundBorder;                                   // 0x0F48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Arrow;                                         // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bFlipArrow;                                        // 0x0F58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsTop;                                            // 0x0F59(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_BacchusItemShopNavigationButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BacchusItemShopNavigationButton_C">();
	}
	static class UBacchusItemShopNavigationButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusItemShopNavigationButton_C>();
	}
};
static_assert(alignof(UBacchusItemShopNavigationButton_C) == 0x000010, "Wrong alignment on UBacchusItemShopNavigationButton_C");
static_assert(sizeof(UBacchusItemShopNavigationButton_C) == 0x000F60, "Wrong size on UBacchusItemShopNavigationButton_C");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, UberGraphFrame) == 0x000F10, "Member 'UBacchusItemShopNavigationButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, FadeOutBacking) == 0x000F18, "Member 'UBacchusItemShopNavigationButton_C::FadeOutBacking' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, Translate_Bottom) == 0x000F20, "Member 'UBacchusItemShopNavigationButton_C::Translate_Bottom' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, Translate_Top) == 0x000F28, "Member 'UBacchusItemShopNavigationButton_C::Translate_Top' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, InitialState) == 0x000F30, "Member 'UBacchusItemShopNavigationButton_C::InitialState' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, Backing) == 0x000F38, "Member 'UBacchusItemShopNavigationButton_C::Backing' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, BorderButton) == 0x000F40, "Member 'UBacchusItemShopNavigationButton_C::BorderButton' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, GridBoundBorder) == 0x000F48, "Member 'UBacchusItemShopNavigationButton_C::GridBoundBorder' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, IMG_Arrow) == 0x000F50, "Member 'UBacchusItemShopNavigationButton_C::IMG_Arrow' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, bFlipArrow) == 0x000F58, "Member 'UBacchusItemShopNavigationButton_C::bFlipArrow' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, bIsTop) == 0x000F59, "Member 'UBacchusItemShopNavigationButton_C::bIsTop' has a wrong offset!");

}

