#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacchusItemShopScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BacchusItemShopScreen.BacchusItemShopScreen_C
// 0x0040 (0x0668 - 0x0628)
class UBacchusItemShopScreen_C final : public UAthenaItemShopScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          NoOffersBox;                                       // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_2;                                        // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_3;                                        // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Sections;                                 // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Sections;                              // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BacchusItemShopScreen(int32 EntryPoint);
	void OnEstablishingSections();
	void OnSectionsEstablished(bool bEmpty);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BacchusItemShopScreen_C">();
	}
	static class UBacchusItemShopScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusItemShopScreen_C>();
	}
};
static_assert(alignof(UBacchusItemShopScreen_C) == 0x000008, "Wrong alignment on UBacchusItemShopScreen_C");
static_assert(sizeof(UBacchusItemShopScreen_C) == 0x000668, "Wrong size on UBacchusItemShopScreen_C");
static_assert(offsetof(UBacchusItemShopScreen_C, UberGraphFrame) == 0x000628, "Member 'UBacchusItemShopScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopScreen_C, NoOffersBox) == 0x000630, "Member 'UBacchusItemShopScreen_C::NoOffersBox' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopScreen_C, ProgressSpinner) == 0x000638, "Member 'UBacchusItemShopScreen_C::ProgressSpinner' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopScreen_C, SafeZone_0) == 0x000640, "Member 'UBacchusItemShopScreen_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopScreen_C, SafeZone_2) == 0x000648, "Member 'UBacchusItemShopScreen_C::SafeZone_2' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopScreen_C, SafeZone_3) == 0x000650, "Member 'UBacchusItemShopScreen_C::SafeZone_3' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopScreen_C, Switcher_Sections) == 0x000658, "Member 'UBacchusItemShopScreen_C::Switcher_Sections' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopScreen_C, VerticalBox_Sections) == 0x000660, "Member 'UBacchusItemShopScreen_C::VerticalBox_Sections' has a wrong offset!");

}

