#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassPurchaseDetailsScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassPurchaseDetailsScreen.BattlePassPurchaseDetailsScreen_C
// 0x0140 (0x0470 - 0x0330)
class UBattlePassPurchaseDetailsScreen_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnLogoIntro;                                       // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeToSubs_Smoother;                               // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeBacktoBP;                                      // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SetActivatedState;                                 // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowComicBubble_Landing;                           // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ReverseShowPurchaseConfirmation;                   // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnShowPurchaseConfirmation_Final;                  // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowComicBubble_Confirmation;                      // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowCallouts;                                      // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortLazyImage*                         BottomImage;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         CenterLeftImage;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         CenterRightImage;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         CenterTopLeftImage;                                // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         CenterTopRightImage;                               // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_163;                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Copy;                                              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDonut_ComicBubble_C*                   Donut_ComicBubble_Confirmation;                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDonut_ComicBubble_C*                   Donut_ComicBubble_Landing;                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_61;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow_1;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               LargeTriangles;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LargeTriangles_Left;                               // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LargeTriangles_Right;                              // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OrangeTri;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OrangeTri_1;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SmallTriangles;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SmallTriangles_Left;                               // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SmallTriangles_Right;                              // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TagsVB;                                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         TopLeftImage;                                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         TopRightImage;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowTri;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowTri_1;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BPTransitionAnim;                                  // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        IntroSound;                                        // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimateBackToNormalState();
	void BP_OnActivated();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_BattlePassPurchaseDetailsScreen(int32 EntryPoint);
	void HideFinalPurchaseConfirmation();
	void IntroAudio();
	void OnScreenIntro();
	void SetImageBrushMaterials();
	void ShowFinalPurchaseConfirmation();
	void TriggerSubsTransition();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassPurchaseDetailsScreen_C">();
	}
	static class UBattlePassPurchaseDetailsScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassPurchaseDetailsScreen_C>();
	}
};
static_assert(alignof(UBattlePassPurchaseDetailsScreen_C) == 0x000008, "Wrong alignment on UBattlePassPurchaseDetailsScreen_C");
static_assert(sizeof(UBattlePassPurchaseDetailsScreen_C) == 0x000470, "Wrong size on UBattlePassPurchaseDetailsScreen_C");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, UberGraphFrame) == 0x000330, "Member 'UBattlePassPurchaseDetailsScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, OnLogoIntro) == 0x000338, "Member 'UBattlePassPurchaseDetailsScreen_C::OnLogoIntro' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, FadeToSubs_Smoother) == 0x000340, "Member 'UBattlePassPurchaseDetailsScreen_C::FadeToSubs_Smoother' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, FadeBacktoBP) == 0x000348, "Member 'UBattlePassPurchaseDetailsScreen_C::FadeBacktoBP' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, SetActivatedState) == 0x000350, "Member 'UBattlePassPurchaseDetailsScreen_C::SetActivatedState' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, ShowComicBubble_Landing) == 0x000358, "Member 'UBattlePassPurchaseDetailsScreen_C::ShowComicBubble_Landing' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, ReverseShowPurchaseConfirmation) == 0x000360, "Member 'UBattlePassPurchaseDetailsScreen_C::ReverseShowPurchaseConfirmation' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, OnShowPurchaseConfirmation_Final) == 0x000368, "Member 'UBattlePassPurchaseDetailsScreen_C::OnShowPurchaseConfirmation_Final' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, ShowComicBubble_Confirmation) == 0x000370, "Member 'UBattlePassPurchaseDetailsScreen_C::ShowComicBubble_Confirmation' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, ShowCallouts) == 0x000378, "Member 'UBattlePassPurchaseDetailsScreen_C::ShowCallouts' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, BottomImage) == 0x000380, "Member 'UBattlePassPurchaseDetailsScreen_C::BottomImage' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, CenterLeftImage) == 0x000388, "Member 'UBattlePassPurchaseDetailsScreen_C::CenterLeftImage' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, CenterRightImage) == 0x000390, "Member 'UBattlePassPurchaseDetailsScreen_C::CenterRightImage' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, CenterTopLeftImage) == 0x000398, "Member 'UBattlePassPurchaseDetailsScreen_C::CenterTopLeftImage' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, CenterTopRightImage) == 0x0003A0, "Member 'UBattlePassPurchaseDetailsScreen_C::CenterTopRightImage' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, CommonRichTextBlock_163) == 0x0003A8, "Member 'UBattlePassPurchaseDetailsScreen_C::CommonRichTextBlock_163' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, Copy) == 0x0003B0, "Member 'UBattlePassPurchaseDetailsScreen_C::Copy' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, Donut_ComicBubble_Confirmation) == 0x0003B8, "Member 'UBattlePassPurchaseDetailsScreen_C::Donut_ComicBubble_Confirmation' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, Donut_ComicBubble_Landing) == 0x0003C0, "Member 'UBattlePassPurchaseDetailsScreen_C::Donut_ComicBubble_Landing' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, Glow) == 0x0003C8, "Member 'UBattlePassPurchaseDetailsScreen_C::Glow' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, Image_1) == 0x0003D0, "Member 'UBattlePassPurchaseDetailsScreen_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, Image_61) == 0x0003D8, "Member 'UBattlePassPurchaseDetailsScreen_C::Image_61' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, Image_Glow_1) == 0x0003E0, "Member 'UBattlePassPurchaseDetailsScreen_C::Image_Glow_1' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, LargeTriangles) == 0x0003E8, "Member 'UBattlePassPurchaseDetailsScreen_C::LargeTriangles' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, LargeTriangles_Left) == 0x0003F0, "Member 'UBattlePassPurchaseDetailsScreen_C::LargeTriangles_Left' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, LargeTriangles_Right) == 0x0003F8, "Member 'UBattlePassPurchaseDetailsScreen_C::LargeTriangles_Right' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, OrangeTri) == 0x000400, "Member 'UBattlePassPurchaseDetailsScreen_C::OrangeTri' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, OrangeTri_1) == 0x000408, "Member 'UBattlePassPurchaseDetailsScreen_C::OrangeTri_1' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, SafeZone_0) == 0x000410, "Member 'UBattlePassPurchaseDetailsScreen_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, Shadow) == 0x000418, "Member 'UBattlePassPurchaseDetailsScreen_C::Shadow' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, SmallTriangles) == 0x000420, "Member 'UBattlePassPurchaseDetailsScreen_C::SmallTriangles' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, SmallTriangles_Left) == 0x000428, "Member 'UBattlePassPurchaseDetailsScreen_C::SmallTriangles_Left' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, SmallTriangles_Right) == 0x000430, "Member 'UBattlePassPurchaseDetailsScreen_C::SmallTriangles_Right' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, TagsVB) == 0x000438, "Member 'UBattlePassPurchaseDetailsScreen_C::TagsVB' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, TopLeftImage) == 0x000440, "Member 'UBattlePassPurchaseDetailsScreen_C::TopLeftImage' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, TopRightImage) == 0x000448, "Member 'UBattlePassPurchaseDetailsScreen_C::TopRightImage' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, YellowTri) == 0x000450, "Member 'UBattlePassPurchaseDetailsScreen_C::YellowTri' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, YellowTri_1) == 0x000458, "Member 'UBattlePassPurchaseDetailsScreen_C::YellowTri_1' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, BPTransitionAnim) == 0x000460, "Member 'UBattlePassPurchaseDetailsScreen_C::BPTransitionAnim' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseDetailsScreen_C, IntroSound) == 0x000468, "Member 'UBattlePassPurchaseDetailsScreen_C::IntroSound' has a wrong offset!");

}

