#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassCrewPurchaseContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CrewUI_structs.hpp"
#include "CrewUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassCrewPurchaseContainer.BattlePassCrewPurchaseContainer_C
// 0x00B0 (0x0458 - 0x03A8)
class UBattlePassCrewPurchaseContainer_C final : public UBattlePassCrewPurchaseContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TransitionLeft;                                    // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TransitionRight;                                   // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCrewBenefitsAnim_C*                    CrewBenefitsAnim;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCrewPurchaseScreen_C*                  CrewPurchaseScreen;                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCrewSeasonLaunchScreen_C*              CrewSeasonLaunchScreen;                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BackgroundFill;                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Blackout;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Blackout_quickintro;                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BPEmblem;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_IntroBG;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Sparks;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Transition;                                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       LastPlayedAnimation;                               // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBattlePassPurchaseScreen_C*            As_Battle_Pass_Purchase_Screen;                    // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           MusicControllerHandle;                             // 0x0420(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              BattlePassMix;                                     // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattlepass_MusicController_Quartz_C*   MusicController_Quartz;                            // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        BattlepassSplashAudio;                             // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CrewSplashAudio;                                   // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionLeftAlpha;                               // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionRightAlpha;                              // 0x044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattlePassCrewContentState                   BPState;                                           // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BattlepassMusic();
	void BP_OnActivated();
	void BP_OnDeactivated();
	void CallMusicController();
	void Construct();
	void ExecuteUbergraph_BattlePassCrewPurchaseContainer(int32 EntryPoint);
	void OnContentStateUpdated(EBattlePassCrewContentState InState, bool bInScreenOpened);
	void OnLastPlayedAnimationFinished();
	void OnTransitionLeftEvaluated();
	void OnTransitionRightEvaluated();
	void OnTriggerIntroAnimation(bool bCanClaimRewards);
	void PlayBattlepassSplashAudio();
	void PlaySubscriptionSplashAudio();
	void ResetAnimations();
	void SequenceEvent__ENTRYPOINTBattlePassCrewPurchaseContainer_0();
	void SequenceEvent__ENTRYPOINTBattlePassCrewPurchaseContainer_1();
	void SequenceEvent__ENTRYPOINTBattlePassCrewPurchaseContainer_2();
	void SequenceEvent__ENTRYPOINTBattlePassCrewPurchaseContainer_3();
	void SequenceEvent_ToggleScreens(bool isLeft);
	void StopAllBattlePassMusic();
	void SubscriptionMusic();
	void TriggerSubTransitionIn(EBattlePassCrewContentState TransitionState);
	void TriggerSubTransitionOut(EBattlePassCrewContentState TransitionState);
	void UpSellMusic();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassCrewPurchaseContainer_C">();
	}
	static class UBattlePassCrewPurchaseContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassCrewPurchaseContainer_C>();
	}
};
static_assert(alignof(UBattlePassCrewPurchaseContainer_C) == 0x000008, "Wrong alignment on UBattlePassCrewPurchaseContainer_C");
static_assert(sizeof(UBattlePassCrewPurchaseContainer_C) == 0x000458, "Wrong size on UBattlePassCrewPurchaseContainer_C");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, UberGraphFrame) == 0x0003A8, "Member 'UBattlePassCrewPurchaseContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, TransitionLeft) == 0x0003B0, "Member 'UBattlePassCrewPurchaseContainer_C::TransitionLeft' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, TransitionRight) == 0x0003B8, "Member 'UBattlePassCrewPurchaseContainer_C::TransitionRight' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, CrewBenefitsAnim) == 0x0003C0, "Member 'UBattlePassCrewPurchaseContainer_C::CrewBenefitsAnim' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, CrewPurchaseScreen) == 0x0003C8, "Member 'UBattlePassCrewPurchaseContainer_C::CrewPurchaseScreen' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, CrewSeasonLaunchScreen) == 0x0003D0, "Member 'UBattlePassCrewPurchaseContainer_C::CrewSeasonLaunchScreen' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, Image_BackgroundFill) == 0x0003D8, "Member 'UBattlePassCrewPurchaseContainer_C::Image_BackgroundFill' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, Image_Blackout) == 0x0003E0, "Member 'UBattlePassCrewPurchaseContainer_C::Image_Blackout' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, Image_Blackout_quickintro) == 0x0003E8, "Member 'UBattlePassCrewPurchaseContainer_C::Image_Blackout_quickintro' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, Image_BPEmblem) == 0x0003F0, "Member 'UBattlePassCrewPurchaseContainer_C::Image_BPEmblem' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, Image_IntroBG) == 0x0003F8, "Member 'UBattlePassCrewPurchaseContainer_C::Image_IntroBG' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, Image_Sparks) == 0x000400, "Member 'UBattlePassCrewPurchaseContainer_C::Image_Sparks' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, Image_Transition) == 0x000408, "Member 'UBattlePassCrewPurchaseContainer_C::Image_Transition' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, LastPlayedAnimation) == 0x000410, "Member 'UBattlePassCrewPurchaseContainer_C::LastPlayedAnimation' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, As_Battle_Pass_Purchase_Screen) == 0x000418, "Member 'UBattlePassCrewPurchaseContainer_C::As_Battle_Pass_Purchase_Screen' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, MusicControllerHandle) == 0x000420, "Member 'UBattlePassCrewPurchaseContainer_C::MusicControllerHandle' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, BattlePassMix) == 0x000428, "Member 'UBattlePassCrewPurchaseContainer_C::BattlePassMix' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, MusicController_Quartz) == 0x000430, "Member 'UBattlePassCrewPurchaseContainer_C::MusicController_Quartz' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, BattlepassSplashAudio) == 0x000438, "Member 'UBattlePassCrewPurchaseContainer_C::BattlepassSplashAudio' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, CrewSplashAudio) == 0x000440, "Member 'UBattlePassCrewPurchaseContainer_C::CrewSplashAudio' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, TransitionLeftAlpha) == 0x000448, "Member 'UBattlePassCrewPurchaseContainer_C::TransitionLeftAlpha' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, TransitionRightAlpha) == 0x00044C, "Member 'UBattlePassCrewPurchaseContainer_C::TransitionRightAlpha' has a wrong offset!");
static_assert(offsetof(UBattlePassCrewPurchaseContainer_C, BPState) == 0x000450, "Member 'UBattlePassCrewPurchaseContainer_C::BPState' has a wrong offset!");

}

