#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassBase

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum BattlePassBase.EBattlePassLandingPageSpecialEntryType
// NumValues: 0x0005
enum class EBattlePassLandingPageSpecialEntryType : uint8
{
	None                                     = 0,
	Subscription                             = 1,
	CharacterCustomizer                      = 2,
	SpecialCharacter                         = 3,
	COUNT                                    = 4,
};

// Enum BattlePassBase.BattlePassTileAvailabilityStates
// NumValues: 0x0004
enum class EBattlePassTileAvailabilityStates : uint8
{
	Invalid                                  = 0,
	Available                                = 1,
	Owned                                    = 2,
	Locked                                   = 3,
};

// ScriptStruct BattlePassBase.BattlePassLandingPageEntryPreviewInfo
// 0x0040 (0x0040 - 0x0000)
struct FBattlePassLandingPageEntryPreviewInfo final
{
public:
	EBattlePassLandingPageSpecialEntryType        SpecialEntryType;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         SubscriptionItemTypesToDisplay;                    // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SpecialCharacterVariantChannelToModify;            // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SpecialCharacterActiveVariantTag;                  // 0x0020(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UFortItemDefinition>> PreviewItems;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                         TransitionTime;                                    // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBattlePassLandingPageEntryPreviewInfo) == 0x000008, "Wrong alignment on FBattlePassLandingPageEntryPreviewInfo");
static_assert(sizeof(FBattlePassLandingPageEntryPreviewInfo) == 0x000040, "Wrong size on FBattlePassLandingPageEntryPreviewInfo");
static_assert(offsetof(FBattlePassLandingPageEntryPreviewInfo, SpecialEntryType) == 0x000000, "Member 'FBattlePassLandingPageEntryPreviewInfo::SpecialEntryType' has a wrong offset!");
static_assert(offsetof(FBattlePassLandingPageEntryPreviewInfo, SubscriptionItemTypesToDisplay) == 0x000008, "Member 'FBattlePassLandingPageEntryPreviewInfo::SubscriptionItemTypesToDisplay' has a wrong offset!");
static_assert(offsetof(FBattlePassLandingPageEntryPreviewInfo, SpecialCharacterVariantChannelToModify) == 0x000018, "Member 'FBattlePassLandingPageEntryPreviewInfo::SpecialCharacterVariantChannelToModify' has a wrong offset!");
static_assert(offsetof(FBattlePassLandingPageEntryPreviewInfo, SpecialCharacterActiveVariantTag) == 0x000020, "Member 'FBattlePassLandingPageEntryPreviewInfo::SpecialCharacterActiveVariantTag' has a wrong offset!");
static_assert(offsetof(FBattlePassLandingPageEntryPreviewInfo, PreviewItems) == 0x000028, "Member 'FBattlePassLandingPageEntryPreviewInfo::PreviewItems' has a wrong offset!");
static_assert(offsetof(FBattlePassLandingPageEntryPreviewInfo, TransitionTime) == 0x000038, "Member 'FBattlePassLandingPageEntryPreviewInfo::TransitionTime' has a wrong offset!");

// ScriptStruct BattlePassBase.BattlePassEntrySelectedParams
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FBattlePassEntrySelectedParams final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBattlePassEntrySelectedParams) == 0x000008, "Wrong alignment on FBattlePassEntrySelectedParams");
static_assert(sizeof(FBattlePassEntrySelectedParams) == 0x000050, "Wrong size on FBattlePassEntrySelectedParams");

}

