#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassPurchaseConfirmationButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function BattlePassPurchaseConfirmationButton.BattlePassPurchaseConfirmationButton_C.ExecuteUbergraph_BattlePassPurchaseConfirmationButton
// 0x0040 (0x0040 - 0x0000)
struct BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton) == 0x000008, "Wrong alignment on BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton");
static_assert(sizeof(BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton) == 0x000040, "Wrong size on BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton");
static_assert(offsetof(BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton, EntryPoint) == 0x000000, "Member 'BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000018, "Member 'BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000020, "Member 'BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton, K2Node_Event_IsDesignTime) == 0x000028, "Member 'BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000030, "Member 'BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'BattlePassPurchaseConfirmationButton_C_ExecuteUbergraph_BattlePassPurchaseConfirmationButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function BattlePassPurchaseConfirmationButton.BattlePassPurchaseConfirmationButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BattlePassPurchaseConfirmationButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPurchaseConfirmationButton_C_PreConstruct) == 0x000001, "Wrong alignment on BattlePassPurchaseConfirmationButton_C_PreConstruct");
static_assert(sizeof(BattlePassPurchaseConfirmationButton_C_PreConstruct) == 0x000001, "Wrong size on BattlePassPurchaseConfirmationButton_C_PreConstruct");
static_assert(offsetof(BattlePassPurchaseConfirmationButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BattlePassPurchaseConfirmationButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

