#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassS19UI

#include "Basic.hpp"

#include "BattlePassBase_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class BattlePassS19UI.FortBattlePassTutorialTooltipS19
// 0x0010 (0x0280 - 0x0270)
class UFortBattlePassTutorialTooltipS19 : public UCommonUserWidget
{
public:
	class UCommonRichTextBlock*                   Text_Tooltip;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HideTooltip();
	void SetText(const class FText& Text);
	void ShowTooltip();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassTutorialTooltipS19">();
	}
	static class UFortBattlePassTutorialTooltipS19* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassTutorialTooltipS19>();
	}
};
static_assert(alignof(UFortBattlePassTutorialTooltipS19) == 0x000008, "Wrong alignment on UFortBattlePassTutorialTooltipS19");
static_assert(sizeof(UFortBattlePassTutorialTooltipS19) == 0x000280, "Wrong size on UFortBattlePassTutorialTooltipS19");
static_assert(offsetof(UFortBattlePassTutorialTooltipS19, Text_Tooltip) == 0x000270, "Member 'UFortBattlePassTutorialTooltipS19::Text_Tooltip' has a wrong offset!");

// Class BattlePassS19UI.BattlePassLandingPageS19
// 0x0050 (0x0488 - 0x0438)
class UBattlePassLandingPageS19 : public UBattlePassLandingPageBase
{
public:
	class UBattlePassLandingPageButton*           Button_Rewards;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattlePassLandingPageButton*           Button_CharacterCustomizer;                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattlePassLandingPageButton*           Button_BonusRewards;                               // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattlePassLandingPageButton*           Button_Quests;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattlePassLandingPageButton*           Button_BuyBattlePass;                              // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattlePassLandingPageButton*           Button_JoinSubscription;                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattlePassLandingPageButton*           Button_BuyResources;                               // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattlePassLandingPageButton*           Button_GiftBattlePass;                             // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_478[0x8];                                      // 0x0478(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSeasonItemData_BattleStar*       SeasonData_BattleStar;                             // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnBattlePassGiftingAllowed(const bool bGiftingAllowed);
	void OnBattlePassOwned();
	void OnBattlePassSubscriptionAllowed(const bool bSubscriptionAllowed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassLandingPageS19">();
	}
	static class UBattlePassLandingPageS19* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassLandingPageS19>();
	}
};
static_assert(alignof(UBattlePassLandingPageS19) == 0x000008, "Wrong alignment on UBattlePassLandingPageS19");
static_assert(sizeof(UBattlePassLandingPageS19) == 0x000488, "Wrong size on UBattlePassLandingPageS19");
static_assert(offsetof(UBattlePassLandingPageS19, Button_Rewards) == 0x000438, "Member 'UBattlePassLandingPageS19::Button_Rewards' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageS19, Button_CharacterCustomizer) == 0x000440, "Member 'UBattlePassLandingPageS19::Button_CharacterCustomizer' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageS19, Button_BonusRewards) == 0x000448, "Member 'UBattlePassLandingPageS19::Button_BonusRewards' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageS19, Button_Quests) == 0x000450, "Member 'UBattlePassLandingPageS19::Button_Quests' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageS19, Button_BuyBattlePass) == 0x000458, "Member 'UBattlePassLandingPageS19::Button_BuyBattlePass' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageS19, Button_JoinSubscription) == 0x000460, "Member 'UBattlePassLandingPageS19::Button_JoinSubscription' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageS19, Button_BuyResources) == 0x000468, "Member 'UBattlePassLandingPageS19::Button_BuyResources' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageS19, Button_GiftBattlePass) == 0x000470, "Member 'UBattlePassLandingPageS19::Button_GiftBattlePass' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageS19, SeasonData_BattleStar) == 0x000480, "Member 'UBattlePassLandingPageS19::SeasonData_BattleStar' has a wrong offset!");

// Class BattlePassS19UI.BattlePassRewardPageS19
// 0x0098 (0x04B0 - 0x0418)
class UBattlePassRewardPageS19 : public UBattlePassRewardPageBase
{
public:
	TSubclassOf<class UFortBattlePassRewardGrid>  RewardsGridClass;                                  // 0x0418(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortPageNavigator*                     PageNavigator;                                     // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTile*                    FocusedReward;                                     // 0x0428(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortBattlePassRewardGrid*>      GridPages;                                         // 0x0430(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_440[0x4];                                      // 0x0440(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	ERewardPageType                               RewardPageType;                                    // 0x0444(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_445[0x3];                                      // 0x0445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HoldTileTooltip_ClaimedRewardsToHide;              // 0x0448(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         HoldTileTooltip_RequiredBattleStarsToShow;         // 0x044C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ClaimToonAFishTooltip_ClaimCheckTemplateId;        // 0x0450(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBattlePassTutorialTooltipS19*      TutorialTooltip_SecondPageUnlock;                  // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTutorialTooltipS19*      TutorialTooltip_ClaimAllRewards;                   // 0x0468(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTutorialTooltipS19*      TutorialTooltip_HoldTile;                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTutorialTooltipS19*      TutorialTooltip_Fishtoon_ClaimToonAFish;           // 0x0478(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTutorialTooltipS19*      TutorialTooltip_Fishtoon_ExploreToCollectInk;      // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTutorialTooltipS19*      TutorialTooltip_Fishtoon_MustUnlockInkColor;       // 0x0488(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTutorialTooltipS19*      TutorialTooltip_Fishtoon_MustCompleteObjective;    // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSeasonItemData_BattleStar*       SeasonData_BattleStar;                             // 0x0498(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassBulkBuyInputData*            BulkBuyInputData;                                  // 0x04A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A8[0x8];                                      // 0x04A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInitForPageType(const ERewardPageType InRewardPageType);
	void OnInputMethodChanged(const ECommonInputType InputType);
	void OnPageChanged(const int32 PageNumber);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassRewardPageS19">();
	}
	static class UBattlePassRewardPageS19* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassRewardPageS19>();
	}
};
static_assert(alignof(UBattlePassRewardPageS19) == 0x000008, "Wrong alignment on UBattlePassRewardPageS19");
static_assert(sizeof(UBattlePassRewardPageS19) == 0x0004B0, "Wrong size on UBattlePassRewardPageS19");
static_assert(offsetof(UBattlePassRewardPageS19, RewardsGridClass) == 0x000418, "Member 'UBattlePassRewardPageS19::RewardsGridClass' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS19, PageNavigator) == 0x000420, "Member 'UBattlePassRewardPageS19::PageNavigator' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS19, FocusedReward) == 0x000428, "Member 'UBattlePassRewardPageS19::FocusedReward' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS19, GridPages) == 0x000430, "Member 'UBattlePassRewardPageS19::GridPages' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS19, RewardPageType) == 0x000444, "Member 'UBattlePassRewardPageS19::RewardPageType' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS19, HoldTileTooltip_ClaimedRewardsToHide) == 0x000448, "Member 'UBattlePassRewardPageS19::HoldTileTooltip_ClaimedRewardsToHide' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS19, HoldTileTooltip_RequiredBattleStarsToShow) == 0x00044C, "Member 'UBattlePassRewardPageS19::HoldTileTooltip_RequiredBattleStarsToShow' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS19, ClaimToonAFishTooltip_ClaimCheckTemplateId) == 0x000450, "Member 'UBattlePassRewardPageS19::ClaimToonAFishTooltip_ClaimCheckTemplateId' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS19, TutorialTooltip_SecondPageUnlock) == 0x000460, "Member 'UBattlePassRewardPageS19::TutorialTooltip_SecondPageUnlock' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS19, TutorialTooltip_ClaimAllRewards) == 0x000468, "Member 'UBattlePassRewardPageS19::TutorialTooltip_ClaimAllRewards' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS19, TutorialTooltip_HoldTile) == 0x000470, "Member 'UBattlePassRewardPageS19::TutorialTooltip_HoldTile' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS19, TutorialTooltip_Fishtoon_ClaimToonAFish) == 0x000478, "Member 'UBattlePassRewardPageS19::TutorialTooltip_Fishtoon_ClaimToonAFish' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS19, TutorialTooltip_Fishtoon_ExploreToCollectInk) == 0x000480, "Member 'UBattlePassRewardPageS19::TutorialTooltip_Fishtoon_ExploreToCollectInk' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS19, TutorialTooltip_Fishtoon_MustUnlockInkColor) == 0x000488, "Member 'UBattlePassRewardPageS19::TutorialTooltip_Fishtoon_MustUnlockInkColor' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS19, TutorialTooltip_Fishtoon_MustCompleteObjective) == 0x000490, "Member 'UBattlePassRewardPageS19::TutorialTooltip_Fishtoon_MustCompleteObjective' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS19, SeasonData_BattleStar) == 0x000498, "Member 'UBattlePassRewardPageS19::SeasonData_BattleStar' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS19, BulkBuyInputData) == 0x0004A0, "Member 'UBattlePassRewardPageS19::BulkBuyInputData' has a wrong offset!");

// Class BattlePassS19UI.BattlePassScreenS19
// 0x03A8 (0x0B18 - 0x0770)
class UBattlePassScreenS19 : public UBattlePassScreenBase
{
public:
	TSubclassOf<class UFortBattlePassPurchaseResourcesWidget> ResourcePurchaseScreenClass;                       // 0x0770(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_778[0x8];                                      // 0x0778(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    Button_Close;                                      // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_CloseMobile;                                // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_BulkBuyRewards;                             // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_ToggleViewDetails;                          // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ToggleViewDetails_Mobile;                   // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_ReplayTrailer;                              // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ReplayTrailer_Mobile;                       // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_ShowAbout;                                  // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ShowAbout_Mobile;                           // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_ShowAboutCustomization;                     // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ShowAboutCustomization_Mobile;              // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisibilitySwitcher*              MobileVisibilitySwitcher;                          // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBattlePassCurrencyPanel*           BattlePassCurrencyPanel;                           // 0x07E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaExclusiveRewardBanner*           AthenaExclusiveRewardBanner;                       // 0x07E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_Description;                                  // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_ItemName;                                     // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaRewardItemTypeRarityTag*         ItemRewardTag;                                     // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_SetDetails;                                   // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisibilitySwitcher*              Switcher_ContextualButtons;                        // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoldableButton*                    Button_BuyLevels;                                  // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoldableButton*                    Button_BuyBattlePass;                              // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoldableButton*                    Button_ClaimReward;                                // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_RequiresBP;                                    // 0x0830(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_PageLocked;                                    // 0x0838(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_BaseItem;                                      // 0x0840(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_Prerequisite;                                  // 0x0848(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_NotEnough_Currency;                            // 0x0850(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_Cost;                                          // 0x0858(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_Owned;                                         // 0x0860(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_Delayed;                                       // 0x0868(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_870[0x48];                                     // 0x0870(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSeasonItemData_BattleStar*       SeasonData_BattleStar;                             // 0x08B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaSeasonItemEntryBase*             CurrentSelectedEntry;                              // 0x08C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<EBattlePassView>                       SwitcherSubPageTypes;                              // 0x08C8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              SubPageSwitcher;                                   // 0x08D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8E0[0xC0];                                     // 0x08E0(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    SeasonalBaseCustomizationItem;                     // 0x09A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasSubscription;                                  // 0x09A8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9A9[0x3];                                      // 0x09A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BattleStarsTooltipHideLevel;                       // 0x09AC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9B0[0x8];                                      // 0x09B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortBattlePassTutorialTooltipS19*      TutorialTooltip_BattleStars;                       // 0x09B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTutorialTooltipS19*      TutorialTooltip_StylePoints;                       // 0x09C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9C8[0x150];                                    // 0x09C8(0x0150)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleClaimRewardComplete(const bool bSuccess, const TArray<class FString>& OfferTemplateIdList);
	void HandleSwitcherVisibilityShown();
	void OnBattlePassOwned();
	void OnInsufficientFunds(const EBattlePassCurrencyType CurrencyType);
	void OnItemDelayed(const struct FTimespan& Delay);
	void OnLevelChanged(const int32 Level);
	void OnSetClaimedRewardInfo(const int32 OwnedRewards, const int32 TotalRewards);
	void OnSetDynamicInput(const EBattlePassInputs InputType, const class UBattlePassInputData* InputData);
	void OnSetItemPrice(const int32 Cost, const EBattlePassCurrencyType CurrencyType);
	void OnSetPrerequisiteInfo(const class FText& Description, const int32 OwnedRewards, const int32 NeededRewards, const bool bShowPrerequisiteLock);
	void OnTransitionItemDetails(const bool bTransitionForward);
	void OverviewShowAnimationFinished();

	struct FTimespan GetQuestPageDelay() const;
	bool IsSeasonalCustomizationItemOwned() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassScreenS19">();
	}
	static class UBattlePassScreenS19* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassScreenS19>();
	}
};
static_assert(alignof(UBattlePassScreenS19) == 0x000008, "Wrong alignment on UBattlePassScreenS19");
static_assert(sizeof(UBattlePassScreenS19) == 0x000B18, "Wrong size on UBattlePassScreenS19");
static_assert(offsetof(UBattlePassScreenS19, ResourcePurchaseScreenClass) == 0x000770, "Member 'UBattlePassScreenS19::ResourcePurchaseScreenClass' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Button_Close) == 0x000780, "Member 'UBattlePassScreenS19::Button_Close' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Button_CloseMobile) == 0x000788, "Member 'UBattlePassScreenS19::Button_CloseMobile' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Button_BulkBuyRewards) == 0x000790, "Member 'UBattlePassScreenS19::Button_BulkBuyRewards' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Button_ToggleViewDetails) == 0x000798, "Member 'UBattlePassScreenS19::Button_ToggleViewDetails' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Button_ToggleViewDetails_Mobile) == 0x0007A0, "Member 'UBattlePassScreenS19::Button_ToggleViewDetails_Mobile' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Button_ReplayTrailer) == 0x0007A8, "Member 'UBattlePassScreenS19::Button_ReplayTrailer' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Button_ReplayTrailer_Mobile) == 0x0007B0, "Member 'UBattlePassScreenS19::Button_ReplayTrailer_Mobile' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Button_ShowAbout) == 0x0007B8, "Member 'UBattlePassScreenS19::Button_ShowAbout' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Button_ShowAbout_Mobile) == 0x0007C0, "Member 'UBattlePassScreenS19::Button_ShowAbout_Mobile' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Button_ShowAboutCustomization) == 0x0007C8, "Member 'UBattlePassScreenS19::Button_ShowAboutCustomization' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Button_ShowAboutCustomization_Mobile) == 0x0007D0, "Member 'UBattlePassScreenS19::Button_ShowAboutCustomization_Mobile' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, MobileVisibilitySwitcher) == 0x0007D8, "Member 'UBattlePassScreenS19::MobileVisibilitySwitcher' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, BattlePassCurrencyPanel) == 0x0007E0, "Member 'UBattlePassScreenS19::BattlePassCurrencyPanel' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, AthenaExclusiveRewardBanner) == 0x0007E8, "Member 'UBattlePassScreenS19::AthenaExclusiveRewardBanner' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Text_Description) == 0x0007F0, "Member 'UBattlePassScreenS19::Text_Description' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Text_ItemName) == 0x0007F8, "Member 'UBattlePassScreenS19::Text_ItemName' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, ItemRewardTag) == 0x000800, "Member 'UBattlePassScreenS19::ItemRewardTag' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Text_SetDetails) == 0x000808, "Member 'UBattlePassScreenS19::Text_SetDetails' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Switcher_ContextualButtons) == 0x000810, "Member 'UBattlePassScreenS19::Switcher_ContextualButtons' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Button_BuyLevels) == 0x000818, "Member 'UBattlePassScreenS19::Button_BuyLevels' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Button_BuyBattlePass) == 0x000820, "Member 'UBattlePassScreenS19::Button_BuyBattlePass' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Button_ClaimReward) == 0x000828, "Member 'UBattlePassScreenS19::Button_ClaimReward' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Tag_RequiresBP) == 0x000830, "Member 'UBattlePassScreenS19::Tag_RequiresBP' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Tag_PageLocked) == 0x000838, "Member 'UBattlePassScreenS19::Tag_PageLocked' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Tag_BaseItem) == 0x000840, "Member 'UBattlePassScreenS19::Tag_BaseItem' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Tag_Prerequisite) == 0x000848, "Member 'UBattlePassScreenS19::Tag_Prerequisite' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Tag_NotEnough_Currency) == 0x000850, "Member 'UBattlePassScreenS19::Tag_NotEnough_Currency' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Tag_Cost) == 0x000858, "Member 'UBattlePassScreenS19::Tag_Cost' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Tag_Owned) == 0x000860, "Member 'UBattlePassScreenS19::Tag_Owned' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, Tag_Delayed) == 0x000868, "Member 'UBattlePassScreenS19::Tag_Delayed' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, SeasonData_BattleStar) == 0x0008B8, "Member 'UBattlePassScreenS19::SeasonData_BattleStar' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, CurrentSelectedEntry) == 0x0008C0, "Member 'UBattlePassScreenS19::CurrentSelectedEntry' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, SwitcherSubPageTypes) == 0x0008C8, "Member 'UBattlePassScreenS19::SwitcherSubPageTypes' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, SubPageSwitcher) == 0x0008D8, "Member 'UBattlePassScreenS19::SubPageSwitcher' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, SeasonalBaseCustomizationItem) == 0x0009A0, "Member 'UBattlePassScreenS19::SeasonalBaseCustomizationItem' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, bHasSubscription) == 0x0009A8, "Member 'UBattlePassScreenS19::bHasSubscription' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, BattleStarsTooltipHideLevel) == 0x0009AC, "Member 'UBattlePassScreenS19::BattleStarsTooltipHideLevel' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, TutorialTooltip_BattleStars) == 0x0009B8, "Member 'UBattlePassScreenS19::TutorialTooltip_BattleStars' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS19, TutorialTooltip_StylePoints) == 0x0009C0, "Member 'UBattlePassScreenS19::TutorialTooltip_StylePoints' has a wrong offset!");

// Class BattlePassS19UI.FortBattlePassCustomSkinPageS19
// 0x0008 (0x04C0 - 0x04B8)
class UFortBattlePassCustomSkinPageS19 final : public UFortBattlePassCustomSkinPageBase
{
public:
	class UFortBattlePassTutorialTooltipS19*      TutorialTooltip_PurchaseStyle;                     // 0x04B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassCustomSkinPageS19">();
	}
	static class UFortBattlePassCustomSkinPageS19* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassCustomSkinPageS19>();
	}
};
static_assert(alignof(UFortBattlePassCustomSkinPageS19) == 0x000008, "Wrong alignment on UFortBattlePassCustomSkinPageS19");
static_assert(sizeof(UFortBattlePassCustomSkinPageS19) == 0x0004C0, "Wrong size on UFortBattlePassCustomSkinPageS19");
static_assert(offsetof(UFortBattlePassCustomSkinPageS19, TutorialTooltip_PurchaseStyle) == 0x0004B8, "Member 'UFortBattlePassCustomSkinPageS19::TutorialTooltip_PurchaseStyle' has a wrong offset!");

// Class BattlePassS19UI.FortBattlePassResourcesWidgetS19
// 0x0020 (0x02C8 - 0x02A8)
class UFortBattlePassResourcesWidgetS19 final : public UFortBattlePassResourcesWidgetBase
{
public:
	class UCommonTextBlock*                       Text_BattleStarsAmount;                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_StylePointsAmount;                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Border_StylePointsRewardsTag;                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Border_BattleStarsRewardsTag;                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnBattleStarRewardsSet(const int32 Rewards);
	void OnStylePointsRewardsSet(const int32 Rewards);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassResourcesWidgetS19">();
	}
	static class UFortBattlePassResourcesWidgetS19* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassResourcesWidgetS19>();
	}
};
static_assert(alignof(UFortBattlePassResourcesWidgetS19) == 0x000008, "Wrong alignment on UFortBattlePassResourcesWidgetS19");
static_assert(sizeof(UFortBattlePassResourcesWidgetS19) == 0x0002C8, "Wrong size on UFortBattlePassResourcesWidgetS19");
static_assert(offsetof(UFortBattlePassResourcesWidgetS19, Text_BattleStarsAmount) == 0x0002A8, "Member 'UFortBattlePassResourcesWidgetS19::Text_BattleStarsAmount' has a wrong offset!");
