#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassPurchaseScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CrewUI_structs.hpp"
#include "CrewUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassPurchaseScreen.BattlePassPurchaseScreen_C
// 0x00F0 (0x0560 - 0x0470)
class UBattlePassPurchaseScreen_C final : public UBattlePassPurchaseScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewTile;                                           // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PurchaseOptions;                                   // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TransitionOut;                                     // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TransitionIn;                                      // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_BottomButtons;                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ConfirmButtons;                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEpicCMSImage*                          Image_Background_TestBG;                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BackgroundBlur;                              // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BGDarken;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow;                                        // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MobileCloseVisibilityWrapper;                      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PurchaseOptions;                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PurchaseVisibilityWrapper;                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_TopRight;                                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ToCrewVisibilityWrapper;                           // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_PassDetails;                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_PurchaseOptions;                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ImageMID;                                          // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                DesignTimeAsset;                                   // 0x0510(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnPurchaseStateConfirm;                            // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPurchaseStatePurchase;                           // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             OldBackground;                                     // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void Construct();
	void EventScreenTransitionIn();
	void ExecuteUbergraph_BattlePassPurchaseScreen(int32 EntryPoint);
	void OnDownloadBackgroundComplete(class UTexture2D* NewBackground);
	void OnPurchaseConfirmed();
	void OnPurchaseStateChanged(EBattlePassPurchaseState InCurrentState);
	void OnSetScreenInteractable(bool bInteractable);
	void OnStartingDownloadBackground();
	void PreConstruct(bool IsDesignTime);
	void SetDesignTimeImages();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassPurchaseScreen_C">();
	}
	static class UBattlePassPurchaseScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassPurchaseScreen_C>();
	}
};
static_assert(alignof(UBattlePassPurchaseScreen_C) == 0x000008, "Wrong alignment on UBattlePassPurchaseScreen_C");
static_assert(sizeof(UBattlePassPurchaseScreen_C) == 0x000560, "Wrong size on UBattlePassPurchaseScreen_C");
static_assert(offsetof(UBattlePassPurchaseScreen_C, UberGraphFrame) == 0x000470, "Member 'UBattlePassPurchaseScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, NewTile) == 0x000478, "Member 'UBattlePassPurchaseScreen_C::NewTile' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, PurchaseOptions) == 0x000480, "Member 'UBattlePassPurchaseScreen_C::PurchaseOptions' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, TransitionOut) == 0x000488, "Member 'UBattlePassPurchaseScreen_C::TransitionOut' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, TransitionIn) == 0x000490, "Member 'UBattlePassPurchaseScreen_C::TransitionIn' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, HorizontalBox_BottomButtons) == 0x000498, "Member 'UBattlePassPurchaseScreen_C::HorizontalBox_BottomButtons' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, HorizontalBox_ConfirmButtons) == 0x0004A0, "Member 'UBattlePassPurchaseScreen_C::HorizontalBox_ConfirmButtons' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, Image_Background_TestBG) == 0x0004A8, "Member 'UBattlePassPurchaseScreen_C::Image_Background_TestBG' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, Image_BackgroundBlur) == 0x0004B0, "Member 'UBattlePassPurchaseScreen_C::Image_BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, Image_BGDarken) == 0x0004B8, "Member 'UBattlePassPurchaseScreen_C::Image_BGDarken' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, Image_Glow) == 0x0004C0, "Member 'UBattlePassPurchaseScreen_C::Image_Glow' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, MobileCloseVisibilityWrapper) == 0x0004C8, "Member 'UBattlePassPurchaseScreen_C::MobileCloseVisibilityWrapper' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, Overlay_PurchaseOptions) == 0x0004D0, "Member 'UBattlePassPurchaseScreen_C::Overlay_PurchaseOptions' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, PurchaseVisibilityWrapper) == 0x0004D8, "Member 'UBattlePassPurchaseScreen_C::PurchaseVisibilityWrapper' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, SafeZone_1) == 0x0004E0, "Member 'UBattlePassPurchaseScreen_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, SafeZone_TopRight) == 0x0004E8, "Member 'UBattlePassPurchaseScreen_C::SafeZone_TopRight' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, ToCrewVisibilityWrapper) == 0x0004F0, "Member 'UBattlePassPurchaseScreen_C::ToCrewVisibilityWrapper' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, VerticalBox_PassDetails) == 0x0004F8, "Member 'UBattlePassPurchaseScreen_C::VerticalBox_PassDetails' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, VerticalBox_PurchaseOptions) == 0x000500, "Member 'UBattlePassPurchaseScreen_C::VerticalBox_PurchaseOptions' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, ImageMID) == 0x000508, "Member 'UBattlePassPurchaseScreen_C::ImageMID' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, DesignTimeAsset) == 0x000510, "Member 'UBattlePassPurchaseScreen_C::DesignTimeAsset' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, OnPurchaseStateConfirm) == 0x000538, "Member 'UBattlePassPurchaseScreen_C::OnPurchaseStateConfirm' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, OnPurchaseStatePurchase) == 0x000548, "Member 'UBattlePassPurchaseScreen_C::OnPurchaseStatePurchase' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, OldBackground) == 0x000558, "Member 'UBattlePassPurchaseScreen_C::OldBackground' has a wrong offset!");

}

