#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassSeasonHeading

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CrewUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassSeasonHeading.BattlePassSeasonHeading_C
// 0x0050 (0x02C8 - 0x0278)
class UBattlePassSeasonHeading_C final : public UBattlePassSeasonHeading
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortLazyImage*                         HeaderImage;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_BattlepassTitle;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              BattlePassStarImage;                               // 0x02A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void EventPlayIntro();
	void ExecuteUbergraph_BattlePassSeasonHeading(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassSeasonHeading_C">();
	}
	static class UBattlePassSeasonHeading_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassSeasonHeading_C>();
	}
};
static_assert(alignof(UBattlePassSeasonHeading_C) == 0x000008, "Wrong alignment on UBattlePassSeasonHeading_C");
static_assert(sizeof(UBattlePassSeasonHeading_C) == 0x0002C8, "Wrong size on UBattlePassSeasonHeading_C");
static_assert(offsetof(UBattlePassSeasonHeading_C, UberGraphFrame) == 0x000278, "Member 'UBattlePassSeasonHeading_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassSeasonHeading_C, Intro) == 0x000280, "Member 'UBattlePassSeasonHeading_C::Intro' has a wrong offset!");
static_assert(offsetof(UBattlePassSeasonHeading_C, HeaderImage) == 0x000288, "Member 'UBattlePassSeasonHeading_C::HeaderImage' has a wrong offset!");
static_assert(offsetof(UBattlePassSeasonHeading_C, Image_Glow) == 0x000290, "Member 'UBattlePassSeasonHeading_C::Image_Glow' has a wrong offset!");
static_assert(offsetof(UBattlePassSeasonHeading_C, Text_BattlepassTitle) == 0x000298, "Member 'UBattlePassSeasonHeading_C::Text_BattlepassTitle' has a wrong offset!");
static_assert(offsetof(UBattlePassSeasonHeading_C, BattlePassStarImage) == 0x0002A0, "Member 'UBattlePassSeasonHeading_C::BattlePassStarImage' has a wrong offset!");

}

