#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassPageUnlockedToast

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassPageUnlockedToast.BattlePassPageUnlockedToast_C
// 0x0080 (0x0300 - 0x0280)
class UBattlePassPageUnlockedToast_C final : public UFortToastWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro_New;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          B_NotificationImage;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          B_NotificationImageExtended;                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_MainWidget;                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Description;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         NotificationImage;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortUINotification*                    ToastNotification;                                 // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimationFinishedDelay;                            // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFinishedToast;                                   // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           AnimationDelayTimer;                               // 0x02F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bActionTaken;                                      // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void StartIntro();
	void SetToast(class UFortUINotification* Toast);
	void SetImage();
	void PlayOutro();
	void ShowText(const class FText& Text, class UCommonTextBlock* TextBlock);
	void SetupAnimBindings(bool Unbind);
	void OnSetToast(class UFortUINotification* ToastNotification_0);
	void OnPlayOpenAnimation();
	ESlateVisibility GetOpenButtonVisibility();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void HandleOutroFinished();
	void HandleIntroFinished();
	void ExecuteUbergraph_BattlePassPageUnlockedToast(int32 EntryPoint);
	void Destruct();
	void ApplyAdditionalStyling();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassPageUnlockedToast_C">();
	}
	static class UBattlePassPageUnlockedToast_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassPageUnlockedToast_C>();
	}
};
static_assert(alignof(UBattlePassPageUnlockedToast_C) == 0x000008, "Wrong alignment on UBattlePassPageUnlockedToast_C");
static_assert(sizeof(UBattlePassPageUnlockedToast_C) == 0x000300, "Wrong size on UBattlePassPageUnlockedToast_C");
static_assert(offsetof(UBattlePassPageUnlockedToast_C, UberGraphFrame) == 0x000280, "Member 'UBattlePassPageUnlockedToast_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassPageUnlockedToast_C, Outro_New) == 0x000288, "Member 'UBattlePassPageUnlockedToast_C::Outro_New' has a wrong offset!");
static_assert(offsetof(UBattlePassPageUnlockedToast_C, Intro) == 0x000290, "Member 'UBattlePassPageUnlockedToast_C::Intro' has a wrong offset!");
static_assert(offsetof(UBattlePassPageUnlockedToast_C, B_NotificationImage) == 0x000298, "Member 'UBattlePassPageUnlockedToast_C::B_NotificationImage' has a wrong offset!");
static_assert(offsetof(UBattlePassPageUnlockedToast_C, B_NotificationImageExtended) == 0x0002A0, "Member 'UBattlePassPageUnlockedToast_C::B_NotificationImageExtended' has a wrong offset!");
static_assert(offsetof(UBattlePassPageUnlockedToast_C, CommonBorder_MainWidget) == 0x0002A8, "Member 'UBattlePassPageUnlockedToast_C::CommonBorder_MainWidget' has a wrong offset!");
static_assert(offsetof(UBattlePassPageUnlockedToast_C, Description) == 0x0002B0, "Member 'UBattlePassPageUnlockedToast_C::Description' has a wrong offset!");
static_assert(offsetof(UBattlePassPageUnlockedToast_C, NotificationImage) == 0x0002B8, "Member 'UBattlePassPageUnlockedToast_C::NotificationImage' has a wrong offset!");
static_assert(offsetof(UBattlePassPageUnlockedToast_C, TextBlock_0) == 0x0002C0, "Member 'UBattlePassPageUnlockedToast_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UBattlePassPageUnlockedToast_C, Title) == 0x0002C8, "Member 'UBattlePassPageUnlockedToast_C::Title' has a wrong offset!");
static_assert(offsetof(UBattlePassPageUnlockedToast_C, ToastNotification) == 0x0002D0, "Member 'UBattlePassPageUnlockedToast_C::ToastNotification' has a wrong offset!");
static_assert(offsetof(UBattlePassPageUnlockedToast_C, AnimationFinishedDelay) == 0x0002D8, "Member 'UBattlePassPageUnlockedToast_C::AnimationFinishedDelay' has a wrong offset!");
static_assert(offsetof(UBattlePassPageUnlockedToast_C, OnFinishedToast) == 0x0002E0, "Member 'UBattlePassPageUnlockedToast_C::OnFinishedToast' has a wrong offset!");
static_assert(offsetof(UBattlePassPageUnlockedToast_C, AnimationDelayTimer) == 0x0002F0, "Member 'UBattlePassPageUnlockedToast_C::AnimationDelayTimer' has a wrong offset!");
static_assert(offsetof(UBattlePassPageUnlockedToast_C, bActionTaken) == 0x0002F8, "Member 'UBattlePassPageUnlockedToast_C::bActionTaken' has a wrong offset!");

}

