#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_WithGravity_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_WithGravity_Parent.BGA_Athena_WithGravity_Parent_C
// 0x01F0 (0x0AB0 - 0x08C0)
class ABGA_Athena_WithGravity_Parent_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortWaterInteractionComponent*         FortWaterInteraction;                              // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ResumeGravSimOnBegin;                              // 0x08E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bResumeSimulation;                                 // 0x08E1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E2[0x2];                                      // 0x08E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             NullHit;                                           // 0x08E4(0x009C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                GravImpact_Loc;                                    // 0x0980(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GravHitNormal;                                     // 0x098C(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GravMaxSlope;                                      // 0x0998(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckForBounce;                                    // 0x099C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99D[0x3];                                      // 0x099D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ForcedBounceExtraZ;                                // 0x09A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ForcedBounceCurrentCount;                          // 0x09A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ForcedBounceMult;                                  // 0x09A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9AC[0x4];                                      // 0x09AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         GravFoundBuildingOnDied;                           // 0x09B0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          RepCollision;                                      // 0x09C0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C1[0x7];                                      // 0x09C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                AdditionalBounceObject;                            // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ForcedBounceMaxCount;                              // 0x09D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceBounce;                                       // 0x09D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CountNonForceBounces;                              // 0x09D5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D6[0x2];                                      // 0x09D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BounceExtraZ;                                      // 0x09D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BounceMult;                                        // 0x09DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldAttach;                                      // 0x09E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E1[0x7];                                      // 0x09E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsToNotAttachTo;                               // 0x09E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          DontAttachToOthersOfThisClass;                     // 0x09F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugText;                                         // 0x09F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldNotReattach;                                 // 0x09FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BlockStoppingSim;                                  // 0x09FB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DeactivatePawnAndVehicleCollisionOnStop;           // 0x09FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowReattachmentToActors;                         // 0x09FD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9FE[0x2];                                      // 0x09FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             StopSimHitResult;                                  // 0x0A00(0x009C)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                StopSimServerLocation;                             // 0x0A9C(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         BounceAwayFromLocation_MinSpeed;                   // 0x0AA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BounceOffTires;                                    // 0x0AAC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AttachedWasDestroyed();
	void AttachToBindedActor(class UPrimitiveComponent* AttachComp);
	void BaseDestroyed(class AActor* DestroyedActor);
	void BaseDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void BounceBGA();
	void BounceBGAAwayFromLocation(const struct FVector& LocationToBounceAwayFrom);
	void CheckForSameClassToBounce(class AActor* Hit, bool* HitSameClass);
	void ExecuteUbergraph_BGA_Athena_WithGravity_Parent(int32 EntryPoint);
	void ForceBounceBGA();
	void HandleBinding(class AActor* Actor, class UPrimitiveComponent* HitComp);
	void Impulse(float DelayBeforeImpulse, float DelayBeforeCollision, const struct FVector& ImpulseOrigin, const struct FVector& ImpulseAmount, bool SetCollisionAfterImpulse);
	void Init(const struct FVector& GravHitNormal_0);
	void OnAttach(class AActor* AttachedActor);
	void OnRep_bResumeSimulation();
	void OnRep_RepCollision();
	void OnRep_StopLocation();
	void OnRep_StopSimServerLocation();
	void PlayHitFX(const struct FHitResult& HitResult);
	void ReceiveBeginPlay();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void RestartSimulation();
	void SlidingDoorOpened();
	void SpawnFXSounds();
	void StopSim(const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_WithGravity_Parent_C">();
	}
	static class ABGA_Athena_WithGravity_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_WithGravity_Parent_C>();
	}
};
static_assert(alignof(ABGA_Athena_WithGravity_Parent_C) == 0x000008, "Wrong alignment on ABGA_Athena_WithGravity_Parent_C");
static_assert(sizeof(ABGA_Athena_WithGravity_Parent_C) == 0x000AB0, "Wrong size on ABGA_Athena_WithGravity_Parent_C");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, UberGraphFrame) == 0x0008C0, "Member 'ABGA_Athena_WithGravity_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, FortWaterInteraction) == 0x0008C8, "Member 'ABGA_Athena_WithGravity_Parent_C::FortWaterInteraction' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, StaticMesh) == 0x0008D0, "Member 'ABGA_Athena_WithGravity_Parent_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ProjectileMovement) == 0x0008D8, "Member 'ABGA_Athena_WithGravity_Parent_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ResumeGravSimOnBegin) == 0x0008E0, "Member 'ABGA_Athena_WithGravity_Parent_C::ResumeGravSimOnBegin' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, bResumeSimulation) == 0x0008E1, "Member 'ABGA_Athena_WithGravity_Parent_C::bResumeSimulation' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, NullHit) == 0x0008E4, "Member 'ABGA_Athena_WithGravity_Parent_C::NullHit' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, GravImpact_Loc) == 0x000980, "Member 'ABGA_Athena_WithGravity_Parent_C::GravImpact_Loc' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, GravHitNormal) == 0x00098C, "Member 'ABGA_Athena_WithGravity_Parent_C::GravHitNormal' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, GravMaxSlope) == 0x000998, "Member 'ABGA_Athena_WithGravity_Parent_C::GravMaxSlope' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, CheckForBounce) == 0x00099C, "Member 'ABGA_Athena_WithGravity_Parent_C::CheckForBounce' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ForcedBounceExtraZ) == 0x0009A0, "Member 'ABGA_Athena_WithGravity_Parent_C::ForcedBounceExtraZ' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ForcedBounceCurrentCount) == 0x0009A4, "Member 'ABGA_Athena_WithGravity_Parent_C::ForcedBounceCurrentCount' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ForcedBounceMult) == 0x0009A8, "Member 'ABGA_Athena_WithGravity_Parent_C::ForcedBounceMult' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, GravFoundBuildingOnDied) == 0x0009B0, "Member 'ABGA_Athena_WithGravity_Parent_C::GravFoundBuildingOnDied' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, RepCollision) == 0x0009C0, "Member 'ABGA_Athena_WithGravity_Parent_C::RepCollision' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, AdditionalBounceObject) == 0x0009C8, "Member 'ABGA_Athena_WithGravity_Parent_C::AdditionalBounceObject' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ForcedBounceMaxCount) == 0x0009D0, "Member 'ABGA_Athena_WithGravity_Parent_C::ForcedBounceMaxCount' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ForceBounce) == 0x0009D4, "Member 'ABGA_Athena_WithGravity_Parent_C::ForceBounce' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, CountNonForceBounces) == 0x0009D5, "Member 'ABGA_Athena_WithGravity_Parent_C::CountNonForceBounces' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, BounceExtraZ) == 0x0009D8, "Member 'ABGA_Athena_WithGravity_Parent_C::BounceExtraZ' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, BounceMult) == 0x0009DC, "Member 'ABGA_Athena_WithGravity_Parent_C::BounceMult' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ShouldAttach) == 0x0009E0, "Member 'ABGA_Athena_WithGravity_Parent_C::ShouldAttach' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ActorsToNotAttachTo) == 0x0009E8, "Member 'ABGA_Athena_WithGravity_Parent_C::ActorsToNotAttachTo' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, DontAttachToOthersOfThisClass) == 0x0009F8, "Member 'ABGA_Athena_WithGravity_Parent_C::DontAttachToOthersOfThisClass' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, DebugText) == 0x0009F9, "Member 'ABGA_Athena_WithGravity_Parent_C::DebugText' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ShouldNotReattach) == 0x0009FA, "Member 'ABGA_Athena_WithGravity_Parent_C::ShouldNotReattach' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, BlockStoppingSim) == 0x0009FB, "Member 'ABGA_Athena_WithGravity_Parent_C::BlockStoppingSim' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, DeactivatePawnAndVehicleCollisionOnStop) == 0x0009FC, "Member 'ABGA_Athena_WithGravity_Parent_C::DeactivatePawnAndVehicleCollisionOnStop' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, AllowReattachmentToActors) == 0x0009FD, "Member 'ABGA_Athena_WithGravity_Parent_C::AllowReattachmentToActors' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, StopSimHitResult) == 0x000A00, "Member 'ABGA_Athena_WithGravity_Parent_C::StopSimHitResult' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, StopSimServerLocation) == 0x000A9C, "Member 'ABGA_Athena_WithGravity_Parent_C::StopSimServerLocation' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, BounceAwayFromLocation_MinSpeed) == 0x000AA8, "Member 'ABGA_Athena_WithGravity_Parent_C::BounceAwayFromLocation_MinSpeed' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, BounceOffTires) == 0x000AAC, "Member 'ABGA_Athena_WithGravity_Parent_C::BounceOffTires' has a wrong offset!");

}

