#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BladesMenu_XpBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BladesMenu_XpBar.BladesMenu_XpBar_C.ExecuteUbergraph_BladesMenu_XpBar
// 0x0020 (0x0020 - 0x0000)
struct BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsRested;                            // 0x0007(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar) == 0x000008, "Wrong alignment on BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar");
static_assert(sizeof(BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar) == 0x000020, "Wrong size on BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar");
static_assert(offsetof(BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar, EntryPoint) == 0x000000, "Member 'BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar, Temp_bool_Variable) == 0x000004, "Member 'BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar, Temp_byte_Variable) == 0x000005, "Member 'BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar, Temp_byte_Variable_1) == 0x000006, "Member 'BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar, K2Node_Event_bIsRested) == 0x000007, "Member 'BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar::K2Node_Event_bIsRested' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar, K2Node_Select_Default) == 0x000010, "Member 'BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar, CallFunc_SelectFloat_ReturnValue) == 0x000014, "Member 'BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000018, "Member 'BladesMenu_XpBar_C_ExecuteUbergraph_BladesMenu_XpBar::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function BladesMenu_XpBar.BladesMenu_XpBar_C.OnUpdatedRestedState
// 0x0001 (0x0001 - 0x0000)
struct BladesMenu_XpBar_C_OnUpdatedRestedState final
{
public:
	bool                                          bIsRested;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BladesMenu_XpBar_C_OnUpdatedRestedState) == 0x000001, "Wrong alignment on BladesMenu_XpBar_C_OnUpdatedRestedState");
static_assert(sizeof(BladesMenu_XpBar_C_OnUpdatedRestedState) == 0x000001, "Wrong size on BladesMenu_XpBar_C_OnUpdatedRestedState");
static_assert(offsetof(BladesMenu_XpBar_C_OnUpdatedRestedState, bIsRested) == 0x000000, "Member 'BladesMenu_XpBar_C_OnUpdatedRestedState::bIsRested' has a wrong offset!");

// Function BladesMenu_XpBar.BladesMenu_XpBar_C.Update Text
// 0x0128 (0x0128 - 0x0000)
struct BladesMenu_XpBar_C_Update_Text final
{
public:
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0000(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0058(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00C0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0110(0x0018)()
};
static_assert(alignof(BladesMenu_XpBar_C_Update_Text) == 0x000008, "Wrong alignment on BladesMenu_XpBar_C_Update_Text");
static_assert(sizeof(BladesMenu_XpBar_C_Update_Text) == 0x000128, "Wrong size on BladesMenu_XpBar_C_Update_Text");
static_assert(offsetof(BladesMenu_XpBar_C_Update_Text, K2Node_MakeStruct_FormatArgumentData) == 0x000000, "Member 'BladesMenu_XpBar_C_Update_Text::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_Update_Text, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BladesMenu_XpBar_C_Update_Text::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_Update_Text, K2Node_MakeArray_Array) == 0x000048, "Member 'BladesMenu_XpBar_C_Update_Text::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_Update_Text, K2Node_MakeStruct_FormatArgumentData_1) == 0x000058, "Member 'BladesMenu_XpBar_C_Update_Text::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_Update_Text, CallFunc_Format_ReturnValue) == 0x000098, "Member 'BladesMenu_XpBar_C_Update_Text::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_Update_Text, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000B0, "Member 'BladesMenu_XpBar_C_Update_Text::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_Update_Text, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000B8, "Member 'BladesMenu_XpBar_C_Update_Text::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_Update_Text, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000C0, "Member 'BladesMenu_XpBar_C_Update_Text::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_Update_Text, K2Node_MakeArray_Array_1) == 0x000100, "Member 'BladesMenu_XpBar_C_Update_Text::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BladesMenu_XpBar_C_Update_Text, CallFunc_Format_ReturnValue_1) == 0x000110, "Member 'BladesMenu_XpBar_C_Update_Text::CallFunc_Format_ReturnValue_1' has a wrong offset!");

}

