#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlueCheeseUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function BlueCheeseUI.BlueCheeseWidgetBase.OnMutatorAvailable
// 0x0008 (0x0008 - 0x0000)
struct BlueCheeseWidgetBase_OnMutatorAvailable final
{
public:
	class AFortGameplayMutator*                   MutatorActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueCheeseWidgetBase_OnMutatorAvailable) == 0x000008, "Wrong alignment on BlueCheeseWidgetBase_OnMutatorAvailable");
static_assert(sizeof(BlueCheeseWidgetBase_OnMutatorAvailable) == 0x000008, "Wrong size on BlueCheeseWidgetBase_OnMutatorAvailable");
static_assert(offsetof(BlueCheeseWidgetBase_OnMutatorAvailable, MutatorActor) == 0x000000, "Member 'BlueCheeseWidgetBase_OnMutatorAvailable::MutatorActor' has a wrong offset!");

// Function BlueCheeseUI.BlueCheeseWidgetBase.GetBlueCheeseMutator
// 0x0008 (0x0008 - 0x0000)
struct BlueCheeseWidgetBase_GetBlueCheeseMutator final
{
public:
	class AFortAthenaMutator_BlueCheese*          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueCheeseWidgetBase_GetBlueCheeseMutator) == 0x000008, "Wrong alignment on BlueCheeseWidgetBase_GetBlueCheeseMutator");
static_assert(sizeof(BlueCheeseWidgetBase_GetBlueCheeseMutator) == 0x000008, "Wrong size on BlueCheeseWidgetBase_GetBlueCheeseMutator");
static_assert(offsetof(BlueCheeseWidgetBase_GetBlueCheeseMutator, ReturnValue) == 0x000000, "Member 'BlueCheeseWidgetBase_GetBlueCheeseMutator::ReturnValue' has a wrong offset!");

}

