#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaMapScreenContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C
// 0x0058 (0x0500 - 0x04A8)
class UBP_AthenaMapScreenContainer_C final : public UAthenaMapScreenContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DamageTaken;                                       // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortQuestMenuAutoRunWidget_C*          AutoRunWidget;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Tabs;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    NextTabAction;                                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OnlineStatusIndicator;                             // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    PreviousTabAction;                                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class US18_PlayerBattlePassXpAndReward_C*     S18_PlayerBattlePassXpAndReward_310;               // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_TabButtons;                               // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_SwitcherContainer;                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreboard_UI_C*                       ScoreboardWidgetRef;                               // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnShowTabsSet(bool bShowTabs);
	void ExecuteUbergraph_BP_AthenaMapScreenContainer(int32 EntryPoint);
	void OnDamageReceived();
	void OnInitialized();
	void OnMinigameEndUI();
	void OnShowOrHideCreativeScoreboard(bool bShowCreativeScoreboard);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AthenaMapScreenContainer_C">();
	}
	static class UBP_AthenaMapScreenContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AthenaMapScreenContainer_C>();
	}
};
static_assert(alignof(UBP_AthenaMapScreenContainer_C) == 0x000008, "Wrong alignment on UBP_AthenaMapScreenContainer_C");
static_assert(sizeof(UBP_AthenaMapScreenContainer_C) == 0x000500, "Wrong size on UBP_AthenaMapScreenContainer_C");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, UberGraphFrame) == 0x0004A8, "Member 'UBP_AthenaMapScreenContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, DamageTaken) == 0x0004B0, "Member 'UBP_AthenaMapScreenContainer_C::DamageTaken' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, AutoRunWidget) == 0x0004B8, "Member 'UBP_AthenaMapScreenContainer_C::AutoRunWidget' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, HBox_Tabs) == 0x0004C0, "Member 'UBP_AthenaMapScreenContainer_C::HBox_Tabs' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, NextTabAction) == 0x0004C8, "Member 'UBP_AthenaMapScreenContainer_C::NextTabAction' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, OnlineStatusIndicator) == 0x0004D0, "Member 'UBP_AthenaMapScreenContainer_C::OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, PreviousTabAction) == 0x0004D8, "Member 'UBP_AthenaMapScreenContainer_C::PreviousTabAction' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, S18_PlayerBattlePassXpAndReward_310) == 0x0004E0, "Member 'UBP_AthenaMapScreenContainer_C::S18_PlayerBattlePassXpAndReward_310' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, SafeZone_TabButtons) == 0x0004E8, "Member 'UBP_AthenaMapScreenContainer_C::SafeZone_TabButtons' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, SizeBox_SwitcherContainer) == 0x0004F0, "Member 'UBP_AthenaMapScreenContainer_C::SizeBox_SwitcherContainer' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, ScoreboardWidgetRef) == 0x0004F8, "Member 'UBP_AthenaMapScreenContainer_C::ScoreboardWidgetRef' has a wrong offset!");

}

