#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattlePassUnlockAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_BattlePassUnlockAnim.BP_BattlePassUnlockAnim_C
// 0x0070 (0x03C0 - 0x0350)
class UBP_BattlePassUnlockAnim_C final : public UAthenaUpgradedPreMessage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       UnlockSequence;                                    // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HeaderContainer;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_59;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_88;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_89;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_90;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_91;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_92;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_93;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SoundOnPlayIntro;                                  // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_BP_BattlePassUnlockAnim(int32 EntryPoint);
	void OnIntroAnimationFinished();
	void PlayIntro();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BattlePassUnlockAnim_C">();
	}
	static class UBP_BattlePassUnlockAnim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BattlePassUnlockAnim_C>();
	}
};
static_assert(alignof(UBP_BattlePassUnlockAnim_C) == 0x000008, "Wrong alignment on UBP_BattlePassUnlockAnim_C");
static_assert(sizeof(UBP_BattlePassUnlockAnim_C) == 0x0003C0, "Wrong size on UBP_BattlePassUnlockAnim_C");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, UberGraphFrame) == 0x000350, "Member 'UBP_BattlePassUnlockAnim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, UnlockSequence) == 0x000358, "Member 'UBP_BattlePassUnlockAnim_C::UnlockSequence' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Intro) == 0x000360, "Member 'UBP_BattlePassUnlockAnim_C::Intro' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Backing) == 0x000368, "Member 'UBP_BattlePassUnlockAnim_C::Backing' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, HeaderContainer) == 0x000370, "Member 'UBP_BattlePassUnlockAnim_C::HeaderContainer' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Icon) == 0x000378, "Member 'UBP_BattlePassUnlockAnim_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Image_59) == 0x000380, "Member 'UBP_BattlePassUnlockAnim_C::Image_59' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Image_88) == 0x000388, "Member 'UBP_BattlePassUnlockAnim_C::Image_88' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Image_89) == 0x000390, "Member 'UBP_BattlePassUnlockAnim_C::Image_89' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Image_90) == 0x000398, "Member 'UBP_BattlePassUnlockAnim_C::Image_90' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Image_91) == 0x0003A0, "Member 'UBP_BattlePassUnlockAnim_C::Image_91' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Image_92) == 0x0003A8, "Member 'UBP_BattlePassUnlockAnim_C::Image_92' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Image_93) == 0x0003B0, "Member 'UBP_BattlePassUnlockAnim_C::Image_93' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, SoundOnPlayIntro) == 0x0003B8, "Member 'UBP_BattlePassUnlockAnim_C::SoundOnPlayIntro' has a wrong offset!");

}

