#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleStarModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleStarModal.BP_BattleStarModal_C.ExecuteUbergraph_BP_BattleStarModal
// 0x0560 (0x0560 - 0x0000)
struct BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0020(0x0018)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0040(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0050(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0070(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0090(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x00B0(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00D0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00E8(0x0018)()
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x010F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewPrice;                             // 0x0110(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewAmount;                            // 0x0114(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_LevelsLeft;                           // 0x0118(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0120(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0160(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0170(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01B0(0x0018)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01E8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0228(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0240(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0250(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0270(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0288(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x02A0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x02E0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x02F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0308(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0328(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x0368(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x0378(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0390(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_6;                          // 0x03D0(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_4;                              // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_6;                     // 0x03E8(0x0018)()
	int32                                         K2Node_CustomEvent_LevelsPurchase;                 // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D[0x3];                                      // 0x041D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_5;             // 0x0420(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0438(0x0040)(HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_7;                          // 0x0480(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_7;                     // 0x0490(0x0018)()
	bool                                          Temp_bool_Variable_5;                              // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x04B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x04C8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_8;                          // 0x0508(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_8;                     // 0x0518(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0531(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReloadMtxEnabled_ReturnValue;           // 0x0532(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_533[0x1];                                      // 0x0533(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_6;             // 0x0540(0x0018)()
	int32                                         K2Node_Select_Default_5;                           // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal) == 0x000008, "Wrong alignment on BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal");
static_assert(sizeof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal) == 0x000560, "Wrong size on BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, EntryPoint) == 0x000000, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_bool_Variable) == 0x000018, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Format_ReturnValue) == 0x000020, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_byte_Variable) == 0x000038, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_byte_Variable_1) == 0x000039, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeArray_Array_1) == 0x000040, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Format_ReturnValue_1) == 0x000050, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_bool_Variable_1) == 0x000068, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_byte_Variable_2) == 0x000069, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToText_ReturnValue) == 0x000070, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_byte_Variable_3) == 0x000088, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_bool_Variable_2) == 0x000089, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000090, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000A8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToText_ReturnValue_2) == 0x0000B0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Event_IsDesignTime) == 0x0000C8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_MakeLiteralText_ReturnValue) == 0x0000D0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0000E8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Multiply_IntInt_ReturnValue) == 0x000100, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_int_Variable) == 0x000104, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Subtract_IntInt_ReturnValue) == 0x000108, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_bool_Variable_3) == 0x00010C, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Less_IntInt_ReturnValue) == 0x00010D, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00010E, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_byte_Variable_4) == 0x00010F, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Event_NewPrice) == 0x000110, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Event_NewPrice' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Event_NewAmount) == 0x000114, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Event_NewAmount' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Event_LevelsLeft) == 0x000118, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Event_LevelsLeft' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Greater_IntInt_ReturnValue) == 0x00011C, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeStruct_FormatArgumentData) == 0x000120, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeArray_Array_2) == 0x000160, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeStruct_FormatArgumentData_1) == 0x000170, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Format_ReturnValue_2) == 0x0001B0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0001C8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001CC, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x0001D0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToString_ReturnValue) == 0x0001D8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001E8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_StringToText_ReturnValue) == 0x000228, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeArray_Array_3) == 0x000240, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Format_ReturnValue_3) == 0x000250, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000268, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Add_IntInt_ReturnValue_2) == 0x00026C, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000270, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Select_Default) == 0x000288, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeStruct_FormatArgumentData_3) == 0x0002A0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToText_ReturnValue_4) == 0x0002E0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeArray_Array_4) == 0x0002F8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Format_ReturnValue_4) == 0x000308, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_byte_Variable_5) == 0x000320, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeStruct_FormatArgumentData_4) == 0x000328, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeArray_Array_5) == 0x000368, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Format_ReturnValue_5) == 0x000378, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Format_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeStruct_FormatArgumentData_5) == 0x000390, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeArray_Array_6) == 0x0003D0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_bool_Variable_4) == 0x0003E0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Format_ReturnValue_6) == 0x0003E8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Format_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_CustomEvent_LevelsPurchase) == 0x000400, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_CustomEvent_LevelsPurchase' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Select_Default_1) == 0x000404, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Add_IntInt_ReturnValue_3) == 0x000408, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Divide_IntInt_ReturnValue) == 0x00040C, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000410, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Add_IntInt_ReturnValue_4) == 0x000414, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Clamp_ReturnValue) == 0x000418, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_InRange_IntInt_ReturnValue) == 0x00041C, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToText_ReturnValue_5) == 0x000420, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeStruct_FormatArgumentData_6) == 0x000438, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Select_Default_2) == 0x000478, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeArray_Array_7) == 0x000480, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Format_ReturnValue_7) == 0x000490, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Format_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_bool_Variable_5) == 0x0004A8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Select_Default_3) == 0x0004B0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeStruct_FormatArgumentData_7) == 0x0004C8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeArray_Array_8) == 0x000508, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeArray_Array_8' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Format_ReturnValue_8) == 0x000518, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Format_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Less_IntInt_ReturnValue_1) == 0x000530, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Select_Default_4) == 0x000531, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_IsReloadMtxEnabled_ReturnValue) == 0x000532, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_IsReloadMtxEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Add_IntInt_ReturnValue_5) == 0x000534, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_SelectInt_ReturnValue) == 0x000538, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToText_ReturnValue_6) == 0x000540, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Select_Default_5) == 0x000558, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Select_Default_5' has a wrong offset!");

// Function BP_BattleStarModal.BP_BattleStarModal_C.OnPurchaseAmountChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleStarModal_C_OnPurchaseAmountChanged final
{
public:
	int32                                         NewAmount;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LevelsLeft;                                        // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleStarModal_C_OnPurchaseAmountChanged) == 0x000004, "Wrong alignment on BP_BattleStarModal_C_OnPurchaseAmountChanged");
static_assert(sizeof(BP_BattleStarModal_C_OnPurchaseAmountChanged) == 0x000008, "Wrong size on BP_BattleStarModal_C_OnPurchaseAmountChanged");
static_assert(offsetof(BP_BattleStarModal_C_OnPurchaseAmountChanged, NewAmount) == 0x000000, "Member 'BP_BattleStarModal_C_OnPurchaseAmountChanged::NewAmount' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_OnPurchaseAmountChanged, LevelsLeft) == 0x000004, "Member 'BP_BattleStarModal_C_OnPurchaseAmountChanged::LevelsLeft' has a wrong offset!");

// Function BP_BattleStarModal.BP_BattleStarModal_C.OnTotalPriceChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_BattleStarModal_C_OnTotalPriceChanged final
{
public:
	int32                                         NewPrice;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleStarModal_C_OnTotalPriceChanged) == 0x000004, "Wrong alignment on BP_BattleStarModal_C_OnTotalPriceChanged");
static_assert(sizeof(BP_BattleStarModal_C_OnTotalPriceChanged) == 0x000004, "Wrong size on BP_BattleStarModal_C_OnTotalPriceChanged");
static_assert(offsetof(BP_BattleStarModal_C_OnTotalPriceChanged, NewPrice) == 0x000000, "Member 'BP_BattleStarModal_C_OnTotalPriceChanged::NewPrice' has a wrong offset!");

// Function BP_BattleStarModal.BP_BattleStarModal_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_BattleStarModal_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleStarModal_C_PreConstruct) == 0x000001, "Wrong alignment on BP_BattleStarModal_C_PreConstruct");
static_assert(sizeof(BP_BattleStarModal_C_PreConstruct) == 0x000001, "Wrong size on BP_BattleStarModal_C_PreConstruct");
static_assert(offsetof(BP_BattleStarModal_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_BattleStarModal_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_BattleStarModal.BP_BattleStarModal_C.Randomize stars hovering
// 0x0028 (0x0028 - 0x0000)
struct BP_BattleStarModal_C_Randomize_stars_hovering final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleStarModal_C_Randomize_stars_hovering) == 0x000008, "Wrong alignment on BP_BattleStarModal_C_Randomize_stars_hovering");
static_assert(sizeof(BP_BattleStarModal_C_Randomize_stars_hovering) == 0x000028, "Wrong size on BP_BattleStarModal_C_Randomize_stars_hovering");
static_assert(offsetof(BP_BattleStarModal_C_Randomize_stars_hovering, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'BP_BattleStarModal_C_Randomize_stars_hovering::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_Randomize_stars_hovering, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000004, "Member 'BP_BattleStarModal_C_Randomize_stars_hovering::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_Randomize_stars_hovering, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'BP_BattleStarModal_C_Randomize_stars_hovering::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_Randomize_stars_hovering, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000010, "Member 'BP_BattleStarModal_C_Randomize_stars_hovering::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_Randomize_stars_hovering, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000018, "Member 'BP_BattleStarModal_C_Randomize_stars_hovering::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_Randomize_stars_hovering, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000020, "Member 'BP_BattleStarModal_C_Randomize_stars_hovering::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");

// Function BP_BattleStarModal.BP_BattleStarModal_C.UpdatePageUnlockText
// 0x0004 (0x0004 - 0x0000)
struct BP_BattleStarModal_C_UpdatePageUnlockText final
{
public:
	int32                                         LevelsPurchase;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleStarModal_C_UpdatePageUnlockText) == 0x000004, "Wrong alignment on BP_BattleStarModal_C_UpdatePageUnlockText");
static_assert(sizeof(BP_BattleStarModal_C_UpdatePageUnlockText) == 0x000004, "Wrong size on BP_BattleStarModal_C_UpdatePageUnlockText");
static_assert(offsetof(BP_BattleStarModal_C_UpdatePageUnlockText, LevelsPurchase) == 0x000000, "Member 'BP_BattleStarModal_C_UpdatePageUnlockText::LevelsPurchase' has a wrong offset!");

}

