#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Background_Raytracing

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Background_Raytracing.BP_Background_Raytracing_C
// 0x0038 (0x0258 - 0x0220)
class ABP_Background_Raytracing_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_InvertedSphere_BackPlate_Half;                  // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          FullSphere;                                        // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCubemap;                                        // 0x0231(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x2];                                      // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Brightness;                                        // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               TwodTexture;                                       // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Cubemap;                                           // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FadeColor;                                         // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Background_Raytracing_C">();
	}
	static class ABP_Background_Raytracing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Background_Raytracing_C>();
	}
};
static_assert(alignof(ABP_Background_Raytracing_C) == 0x000008, "Wrong alignment on ABP_Background_Raytracing_C");
static_assert(sizeof(ABP_Background_Raytracing_C) == 0x000258, "Wrong size on ABP_Background_Raytracing_C");
static_assert(offsetof(ABP_Background_Raytracing_C, SM_InvertedSphere_BackPlate_Half) == 0x000220, "Member 'ABP_Background_Raytracing_C::SM_InvertedSphere_BackPlate_Half' has a wrong offset!");
static_assert(offsetof(ABP_Background_Raytracing_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_Background_Raytracing_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Background_Raytracing_C, FullSphere) == 0x000230, "Member 'ABP_Background_Raytracing_C::FullSphere' has a wrong offset!");
static_assert(offsetof(ABP_Background_Raytracing_C, UseCubemap) == 0x000231, "Member 'ABP_Background_Raytracing_C::UseCubemap' has a wrong offset!");
static_assert(offsetof(ABP_Background_Raytracing_C, Brightness) == 0x000234, "Member 'ABP_Background_Raytracing_C::Brightness' has a wrong offset!");
static_assert(offsetof(ABP_Background_Raytracing_C, TwodTexture) == 0x000238, "Member 'ABP_Background_Raytracing_C::TwodTexture' has a wrong offset!");
static_assert(offsetof(ABP_Background_Raytracing_C, Cubemap) == 0x000240, "Member 'ABP_Background_Raytracing_C::Cubemap' has a wrong offset!");
static_assert(offsetof(ABP_Background_Raytracing_C, FadeColor) == 0x000248, "Member 'ABP_Background_Raytracing_C::FadeColor' has a wrong offset!");

}

