#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HoldableButton_BuyLevel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_HoldableButton_BuyLevel.BP_HoldableButton_BuyLevel_C.BP_OnHoldDecreased
// 0x0004 (0x0004 - 0x0000)
struct BP_HoldableButton_BuyLevel_C_BP_OnHoldDecreased final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HoldableButton_BuyLevel_C_BP_OnHoldDecreased) == 0x000004, "Wrong alignment on BP_HoldableButton_BuyLevel_C_BP_OnHoldDecreased");
static_assert(sizeof(BP_HoldableButton_BuyLevel_C_BP_OnHoldDecreased) == 0x000004, "Wrong size on BP_HoldableButton_BuyLevel_C_BP_OnHoldDecreased");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_BP_OnHoldDecreased, HoldPercentage) == 0x000000, "Member 'BP_HoldableButton_BuyLevel_C_BP_OnHoldDecreased::HoldPercentage' has a wrong offset!");

// Function BP_HoldableButton_BuyLevel.BP_HoldableButton_BuyLevel_C.BP_OnHoldEnded
// 0x0008 (0x0008 - 0x0000)
struct BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInUseSecondaryHoldAnimation;                      // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded) == 0x000004, "Wrong alignment on BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded");
static_assert(sizeof(BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded) == 0x000008, "Wrong size on BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded, HoldPercentage) == 0x000000, "Member 'BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded::HoldPercentage' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded, bInUseSecondaryHoldAnimation) == 0x000004, "Member 'BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded::bInUseSecondaryHoldAnimation' has a wrong offset!");

// Function BP_HoldableButton_BuyLevel.BP_HoldableButton_BuyLevel_C.BP_OnHoldIncreased
// 0x0004 (0x0004 - 0x0000)
struct BP_HoldableButton_BuyLevel_C_BP_OnHoldIncreased final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HoldableButton_BuyLevel_C_BP_OnHoldIncreased) == 0x000004, "Wrong alignment on BP_HoldableButton_BuyLevel_C_BP_OnHoldIncreased");
static_assert(sizeof(BP_HoldableButton_BuyLevel_C_BP_OnHoldIncreased) == 0x000004, "Wrong size on BP_HoldableButton_BuyLevel_C_BP_OnHoldIncreased");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_BP_OnHoldIncreased, HoldPercentage) == 0x000000, "Member 'BP_HoldableButton_BuyLevel_C_BP_OnHoldIncreased::HoldPercentage' has a wrong offset!");

// Function BP_HoldableButton_BuyLevel.BP_HoldableButton_BuyLevel_C.BP_OnHoldStarted
// 0x0008 (0x0008 - 0x0000)
struct BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInUseSecondaryHoldAnimation;                      // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted) == 0x000004, "Wrong alignment on BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted");
static_assert(sizeof(BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted) == 0x000008, "Wrong size on BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted, HoldPercentage) == 0x000000, "Member 'BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted::HoldPercentage' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted, bInUseSecondaryHoldAnimation) == 0x000004, "Member 'BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted::bInUseSecondaryHoldAnimation' has a wrong offset!");

// Function BP_HoldableButton_BuyLevel.BP_HoldableButton_BuyLevel_C.ExecuteUbergraph_BP_HoldableButton_BuyLevel
// 0x0128 (0x0128 - 0x0000)
struct BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HoldPercentage_3;                     // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInUseSecondaryHoldAnimation_1;       // 0x0024(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HoldPercentage_2;                     // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInUseSecondaryHoldAnimation;         // 0x002C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HoldPercentage_1;                     // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterInterface> CallFunc_SetFloatParameter_self_CastInput;         // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HoldPercentage;                       // 0x0048(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterInterface> CallFunc_SetFloatParameter_self_CastInput_1;       // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0090(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00F4(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel) == 0x000008, "Wrong alignment on BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel");
static_assert(sizeof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel) == 0x000128, "Wrong size on BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, EntryPoint) == 0x000000, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_IsValid_ReturnValue_2) == 0x000006, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_IsValid_ReturnValue_3) == 0x000007, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_IsValid_ReturnValue_4) == 0x000008, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_Event_HoldPercentage_3) == 0x000020, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_Event_HoldPercentage_3' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_Event_bInUseSecondaryHoldAnimation_1) == 0x000024, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_Event_bInUseSecondaryHoldAnimation_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_Event_HoldPercentage_2) == 0x000028, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_Event_HoldPercentage_2' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_Event_bInUseSecondaryHoldAnimation) == 0x00002C, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_Event_bInUseSecondaryHoldAnimation' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00002D, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_Event_HoldPercentage_1) == 0x000030, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_Event_HoldPercentage_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_SetFloatParameter_self_CastInput) == 0x000038, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_Event_HoldPercentage) == 0x000048, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_Event_HoldPercentage' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_SetFloatParameter_self_CastInput_1) == 0x000050, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_SetFloatParameter_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_Event_IsDesignTime) == 0x000060, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_GetEndTime_ReturnValue) == 0x000064, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_GetEndTime_ReturnValue_1) == 0x000068, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00006C, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000070, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000074, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000078, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_PlayAnimation_ReturnValue) == 0x000080, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_PlayAnimation_ReturnValue_1) == 0x000088, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_MakeStruct_SlateFontInfo) == 0x000090, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_IsValid_ReturnValue_5) == 0x0000E8, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_MakeVector2D_ReturnValue) == 0x0000EC, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_CreateDelegate_OutputDelegate) == 0x0000F4, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, Temp_byte_Variable) == 0x000104, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, Temp_byte_Variable_1) == 0x000105, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_SpawnSound2D_ReturnValue) == 0x000108, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, Temp_bool_Variable) == 0x000110, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_PlayAnimation_ReturnValue_2) == 0x000118, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_Select_Default) == 0x000120, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_Select_Default' has a wrong offset!");

// Function BP_HoldableButton_BuyLevel.BP_HoldableButton_BuyLevel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_HoldableButton_BuyLevel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HoldableButton_BuyLevel_C_PreConstruct) == 0x000001, "Wrong alignment on BP_HoldableButton_BuyLevel_C_PreConstruct");
static_assert(sizeof(BP_HoldableButton_BuyLevel_C_PreConstruct) == 0x000001, "Wrong size on BP_HoldableButton_BuyLevel_C_PreConstruct");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_HoldableButton_BuyLevel_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

