#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LobbySeasonalResources

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePassBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_LobbySeasonalResources.BP_LobbySeasonalResources_C
// 0x0028 (0x02D0 - 0x02A8)
class UBP_LobbySeasonalResources_C final : public UFortBattlePassResourcesWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaGlobalCashHorizontal_C*          AthenaGlobalCashHorizontal;                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMoreInfo_Ressources_Button_C*          MoreInfo_Ressources_Button_67;                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMoreInfo_Ressources_MobileButton_C*    MoreInfo_Ressources_MobileButton_19;               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SeasonName;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_BP_LobbySeasonalResources(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LobbySeasonalResources_C">();
	}
	static class UBP_LobbySeasonalResources_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_LobbySeasonalResources_C>();
	}
};
static_assert(alignof(UBP_LobbySeasonalResources_C) == 0x000008, "Wrong alignment on UBP_LobbySeasonalResources_C");
static_assert(sizeof(UBP_LobbySeasonalResources_C) == 0x0002D0, "Wrong size on UBP_LobbySeasonalResources_C");
static_assert(offsetof(UBP_LobbySeasonalResources_C, UberGraphFrame) == 0x0002A8, "Member 'UBP_LobbySeasonalResources_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_LobbySeasonalResources_C, AthenaGlobalCashHorizontal) == 0x0002B0, "Member 'UBP_LobbySeasonalResources_C::AthenaGlobalCashHorizontal' has a wrong offset!");
static_assert(offsetof(UBP_LobbySeasonalResources_C, MoreInfo_Ressources_Button_67) == 0x0002B8, "Member 'UBP_LobbySeasonalResources_C::MoreInfo_Ressources_Button_67' has a wrong offset!");
static_assert(offsetof(UBP_LobbySeasonalResources_C, MoreInfo_Ressources_MobileButton_19) == 0x0002C0, "Member 'UBP_LobbySeasonalResources_C::MoreInfo_Ressources_MobileButton_19' has a wrong offset!");
static_assert(offsetof(UBP_LobbySeasonalResources_C, Text_SeasonName) == 0x0002C8, "Member 'UBP_LobbySeasonalResources_C::Text_SeasonName' has a wrong offset!");

}

