#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LobbySeasonalResources

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_LobbySeasonalResources.BP_LobbySeasonalResources_C.BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BP_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BP_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BP_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BP_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BP_LobbySeasonalResources.BP_LobbySeasonalResources_C.BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BP_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BP_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BP_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BP_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BP_LobbySeasonalResources.BP_LobbySeasonalResources_C.ExecuteUbergraph_BP_LobbySeasonalResources
// 0x00A0 (0x00A0 - 0x0000)
struct BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortBattlePassContext*                 CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCurrentSeasonNumberAsText_ReturnValue; // 0x0010(0x0018)()
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
};
static_assert(alignof(BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources) == 0x000008, "Wrong alignment on BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources");
static_assert(sizeof(BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources) == 0x0000A0, "Wrong size on BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources");
static_assert(offsetof(BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources, EntryPoint) == 0x000000, "Member 'BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources, CallFunc_GetCurrentSeasonNumberAsText_ReturnValue) == 0x000010, "Member 'BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources::CallFunc_GetCurrentSeasonNumberAsText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources, K2Node_ComponentBoundEvent_Button_1) == 0x000028, "Member 'BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources, K2Node_MakeArray_Array) == 0x000070, "Member 'BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources, K2Node_ComponentBoundEvent_Button) == 0x000080, "Member 'BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources, CallFunc_Format_ReturnValue) == 0x000088, "Member 'BP_LobbySeasonalResources_C_ExecuteUbergraph_BP_LobbySeasonalResources::CallFunc_Format_ReturnValue' has a wrong offset!");

}

