#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Shotgun_SG_BFPA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Shotgun_SG_BFPA.BP_Shotgun_SG_BFPA_C
// 0x0090 (0x03B0 - 0x0320)
class UBP_Shotgun_SG_BFPA_C final : public UAnimInstance
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0328(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0330(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0338(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0358(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x03A0(0x0010)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_BP_Shotgun_SG_BFPA(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Shotgun_SG_BFPA_C">();
	}
	static class UBP_Shotgun_SG_BFPA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Shotgun_SG_BFPA_C>();
	}
};
static_assert(alignof(UBP_Shotgun_SG_BFPA_C) == 0x000010, "Wrong alignment on UBP_Shotgun_SG_BFPA_C");
static_assert(sizeof(UBP_Shotgun_SG_BFPA_C) == 0x0003B0, "Wrong size on UBP_Shotgun_SG_BFPA_C");
static_assert(offsetof(UBP_Shotgun_SG_BFPA_C, UberGraphFrame) == 0x000320, "Member 'UBP_Shotgun_SG_BFPA_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Shotgun_SG_BFPA_C, AnimBlueprintExtension_PropertyAccess) == 0x000328, "Member 'UBP_Shotgun_SG_BFPA_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UBP_Shotgun_SG_BFPA_C, AnimBlueprintExtension_Base) == 0x000330, "Member 'UBP_Shotgun_SG_BFPA_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UBP_Shotgun_SG_BFPA_C, AnimGraphNode_Root) == 0x000338, "Member 'UBP_Shotgun_SG_BFPA_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_Shotgun_SG_BFPA_C, AnimGraphNode_Slot) == 0x000358, "Member 'UBP_Shotgun_SG_BFPA_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_Shotgun_SG_BFPA_C, AnimGraphNode_LocalRefPose) == 0x0003A0, "Member 'UBP_Shotgun_SG_BFPA_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

