#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TeleportationDrone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TeleportationDrone.BP_TeleportationDrone_C
// 0x0050 (0x02D8 - 0x0288)
class ABP_TeleportationDrone_C final : public APawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponentBudgeted*         SkeletalMeshComponentBudgeted;                     // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         AnimPlayRate;                                      // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               StaticMeshMID;                                     // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TeleportIn;                                        // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CharacterAttached;                                 // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InLobby;                                           // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Mesh_for_Attachment;                               // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TeleportationDrone(int32 EntryPoint);
	void OnSpawnOutAnimEnded(class UAnimMontage* Montage, bool bInterrupted);
	void PlaySpawnAnim();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TeleportationDrone_C">();
	}
	static class ABP_TeleportationDrone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TeleportationDrone_C>();
	}
};
static_assert(alignof(ABP_TeleportationDrone_C) == 0x000008, "Wrong alignment on ABP_TeleportationDrone_C");
static_assert(sizeof(ABP_TeleportationDrone_C) == 0x0002D8, "Wrong size on ABP_TeleportationDrone_C");
static_assert(offsetof(ABP_TeleportationDrone_C, UberGraphFrame) == 0x000288, "Member 'ABP_TeleportationDrone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TeleportationDrone_C, SkeletalMeshComponentBudgeted) == 0x000290, "Member 'ABP_TeleportationDrone_C::SkeletalMeshComponentBudgeted' has a wrong offset!");
static_assert(offsetof(ABP_TeleportationDrone_C, Scene) == 0x000298, "Member 'ABP_TeleportationDrone_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_TeleportationDrone_C, AnimPlayRate) == 0x0002A0, "Member 'ABP_TeleportationDrone_C::AnimPlayRate' has a wrong offset!");
static_assert(offsetof(ABP_TeleportationDrone_C, StaticMeshMID) == 0x0002A8, "Member 'ABP_TeleportationDrone_C::StaticMeshMID' has a wrong offset!");
static_assert(offsetof(ABP_TeleportationDrone_C, TeleportIn) == 0x0002B0, "Member 'ABP_TeleportationDrone_C::TeleportIn' has a wrong offset!");
static_assert(offsetof(ABP_TeleportationDrone_C, CharacterAttached) == 0x0002B8, "Member 'ABP_TeleportationDrone_C::CharacterAttached' has a wrong offset!");
static_assert(offsetof(ABP_TeleportationDrone_C, InLobby) == 0x0002C0, "Member 'ABP_TeleportationDrone_C::InLobby' has a wrong offset!");
static_assert(offsetof(ABP_TeleportationDrone_C, Mesh_for_Attachment) == 0x0002C8, "Member 'ABP_TeleportationDrone_C::Mesh_for_Attachment' has a wrong offset!");
static_assert(offsetof(ABP_TeleportationDrone_C, NewVar_0) == 0x0002D0, "Member 'ABP_TeleportationDrone_C::NewVar_0' has a wrong offset!");

}

