#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZipLine_Athena_Harness_Yellow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ZipLine_Athena_Harness_Yellow.BP_ZipLine_Athena_Harness_Yellow_C.ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow
// 0x0078 (0x0078 - 0x0000)
struct BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow) == 0x000008, "Wrong alignment on BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow");
static_assert(sizeof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow) == 0x000078, "Wrong size on BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, EntryPoint) == 0x000000, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000030, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, Temp_bool_IsClosed_Variable) == 0x000038, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, Temp_bool_Has_Been_Initd_Variable) == 0x000039, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, CallFunc_IsValid_ReturnValue) == 0x00003A, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00003C, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, CallFunc_BreakVector_X) == 0x000048, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, CallFunc_BreakVector_Y) == 0x00004C, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, CallFunc_BreakVector_Z) == 0x000050, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, CallFunc_IsValid_ReturnValue_1) == 0x000054, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000058, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, CallFunc_BreakVector_X_1) == 0x000064, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, CallFunc_BreakVector_Y_1) == 0x000068, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, CallFunc_BreakVector_Z_1) == 0x00006C, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000070, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, Temp_bool_Has_Been_Initd_Variable_1) == 0x000071, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow, Temp_bool_IsClosed_Variable_1) == 0x000072, "Member 'BP_ZipLine_Athena_Harness_Yellow_C_ExecuteUbergraph_BP_ZipLine_Athena_Harness_Yellow::Temp_bool_IsClosed_Variable_1' has a wrong offset!");

}

