#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS19_GetAllButton

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPS19_GetAllButton.BPS19_GetAllButton_C.ExecuteUbergraph_BPS19_GetAllButton
// 0x0038 (0x0038 - 0x0000)
struct BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue_1;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton) == 0x000008, "Wrong alignment on BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton");
static_assert(sizeof(BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton) == 0x000038, "Wrong size on BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton");
static_assert(offsetof(BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton, EntryPoint) == 0x000000, "Member 'BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton, CallFunc_GetContext_ReturnValue_1) == 0x000020, "Member 'BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BPS19_GetAllButton_C_ExecuteUbergraph_BPS19_GetAllButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BPS19_GetAllButton.BPS19_GetAllButton_C.Set Text Data
// 0x0230 (0x0230 - 0x0000)
struct BPS19_GetAllButton_C_Set_Text_Data final
{
public:
	bool                                          Page_Complete_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Starting_Page;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Ending_Page;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cost;                                              // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D0(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F0(0x0040)(HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x1];                                      // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0148(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0160(0x0018)()
	float                                         K2Node_Select_Default_2;                           // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x0180(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0198(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x01D8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0200(0x0018)()
	class FText                                   K2Node_Select_Default_4;                           // 0x0218(0x0018)(ConstParm)
};
static_assert(alignof(BPS19_GetAllButton_C_Set_Text_Data) == 0x000008, "Wrong alignment on BPS19_GetAllButton_C_Set_Text_Data");
static_assert(sizeof(BPS19_GetAllButton_C_Set_Text_Data) == 0x000230, "Wrong size on BPS19_GetAllButton_C_Set_Text_Data");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, Page_Complete_0) == 0x000000, "Member 'BPS19_GetAllButton_C_Set_Text_Data::Page_Complete_0' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, Starting_Page) == 0x000004, "Member 'BPS19_GetAllButton_C_Set_Text_Data::Starting_Page' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, Ending_Page) == 0x000008, "Member 'BPS19_GetAllButton_C_Set_Text_Data::Ending_Page' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, Cost) == 0x00000C, "Member 'BPS19_GetAllButton_C_Set_Text_Data::Cost' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'BPS19_GetAllButton_C_Set_Text_Data::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BPS19_GetAllButton_C_Set_Text_Data::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'BPS19_GetAllButton_C_Set_Text_Data::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, CallFunc_Conv_IntToString_ReturnValue) == 0x000058, "Member 'BPS19_GetAllButton_C_Set_Text_Data::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000068, "Member 'BPS19_GetAllButton_C_Set_Text_Data::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000078, "Member 'BPS19_GetAllButton_C_Set_Text_Data::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000080, "Member 'BPS19_GetAllButton_C_Set_Text_Data::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, CallFunc_Concat_StrStr_ReturnValue) == 0x000090, "Member 'BPS19_GetAllButton_C_Set_Text_Data::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, Temp_bool_Variable) == 0x0000A0, "Member 'BPS19_GetAllButton_C_Set_Text_Data::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000A8, "Member 'BPS19_GetAllButton_C_Set_Text_Data::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, Temp_bool_Variable_1) == 0x0000B8, "Member 'BPS19_GetAllButton_C_Set_Text_Data::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, K2Node_Select_Default) == 0x0000C0, "Member 'BPS19_GetAllButton_C_Set_Text_Data::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D0, "Member 'BPS19_GetAllButton_C_Set_Text_Data::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, Temp_bool_Variable_2) == 0x0000E8, "Member 'BPS19_GetAllButton_C_Set_Text_Data::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F0, "Member 'BPS19_GetAllButton_C_Set_Text_Data::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, Temp_byte_Variable) == 0x000130, "Member 'BPS19_GetAllButton_C_Set_Text_Data::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, Temp_byte_Variable_1) == 0x000131, "Member 'BPS19_GetAllButton_C_Set_Text_Data::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, Temp_bool_Variable_3) == 0x000132, "Member 'BPS19_GetAllButton_C_Set_Text_Data::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, Temp_float_Variable) == 0x000134, "Member 'BPS19_GetAllButton_C_Set_Text_Data::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, K2Node_Select_Default_1) == 0x000138, "Member 'BPS19_GetAllButton_C_Set_Text_Data::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, Temp_float_Variable_1) == 0x00013C, "Member 'BPS19_GetAllButton_C_Set_Text_Data::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, Temp_bool_Variable_4) == 0x000140, "Member 'BPS19_GetAllButton_C_Set_Text_Data::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, CallFunc_MakeLiteralText_ReturnValue) == 0x000148, "Member 'BPS19_GetAllButton_C_Set_Text_Data::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000160, "Member 'BPS19_GetAllButton_C_Set_Text_Data::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, K2Node_Select_Default_2) == 0x000178, "Member 'BPS19_GetAllButton_C_Set_Text_Data::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, K2Node_Select_Default_3) == 0x000180, "Member 'BPS19_GetAllButton_C_Set_Text_Data::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, K2Node_MakeStruct_FormatArgumentData_2) == 0x000198, "Member 'BPS19_GetAllButton_C_Set_Text_Data::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, CallFunc_MakeLiteralText_ReturnValue_2) == 0x0001D8, "Member 'BPS19_GetAllButton_C_Set_Text_Data::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, K2Node_MakeArray_Array) == 0x0001F0, "Member 'BPS19_GetAllButton_C_Set_Text_Data::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, CallFunc_Format_ReturnValue) == 0x000200, "Member 'BPS19_GetAllButton_C_Set_Text_Data::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_Set_Text_Data, K2Node_Select_Default_4) == 0x000218, "Member 'BPS19_GetAllButton_C_Set_Text_Data::K2Node_Select_Default_4' has a wrong offset!");

// Function BPS19_GetAllButton.BPS19_GetAllButton_C.UpdateTextAndStyle
// 0x0008 (0x0008 - 0x0000)
struct BPS19_GetAllButton_C_UpdateTextAndStyle final
{
public:
	ECommonInputType                              Input_Type;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsErebus_ReturnValue;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_GetAllButton_C_UpdateTextAndStyle) == 0x000001, "Wrong alignment on BPS19_GetAllButton_C_UpdateTextAndStyle");
static_assert(sizeof(BPS19_GetAllButton_C_UpdateTextAndStyle) == 0x000008, "Wrong size on BPS19_GetAllButton_C_UpdateTextAndStyle");
static_assert(offsetof(BPS19_GetAllButton_C_UpdateTextAndStyle, Input_Type) == 0x000000, "Member 'BPS19_GetAllButton_C_UpdateTextAndStyle::Input_Type' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_UpdateTextAndStyle, Temp_bool_Variable) == 0x000001, "Member 'BPS19_GetAllButton_C_UpdateTextAndStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_UpdateTextAndStyle, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BPS19_GetAllButton_C_UpdateTextAndStyle::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_UpdateTextAndStyle, Temp_byte_Variable) == 0x000003, "Member 'BPS19_GetAllButton_C_UpdateTextAndStyle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_UpdateTextAndStyle, Temp_byte_Variable_1) == 0x000004, "Member 'BPS19_GetAllButton_C_UpdateTextAndStyle::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_UpdateTextAndStyle, CallFunc_IsErebus_ReturnValue) == 0x000005, "Member 'BPS19_GetAllButton_C_UpdateTextAndStyle::CallFunc_IsErebus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_UpdateTextAndStyle, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'BPS19_GetAllButton_C_UpdateTextAndStyle::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_GetAllButton_C_UpdateTextAndStyle, K2Node_Select_Default) == 0x000007, "Member 'BPS19_GetAllButton_C_UpdateTextAndStyle::K2Node_Select_Default' has a wrong offset!");

}

