#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS19_SeasonalDataWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPS19_SeasonalDataWidget.BPS19_SeasonalDataWidget_C.ExecuteUbergraph_BPS19_SeasonalDataWidget
// 0x0010 (0x0010 - 0x0000)
struct BPS19_SeasonalDataWidget_C_ExecuteUbergraph_BPS19_SeasonalDataWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_SeasonalDataWidget_C_ExecuteUbergraph_BPS19_SeasonalDataWidget) == 0x000008, "Wrong alignment on BPS19_SeasonalDataWidget_C_ExecuteUbergraph_BPS19_SeasonalDataWidget");
static_assert(sizeof(BPS19_SeasonalDataWidget_C_ExecuteUbergraph_BPS19_SeasonalDataWidget) == 0x000010, "Wrong size on BPS19_SeasonalDataWidget_C_ExecuteUbergraph_BPS19_SeasonalDataWidget");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_ExecuteUbergraph_BPS19_SeasonalDataWidget, EntryPoint) == 0x000000, "Member 'BPS19_SeasonalDataWidget_C_ExecuteUbergraph_BPS19_SeasonalDataWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_ExecuteUbergraph_BPS19_SeasonalDataWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'BPS19_SeasonalDataWidget_C_ExecuteUbergraph_BPS19_SeasonalDataWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function BPS19_SeasonalDataWidget.BPS19_SeasonalDataWidget_C.UpdateText
// 0x0140 (0x0140 - 0x0000)
struct BPS19_SeasonalDataWidget_C_UpdateText final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0040)(HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00D8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0118(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0128(0x0018)()
};
static_assert(alignof(BPS19_SeasonalDataWidget_C_UpdateText) == 0x000008, "Wrong alignment on BPS19_SeasonalDataWidget_C_UpdateText");
static_assert(sizeof(BPS19_SeasonalDataWidget_C_UpdateText) == 0x000140, "Wrong size on BPS19_SeasonalDataWidget_C_UpdateText");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_UpdateText, Temp_byte_Variable) == 0x000000, "Member 'BPS19_SeasonalDataWidget_C_UpdateText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_UpdateText, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'BPS19_SeasonalDataWidget_C_UpdateText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_UpdateText, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'BPS19_SeasonalDataWidget_C_UpdateText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_UpdateText, K2Node_MakeArray_Array) == 0x000050, "Member 'BPS19_SeasonalDataWidget_C_UpdateText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_UpdateText, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BPS19_SeasonalDataWidget_C_UpdateText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_UpdateText, CallFunc_Format_ReturnValue) == 0x000068, "Member 'BPS19_SeasonalDataWidget_C_UpdateText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_UpdateText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'BPS19_SeasonalDataWidget_C_UpdateText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_UpdateText, Temp_byte_Variable_1) == 0x0000C0, "Member 'BPS19_SeasonalDataWidget_C_UpdateText::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_UpdateText, Temp_bool_Variable) == 0x0000C1, "Member 'BPS19_SeasonalDataWidget_C_UpdateText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_UpdateText, K2Node_Select_Default) == 0x0000C2, "Member 'BPS19_SeasonalDataWidget_C_UpdateText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_UpdateText, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000C8, "Member 'BPS19_SeasonalDataWidget_C_UpdateText::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_UpdateText, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000D0, "Member 'BPS19_SeasonalDataWidget_C_UpdateText::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_UpdateText, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000D8, "Member 'BPS19_SeasonalDataWidget_C_UpdateText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_UpdateText, K2Node_MakeArray_Array_1) == 0x000118, "Member 'BPS19_SeasonalDataWidget_C_UpdateText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPS19_SeasonalDataWidget_C_UpdateText, CallFunc_Format_ReturnValue_1) == 0x000128, "Member 'BPS19_SeasonalDataWidget_C_UpdateText::CallFunc_Format_ReturnValue_1' has a wrong offset!");

}

