#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS19_HoldableCloseButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS19_HoldableCloseButton.BPS19_HoldableCloseButton_C
// 0x0090 (0x0FC0 - 0x0F30)
class UBPS19_HoldableCloseButton_C final : public UFortHoldableButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0F38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoldCompleted;                                     // 0x0F40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoldProgress;                                      // 0x0F48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_GamepadProgress;                             // 0x0F58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Input;                                     // 0x0F60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_50;                                    // 0x0F68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Height;                                    // 0x0F70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_KBM;                                       // 0x0F78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextButton_Text;                                   // 0x0F80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x0F88(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         In_Min_Desired_Width;                              // 0x0FA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         In_Min_Desired_Height;                             // 0x0FA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Hold_Completed;                                    // 0x0FA8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnHoldCompleted();
	void BP_OnHoldDecreased(const float HoldPercentage);
	void BP_OnHoldEnded(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHoldIncreased(const float HoldPercentage);
	void BP_OnHoldReset();
	void BP_OnHoldStarted(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHovered();
	void BP_OnPressed();
	void BP_OnUnhovered();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_BPS19_HoldableCloseButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Update_style(bool Using_Gamepad);
	void UpdateTextAndStyle(ECommonInputType Input_Type);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS19_HoldableCloseButton_C">();
	}
	static class UBPS19_HoldableCloseButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS19_HoldableCloseButton_C>();
	}
};
static_assert(alignof(UBPS19_HoldableCloseButton_C) == 0x000010, "Wrong alignment on UBPS19_HoldableCloseButton_C");
static_assert(sizeof(UBPS19_HoldableCloseButton_C) == 0x000FC0, "Wrong size on UBPS19_HoldableCloseButton_C");
static_assert(offsetof(UBPS19_HoldableCloseButton_C, UberGraphFrame) == 0x000F30, "Member 'UBPS19_HoldableCloseButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS19_HoldableCloseButton_C, Hover) == 0x000F38, "Member 'UBPS19_HoldableCloseButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UBPS19_HoldableCloseButton_C, HoldCompleted) == 0x000F40, "Member 'UBPS19_HoldableCloseButton_C::HoldCompleted' has a wrong offset!");
static_assert(offsetof(UBPS19_HoldableCloseButton_C, HoldProgress) == 0x000F48, "Member 'UBPS19_HoldableCloseButton_C::HoldProgress' has a wrong offset!");
static_assert(offsetof(UBPS19_HoldableCloseButton_C, Image_Background) == 0x000F50, "Member 'UBPS19_HoldableCloseButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UBPS19_HoldableCloseButton_C, Image_GamepadProgress) == 0x000F58, "Member 'UBPS19_HoldableCloseButton_C::Image_GamepadProgress' has a wrong offset!");
static_assert(offsetof(UBPS19_HoldableCloseButton_C, Overlay_Input) == 0x000F60, "Member 'UBPS19_HoldableCloseButton_C::Overlay_Input' has a wrong offset!");
static_assert(offsetof(UBPS19_HoldableCloseButton_C, ProgressBar_50) == 0x000F68, "Member 'UBPS19_HoldableCloseButton_C::ProgressBar_50' has a wrong offset!");
static_assert(offsetof(UBPS19_HoldableCloseButton_C, SizeBox_Height) == 0x000F70, "Member 'UBPS19_HoldableCloseButton_C::SizeBox_Height' has a wrong offset!");
static_assert(offsetof(UBPS19_HoldableCloseButton_C, SizeBox_KBM) == 0x000F78, "Member 'UBPS19_HoldableCloseButton_C::SizeBox_KBM' has a wrong offset!");
static_assert(offsetof(UBPS19_HoldableCloseButton_C, TextButton_Text) == 0x000F80, "Member 'UBPS19_HoldableCloseButton_C::TextButton_Text' has a wrong offset!");
static_assert(offsetof(UBPS19_HoldableCloseButton_C, In_Text) == 0x000F88, "Member 'UBPS19_HoldableCloseButton_C::In_Text' has a wrong offset!");
static_assert(offsetof(UBPS19_HoldableCloseButton_C, In_Min_Desired_Width) == 0x000FA0, "Member 'UBPS19_HoldableCloseButton_C::In_Min_Desired_Width' has a wrong offset!");
static_assert(offsetof(UBPS19_HoldableCloseButton_C, In_Min_Desired_Height) == 0x000FA4, "Member 'UBPS19_HoldableCloseButton_C::In_Min_Desired_Height' has a wrong offset!");
static_assert(offsetof(UBPS19_HoldableCloseButton_C, Hold_Completed) == 0x000FA8, "Member 'UBPS19_HoldableCloseButton_C::Hold_Completed' has a wrong offset!");

}

