#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS19_LandingPage_SmallButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "BattlePassBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS19_LandingPage_SmallButton.BPS19_LandingPage_SmallButton_C
// 0x00E0 (0x1020 - 0x0F40)
class UBPS19_LandingPage_SmallButton_C final : public UBattlePassLandingPageButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0F48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       burst;                                             // 0x0F50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected_large;                                    // 0x0F58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_57;                                          // 0x0F60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_material;                                    // 0x0F68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_selected_LR;                                 // 0x0F70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_selected_TB;                                 // 0x0F78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shine;                                       // 0x0F80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_BP;                                        // 0x0F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Subtitle;                                     // 0x0F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x0FA0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            In_Color_and_Opacity;                              // 0x0FB8(0x0014)(Edit, BlueprintVisible, ExposeOnSpawn)
	uint8                                         Pad_FCC[0x4];                                      // 0x0FCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0FD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Show_BP_icon;                                      // 0x0FD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_FD9[0x7];                                      // 0x0FD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   In_SubText;                                        // 0x0FE0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Empty;                                             // 0x0FF8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Title_Font_Size;                                   // 0x1010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_BPS19_LandingPage_SmallButton(int32 EntryPoint);
	void OnInitialized();
	void play_intro();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS19_LandingPage_SmallButton_C">();
	}
	static class UBPS19_LandingPage_SmallButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS19_LandingPage_SmallButton_C>();
	}
};
static_assert(alignof(UBPS19_LandingPage_SmallButton_C) == 0x000010, "Wrong alignment on UBPS19_LandingPage_SmallButton_C");
static_assert(sizeof(UBPS19_LandingPage_SmallButton_C) == 0x001020, "Wrong size on UBPS19_LandingPage_SmallButton_C");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, UberGraphFrame) == 0x000F40, "Member 'UBPS19_LandingPage_SmallButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, Intro) == 0x000F48, "Member 'UBPS19_LandingPage_SmallButton_C::Intro' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, burst) == 0x000F50, "Member 'UBPS19_LandingPage_SmallButton_C::burst' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, Selected_large) == 0x000F58, "Member 'UBPS19_LandingPage_SmallButton_C::Selected_large' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, Image_57) == 0x000F60, "Member 'UBPS19_LandingPage_SmallButton_C::Image_57' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, Image_material) == 0x000F68, "Member 'UBPS19_LandingPage_SmallButton_C::Image_material' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, Image_selected_LR) == 0x000F70, "Member 'UBPS19_LandingPage_SmallButton_C::Image_selected_LR' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, Image_selected_TB) == 0x000F78, "Member 'UBPS19_LandingPage_SmallButton_C::Image_selected_TB' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, Image_Shine) == 0x000F80, "Member 'UBPS19_LandingPage_SmallButton_C::Image_Shine' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, SizeBox_BP) == 0x000F88, "Member 'UBPS19_LandingPage_SmallButton_C::SizeBox_BP' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, Text_Subtitle) == 0x000F90, "Member 'UBPS19_LandingPage_SmallButton_C::Text_Subtitle' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, Text_Title) == 0x000F98, "Member 'UBPS19_LandingPage_SmallButton_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, In_Text) == 0x000FA0, "Member 'UBPS19_LandingPage_SmallButton_C::In_Text' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, In_Color_and_Opacity) == 0x000FB8, "Member 'UBPS19_LandingPage_SmallButton_C::In_Color_and_Opacity' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, Material) == 0x000FD0, "Member 'UBPS19_LandingPage_SmallButton_C::Material' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, Show_BP_icon) == 0x000FD8, "Member 'UBPS19_LandingPage_SmallButton_C::Show_BP_icon' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, In_SubText) == 0x000FE0, "Member 'UBPS19_LandingPage_SmallButton_C::In_SubText' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, Empty) == 0x000FF8, "Member 'UBPS19_LandingPage_SmallButton_C::Empty' has a wrong offset!");
static_assert(offsetof(UBPS19_LandingPage_SmallButton_C, Title_Font_Size) == 0x001010, "Member 'UBPS19_LandingPage_SmallButton_C::Title_Font_Size' has a wrong offset!");

}

