#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS19_GetAllButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS19_GetAllButton.BPS19_GetAllButton_C
// 0x0060 (0x0F10 - 0x0EB0)
class UBPS19_GetAllButton_C final : public UCommonButtonBase
{
public:
	uint8                                         Pad_EA8[0x8];                                      // 0x0EA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0EB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0EB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0EC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_34;                                          // 0x0EC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hover;                                       // 0x0ED0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   MainText;                                          // 0x0ED8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   MainText_hover;                                    // 0x0EE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_23;                                        // 0x0EE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Input;                                     // 0x0EF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0EF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Page_Complete;                                     // 0x0F00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_BPS19_GetAllButton(int32 EntryPoint);
	void Set_Text_Data(bool Page_Complete_0, int32 Starting_Page, int32 Ending_Page, int32 Cost);
	void UpdateTextAndStyle(ECommonInputType Input_Type);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS19_GetAllButton_C">();
	}
	static class UBPS19_GetAllButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS19_GetAllButton_C>();
	}
};
static_assert(alignof(UBPS19_GetAllButton_C) == 0x000010, "Wrong alignment on UBPS19_GetAllButton_C");
static_assert(sizeof(UBPS19_GetAllButton_C) == 0x000F10, "Wrong size on UBPS19_GetAllButton_C");
static_assert(offsetof(UBPS19_GetAllButton_C, UberGraphFrame) == 0x000EB0, "Member 'UBPS19_GetAllButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS19_GetAllButton_C, Hover) == 0x000EB8, "Member 'UBPS19_GetAllButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UBPS19_GetAllButton_C, Image) == 0x000EC0, "Member 'UBPS19_GetAllButton_C::Image' has a wrong offset!");
static_assert(offsetof(UBPS19_GetAllButton_C, Image_34) == 0x000EC8, "Member 'UBPS19_GetAllButton_C::Image_34' has a wrong offset!");
static_assert(offsetof(UBPS19_GetAllButton_C, Image_Hover) == 0x000ED0, "Member 'UBPS19_GetAllButton_C::Image_Hover' has a wrong offset!");
static_assert(offsetof(UBPS19_GetAllButton_C, MainText) == 0x000ED8, "Member 'UBPS19_GetAllButton_C::MainText' has a wrong offset!");
static_assert(offsetof(UBPS19_GetAllButton_C, MainText_hover) == 0x000EE0, "Member 'UBPS19_GetAllButton_C::MainText_hover' has a wrong offset!");
static_assert(offsetof(UBPS19_GetAllButton_C, Overlay_23) == 0x000EE8, "Member 'UBPS19_GetAllButton_C::Overlay_23' has a wrong offset!");
static_assert(offsetof(UBPS19_GetAllButton_C, Overlay_Input) == 0x000EF0, "Member 'UBPS19_GetAllButton_C::Overlay_Input' has a wrong offset!");
static_assert(offsetof(UBPS19_GetAllButton_C, SizeBox_0) == 0x000EF8, "Member 'UBPS19_GetAllButton_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UBPS19_GetAllButton_C, Page_Complete) == 0x000F00, "Member 'UBPS19_GetAllButton_C::Page_Complete' has a wrong offset!");

}

