#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS19_BattlePassTile

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "BattlePassBase_structs.hpp"


namespace SDK::Params
{

// Function BPS19_BattlePassTile.BPS19_BattlePassTile_C.BP_OnHoldEnded
// 0x0008 (0x0008 - 0x0000)
struct BPS19_BattlePassTile_C_BP_OnHoldEnded final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInUseSecondaryHoldAnimation;                      // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_BattlePassTile_C_BP_OnHoldEnded) == 0x000004, "Wrong alignment on BPS19_BattlePassTile_C_BP_OnHoldEnded");
static_assert(sizeof(BPS19_BattlePassTile_C_BP_OnHoldEnded) == 0x000008, "Wrong size on BPS19_BattlePassTile_C_BP_OnHoldEnded");
static_assert(offsetof(BPS19_BattlePassTile_C_BP_OnHoldEnded, HoldPercentage) == 0x000000, "Member 'BPS19_BattlePassTile_C_BP_OnHoldEnded::HoldPercentage' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_BP_OnHoldEnded, bInUseSecondaryHoldAnimation) == 0x000004, "Member 'BPS19_BattlePassTile_C_BP_OnHoldEnded::bInUseSecondaryHoldAnimation' has a wrong offset!");

// Function BPS19_BattlePassTile.BPS19_BattlePassTile_C.BP_OnHoldStarted
// 0x0008 (0x0008 - 0x0000)
struct BPS19_BattlePassTile_C_BP_OnHoldStarted final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInUseSecondaryHoldAnimation;                      // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_BattlePassTile_C_BP_OnHoldStarted) == 0x000004, "Wrong alignment on BPS19_BattlePassTile_C_BP_OnHoldStarted");
static_assert(sizeof(BPS19_BattlePassTile_C_BP_OnHoldStarted) == 0x000008, "Wrong size on BPS19_BattlePassTile_C_BP_OnHoldStarted");
static_assert(offsetof(BPS19_BattlePassTile_C_BP_OnHoldStarted, HoldPercentage) == 0x000000, "Member 'BPS19_BattlePassTile_C_BP_OnHoldStarted::HoldPercentage' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_BP_OnHoldStarted, bInUseSecondaryHoldAnimation) == 0x000004, "Member 'BPS19_BattlePassTile_C_BP_OnHoldStarted::bInUseSecondaryHoldAnimation' has a wrong offset!");

// Function BPS19_BattlePassTile.BPS19_BattlePassTile_C.ExecuteUbergraph_BPS19_BattlePassTile
// 0x0240 (0x0240 - 0x0000)
struct BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_4;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattlePassTileAvailabilityStates             Temp_byte_Variable_2;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattlePassTileAvailabilityStates             Temp_byte_Variable_10;                             // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_16;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_17;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_6;                             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_1;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattlePassCurrencyType                       K2Node_Event_Currency;                             // 0x00A8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Price;                                // 0x00AC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasEnougCurrency;                    // 0x00B0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00B8(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsFreeTrack;                         // 0x00D9(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOwnsBattlePass;                      // 0x00DA(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_2;     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_7;                             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_3;       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_4;       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_11;                             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_5;       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattlePassTileAvailabilityStates             CallFunc_GetState_ReturnValue;                     // 0x0130(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_8;                             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_3;                           // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_4;                           // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Progress;                             // 0x0144(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_CurrentlyOwnedRewards;                // 0x0148(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NeededRewards;                        // 0x014C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattlePassTileAvailabilityStates             K2Node_Event_NewState;                             // 0x0151(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_7;                           // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_9;                             // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_10;                            // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HoldPercentage_1;                     // 0x0168(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInUseSecondaryHoldAnimation_1;       // 0x016C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HoldPercentage;                       // 0x0170(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInUseSecondaryHoldAnimation;         // 0x0174(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAffordable_ReturnValue;                 // 0x0176(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_177[0x1];                                      // 0x0177(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_8;                           // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_4;       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_5;       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_6;       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_7;       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_OwnsBattlePass;                       // 0x01A0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ParentUnlocked;                       // 0x01A1(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_HasRemainingPrerequisites;            // 0x01A2(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDelayed;                           // 0x01A3(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_9;                           // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_10;                          // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattlePassTileAvailabilityStates             Temp_byte_Variable_18;                             // 0x01A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_11;                          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_12;                          // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_11;                            // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_12;                            // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_13;                          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_14;                          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_12;                             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_15;                          // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_6;       // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_4;         // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_5;         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_6;         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile) == 0x000008, "Wrong alignment on BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile");
static_assert(sizeof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile) == 0x000240, "Wrong size on BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, EntryPoint) == 0x000000, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_bool_Variable) == 0x000004, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable) == 0x000005, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_1) == 0x000006, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_bool_Variable_1) == 0x000007, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_float_Variable) == 0x000008, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_float_Variable_1) == 0x00000C, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_bool_Variable_2) == 0x000010, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_float_Variable_2) == 0x000014, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_float_Variable_3) == 0x000018, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_bool_Variable_3) == 0x00001C, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_float_Variable_4) == 0x000020, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_float_Variable_5) == 0x000024, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_bool_Variable_4) == 0x000028, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_int_Variable) == 0x00002C, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_int_Variable_1) == 0x000030, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_2) == 0x000034, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_3) == 0x000035, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_4) == 0x000036, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_5) == 0x000037, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_bool_Variable_5) == 0x000038, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_6) == 0x000039, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_7) == 0x00003A, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_bool_Variable_6) == 0x00003B, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_8) == 0x00003C, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_9) == 0x00003D, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_10) == 0x00003E, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_11) == 0x00003F, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_12) == 0x000040, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_13) == 0x000041, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_bool_Variable_7) == 0x000042, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_14) == 0x000043, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_15) == 0x000044, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_bool_Variable_8) == 0x000045, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_bool_Variable_9) == 0x000046, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_bool_Variable_10) == 0x000047, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_16) == 0x000048, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_17) == 0x000049, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_17' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000050, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000058, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_PlayAnimationForward_ReturnValue) == 0x000060, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000068, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_float_Variable_6) == 0x000070, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_float_Variable_6' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x000078, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000080, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000088, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000090, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_GetDynamicFontMaterial_ReturnValue_1) == 0x000098, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_GetDynamicFontMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000A0, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_Currency) == 0x0000A8, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_Currency' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_Price) == 0x0000AC, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_Price' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_bHasEnougCurrency) == 0x0000B0, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_bHasEnougCurrency' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_Conv_IntToText_ReturnValue) == 0x0000B8, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000D1, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Select_Default) == 0x0000D4, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_SwitchEnum_CmpSuccess) == 0x0000D8, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_bIsFreeTrack) == 0x0000D9, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_bIsFreeTrack' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_bOwnsBattlePass) == 0x0000DA, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_bOwnsBattlePass' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_Not_PreBool_ReturnValue) == 0x0000DB, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x0000E0, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_BooleanAND_ReturnValue) == 0x0000E8, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Select_Default_1) == 0x0000E9, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Select_Default_2) == 0x0000EC, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_GetDynamicFontMaterial_ReturnValue_2) == 0x0000F0, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_GetDynamicFontMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x0000F8, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_float_Variable_7) == 0x000100, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_float_Variable_7' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_PlayAnimationReverse_ReturnValue_3) == 0x000108, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_PlayAnimationReverse_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_PlayAnimationReverse_ReturnValue_4) == 0x000110, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_PlayAnimationReverse_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000118, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_bool_Variable_11) == 0x000120, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_PlayAnimationReverse_ReturnValue_5) == 0x000128, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_PlayAnimationReverse_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_GetState_ReturnValue) == 0x000130, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_float_Variable_8) == 0x000134, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_float_Variable_8' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000138, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_BooleanAND_ReturnValue_1) == 0x000139, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Select_Default_3) == 0x00013C, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Select_Default_4) == 0x000140, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_Progress) == 0x000144, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_Progress' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_CurrentlyOwnedRewards) == 0x000148, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_CurrentlyOwnedRewards' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_NeededRewards) == 0x00014C, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_NeededRewards' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_Greater_IntInt_ReturnValue) == 0x000150, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_NewState) == 0x000151, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Select_Default_5) == 0x000152, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Select_Default_6) == 0x000153, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Select_Default_7) == 0x000154, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_SwitchEnum_CmpSuccess_1) == 0x000155, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000158, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_float_Variable_9) == 0x000160, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_float_Variable_9' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_float_Variable_10) == 0x000164, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_float_Variable_10' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_HoldPercentage_1) == 0x000168, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_HoldPercentage_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_bInUseSecondaryHoldAnimation_1) == 0x00016C, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_bInUseSecondaryHoldAnimation_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_HoldPercentage) == 0x000170, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_HoldPercentage' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_bInUseSecondaryHoldAnimation) == 0x000174, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_bInUseSecondaryHoldAnimation' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000175, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_IsAffordable_ReturnValue) == 0x000176, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_IsAffordable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Select_Default_8) == 0x000178, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_PlayAnimationForward_ReturnValue_4) == 0x000180, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_PlayAnimationForward_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_PlayAnimationForward_ReturnValue_5) == 0x000188, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_PlayAnimationForward_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_PlayAnimationForward_ReturnValue_6) == 0x000190, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_PlayAnimationForward_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_PlayAnimationForward_ReturnValue_7) == 0x000198, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_PlayAnimationForward_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_OwnsBattlePass) == 0x0001A0, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_OwnsBattlePass' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_ParentUnlocked) == 0x0001A1, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_ParentUnlocked' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_HasRemainingPrerequisites) == 0x0001A2, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_HasRemainingPrerequisites' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Event_bIsDelayed) == 0x0001A3, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Event_bIsDelayed' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Select_Default_9) == 0x0001A4, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Select_Default_10) == 0x0001A5, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Select_Default_10' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, CallFunc_BooleanAND_ReturnValue_2) == 0x0001A6, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, Temp_byte_Variable_18) == 0x0001A7, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::Temp_byte_Variable_18' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile, K2Node_Select_Default_11) == 0x0001A8, "Member 'BPS19_BattlePassTile_C_ExecuteUbergraph_BPS19_BattlePassTile::K2Node_Select_Default_11' has a wrong offset!");
