#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS19_ContextualButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPS19_ContextualButton.BPS19_ContextualButton_C.BP_OnHoldDecreased
// 0x0004 (0x0004 - 0x0000)
struct BPS19_ContextualButton_C_BP_OnHoldDecreased final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_ContextualButton_C_BP_OnHoldDecreased) == 0x000004, "Wrong alignment on BPS19_ContextualButton_C_BP_OnHoldDecreased");
static_assert(sizeof(BPS19_ContextualButton_C_BP_OnHoldDecreased) == 0x000004, "Wrong size on BPS19_ContextualButton_C_BP_OnHoldDecreased");
static_assert(offsetof(BPS19_ContextualButton_C_BP_OnHoldDecreased, HoldPercentage) == 0x000000, "Member 'BPS19_ContextualButton_C_BP_OnHoldDecreased::HoldPercentage' has a wrong offset!");

// Function BPS19_ContextualButton.BPS19_ContextualButton_C.BP_OnHoldEnded
// 0x0008 (0x0008 - 0x0000)
struct BPS19_ContextualButton_C_BP_OnHoldEnded final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInUseSecondaryHoldAnimation;                      // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_ContextualButton_C_BP_OnHoldEnded) == 0x000004, "Wrong alignment on BPS19_ContextualButton_C_BP_OnHoldEnded");
static_assert(sizeof(BPS19_ContextualButton_C_BP_OnHoldEnded) == 0x000008, "Wrong size on BPS19_ContextualButton_C_BP_OnHoldEnded");
static_assert(offsetof(BPS19_ContextualButton_C_BP_OnHoldEnded, HoldPercentage) == 0x000000, "Member 'BPS19_ContextualButton_C_BP_OnHoldEnded::HoldPercentage' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_BP_OnHoldEnded, bInUseSecondaryHoldAnimation) == 0x000004, "Member 'BPS19_ContextualButton_C_BP_OnHoldEnded::bInUseSecondaryHoldAnimation' has a wrong offset!");

// Function BPS19_ContextualButton.BPS19_ContextualButton_C.BP_OnHoldIncreased
// 0x0004 (0x0004 - 0x0000)
struct BPS19_ContextualButton_C_BP_OnHoldIncreased final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_ContextualButton_C_BP_OnHoldIncreased) == 0x000004, "Wrong alignment on BPS19_ContextualButton_C_BP_OnHoldIncreased");
static_assert(sizeof(BPS19_ContextualButton_C_BP_OnHoldIncreased) == 0x000004, "Wrong size on BPS19_ContextualButton_C_BP_OnHoldIncreased");
static_assert(offsetof(BPS19_ContextualButton_C_BP_OnHoldIncreased, HoldPercentage) == 0x000000, "Member 'BPS19_ContextualButton_C_BP_OnHoldIncreased::HoldPercentage' has a wrong offset!");

// Function BPS19_ContextualButton.BPS19_ContextualButton_C.BP_OnHoldStarted
// 0x0008 (0x0008 - 0x0000)
struct BPS19_ContextualButton_C_BP_OnHoldStarted final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInUseSecondaryHoldAnimation;                      // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_ContextualButton_C_BP_OnHoldStarted) == 0x000004, "Wrong alignment on BPS19_ContextualButton_C_BP_OnHoldStarted");
static_assert(sizeof(BPS19_ContextualButton_C_BP_OnHoldStarted) == 0x000008, "Wrong size on BPS19_ContextualButton_C_BP_OnHoldStarted");
static_assert(offsetof(BPS19_ContextualButton_C_BP_OnHoldStarted, HoldPercentage) == 0x000000, "Member 'BPS19_ContextualButton_C_BP_OnHoldStarted::HoldPercentage' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_BP_OnHoldStarted, bInUseSecondaryHoldAnimation) == 0x000004, "Member 'BPS19_ContextualButton_C_BP_OnHoldStarted::bInUseSecondaryHoldAnimation' has a wrong offset!");

// Function BPS19_ContextualButton.BPS19_ContextualButton_C.ExecuteUbergraph_BPS19_ContextualButton
// 0x0178 (0x0178 - 0x0000)
struct BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HoldPercentage_3;                     // 0x000C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInUseSecondaryHoldAnimation_1;       // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HoldPercentage_2;                     // 0x0014(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInUseSecondaryHoldAnimation;         // 0x0018(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HoldPercentage_1;                     // 0x001C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterInterface> CallFunc_SetFloatParameter_self_CastInput;         // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HoldPercentage;                       // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterInterface> CallFunc_SetFloatParameter_self_CastInput_1;       // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0088(0x0058)(HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00EC(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x0120(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton) == 0x000008, "Wrong alignment on BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton");
static_assert(sizeof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton) == 0x000178, "Wrong size on BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, EntryPoint) == 0x000000, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, Temp_byte_Variable) == 0x000004, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_IsValid_ReturnValue_1) == 0x000006, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_IsValid_ReturnValue_2) == 0x000007, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_IsValid_ReturnValue_3) == 0x000008, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_IsValid_ReturnValue_4) == 0x000009, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_IsValid_ReturnValue_5) == 0x00000A, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, K2Node_Event_HoldPercentage_3) == 0x00000C, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::K2Node_Event_HoldPercentage_3' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, K2Node_Event_bInUseSecondaryHoldAnimation_1) == 0x000010, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::K2Node_Event_bInUseSecondaryHoldAnimation_1' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, K2Node_Event_HoldPercentage_2) == 0x000014, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::K2Node_Event_HoldPercentage_2' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, K2Node_Event_bInUseSecondaryHoldAnimation) == 0x000018, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::K2Node_Event_bInUseSecondaryHoldAnimation' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000019, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, K2Node_Event_HoldPercentage_1) == 0x00001C, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::K2Node_Event_HoldPercentage_1' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_SetFloatParameter_self_CastInput) == 0x000020, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, K2Node_Event_HoldPercentage) == 0x000030, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::K2Node_Event_HoldPercentage' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_SetFloatParameter_self_CastInput_1) == 0x000038, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_SetFloatParameter_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000048, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000050, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, K2Node_Event_IsDesignTime) == 0x000058, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_GetEndTime_ReturnValue) == 0x00005C, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_GetEndTime_ReturnValue_1) == 0x000060, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000064, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000068, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00006C, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000070, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_PlayAnimation_ReturnValue) == 0x000078, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000080, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, K2Node_MakeStruct_SlateFontInfo) == 0x000088, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, Temp_byte_Variable_1) == 0x0000E0, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_MakeVector2D_ReturnValue) == 0x0000E4, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, K2Node_CreateDelegate_OutputDelegate) == 0x0000EC, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, Temp_byte_Variable_2) == 0x0000FC, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, Temp_byte_Variable_3) == 0x0000FD, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, Temp_bool_Variable) == 0x0000FE, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, K2Node_Select_Default) == 0x0000FF, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_SpawnSound2D_ReturnValue) == 0x000100, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, Temp_bool_Variable_1) == 0x000108, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000110, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, K2Node_Select_Default_1) == 0x000118, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton, K2Node_MakeStruct_SlateFontInfo_1) == 0x000120, "Member 'BPS19_ContextualButton_C_ExecuteUbergraph_BPS19_ContextualButton::K2Node_MakeStruct_SlateFontInfo_1' has a wrong offset!");

// Function BPS19_ContextualButton.BPS19_ContextualButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPS19_ContextualButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_ContextualButton_C_PreConstruct) == 0x000001, "Wrong alignment on BPS19_ContextualButton_C_PreConstruct");
static_assert(sizeof(BPS19_ContextualButton_C_PreConstruct) == 0x000001, "Wrong size on BPS19_ContextualButton_C_PreConstruct");
static_assert(offsetof(BPS19_ContextualButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPS19_ContextualButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

