#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS19_AboutModal

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS19_AboutModal.BPS19_AboutModal_C
// 0x0218 (0x0690 - 0x0478)
class UBPS19_AboutModal_C final : public UAthenaAboutModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowToonaFish;                                     // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowBattlePass;                                    // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAccolades;                                     // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowButton;                                        // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowBuyLevels;                                     // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowUp;                                            // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         Accolades;                                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BattleStars;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPS19_AboutModal_Pip_C*                BPS17_AboutModal_Pip_1;                            // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPS19_AboutModal_Pip_C*                BPS17_AboutModal_Pip_2;                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPS19_AboutModal_Pip_C*                BPS17_AboutModal_Pip_3;                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPS19_AboutModal_Pip_C*                BPS17_AboutModal_Pip_4;                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPS19_HoldableCloseButton_C*           Button_HoldCloseClick;                             // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_HoldCloseController;                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpatial_Specialbutton_C*               Button_Next;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BuyLevels;                                         // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DividerLine;                                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Pips;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HeaderColor;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderIcon;                                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HeaderMainText;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_42;                                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_265;                                         // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BigStar;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_bodyBackground;                              // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BottomLine;                                  // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MediumStar;                                  // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SmallStar;                                   // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_StarLeft;                                    // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_StarMiddle;                                  // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_StarRight;                                   // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ModalHeader;                                       // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_3;                                   // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_BigButtonBotton;                          // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Body;                                     // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Header;                                   // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Legl;                                     // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_MobileClose;                              // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_SmallButtonBotton;                        // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Body;                                      // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SubHeaderText;                                     // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                SubtextColor;                                      // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_Button;                                   // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_Content;                                  // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ToonaFIsh;                                         // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              closeAbout;                                        // 0x05F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          GoldNblack;                                        // 0x0600(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_601[0x3];                                      // 0x0601(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Height_Override;                                   // 0x0604(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Header;                                            // 0x0608(0x0018)(Edit, BlueprintVisible)
	class FText                                   SubHeader;                                         // 0x0620(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           Header_Color;                                      // 0x0638(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Subheader_Color;                                   // 0x0648(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Divider_Color;                                     // 0x0658(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Header_Icon;                                       // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowHeaderIcon;                                    // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowDividerLine;                                   // 0x0671(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowHeader;                                        // 0x0672(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          show_Header;                                       // 0x0673(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AboutModalAudio;                                   // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Show_trailer;                                      // 0x0680(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__BPS17_AboutModal_Pip_1_K2Node_ComponentBoundEvent_6_ClickedOnPip__DelegateSignature();
	void BndEvt__BPS17_AboutModal_Pip_2_K2Node_ComponentBoundEvent_7_ClickedOnPip__DelegateSignature();
	void BndEvt__BPS17_AboutModal_Pip_3_K2Node_ComponentBoundEvent_8_ClickedOnPip__DelegateSignature();
	void BndEvt__BPS17_AboutModal_Pip_4_K2Node_ComponentBoundEvent_5_ClickedOnPip__DelegateSignature();
	void BndEvt__Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_CloseMobile_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_HoldCloseController_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__HoldableCloseButton_K2Node_ComponentBoundEvent_10_Hold_Completed__DelegateSignature();
	void BP_OnActivated();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_BPS19_AboutModal(int32 EntryPoint);
	void Play_Intro_Animation_Sound();
	void Play_open_anim();
	void PreConstruct(bool IsDesignTime);
	void Set_pips(bool Pip_1_focused, bool Pip_2_Focused, bool Pip_3_Focused, bool Pip_4_Focused);
	void Set_randomizer();
	void Set_to_page_1();
	void Set_to_Page_2();
	void Set_to_Page_3();
	void Set_to_Page_4();
	void UpdateInput(ECommonInputType Input);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS19_AboutModal_C">();
	}
	static class UBPS19_AboutModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS19_AboutModal_C>();
	}
};
static_assert(alignof(UBPS19_AboutModal_C) == 0x000008, "Wrong alignment on UBPS19_AboutModal_C");
static_assert(sizeof(UBPS19_AboutModal_C) == 0x000690, "Wrong size on UBPS19_AboutModal_C");
static_assert(offsetof(UBPS19_AboutModal_C, UberGraphFrame) == 0x000478, "Member 'UBPS19_AboutModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, ShowToonaFish) == 0x000480, "Member 'UBPS19_AboutModal_C::ShowToonaFish' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, ShowBattlePass) == 0x000488, "Member 'UBPS19_AboutModal_C::ShowBattlePass' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, ShowAccolades) == 0x000490, "Member 'UBPS19_AboutModal_C::ShowAccolades' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, ShowButton) == 0x000498, "Member 'UBPS19_AboutModal_C::ShowButton' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, ShowBuyLevels) == 0x0004A0, "Member 'UBPS19_AboutModal_C::ShowBuyLevels' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, ShowUp) == 0x0004A8, "Member 'UBPS19_AboutModal_C::ShowUp' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Accolades) == 0x0004B0, "Member 'UBPS19_AboutModal_C::Accolades' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, BattleStars) == 0x0004B8, "Member 'UBPS19_AboutModal_C::BattleStars' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, BPS17_AboutModal_Pip_1) == 0x0004C0, "Member 'UBPS19_AboutModal_C::BPS17_AboutModal_Pip_1' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, BPS17_AboutModal_Pip_2) == 0x0004C8, "Member 'UBPS19_AboutModal_C::BPS17_AboutModal_Pip_2' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, BPS17_AboutModal_Pip_3) == 0x0004D0, "Member 'UBPS19_AboutModal_C::BPS17_AboutModal_Pip_3' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, BPS17_AboutModal_Pip_4) == 0x0004D8, "Member 'UBPS19_AboutModal_C::BPS17_AboutModal_Pip_4' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Button_HoldCloseClick) == 0x0004E0, "Member 'UBPS19_AboutModal_C::Button_HoldCloseClick' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Button_HoldCloseController) == 0x0004E8, "Member 'UBPS19_AboutModal_C::Button_HoldCloseController' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Button_Next) == 0x0004F0, "Member 'UBPS19_AboutModal_C::Button_Next' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, BuyLevels) == 0x0004F8, "Member 'UBPS19_AboutModal_C::BuyLevels' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, DividerLine) == 0x000500, "Member 'UBPS19_AboutModal_C::DividerLine' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, HBox_Pips) == 0x000508, "Member 'UBPS19_AboutModal_C::HBox_Pips' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, HeaderColor) == 0x000510, "Member 'UBPS19_AboutModal_C::HeaderColor' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, HeaderIcon) == 0x000518, "Member 'UBPS19_AboutModal_C::HeaderIcon' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, HeaderMainText) == 0x000520, "Member 'UBPS19_AboutModal_C::HeaderMainText' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Image_3) == 0x000528, "Member 'UBPS19_AboutModal_C::Image_3' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Image_42) == 0x000530, "Member 'UBPS19_AboutModal_C::Image_42' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Image_265) == 0x000538, "Member 'UBPS19_AboutModal_C::Image_265' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Image_BigStar) == 0x000540, "Member 'UBPS19_AboutModal_C::Image_BigStar' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Image_bodyBackground) == 0x000548, "Member 'UBPS19_AboutModal_C::Image_bodyBackground' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Image_BottomLine) == 0x000550, "Member 'UBPS19_AboutModal_C::Image_BottomLine' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Image_MediumStar) == 0x000558, "Member 'UBPS19_AboutModal_C::Image_MediumStar' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Image_SmallStar) == 0x000560, "Member 'UBPS19_AboutModal_C::Image_SmallStar' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Image_StarLeft) == 0x000568, "Member 'UBPS19_AboutModal_C::Image_StarLeft' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Image_StarMiddle) == 0x000570, "Member 'UBPS19_AboutModal_C::Image_StarMiddle' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Image_StarRight) == 0x000578, "Member 'UBPS19_AboutModal_C::Image_StarRight' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, ModalHeader) == 0x000580, "Member 'UBPS19_AboutModal_C::ModalHeader' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, RichTextBlock_3) == 0x000588, "Member 'UBPS19_AboutModal_C::RichTextBlock_3' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, SafeZone_BigButtonBotton) == 0x000590, "Member 'UBPS19_AboutModal_C::SafeZone_BigButtonBotton' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, SafeZone_Body) == 0x000598, "Member 'UBPS19_AboutModal_C::SafeZone_Body' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, SafeZone_Header) == 0x0005A0, "Member 'UBPS19_AboutModal_C::SafeZone_Header' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, SafeZone_Legl) == 0x0005A8, "Member 'UBPS19_AboutModal_C::SafeZone_Legl' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, SafeZone_MobileClose) == 0x0005B0, "Member 'UBPS19_AboutModal_C::SafeZone_MobileClose' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, SafeZone_SmallButtonBotton) == 0x0005B8, "Member 'UBPS19_AboutModal_C::SafeZone_SmallButtonBotton' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, SizeBox_Body) == 0x0005C0, "Member 'UBPS19_AboutModal_C::SizeBox_Body' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, SubHeaderText) == 0x0005C8, "Member 'UBPS19_AboutModal_C::SubHeaderText' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, SubtextColor) == 0x0005D0, "Member 'UBPS19_AboutModal_C::SubtextColor' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Switcher_Button) == 0x0005D8, "Member 'UBPS19_AboutModal_C::Switcher_Button' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Switcher_Content) == 0x0005E0, "Member 'UBPS19_AboutModal_C::Switcher_Content' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, ToonaFIsh) == 0x0005E8, "Member 'UBPS19_AboutModal_C::ToonaFIsh' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, closeAbout) == 0x0005F0, "Member 'UBPS19_AboutModal_C::closeAbout' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, GoldNblack) == 0x000600, "Member 'UBPS19_AboutModal_C::GoldNblack' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Height_Override) == 0x000604, "Member 'UBPS19_AboutModal_C::Height_Override' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Header) == 0x000608, "Member 'UBPS19_AboutModal_C::Header' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, SubHeader) == 0x000620, "Member 'UBPS19_AboutModal_C::SubHeader' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Header_Color) == 0x000638, "Member 'UBPS19_AboutModal_C::Header_Color' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Subheader_Color) == 0x000648, "Member 'UBPS19_AboutModal_C::Subheader_Color' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Divider_Color) == 0x000658, "Member 'UBPS19_AboutModal_C::Divider_Color' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Header_Icon) == 0x000668, "Member 'UBPS19_AboutModal_C::Header_Icon' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, ShowHeaderIcon) == 0x000670, "Member 'UBPS19_AboutModal_C::ShowHeaderIcon' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, ShowDividerLine) == 0x000671, "Member 'UBPS19_AboutModal_C::ShowDividerLine' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, ShowHeader) == 0x000672, "Member 'UBPS19_AboutModal_C::ShowHeader' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, show_Header) == 0x000673, "Member 'UBPS19_AboutModal_C::show_Header' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, AboutModalAudio) == 0x000678, "Member 'UBPS19_AboutModal_C::AboutModalAudio' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_C, Show_trailer) == 0x000680, "Member 'UBPS19_AboutModal_C::Show_trailer' has a wrong offset!");

}

