#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS19_AboutModal_Pip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS19_AboutModal_Pip.BPS19_AboutModal_Pip_C
// 0x0040 (0x0EF0 - 0x0EB0)
class UBPS19_AboutModal_Pip_C final : public UCommonButtonBase
{
public:
	uint8                                         Pad_EA8[0x8];                                      // 0x0EA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0EB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0EB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x0EC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 PIP;                                               // 0x0EC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsFocused;                                         // 0x0ED0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED1[0x7];                                      // 0x0ED1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              ClickedOnPip;                                      // 0x0ED8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_BPS19_AboutModal_Pip(int32 EntryPoint);
	void Is_Focused(bool Is_Focused_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS19_AboutModal_Pip_C">();
	}
	static class UBPS19_AboutModal_Pip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS19_AboutModal_Pip_C>();
	}
};
static_assert(alignof(UBPS19_AboutModal_Pip_C) == 0x000010, "Wrong alignment on UBPS19_AboutModal_Pip_C");
static_assert(sizeof(UBPS19_AboutModal_Pip_C) == 0x000EF0, "Wrong size on UBPS19_AboutModal_Pip_C");
static_assert(offsetof(UBPS19_AboutModal_Pip_C, UberGraphFrame) == 0x000EB0, "Member 'UBPS19_AboutModal_Pip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_Pip_C, Hover) == 0x000EB8, "Member 'UBPS19_AboutModal_Pip_C::Hover' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_Pip_C, Select) == 0x000EC0, "Member 'UBPS19_AboutModal_Pip_C::Select' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_Pip_C, PIP) == 0x000EC8, "Member 'UBPS19_AboutModal_Pip_C::PIP' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_Pip_C, IsFocused) == 0x000ED0, "Member 'UBPS19_AboutModal_Pip_C::IsFocused' has a wrong offset!");
static_assert(offsetof(UBPS19_AboutModal_Pip_C, ClickedOnPip) == 0x000ED8, "Member 'UBPS19_AboutModal_Pip_C::ClickedOnPip' has a wrong offset!");

}

