#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS19_LandingPages

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPS19_LandingPages.BPS19_LandingPages_C.BndEvt__Button_BonusRewards_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_BndEvt__Button_BonusRewards_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_BndEvt__Button_BonusRewards_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_BndEvt__Button_BonusRewards_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BPS19_LandingPages_C_BndEvt__Button_BonusRewards_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BPS19_LandingPages_C_BndEvt__Button_BonusRewards_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BPS19_LandingPages_C_BndEvt__Button_BonusRewards_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS19_LandingPages_C_BndEvt__Button_BonusRewards_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.BndEvt__Button_BuyBattlePass_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_BndEvt__Button_BuyBattlePass_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_BndEvt__Button_BuyBattlePass_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_BndEvt__Button_BuyBattlePass_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BPS19_LandingPages_C_BndEvt__Button_BuyBattlePass_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BPS19_LandingPages_C_BndEvt__Button_BuyBattlePass_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BPS19_LandingPages_C_BndEvt__Button_BuyBattlePass_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS19_LandingPages_C_BndEvt__Button_BuyBattlePass_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.BndEvt__Button_CharacterCustomizer_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_BndEvt__Button_CharacterCustomizer_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_BndEvt__Button_CharacterCustomizer_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_BndEvt__Button_CharacterCustomizer_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BPS19_LandingPages_C_BndEvt__Button_CharacterCustomizer_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BPS19_LandingPages_C_BndEvt__Button_CharacterCustomizer_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BPS19_LandingPages_C_BndEvt__Button_CharacterCustomizer_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS19_LandingPages_C_BndEvt__Button_CharacterCustomizer_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.BndEvt__Button_GiftBattlePass_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_BndEvt__Button_GiftBattlePass_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_BndEvt__Button_GiftBattlePass_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_BndEvt__Button_GiftBattlePass_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BPS19_LandingPages_C_BndEvt__Button_GiftBattlePass_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BPS19_LandingPages_C_BndEvt__Button_GiftBattlePass_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BPS19_LandingPages_C_BndEvt__Button_GiftBattlePass_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS19_LandingPages_C_BndEvt__Button_GiftBattlePass_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.BndEvt__Button_JoinSubscription_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_BndEvt__Button_JoinSubscription_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_BndEvt__Button_JoinSubscription_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_BndEvt__Button_JoinSubscription_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BPS19_LandingPages_C_BndEvt__Button_JoinSubscription_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BPS19_LandingPages_C_BndEvt__Button_JoinSubscription_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BPS19_LandingPages_C_BndEvt__Button_JoinSubscription_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS19_LandingPages_C_BndEvt__Button_JoinSubscription_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.BndEvt__Button_MysteryRewards_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_BndEvt__Button_MysteryRewards_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_BndEvt__Button_MysteryRewards_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_BndEvt__Button_MysteryRewards_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BPS19_LandingPages_C_BndEvt__Button_MysteryRewards_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BPS19_LandingPages_C_BndEvt__Button_MysteryRewards_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BPS19_LandingPages_C_BndEvt__Button_MysteryRewards_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS19_LandingPages_C_BndEvt__Button_MysteryRewards_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.BndEvt__Button_Quests_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_BndEvt__Button_Quests_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_BndEvt__Button_Quests_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_BndEvt__Button_Quests_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BPS19_LandingPages_C_BndEvt__Button_Quests_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BPS19_LandingPages_C_BndEvt__Button_Quests_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BPS19_LandingPages_C_BndEvt__Button_Quests_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS19_LandingPages_C_BndEvt__Button_Quests_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.BndEvt__Button_RewardOverview_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_BndEvt__Button_RewardOverview_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_BndEvt__Button_RewardOverview_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_BndEvt__Button_RewardOverview_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BPS19_LandingPages_C_BndEvt__Button_RewardOverview_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BPS19_LandingPages_C_BndEvt__Button_RewardOverview_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BPS19_LandingPages_C_BndEvt__Button_RewardOverview_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS19_LandingPages_C_BndEvt__Button_RewardOverview_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.Button_BonusRewards_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_Button_BonusRewards_Event_0 final
{
public:
	class UBPS19_LandingPageButton_C*             Button_BonusRewards_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_Button_BonusRewards_Event_0) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_Button_BonusRewards_Event_0");
static_assert(sizeof(BPS19_LandingPages_C_Button_BonusRewards_Event_0) == 0x000008, "Wrong size on BPS19_LandingPages_C_Button_BonusRewards_Event_0");
static_assert(offsetof(BPS19_LandingPages_C_Button_BonusRewards_Event_0, Button_BonusRewards_0) == 0x000000, "Member 'BPS19_LandingPages_C_Button_BonusRewards_Event_0::Button_BonusRewards_0' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.Button_BuyBattlePass_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_Button_BuyBattlePass_Event_0 final
{
public:
	class UBPS19_LandingPage_SmallButton_C*       Button_BuyBattlePass_0;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_Button_BuyBattlePass_Event_0) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_Button_BuyBattlePass_Event_0");
static_assert(sizeof(BPS19_LandingPages_C_Button_BuyBattlePass_Event_0) == 0x000008, "Wrong size on BPS19_LandingPages_C_Button_BuyBattlePass_Event_0");
static_assert(offsetof(BPS19_LandingPages_C_Button_BuyBattlePass_Event_0, Button_BuyBattlePass_0) == 0x000000, "Member 'BPS19_LandingPages_C_Button_BuyBattlePass_Event_0::Button_BuyBattlePass_0' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.Button_BuyResources_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_Button_BuyResources_Event_0 final
{
public:
	class UBPS19_LandingPage_SmallButton_C*       Button_BuyResources_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_Button_BuyResources_Event_0) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_Button_BuyResources_Event_0");
static_assert(sizeof(BPS19_LandingPages_C_Button_BuyResources_Event_0) == 0x000008, "Wrong size on BPS19_LandingPages_C_Button_BuyResources_Event_0");
static_assert(offsetof(BPS19_LandingPages_C_Button_BuyResources_Event_0, Button_BuyResources_0) == 0x000000, "Member 'BPS19_LandingPages_C_Button_BuyResources_Event_0::Button_BuyResources_0' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.Button_CharacterCustomizer_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_Button_CharacterCustomizer_Event_0 final
{
public:
	class UBPS19_LandingPageButton_C*             Button_CharacterCustomizer_0;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_Button_CharacterCustomizer_Event_0) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_Button_CharacterCustomizer_Event_0");
static_assert(sizeof(BPS19_LandingPages_C_Button_CharacterCustomizer_Event_0) == 0x000008, "Wrong size on BPS19_LandingPages_C_Button_CharacterCustomizer_Event_0");
static_assert(offsetof(BPS19_LandingPages_C_Button_CharacterCustomizer_Event_0, Button_CharacterCustomizer_0) == 0x000000, "Member 'BPS19_LandingPages_C_Button_CharacterCustomizer_Event_0::Button_CharacterCustomizer_0' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.Button_GiftBattlePass_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_Button_GiftBattlePass_Event_0 final
{
public:
	class UBPS19_LandingPage_SmallButton_C*       Button_GiftBattlePass_0;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_Button_GiftBattlePass_Event_0) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_Button_GiftBattlePass_Event_0");
static_assert(sizeof(BPS19_LandingPages_C_Button_GiftBattlePass_Event_0) == 0x000008, "Wrong size on BPS19_LandingPages_C_Button_GiftBattlePass_Event_0");
static_assert(offsetof(BPS19_LandingPages_C_Button_GiftBattlePass_Event_0, Button_GiftBattlePass_0) == 0x000000, "Member 'BPS19_LandingPages_C_Button_GiftBattlePass_Event_0::Button_GiftBattlePass_0' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.Button_JoinSubscription_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_Button_JoinSubscription_Event_0 final
{
public:
	class UBPS19_LandingPageButton_C*             Button_JoinSubscription_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_Button_JoinSubscription_Event_0) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_Button_JoinSubscription_Event_0");
static_assert(sizeof(BPS19_LandingPages_C_Button_JoinSubscription_Event_0) == 0x000008, "Wrong size on BPS19_LandingPages_C_Button_JoinSubscription_Event_0");
static_assert(offsetof(BPS19_LandingPages_C_Button_JoinSubscription_Event_0, Button_JoinSubscription_0) == 0x000000, "Member 'BPS19_LandingPages_C_Button_JoinSubscription_Event_0::Button_JoinSubscription_0' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.Button_MysteryRewards_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_Button_MysteryRewards_Event_0 final
{
public:
	class UBPS19_LandingPageButton_C*             Button_MysteryRewards;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_Button_MysteryRewards_Event_0) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_Button_MysteryRewards_Event_0");
static_assert(sizeof(BPS19_LandingPages_C_Button_MysteryRewards_Event_0) == 0x000008, "Wrong size on BPS19_LandingPages_C_Button_MysteryRewards_Event_0");
static_assert(offsetof(BPS19_LandingPages_C_Button_MysteryRewards_Event_0, Button_MysteryRewards) == 0x000000, "Member 'BPS19_LandingPages_C_Button_MysteryRewards_Event_0::Button_MysteryRewards' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.Button_RewardOverview_Event_2
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_Button_RewardOverview_Event_2 final
{
public:
	class UBPS19_LandingPageButton_C*             Button_RewardOverview;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_Button_RewardOverview_Event_2) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_Button_RewardOverview_Event_2");
static_assert(sizeof(BPS19_LandingPages_C_Button_RewardOverview_Event_2) == 0x000008, "Wrong size on BPS19_LandingPages_C_Button_RewardOverview_Event_2");
static_assert(offsetof(BPS19_LandingPages_C_Button_RewardOverview_Event_2, Button_RewardOverview) == 0x000000, "Member 'BPS19_LandingPages_C_Button_RewardOverview_Event_2::Button_RewardOverview' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.ExecuteUbergraph_BPS19_LandingPages
// 0x00F0 (0x00F0 - 0x0000)
struct BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortBattlePassContext*                 CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPS19_LandingPageButton_C*             K2Node_CustomEvent_Button_JoinSubscription;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPurchaseBattlePassLevel_ReturnValue;   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS19_LandingPage_SmallButton_C*       K2Node_CustomEvent_Button_BuyResources;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS19_LandingPage_SmallButton_C*       K2Node_CustomEvent_Button_GiftBattlePass;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPS19_LandingPage_SmallButton_C*       K2Node_CustomEvent_Button_BuyBattlePass;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_7;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_6;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPS19_LandingPageButton_C*             K2Node_CustomEvent_Button_BonusRewards;            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_BPComplete;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS19_LandingPageButton_C*             K2Node_DynamicCast_AsBPS19_Landing_Page_Button;    // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS19_LandingPageButton_C*             K2Node_CustomEvent_Button_MysteryRewards;          // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Level;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bGiftingAllowed;                      // 0x00B4(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSubscriptionAllowed;                 // 0x00B5(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Delayed;                        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS19_LandingPageButton_C*             K2Node_DynamicCast_AsBPS19_Landing_Page_Button_1;  // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS19_LandingPageButton_C*             K2Node_DynamicCast_AsBPS19_Landing_Page_Button_2;  // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SkinAcquired;                   // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS19_LandingPageButton_C*             K2Node_CustomEvent_Button_CharacterCustomizer;     // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPS19_LandingPageButton_C*             K2Node_CustomEvent_Button_RewardOverview;          // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages");
static_assert(sizeof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages) == 0x0000F0, "Wrong size on BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, EntryPoint) == 0x000000, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, Temp_bool_Variable) == 0x000004, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, Temp_byte_Variable) == 0x000005, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, Temp_byte_Variable_1) == 0x000006, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, Temp_bool_Variable_1) == 0x000007, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, Temp_byte_Variable_2) == 0x000008, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, Temp_byte_Variable_3) == 0x000009, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, Temp_bool_Variable_2) == 0x00000A, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, Temp_byte_Variable_4) == 0x00000B, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, Temp_byte_Variable_5) == 0x00000C, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_CustomEvent_Button_JoinSubscription) == 0x000018, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_CustomEvent_Button_JoinSubscription' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, CallFunc_CanPurchaseBattlePassLevel_ReturnValue) == 0x000020, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::CallFunc_CanPurchaseBattlePassLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_CustomEvent_Button_BuyResources) == 0x000028, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_CustomEvent_Button_BuyResources' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_Select_Default) == 0x000030, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_CustomEvent_Button_GiftBattlePass) == 0x000038, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_CustomEvent_Button_GiftBattlePass' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_CustomEvent_Button_BuyBattlePass) == 0x000040, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_CustomEvent_Button_BuyBattlePass' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_ComponentBoundEvent_Button_7) == 0x000048, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_ComponentBoundEvent_Button_7' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_ComponentBoundEvent_Button_6) == 0x000050, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_ComponentBoundEvent_Button_5) == 0x000058, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_ComponentBoundEvent_Button_4) == 0x000060, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_ComponentBoundEvent_Button_3) == 0x000068, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_ComponentBoundEvent_Button_2) == 0x000070, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_ComponentBoundEvent_Button_1) == 0x000078, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_ComponentBoundEvent_Button) == 0x000080, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_CustomEvent_Button_BonusRewards) == 0x000088, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_CustomEvent_Button_BonusRewards' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_CustomEvent_BPComplete) == 0x000090, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_CustomEvent_BPComplete' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, CallFunc_Not_PreBool_ReturnValue) == 0x000091, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_DynamicCast_AsBPS19_Landing_Page_Button) == 0x000098, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_DynamicCast_AsBPS19_Landing_Page_Button' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_CustomEvent_Button_MysteryRewards) == 0x0000A8, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_CustomEvent_Button_MysteryRewards' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_CustomEvent_Level) == 0x0000B0, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_CustomEvent_Level' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_Event_bGiftingAllowed) == 0x0000B4, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_Event_bGiftingAllowed' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_Event_bSubscriptionAllowed) == 0x0000B5, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_Event_bSubscriptionAllowed' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_Select_Default_1) == 0x0000B6, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_Select_Default_2) == 0x0000B7, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_CustomEvent_Delayed) == 0x0000B8, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_CustomEvent_Delayed' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_DynamicCast_AsBPS19_Landing_Page_Button_1) == 0x0000C0, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_DynamicCast_AsBPS19_Landing_Page_Button_1' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_DynamicCast_AsBPS19_Landing_Page_Button_2) == 0x0000D0, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_DynamicCast_AsBPS19_Landing_Page_Button_2' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_DynamicCast_bSuccess_2) == 0x0000D8, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_CustomEvent_SkinAcquired) == 0x0000D9, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_CustomEvent_SkinAcquired' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_CustomEvent_Button_CharacterCustomizer) == 0x0000E0, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_CustomEvent_Button_CharacterCustomizer' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages, K2Node_CustomEvent_Button_RewardOverview) == 0x0000E8, "Member 'BPS19_LandingPages_C_ExecuteUbergraph_BPS19_LandingPages::K2Node_CustomEvent_Button_RewardOverview' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.On BattlePass completed
// 0x0001 (0x0001 - 0x0000)
struct BPS19_LandingPages_C_On_BattlePass_completed final
{
public:
	bool                                          BPComplete;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_On_BattlePass_completed) == 0x000001, "Wrong alignment on BPS19_LandingPages_C_On_BattlePass_completed");
static_assert(sizeof(BPS19_LandingPages_C_On_BattlePass_completed) == 0x000001, "Wrong size on BPS19_LandingPages_C_On_BattlePass_completed");
static_assert(offsetof(BPS19_LandingPages_C_On_BattlePass_completed, BPComplete) == 0x000000, "Member 'BPS19_LandingPages_C_On_BattlePass_completed::BPComplete' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.On Level Changed
// 0x0004 (0x0004 - 0x0000)
struct BPS19_LandingPages_C_On_Level_Changed final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_On_Level_Changed) == 0x000004, "Wrong alignment on BPS19_LandingPages_C_On_Level_Changed");
static_assert(sizeof(BPS19_LandingPages_C_On_Level_Changed) == 0x000004, "Wrong size on BPS19_LandingPages_C_On_Level_Changed");
static_assert(offsetof(BPS19_LandingPages_C_On_Level_Changed, Level) == 0x000000, "Member 'BPS19_LandingPages_C_On_Level_Changed::Level' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.OnBattlePassGiftingAllowed
// 0x0001 (0x0001 - 0x0000)
struct BPS19_LandingPages_C_OnBattlePassGiftingAllowed final
{
public:
	bool                                          bGiftingAllowed;                                   // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_OnBattlePassGiftingAllowed) == 0x000001, "Wrong alignment on BPS19_LandingPages_C_OnBattlePassGiftingAllowed");
static_assert(sizeof(BPS19_LandingPages_C_OnBattlePassGiftingAllowed) == 0x000001, "Wrong size on BPS19_LandingPages_C_OnBattlePassGiftingAllowed");
static_assert(offsetof(BPS19_LandingPages_C_OnBattlePassGiftingAllowed, bGiftingAllowed) == 0x000000, "Member 'BPS19_LandingPages_C_OnBattlePassGiftingAllowed::bGiftingAllowed' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.OnBattlePassSubscriptionAllowed
// 0x0001 (0x0001 - 0x0000)
struct BPS19_LandingPages_C_OnBattlePassSubscriptionAllowed final
{
public:
	bool                                          bSubscriptionAllowed;                              // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_OnBattlePassSubscriptionAllowed) == 0x000001, "Wrong alignment on BPS19_LandingPages_C_OnBattlePassSubscriptionAllowed");
static_assert(sizeof(BPS19_LandingPages_C_OnBattlePassSubscriptionAllowed) == 0x000001, "Wrong size on BPS19_LandingPages_C_OnBattlePassSubscriptionAllowed");
static_assert(offsetof(BPS19_LandingPages_C_OnBattlePassSubscriptionAllowed, bSubscriptionAllowed) == 0x000000, "Member 'BPS19_LandingPages_C_OnBattlePassSubscriptionAllowed::bSubscriptionAllowed' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.play intro
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_play_intro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_play_intro) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_play_intro");
static_assert(sizeof(BPS19_LandingPages_C_play_intro) == 0x000008, "Wrong size on BPS19_LandingPages_C_play_intro");
static_assert(offsetof(BPS19_LandingPages_C_play_intro, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'BPS19_LandingPages_C_play_intro::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.SequenceEvent__ENTRYPOINTBPS19_LandingPages_0
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_0 final
{
public:
	class UBPS19_LandingPageButton_C*             Button_RewardOverview;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_0) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_0");
static_assert(sizeof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_0) == 0x000008, "Wrong size on BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_0");
static_assert(offsetof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_0, Button_RewardOverview) == 0x000000, "Member 'BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_0::Button_RewardOverview' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.SequenceEvent__ENTRYPOINTBPS19_LandingPages_1
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_1 final
{
public:
	class UBPS19_LandingPageButton_C*             Button_CharacterCustomizer_0;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_1) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_1");
static_assert(sizeof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_1) == 0x000008, "Wrong size on BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_1");
static_assert(offsetof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_1, Button_CharacterCustomizer_0) == 0x000000, "Member 'BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_1::Button_CharacterCustomizer_0' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.SequenceEvent__ENTRYPOINTBPS19_LandingPages_2
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_2 final
{
public:
	class UBPS19_LandingPageButton_C*             Button_MysteryRewards;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_2) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_2");
static_assert(sizeof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_2) == 0x000008, "Wrong size on BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_2");
static_assert(offsetof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_2, Button_MysteryRewards) == 0x000000, "Member 'BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_2::Button_MysteryRewards' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.SequenceEvent__ENTRYPOINTBPS19_LandingPages_3
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_3 final
{
public:
	class UBPS19_LandingPageButton_C*             Button_BonusRewards_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_3) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_3");
static_assert(sizeof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_3) == 0x000008, "Wrong size on BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_3");
static_assert(offsetof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_3, Button_BonusRewards_0) == 0x000000, "Member 'BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_3::Button_BonusRewards_0' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.SequenceEvent__ENTRYPOINTBPS19_LandingPages_4
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_4 final
{
public:
	class UBPS19_LandingPageButton_C*             Button_JoinSubscription_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_4) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_4");
static_assert(sizeof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_4) == 0x000008, "Wrong size on BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_4");
static_assert(offsetof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_4, Button_JoinSubscription_0) == 0x000000, "Member 'BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_4::Button_JoinSubscription_0' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.SequenceEvent__ENTRYPOINTBPS19_LandingPages_5
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_5 final
{
public:
	class UBPS19_LandingPage_SmallButton_C*       Button_BuyResources_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_5) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_5");
static_assert(sizeof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_5) == 0x000008, "Wrong size on BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_5");
static_assert(offsetof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_5, Button_BuyResources_0) == 0x000000, "Member 'BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_5::Button_BuyResources_0' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.SequenceEvent__ENTRYPOINTBPS19_LandingPages_6
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_6 final
{
public:
	class UBPS19_LandingPage_SmallButton_C*       Button_GiftBattlePass_0;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_6) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_6");
static_assert(sizeof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_6) == 0x000008, "Wrong size on BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_6");
static_assert(offsetof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_6, Button_GiftBattlePass_0) == 0x000000, "Member 'BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_6::Button_GiftBattlePass_0' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.SequenceEvent__ENTRYPOINTBPS19_LandingPages_7
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_7 final
{
public:
	class UBPS19_LandingPage_SmallButton_C*       Button_BuyBattlePass_0;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_7) == 0x000008, "Wrong alignment on BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_7");
static_assert(sizeof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_7) == 0x000008, "Wrong size on BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_7");
static_assert(offsetof(BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_7, Button_BuyBattlePass_0) == 0x000000, "Member 'BPS19_LandingPages_C_SequenceEvent__ENTRYPOINTBPS19_LandingPages_7::Button_BuyBattlePass_0' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.UpdateBonusPageDelay
// 0x0001 (0x0001 - 0x0000)
struct BPS19_LandingPages_C_UpdateBonusPageDelay final
{
public:
	bool                                          Delayed;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_UpdateBonusPageDelay) == 0x000001, "Wrong alignment on BPS19_LandingPages_C_UpdateBonusPageDelay");
static_assert(sizeof(BPS19_LandingPages_C_UpdateBonusPageDelay) == 0x000001, "Wrong size on BPS19_LandingPages_C_UpdateBonusPageDelay");
static_assert(offsetof(BPS19_LandingPages_C_UpdateBonusPageDelay, Delayed) == 0x000000, "Member 'BPS19_LandingPages_C_UpdateBonusPageDelay::Delayed' has a wrong offset!");

// Function BPS19_LandingPages.BPS19_LandingPages_C.UpdateCustomizationSkinAcquired
// 0x0001 (0x0001 - 0x0000)
struct BPS19_LandingPages_C_UpdateCustomizationSkinAcquired final
{
public:
	bool                                          SkinAcquired;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPages_C_UpdateCustomizationSkinAcquired) == 0x000001, "Wrong alignment on BPS19_LandingPages_C_UpdateCustomizationSkinAcquired");
static_assert(sizeof(BPS19_LandingPages_C_UpdateCustomizationSkinAcquired) == 0x000001, "Wrong size on BPS19_LandingPages_C_UpdateCustomizationSkinAcquired");
static_assert(offsetof(BPS19_LandingPages_C_UpdateCustomizationSkinAcquired, SkinAcquired) == 0x000000, "Member 'BPS19_LandingPages_C_UpdateCustomizationSkinAcquired::SkinAcquired' has a wrong offset!");

}

