#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS19_BulkClaimRewards

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePassBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS19_BulkClaimRewards.BPS19_BulkClaimRewards_C
// 0x0050 (0x04E8 - 0x0498)
class UBPS19_BulkClaimRewards_C final : public UFortBattlePassBulkBuyPageBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_185;                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Cost;                                              // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_131;                                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_231;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LevelsAmount;                                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         First_Page_to_Claim;                               // 0x04D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Last_Page_to_Claim;                                // 0x04DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Add_One;                                           // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_BPS19_BulkClaimRewards(int32 EntryPoint);
	void OnCostChanged(const int32 Cost_0);
	void OnPageRangeChanged(const int32 FromPage, const int32 ToPage);
	void OnRewardCountChanged(const int32 Count);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS19_BulkClaimRewards_C">();
	}
	static class UBPS19_BulkClaimRewards_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS19_BulkClaimRewards_C>();
	}
};
static_assert(alignof(UBPS19_BulkClaimRewards_C) == 0x000008, "Wrong alignment on UBPS19_BulkClaimRewards_C");
static_assert(sizeof(UBPS19_BulkClaimRewards_C) == 0x0004E8, "Wrong size on UBPS19_BulkClaimRewards_C");
static_assert(offsetof(UBPS19_BulkClaimRewards_C, UberGraphFrame) == 0x000498, "Member 'UBPS19_BulkClaimRewards_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS19_BulkClaimRewards_C, Intro) == 0x0004A0, "Member 'UBPS19_BulkClaimRewards_C::Intro' has a wrong offset!");
static_assert(offsetof(UBPS19_BulkClaimRewards_C, CommonRichTextBlock_185) == 0x0004A8, "Member 'UBPS19_BulkClaimRewards_C::CommonRichTextBlock_185' has a wrong offset!");
static_assert(offsetof(UBPS19_BulkClaimRewards_C, Cost) == 0x0004B0, "Member 'UBPS19_BulkClaimRewards_C::Cost' has a wrong offset!");
static_assert(offsetof(UBPS19_BulkClaimRewards_C, Image_131) == 0x0004B8, "Member 'UBPS19_BulkClaimRewards_C::Image_131' has a wrong offset!");
static_assert(offsetof(UBPS19_BulkClaimRewards_C, Image_231) == 0x0004C0, "Member 'UBPS19_BulkClaimRewards_C::Image_231' has a wrong offset!");
static_assert(offsetof(UBPS19_BulkClaimRewards_C, Text_LevelsAmount) == 0x0004C8, "Member 'UBPS19_BulkClaimRewards_C::Text_LevelsAmount' has a wrong offset!");
static_assert(offsetof(UBPS19_BulkClaimRewards_C, Title) == 0x0004D0, "Member 'UBPS19_BulkClaimRewards_C::Title' has a wrong offset!");
static_assert(offsetof(UBPS19_BulkClaimRewards_C, First_Page_to_Claim) == 0x0004D8, "Member 'UBPS19_BulkClaimRewards_C::First_Page_to_Claim' has a wrong offset!");
static_assert(offsetof(UBPS19_BulkClaimRewards_C, Last_Page_to_Claim) == 0x0004DC, "Member 'UBPS19_BulkClaimRewards_C::Last_Page_to_Claim' has a wrong offset!");
static_assert(offsetof(UBPS19_BulkClaimRewards_C, Add_One) == 0x0004E0, "Member 'UBPS19_BulkClaimRewards_C::Add_One' has a wrong offset!");

}

