#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS19_LandingPage_SmallButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BPS19_LandingPage_SmallButton.BPS19_LandingPage_SmallButton_C.ExecuteUbergraph_BPS19_LandingPage_SmallButton
// 0x0090 (0x0090 - 0x0000)
struct BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0038(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton) == 0x000008, "Wrong alignment on BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton");
static_assert(sizeof(BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton) == 0x000090, "Wrong size on BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton");
static_assert(offsetof(BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton, EntryPoint) == 0x000000, "Member 'BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton, Temp_bool_Variable) == 0x000004, "Member 'BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton, Temp_byte_Variable) == 0x000005, "Member 'BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton, Temp_byte_Variable_1) == 0x000006, "Member 'BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton, K2Node_Event_IsDesignTime) == 0x000007, "Member 'BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000020, "Member 'BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000028, "Member 'BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton, K2Node_Select_Default) == 0x000030, "Member 'BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton, K2Node_MakeStruct_SlateFontInfo) == 0x000038, "Member 'BPS19_LandingPage_SmallButton_C_ExecuteUbergraph_BPS19_LandingPage_SmallButton::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function BPS19_LandingPage_SmallButton.BPS19_LandingPage_SmallButton_C.play intro
// 0x0008 (0x0008 - 0x0000)
struct BPS19_LandingPage_SmallButton_C_play_intro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPage_SmallButton_C_play_intro) == 0x000008, "Wrong alignment on BPS19_LandingPage_SmallButton_C_play_intro");
static_assert(sizeof(BPS19_LandingPage_SmallButton_C_play_intro) == 0x000008, "Wrong size on BPS19_LandingPage_SmallButton_C_play_intro");
static_assert(offsetof(BPS19_LandingPage_SmallButton_C_play_intro, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'BPS19_LandingPage_SmallButton_C_play_intro::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function BPS19_LandingPage_SmallButton.BPS19_LandingPage_SmallButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPS19_LandingPage_SmallButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_LandingPage_SmallButton_C_PreConstruct) == 0x000001, "Wrong alignment on BPS19_LandingPage_SmallButton_C_PreConstruct");
static_assert(sizeof(BPS19_LandingPage_SmallButton_C_PreConstruct) == 0x000001, "Wrong size on BPS19_LandingPage_SmallButton_C_PreConstruct");
static_assert(offsetof(BPS19_LandingPage_SmallButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPS19_LandingPage_SmallButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

