#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS19_BattlePassRewardGridHeader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPS19_BattlePassRewardGridHeader.BPS19_BattlePassRewardGridHeader_C.ExecuteUbergraph_BPS19_BattlePassRewardGridHeader
// 0x0228 (0x0228 - 0x0000)
struct BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardPageType                               Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_RequiredLevel;                        // 0x006C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_RequiredRewards;                      // 0x0070(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InPageNumber;                         // 0x0074(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	int32                                         K2Node_Event_PurchasedRewards;                     // 0x00D0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_TotalRewards;                         // 0x00D4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0138(0x0040)(HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0180(0x0010)(ReferenceParm)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0198(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x01C8(0x0018)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardPageType                               K2Node_Event_PageType;                             // 0x01E8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x01F0(0x0018)()
	class FText                                   K2Node_Event_CustomName;                           // 0x0208(0x0018)(ConstParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader) == 0x000008, "Wrong alignment on BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader");
static_assert(sizeof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader) == 0x000228, "Wrong size on BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, EntryPoint) == 0x000000, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, Temp_byte_Variable) == 0x000004, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, Temp_bool_Variable) == 0x000005, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, Temp_byte_Variable_1) == 0x000006, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, Temp_text_Variable) == 0x000008, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, Temp_text_Variable_1) == 0x000020, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, Temp_text_Variable_2) == 0x000038, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, Temp_text_Variable_3) == 0x000050, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, Temp_bool_Variable_1) == 0x000068, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, Temp_byte_Variable_2) == 0x000069, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, Temp_byte_Variable_3) == 0x00006A, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, K2Node_Event_RequiredLevel) == 0x00006C, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::K2Node_Event_RequiredLevel' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, K2Node_Event_RequiredRewards) == 0x000070, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::K2Node_Event_RequiredRewards' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, K2Node_Event_InPageNumber) == 0x000074, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::K2Node_Event_InPageNumber' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B8, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, K2Node_MakeArray_Array) == 0x0000C0, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, K2Node_Event_PurchasedRewards) == 0x0000D0, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::K2Node_Event_PurchasedRewards' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, K2Node_Event_TotalRewards) == 0x0000D4, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::K2Node_Event_TotalRewards' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F0, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000130, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000134, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, K2Node_MakeStruct_FormatArgumentData_2) == 0x000138, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000178, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, K2Node_MakeArray_Array_1) == 0x000180, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000190, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, CallFunc_Format_ReturnValue_1) == 0x000198, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, Temp_byte_Variable_4) == 0x0001B0, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, Temp_bool_Variable_2) == 0x0001B1, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0001B8, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, K2Node_Select_Default) == 0x0001C0, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, K2Node_Select_Default_1) == 0x0001C8, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, CallFunc_PlayAnimation_ReturnValue) == 0x0001E0, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, K2Node_Event_PageType) == 0x0001E8, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::K2Node_Event_PageType' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, K2Node_Select_Default_2) == 0x0001F0, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, K2Node_Event_CustomName) == 0x000208, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::K2Node_Event_CustomName' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000220, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader, K2Node_Select_Default_3) == 0x000221, "Member 'BPS19_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS19_BattlePassRewardGridHeader::K2Node_Select_Default_3' has a wrong offset!");

// Function BPS19_BattlePassRewardGridHeader.BPS19_BattlePassRewardGridHeader_C.OnPageLocked
// 0x0008 (0x0008 - 0x0000)
struct BPS19_BattlePassRewardGridHeader_C_OnPageLocked final
{
public:
	int32                                         RequiredLevel;                                     // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequiredRewards;                                   // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_BattlePassRewardGridHeader_C_OnPageLocked) == 0x000004, "Wrong alignment on BPS19_BattlePassRewardGridHeader_C_OnPageLocked");
static_assert(sizeof(BPS19_BattlePassRewardGridHeader_C_OnPageLocked) == 0x000008, "Wrong size on BPS19_BattlePassRewardGridHeader_C_OnPageLocked");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_OnPageLocked, RequiredLevel) == 0x000000, "Member 'BPS19_BattlePassRewardGridHeader_C_OnPageLocked::RequiredLevel' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_OnPageLocked, RequiredRewards) == 0x000004, "Member 'BPS19_BattlePassRewardGridHeader_C_OnPageLocked::RequiredRewards' has a wrong offset!");

// Function BPS19_BattlePassRewardGridHeader.BPS19_BattlePassRewardGridHeader_C.OnPageNumberSet
// 0x0004 (0x0004 - 0x0000)
struct BPS19_BattlePassRewardGridHeader_C_OnPageNumberSet final
{
public:
	int32                                         InPageNumber;                                      // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_BattlePassRewardGridHeader_C_OnPageNumberSet) == 0x000004, "Wrong alignment on BPS19_BattlePassRewardGridHeader_C_OnPageNumberSet");
static_assert(sizeof(BPS19_BattlePassRewardGridHeader_C_OnPageNumberSet) == 0x000004, "Wrong size on BPS19_BattlePassRewardGridHeader_C_OnPageNumberSet");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_OnPageNumberSet, InPageNumber) == 0x000000, "Member 'BPS19_BattlePassRewardGridHeader_C_OnPageNumberSet::InPageNumber' has a wrong offset!");

// Function BPS19_BattlePassRewardGridHeader.BPS19_BattlePassRewardGridHeader_C.OnPageUnlocked
// 0x0008 (0x0008 - 0x0000)
struct BPS19_BattlePassRewardGridHeader_C_OnPageUnlocked final
{
public:
	int32                                         PurchasedRewards;                                  // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalRewards;                                      // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_BattlePassRewardGridHeader_C_OnPageUnlocked) == 0x000004, "Wrong alignment on BPS19_BattlePassRewardGridHeader_C_OnPageUnlocked");
static_assert(sizeof(BPS19_BattlePassRewardGridHeader_C_OnPageUnlocked) == 0x000008, "Wrong size on BPS19_BattlePassRewardGridHeader_C_OnPageUnlocked");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_OnPageUnlocked, PurchasedRewards) == 0x000000, "Member 'BPS19_BattlePassRewardGridHeader_C_OnPageUnlocked::PurchasedRewards' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_OnPageUnlocked, TotalRewards) == 0x000004, "Member 'BPS19_BattlePassRewardGridHeader_C_OnPageUnlocked::TotalRewards' has a wrong offset!");

// Function BPS19_BattlePassRewardGridHeader.BPS19_BattlePassRewardGridHeader_C.OnSetPageCustomName
// 0x0018 (0x0018 - 0x0000)
struct BPS19_BattlePassRewardGridHeader_C_OnSetPageCustomName final
{
public:
	class FText                                   CustomName;                                        // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BPS19_BattlePassRewardGridHeader_C_OnSetPageCustomName) == 0x000008, "Wrong alignment on BPS19_BattlePassRewardGridHeader_C_OnSetPageCustomName");
static_assert(sizeof(BPS19_BattlePassRewardGridHeader_C_OnSetPageCustomName) == 0x000018, "Wrong size on BPS19_BattlePassRewardGridHeader_C_OnSetPageCustomName");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_OnSetPageCustomName, CustomName) == 0x000000, "Member 'BPS19_BattlePassRewardGridHeader_C_OnSetPageCustomName::CustomName' has a wrong offset!");

// Function BPS19_BattlePassRewardGridHeader.BPS19_BattlePassRewardGridHeader_C.OnSetPageType
// 0x0001 (0x0001 - 0x0000)
struct BPS19_BattlePassRewardGridHeader_C_OnSetPageType final
{
public:
	ERewardPageType                               PageType;                                          // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS19_BattlePassRewardGridHeader_C_OnSetPageType) == 0x000001, "Wrong alignment on BPS19_BattlePassRewardGridHeader_C_OnSetPageType");
static_assert(sizeof(BPS19_BattlePassRewardGridHeader_C_OnSetPageType) == 0x000001, "Wrong size on BPS19_BattlePassRewardGridHeader_C_OnSetPageType");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_OnSetPageType, PageType) == 0x000000, "Member 'BPS19_BattlePassRewardGridHeader_C_OnSetPageType::PageType' has a wrong offset!");

// Function BPS19_BattlePassRewardGridHeader.BPS19_BattlePassRewardGridHeader_C.UpdateLockedHeaderText
// 0x0420 (0x0420 - 0x0000)
struct BPS19_BattlePassRewardGridHeader_C_UpdateLockedHeaderText final
{
public:
	int32                                         RequiredLevel;                                     // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequiredRewards;                                   // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0050(0x0040)(HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x00A8(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00C8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0108(0x0040)(HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_2;                              // 0x0148(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0160(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0180(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0198(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01B0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x01F0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0230(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0240(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0258(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0298(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x02B0(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x02D0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0310(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x0320(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0360(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x0378(0x0040)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x03C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x03D0(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x03E8(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_402[0x6];                                      // 0x0402(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x0408(0x0018)()
};
static_assert(alignof(BPS19_BattlePassRewardGridHeader_C_UpdateLockedHeaderText) == 0x000008, "Wrong alignment on BPS19_BattlePassRewardGridHeader_C_UpdateLockedHeaderText");
static_assert(sizeof(BPS19_BattlePassRewardGridHeader_C_UpdateLockedHeaderText) == 0x000420, "Wrong size on BPS19_BattlePassRewardGridHeader_C_UpdateLockedHeaderText");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_UpdateLockedHeaderText, RequiredLevel) == 0x000000, "Member 'BPS19_BattlePassRewardGridHeader_C_UpdateLockedHeaderText::RequiredLevel' has a wrong offset!");
static_assert(offsetof(BPS19_BattlePassRewardGridHeader_C_UpdateLockedHeaderText, RequiredRewards) == 0x000004, "Member 'BPS19_BattlePassRewardGridHeader_C_UpdateLockedHeaderText::RequiredRewards' has a wrong offset!");
