#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraAnimationTransition

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CameraAnimationTransition.CameraAnimationTransition_C
// 0x00C0 (0x02E0 - 0x0220)
class ACameraAnimationTransition_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_2750533A46B9AEF2BE294F8153FE4FD4; // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_2750533A46B9AEF2BE294F8153FE4FD4; // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortnitePartyBackdrop_Camera_C*        CameraBR;                                          // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CameraLocationBR;                                  // 0x0250(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AFortnitePartyBackdrop_Camera_C*        CameraBR16Player;                                  // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortnitePartyBackdrop_Camera_C*        CameraCreative;                                    // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortnitePartyBackdrop_Camera_C*        CameraCreative16Player;                            // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CameraLocationCreative;                            // 0x02A0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         FOVPostion1;                                       // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FOVPostion2;                                       // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void MoveCameraUp();
	void MoveCameraDown();
	void ExecuteUbergraph_CameraAnimationTransition(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CameraAnimationTransition_C">();
	}
	static class ACameraAnimationTransition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACameraAnimationTransition_C>();
	}
};
static_assert(alignof(ACameraAnimationTransition_C) == 0x000010, "Wrong alignment on ACameraAnimationTransition_C");
static_assert(sizeof(ACameraAnimationTransition_C) == 0x0002E0, "Wrong size on ACameraAnimationTransition_C");
static_assert(offsetof(ACameraAnimationTransition_C, UberGraphFrame) == 0x000220, "Member 'ACameraAnimationTransition_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, DefaultSceneRoot) == 0x000228, "Member 'ACameraAnimationTransition_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, Timeline_0_NewTrack_0_2750533A46B9AEF2BE294F8153FE4FD4) == 0x000230, "Member 'ACameraAnimationTransition_C::Timeline_0_NewTrack_0_2750533A46B9AEF2BE294F8153FE4FD4' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, Timeline_0__Direction_2750533A46B9AEF2BE294F8153FE4FD4) == 0x000234, "Member 'ACameraAnimationTransition_C::Timeline_0__Direction_2750533A46B9AEF2BE294F8153FE4FD4' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, Timeline_0) == 0x000238, "Member 'ACameraAnimationTransition_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, CameraBR) == 0x000240, "Member 'ACameraAnimationTransition_C::CameraBR' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, CameraLocationBR) == 0x000250, "Member 'ACameraAnimationTransition_C::CameraLocationBR' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, CameraBR16Player) == 0x000280, "Member 'ACameraAnimationTransition_C::CameraBR16Player' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, CameraCreative) == 0x000288, "Member 'ACameraAnimationTransition_C::CameraCreative' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, CameraCreative16Player) == 0x000290, "Member 'ACameraAnimationTransition_C::CameraCreative16Player' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, CameraLocationCreative) == 0x0002A0, "Member 'ACameraAnimationTransition_C::CameraLocationCreative' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, FOVPostion1) == 0x0002D0, "Member 'ACameraAnimationTransition_C::FOVPostion1' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, FOVPostion2) == 0x0002D4, "Member 'ACameraAnimationTransition_C::FOVPostion2' has a wrong offset!");

}

