#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraAnimationTransition

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CameraAnimationTransition.CameraAnimationTransition_C.UserConstructionScript
// 0x0080 (0x0080 - 0x0000)
struct CameraAnimationTransition_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0xB];                                        // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0xE];                                       // 0x0042(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0050(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CameraAnimationTransition_C_UserConstructionScript) == 0x000010, "Wrong alignment on CameraAnimationTransition_C_UserConstructionScript");
static_assert(sizeof(CameraAnimationTransition_C_UserConstructionScript) == 0x000080, "Wrong size on CameraAnimationTransition_C_UserConstructionScript");
static_assert(offsetof(CameraAnimationTransition_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CameraAnimationTransition_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'CameraAnimationTransition_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'CameraAnimationTransition_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_3) == 0x000003, "Member 'CameraAnimationTransition_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'CameraAnimationTransition_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_UserConstructionScript, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'CameraAnimationTransition_C_UserConstructionScript::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue_1) == 0x000040, "Member 'CameraAnimationTransition_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue_2) == 0x000041, "Member 'CameraAnimationTransition_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_UserConstructionScript, CallFunc_GetTransform_ReturnValue_1) == 0x000050, "Member 'CameraAnimationTransition_C_UserConstructionScript::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");

// Function CameraAnimationTransition.CameraAnimationTransition_C.ExecuteUbergraph_CameraAnimationTransition
// 0x0220 (0x0220 - 0x0000)
struct CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0070(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00A0(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_TLerp_ReturnValue_1;                      // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult_1;    // 0x0170(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue_1;       // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x020E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x020F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition) == 0x000010, "Wrong alignment on CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition");
static_assert(sizeof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition) == 0x000220, "Wrong size on CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, EntryPoint) == 0x000000, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::EntryPoint' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_TLerp_ReturnValue) == 0x000040, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_TLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_GetTransform_ReturnValue_1) == 0x000070, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000A0, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_K2_SetActorTransform_ReturnValue) == 0x00013C, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_TLerp_ReturnValue_1) == 0x000140, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_TLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_K2_SetActorTransform_SweepHitResult_1) == 0x000170, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_K2_SetActorTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_K2_SetActorTransform_ReturnValue_1) == 0x00020C, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_K2_SetActorTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_IsValid_ReturnValue) == 0x00020D, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_IsValid_ReturnValue_1) == 0x00020E, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_BooleanAND_ReturnValue) == 0x00020F, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_IsValid_ReturnValue_2) == 0x000210, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_BooleanAND_ReturnValue_1) == 0x000211, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_IsValid_ReturnValue_3) == 0x000212, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_BooleanAND_ReturnValue_2) == 0x000213, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_Lerp_ReturnValue) == 0x000214, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_Lerp_ReturnValue' has a wrong offset!");

}

