#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CareerScreen

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function CareerScreen.CareerScreen_C.ExecuteUbergraph_CareerScreen
// 0x0088 (0x0088 - 0x0000)
struct CareerScreen_C_ExecuteUbergraph_CareerScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasCompletedFeats;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AVaultWorld_C*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0058(0x0010)(ReferenceParm)
	class AVaultWorld_C*                          CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVaultRotator_C*                        CallFunc_GetVaultRotator_VaultRotator;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CareerScreen_C_ExecuteUbergraph_CareerScreen) == 0x000008, "Wrong alignment on CareerScreen_C_ExecuteUbergraph_CareerScreen");
static_assert(sizeof(CareerScreen_C_ExecuteUbergraph_CareerScreen) == 0x000088, "Wrong size on CareerScreen_C_ExecuteUbergraph_CareerScreen");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, EntryPoint) == 0x000000, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000008, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, Temp_bool_Variable) == 0x000010, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, Temp_int_Variable) == 0x000014, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, Temp_int_Variable_1) == 0x000018, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, Temp_bool_True_if_break_was_hit_Variable) == 0x00001C, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, Temp_int_Array_Index_Variable) == 0x000020, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_Not_PreBool_ReturnValue) == 0x000024, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, K2Node_Event_bHasCompletedFeats) == 0x000030, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::K2Node_Event_bHasCompletedFeats' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000038, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, K2Node_Select_Default) == 0x000040, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetAllActorsOfClass_OutActors) == 0x000058, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_Array_Get_Item) == 0x000068, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetVaultRotator_VaultRotator) == 0x000078, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetVaultRotator_VaultRotator' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_BooleanAND_ReturnValue) == 0x000081, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_ActorHasTag_ReturnValue) == 0x000082, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");

// Function CareerScreen.CareerScreen_C.PlayCinematic
// 0x00A0 (0x00A0 - 0x0000)
struct CareerScreen_C_PlayCinematic final
{
public:
	class UFortStreamMediaSource*                 StreamSource;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortActivatableMovieWidget_C*          CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVideoWidgetConfig                     K2Node_MakeStruct_VideoWidgetConfig;               // 0x0020(0x0080)()
};
static_assert(alignof(CareerScreen_C_PlayCinematic) == 0x000008, "Wrong alignment on CareerScreen_C_PlayCinematic");
static_assert(sizeof(CareerScreen_C_PlayCinematic) == 0x0000A0, "Wrong size on CareerScreen_C_PlayCinematic");
static_assert(offsetof(CareerScreen_C_PlayCinematic, StreamSource) == 0x000000, "Member 'CareerScreen_C_PlayCinematic::StreamSource' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_PlayCinematic, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'CareerScreen_C_PlayCinematic::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_PlayCinematic, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000010, "Member 'CareerScreen_C_PlayCinematic::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_PlayCinematic, CallFunc_Create_ReturnValue) == 0x000018, "Member 'CareerScreen_C_PlayCinematic::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_PlayCinematic, K2Node_MakeStruct_VideoWidgetConfig) == 0x000020, "Member 'CareerScreen_C_PlayCinematic::K2Node_MakeStruct_VideoWidgetConfig' has a wrong offset!");

// Function CareerScreen.CareerScreen_C.ReplayCinematic
// 0x0001 (0x0001 - 0x0000)
struct CareerScreen_C_ReplayCinematic final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CareerScreen_C_ReplayCinematic) == 0x000001, "Wrong alignment on CareerScreen_C_ReplayCinematic");
static_assert(sizeof(CareerScreen_C_ReplayCinematic) == 0x000001, "Wrong size on CareerScreen_C_ReplayCinematic");
static_assert(offsetof(CareerScreen_C_ReplayCinematic, PassThrough) == 0x000000, "Member 'CareerScreen_C_ReplayCinematic::PassThrough' has a wrong offset!");

// Function CareerScreen.CareerScreen_C.ShowFeats
// 0x0001 (0x0001 - 0x0000)
struct CareerScreen_C_ShowFeats final
{
public:
	bool                                          bHasCompletedFeats;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CareerScreen_C_ShowFeats) == 0x000001, "Wrong alignment on CareerScreen_C_ShowFeats");
static_assert(sizeof(CareerScreen_C_ShowFeats) == 0x000001, "Wrong size on CareerScreen_C_ShowFeats");
static_assert(offsetof(CareerScreen_C_ShowFeats, bHasCompletedFeats) == 0x000000, "Member 'CareerScreen_C_ShowFeats::bHasCompletedFeats' has a wrong offset!");

}

