#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatMessageEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChatMessageEntry.ChatMessageEntry_C
// 0x0030 (0x03D8 - 0x03A8)
class UChatMessageEntry_C final : public UFortChatMessageEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          MessageBackground;                                 // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MessageWrapper;                                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 DefaultStyle_0;                                    // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SelfStyle;                                         // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 OtherUserStyle;                                    // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_FocusTarget_K2Node_ComponentBoundEvent_35_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_ChatMessageEntry(int32 EntryPoint);
	void HandleSelectionStatusChanged(bool bIsSelected);
	void OnEntryUpdated_1();
	void OnFocusedChanged(bool bIsFocused);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChatMessageEntry_C">();
	}
	static class UChatMessageEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatMessageEntry_C>();
	}
};
static_assert(alignof(UChatMessageEntry_C) == 0x000008, "Wrong alignment on UChatMessageEntry_C");
static_assert(sizeof(UChatMessageEntry_C) == 0x0003D8, "Wrong size on UChatMessageEntry_C");
static_assert(offsetof(UChatMessageEntry_C, UberGraphFrame) == 0x0003A8, "Member 'UChatMessageEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChatMessageEntry_C, MessageBackground) == 0x0003B0, "Member 'UChatMessageEntry_C::MessageBackground' has a wrong offset!");
static_assert(offsetof(UChatMessageEntry_C, MessageWrapper) == 0x0003B8, "Member 'UChatMessageEntry_C::MessageWrapper' has a wrong offset!");
static_assert(offsetof(UChatMessageEntry_C, DefaultStyle_0) == 0x0003C0, "Member 'UChatMessageEntry_C::DefaultStyle_0' has a wrong offset!");
static_assert(offsetof(UChatMessageEntry_C, SelfStyle) == 0x0003C8, "Member 'UChatMessageEntry_C::SelfStyle' has a wrong offset!");
static_assert(offsetof(UChatMessageEntry_C, OtherUserStyle) == 0x0003D0, "Member 'UChatMessageEntry_C::OtherUserStyle' has a wrong offset!");

}

