#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatContainer

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function ChatContainer.ChatContainer_C.BndEvt__ConsoleChatShortcut_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ChatContainer_C_BndEvt__ConsoleChatShortcut_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatContainer_C_BndEvt__ConsoleChatShortcut_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ChatContainer_C_BndEvt__ConsoleChatShortcut_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ChatContainer_C_BndEvt__ConsoleChatShortcut_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ChatContainer_C_BndEvt__ConsoleChatShortcut_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ChatContainer_C_BndEvt__ConsoleChatShortcut_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ChatContainer_C_BndEvt__ConsoleChatShortcut_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ChatContainer.ChatContainer_C.ExecuteUbergraph_ChatContainer
// 0x00C8 (0x00C8 - 0x0000)
struct ChatContainer_C_ExecuteUbergraph_ChatContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShouldBeOpen;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowSendButton;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_2;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_3;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_4;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInCursorMode_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x007C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_2;                           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatContainer_C_ExecuteUbergraph_ChatContainer) == 0x000008, "Wrong alignment on ChatContainer_C_ExecuteUbergraph_ChatContainer");
static_assert(sizeof(ChatContainer_C_ExecuteUbergraph_ChatContainer) == 0x0000C8, "Wrong size on ChatContainer_C_ExecuteUbergraph_ChatContainer");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, EntryPoint) == 0x000000, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, Temp_bool_Variable) == 0x000010, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, Temp_byte_Variable) == 0x000011, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, Temp_byte_Variable_1) == 0x000012, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, CallFunc_GetContext_ReturnValue_1) == 0x000018, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, K2Node_Event_bShouldBeOpen) == 0x000020, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::K2Node_Event_bShouldBeOpen' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, CallFunc_IsUsingGamepad_ReturnValue) == 0x000021, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, K2Node_Event_bShowSendButton) == 0x000022, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::K2Node_Event_bShowSendButton' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, K2Node_Select_Default) == 0x000023, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, Temp_bool_Variable_1) == 0x000024, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, CallFunc_GetContext_ReturnValue_2) == 0x000028, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, K2Node_ComponentBoundEvent_Button) == 0x000040, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, K2Node_Select_Default_1) == 0x000048, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, CallFunc_GetContext_ReturnValue_3) == 0x000060, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::CallFunc_GetContext_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, CallFunc_IsInZone_ReturnValue) == 0x000068, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, Temp_bool_Variable_2) == 0x000069, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, CallFunc_GetContext_ReturnValue_4) == 0x000070, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::CallFunc_GetContext_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, CallFunc_IsInCursorMode_ReturnValue) == 0x000078, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::CallFunc_IsInCursorMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, K2Node_Event_MyGeometry) == 0x00007C, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, K2Node_Event_InDeltaTime) == 0x0000B4, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, CallFunc_Not_PreBool_ReturnValue) == 0x0000B8, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, CallFunc_BooleanAND_ReturnValue) == 0x0000B9, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_ExecuteUbergraph_ChatContainer, K2Node_Select_Default_2) == 0x0000C0, "Member 'ChatContainer_C_ExecuteUbergraph_ChatContainer::K2Node_Select_Default_2' has a wrong offset!");

// Function ChatContainer.ChatContainer_C.HandleChatOpenChanged
// 0x0038 (0x0038 - 0x0000)
struct ChatContainer_C_HandleChatOpenChanged final
{
public:
	bool                                          bChatShouldBeOpen;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewLocalVar_0;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_5;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_6;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_7;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTextChatRestricted_ReturnValue;         // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_2;                           // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatContainer_C_HandleChatOpenChanged) == 0x000008, "Wrong alignment on ChatContainer_C_HandleChatOpenChanged");
static_assert(sizeof(ChatContainer_C_HandleChatOpenChanged) == 0x000038, "Wrong size on ChatContainer_C_HandleChatOpenChanged");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, bChatShouldBeOpen) == 0x000000, "Member 'ChatContainer_C_HandleChatOpenChanged::bChatShouldBeOpen' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, NewLocalVar_0) == 0x000001, "Member 'ChatContainer_C_HandleChatOpenChanged::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, Temp_byte_Variable) == 0x000002, "Member 'ChatContainer_C_HandleChatOpenChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, Temp_byte_Variable_1) == 0x000003, "Member 'ChatContainer_C_HandleChatOpenChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, Temp_bool_Variable) == 0x000004, "Member 'ChatContainer_C_HandleChatOpenChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, Temp_byte_Variable_2) == 0x000005, "Member 'ChatContainer_C_HandleChatOpenChanged::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, Temp_byte_Variable_3) == 0x000006, "Member 'ChatContainer_C_HandleChatOpenChanged::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, Temp_bool_Variable_1) == 0x000007, "Member 'ChatContainer_C_HandleChatOpenChanged::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, Temp_byte_Variable_4) == 0x000008, "Member 'ChatContainer_C_HandleChatOpenChanged::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, K2Node_Select_Default) == 0x000009, "Member 'ChatContainer_C_HandleChatOpenChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, Temp_byte_Variable_5) == 0x00000A, "Member 'ChatContainer_C_HandleChatOpenChanged::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, Temp_bool_Variable_2) == 0x00000B, "Member 'ChatContainer_C_HandleChatOpenChanged::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, Temp_byte_Variable_6) == 0x00000C, "Member 'ChatContainer_C_HandleChatOpenChanged::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, Temp_byte_Variable_7) == 0x00000D, "Member 'ChatContainer_C_HandleChatOpenChanged::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, CallFunc_IsTextChatRestricted_ReturnValue) == 0x00000E, "Member 'ChatContainer_C_HandleChatOpenChanged::CallFunc_IsTextChatRestricted_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, CallFunc_BooleanAND_ReturnValue) == 0x00000F, "Member 'ChatContainer_C_HandleChatOpenChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'ChatContainer_C_HandleChatOpenChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, K2Node_Select_Default_1) == 0x000011, "Member 'ChatContainer_C_HandleChatOpenChanged::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, K2Node_Select_Default_2) == 0x000012, "Member 'ChatContainer_C_HandleChatOpenChanged::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'ChatContainer_C_HandleChatOpenChanged::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, Temp_bool_Variable_3) == 0x000020, "Member 'ChatContainer_C_HandleChatOpenChanged::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000021, "Member 'ChatContainer_C_HandleChatOpenChanged::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, K2Node_Select_Default_3) == 0x000022, "Member 'ChatContainer_C_HandleChatOpenChanged::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'ChatContainer_C_HandleChatOpenChanged::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleChatOpenChanged, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000030, "Member 'ChatContainer_C_HandleChatOpenChanged::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");

// Function ChatContainer.ChatContainer_C.HandleCursorModeChanged
// 0x0028 (0x0028 - 0x0000)
struct ChatContainer_C_HandleCursorModeChanged final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Widget;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatContainer_C_HandleCursorModeChanged) == 0x000008, "Wrong alignment on ChatContainer_C_HandleCursorModeChanged");
static_assert(sizeof(ChatContainer_C_HandleCursorModeChanged) == 0x000028, "Wrong size on ChatContainer_C_HandleCursorModeChanged");
static_assert(offsetof(ChatContainer_C_HandleCursorModeChanged, bEnabled) == 0x000000, "Member 'ChatContainer_C_HandleCursorModeChanged::bEnabled' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleCursorModeChanged, ActionName) == 0x000004, "Member 'ChatContainer_C_HandleCursorModeChanged::ActionName' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleCursorModeChanged, Widget) == 0x000010, "Member 'ChatContainer_C_HandleCursorModeChanged::Widget' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleCursorModeChanged, Temp_bool_Variable) == 0x000018, "Member 'ChatContainer_C_HandleCursorModeChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_HandleCursorModeChanged, K2Node_Select_Default) == 0x000020, "Member 'ChatContainer_C_HandleCursorModeChanged::K2Node_Select_Default' has a wrong offset!");

// Function ChatContainer.ChatContainer_C.OnChatOpenChanged
// 0x0001 (0x0001 - 0x0000)
struct ChatContainer_C_OnChatOpenChanged final
{
public:
	bool                                          bShouldBeOpen;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatContainer_C_OnChatOpenChanged) == 0x000001, "Wrong alignment on ChatContainer_C_OnChatOpenChanged");
static_assert(sizeof(ChatContainer_C_OnChatOpenChanged) == 0x000001, "Wrong size on ChatContainer_C_OnChatOpenChanged");
static_assert(offsetof(ChatContainer_C_OnChatOpenChanged, bShouldBeOpen) == 0x000000, "Member 'ChatContainer_C_OnChatOpenChanged::bShouldBeOpen' has a wrong offset!");

// Function ChatContainer.ChatContainer_C.OnKeyDown
// 0x02B8 (0x02B8 - 0x0000)
struct ChatContainer_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0128(0x00B8)()
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x01E0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0200(0x00B8)()
};
static_assert(alignof(ChatContainer_C_OnKeyDown) == 0x000008, "Wrong alignment on ChatContainer_C_OnKeyDown");
static_assert(sizeof(ChatContainer_C_OnKeyDown) == 0x0002B8, "Wrong size on ChatContainer_C_OnKeyDown");
static_assert(offsetof(ChatContainer_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'ChatContainer_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'ChatContainer_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'ChatContainer_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000128, "Member 'ChatContainer_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x0001E0, "Member 'ChatContainer_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x0001F8, "Member 'ChatContainer_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000200, "Member 'ChatContainer_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function ChatContainer.ChatContainer_C.OnSendButtonDisplayChanged
// 0x0001 (0x0001 - 0x0000)
struct ChatContainer_C_OnSendButtonDisplayChanged final
{
public:
	bool                                          bShowSendButton;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatContainer_C_OnSendButtonDisplayChanged) == 0x000001, "Wrong alignment on ChatContainer_C_OnSendButtonDisplayChanged");
static_assert(sizeof(ChatContainer_C_OnSendButtonDisplayChanged) == 0x000001, "Wrong size on ChatContainer_C_OnSendButtonDisplayChanged");
static_assert(offsetof(ChatContainer_C_OnSendButtonDisplayChanged, bShowSendButton) == 0x000000, "Member 'ChatContainer_C_OnSendButtonDisplayChanged::bShowSendButton' has a wrong offset!");

// Function ChatContainer.ChatContainer_C.SetChatBoxStyle
// 0x0040 (0x0040 - 0x0000)
struct ChatContainer_C_SetChatBoxStyle final
{
public:
	ESubGame                                      Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetCurrentSubGame_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatContainer_C_SetChatBoxStyle) == 0x000008, "Wrong alignment on ChatContainer_C_SetChatBoxStyle");
static_assert(sizeof(ChatContainer_C_SetChatBoxStyle) == 0x000040, "Wrong size on ChatContainer_C_SetChatBoxStyle");
static_assert(offsetof(ChatContainer_C_SetChatBoxStyle, Temp_byte_Variable) == 0x000000, "Member 'ChatContainer_C_SetChatBoxStyle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_SetChatBoxStyle, Temp_object_Variable) == 0x000008, "Member 'ChatContainer_C_SetChatBoxStyle::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_SetChatBoxStyle, Temp_object_Variable_1) == 0x000010, "Member 'ChatContainer_C_SetChatBoxStyle::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_SetChatBoxStyle, Temp_object_Variable_2) == 0x000018, "Member 'ChatContainer_C_SetChatBoxStyle::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_SetChatBoxStyle, Temp_object_Variable_3) == 0x000020, "Member 'ChatContainer_C_SetChatBoxStyle::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_SetChatBoxStyle, Temp_object_Variable_4) == 0x000028, "Member 'ChatContainer_C_SetChatBoxStyle::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_SetChatBoxStyle, CallFunc_GetCurrentSubGame_ReturnValue) == 0x000030, "Member 'ChatContainer_C_SetChatBoxStyle::CallFunc_GetCurrentSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_SetChatBoxStyle, K2Node_Select_Default) == 0x000038, "Member 'ChatContainer_C_SetChatBoxStyle::K2Node_Select_Default' has a wrong offset!");

// Function ChatContainer.ChatContainer_C.Tick
// 0x003C (0x003C - 0x0000)
struct ChatContainer_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatContainer_C_Tick) == 0x000004, "Wrong alignment on ChatContainer_C_Tick");
static_assert(sizeof(ChatContainer_C_Tick) == 0x00003C, "Wrong size on ChatContainer_C_Tick");
static_assert(offsetof(ChatContainer_C_Tick, MyGeometry) == 0x000000, "Member 'ChatContainer_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(ChatContainer_C_Tick, InDeltaTime) == 0x000038, "Member 'ChatContainer_C_Tick::InDeltaTime' has a wrong offset!");

}

