#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cinematic_TeamMics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Cinematic-TeamMics.Cinematic-TeamMics_C.ExecuteUbergraph_Cinematic-TeamMics
// 0x0004 (0x0004 - 0x0000)
struct Cinematic_TeamMics_C_ExecuteUbergraph_Cinematic_TeamMics final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cinematic_TeamMics_C_ExecuteUbergraph_Cinematic_TeamMics) == 0x000004, "Wrong alignment on Cinematic_TeamMics_C_ExecuteUbergraph_Cinematic_TeamMics");
static_assert(sizeof(Cinematic_TeamMics_C_ExecuteUbergraph_Cinematic_TeamMics) == 0x000004, "Wrong size on Cinematic_TeamMics_C_ExecuteUbergraph_Cinematic_TeamMics");
static_assert(offsetof(Cinematic_TeamMics_C_ExecuteUbergraph_Cinematic_TeamMics, EntryPoint) == 0x000000, "Member 'Cinematic_TeamMics_C_ExecuteUbergraph_Cinematic_TeamMics::EntryPoint' has a wrong offset!");

// Function Cinematic-TeamMics.Cinematic-TeamMics_C.Update
// 0x02B0 (0x02B0 - 0x0000)
struct Cinematic_TeamMics_C_Update final
{
public:
	struct FFortTeamMemberInfo                    UpdatedMemberInfo;                                 // 0x0000(0x0230)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       PlayerNetId;                                       // 0x0230(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x025B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x2];                                      // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNetIdFromLocalPlayersPlatform_ReturnValue; // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_Select_Default_2;                           // 0x0280(0x0028)(ConstParm, HasGetValueTypeHash)
};
static_assert(alignof(Cinematic_TeamMics_C_Update) == 0x000010, "Wrong alignment on Cinematic_TeamMics_C_Update");
static_assert(sizeof(Cinematic_TeamMics_C_Update) == 0x0002B0, "Wrong size on Cinematic_TeamMics_C_Update");
static_assert(offsetof(Cinematic_TeamMics_C_Update, UpdatedMemberInfo) == 0x000000, "Member 'Cinematic_TeamMics_C_Update::UpdatedMemberInfo' has a wrong offset!");
static_assert(offsetof(Cinematic_TeamMics_C_Update, PlayerNetId) == 0x000230, "Member 'Cinematic_TeamMics_C_Update::PlayerNetId' has a wrong offset!");
static_assert(offsetof(Cinematic_TeamMics_C_Update, Temp_bool_Variable) == 0x000258, "Member 'Cinematic_TeamMics_C_Update::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Cinematic_TeamMics_C_Update, Temp_bool_Variable_1) == 0x000259, "Member 'Cinematic_TeamMics_C_Update::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Cinematic_TeamMics_C_Update, Temp_byte_Variable) == 0x00025A, "Member 'Cinematic_TeamMics_C_Update::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Cinematic_TeamMics_C_Update, Temp_byte_Variable_1) == 0x00025B, "Member 'Cinematic_TeamMics_C_Update::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Cinematic_TeamMics_C_Update, Temp_bool_Variable_2) == 0x00025C, "Member 'Cinematic_TeamMics_C_Update::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Cinematic_TeamMics_C_Update, Temp_int_Variable) == 0x000260, "Member 'Cinematic_TeamMics_C_Update::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Cinematic_TeamMics_C_Update, Temp_int_Variable_1) == 0x000264, "Member 'Cinematic_TeamMics_C_Update::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Cinematic_TeamMics_C_Update, CallFunc_GetContext_ReturnValue) == 0x000268, "Member 'Cinematic_TeamMics_C_Update::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cinematic_TeamMics_C_Update, CallFunc_IsValid_ReturnValue) == 0x000270, "Member 'Cinematic_TeamMics_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cinematic_TeamMics_C_Update, K2Node_Select_Default) == 0x000271, "Member 'Cinematic_TeamMics_C_Update::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Cinematic_TeamMics_C_Update, K2Node_Select_Default_1) == 0x000274, "Member 'Cinematic_TeamMics_C_Update::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Cinematic_TeamMics_C_Update, CallFunc_IsNetIdFromLocalPlayersPlatform_ReturnValue) == 0x000278, "Member 'Cinematic_TeamMics_C_Update::CallFunc_IsNetIdFromLocalPlayersPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cinematic_TeamMics_C_Update, K2Node_Select_Default_2) == 0x000280, "Member 'Cinematic_TeamMics_C_Update::K2Node_Select_Default_2' has a wrong offset!");

}

