#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cinematic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Cinematic.Cinematic_C
// 0x0060 (0x0528 - 0x04C8)
class UCinematic_C final : public UFortUIStateWidget_NUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             LocalizedAudioOnlyMovieSlot;                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetStackLegacy*               MainContentStack;                                  // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             MovieSlot;                                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayMovieOverlay;                               // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USubtitles_C*                           Subtitles;                                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTeamMicStack_C*                        TeamMicStack;                                      // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBuildWatermark_C*                      Widget_BuildWatermark;                             // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULegacy_MovieWidget_C*                  MovieWidget;                                       // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMediaSubtitlesPlayer*              SubtitlesPlayer;                                   // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CinematicMediaSoundWave;                           // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFinished;                                         // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ClearMovie();
	void ClearMovieSlot(class UPanelWidget*& MovieSlotToClear);
	void ClearMovieWidget(class UFortMovieWidget*& MovieWidgetToClear);
	void ClearOldSubtitlesIfNecessary(bool NewSubtitlesExist, class UFortMediaSubtitlesPlayer* NewSubtitles);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_Cinematic(int32 EntryPoint);
	void GetAudioTrackIndex(int32* AudioTrack);
	void HandleClientEvent_QueueCinematic(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleClientEvent_SkipCinematic(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleEndReached();
	void OnEnterState(EFortUIState PreviousUIState);
	void OnExitState(EFortUIState NextUIState);
	class UWidget* PopContentWidgetInternal(const struct FContentPushState& State);
	void PushContentWidgetInternal(class UWidget* Widget, const struct FContentPushState& State);
	void SetMoviePlaying(bool MoviePlaying);
	void ShowMovie(class UMediaPlayer* MediaPlayer, class UMediaSource* MediaSource, class UNamedSlot*& MovieSlot_0, class ULegacy_MovieWidget_C*& MovieWidget_0);
	void SkipMovie();
	void StopAndClearSubtitles();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cinematic_C">();
	}
	static class UCinematic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCinematic_C>();
	}
};
static_assert(alignof(UCinematic_C) == 0x000008, "Wrong alignment on UCinematic_C");
static_assert(sizeof(UCinematic_C) == 0x000528, "Wrong size on UCinematic_C");
static_assert(offsetof(UCinematic_C, UberGraphFrame) == 0x0004C8, "Member 'UCinematic_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCinematic_C, LocalizedAudioOnlyMovieSlot) == 0x0004D0, "Member 'UCinematic_C::LocalizedAudioOnlyMovieSlot' has a wrong offset!");
static_assert(offsetof(UCinematic_C, MainContentStack) == 0x0004D8, "Member 'UCinematic_C::MainContentStack' has a wrong offset!");
static_assert(offsetof(UCinematic_C, MovieSlot) == 0x0004E0, "Member 'UCinematic_C::MovieSlot' has a wrong offset!");
static_assert(offsetof(UCinematic_C, OverlayMovieOverlay) == 0x0004E8, "Member 'UCinematic_C::OverlayMovieOverlay' has a wrong offset!");
static_assert(offsetof(UCinematic_C, Subtitles) == 0x0004F0, "Member 'UCinematic_C::Subtitles' has a wrong offset!");
static_assert(offsetof(UCinematic_C, TeamMicStack) == 0x0004F8, "Member 'UCinematic_C::TeamMicStack' has a wrong offset!");
static_assert(offsetof(UCinematic_C, Widget_BuildWatermark) == 0x000500, "Member 'UCinematic_C::Widget_BuildWatermark' has a wrong offset!");
static_assert(offsetof(UCinematic_C, MovieWidget) == 0x000508, "Member 'UCinematic_C::MovieWidget' has a wrong offset!");
static_assert(offsetof(UCinematic_C, SubtitlesPlayer) == 0x000510, "Member 'UCinematic_C::SubtitlesPlayer' has a wrong offset!");
static_assert(offsetof(UCinematic_C, CinematicMediaSoundWave) == 0x000518, "Member 'UCinematic_C::CinematicMediaSoundWave' has a wrong offset!");
static_assert(offsetof(UCinematic_C, bFinished) == 0x000520, "Member 'UCinematic_C::bFinished' has a wrong offset!");

}

