#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CircleArrowButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CircleArrowButton.CircleArrowButton_C.ExecuteUbergraph_CircleArrowButton
// 0x0080 (0x0080 - 0x0000)
struct CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_2;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_3;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_4;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable_5;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable_6;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_2;                           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_3;                           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            K2Node_Select_Default_4;                           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton) == 0x000008, "Wrong alignment on CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton");
static_assert(sizeof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton) == 0x000080, "Wrong size on CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, EntryPoint) == 0x000000, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_bool_Variable) == 0x000004, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_struct_Variable) == 0x000008, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_bool_Variable_1) == 0x000010, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_byte_Variable) == 0x000011, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_byte_Variable_1) == 0x000012, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_bool_Variable_2) == 0x000013, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_byte_Variable_2) == 0x000014, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_bool_Variable_3) == 0x000015, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_byte_Variable_3) == 0x000016, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_byte_Variable_4) == 0x000017, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_bool_Variable_4) == 0x000018, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_byte_Variable_5) == 0x000019, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_byte_Variable_6) == 0x00001A, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, K2Node_Event_IsDesignTime) == 0x00001B, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000028, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000040, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_struct_Variable_1) == 0x000048, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, K2Node_Select_Default) == 0x000050, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, K2Node_Select_Default_1) == 0x000058, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, K2Node_Select_Default_2) == 0x000059, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000060, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, K2Node_Select_Default_3) == 0x000068, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000070, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, K2Node_Select_Default_4) == 0x000078, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::K2Node_Select_Default_4' has a wrong offset!");

// Function CircleArrowButton.CircleArrowButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CircleArrowButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CircleArrowButton_C_PreConstruct) == 0x000001, "Wrong alignment on CircleArrowButton_C_PreConstruct");
static_assert(sizeof(CircleArrowButton_C_PreConstruct) == 0x000001, "Wrong size on CircleArrowButton_C_PreConstruct");
static_assert(offsetof(CircleArrowButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CircleArrowButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CircleArrowButton.CircleArrowButton_C.UpdateArrowColor
// 0x0028 (0x0028 - 0x0000)
struct CircleArrowButton_C_UpdateArrowColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoverColor_0;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CircleArrowButton_C_UpdateArrowColor) == 0x000008, "Wrong alignment on CircleArrowButton_C_UpdateArrowColor");
static_assert(sizeof(CircleArrowButton_C_UpdateArrowColor) == 0x000028, "Wrong size on CircleArrowButton_C_UpdateArrowColor");
static_assert(offsetof(CircleArrowButton_C_UpdateArrowColor, Color) == 0x000000, "Member 'CircleArrowButton_C_UpdateArrowColor::Color' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_UpdateArrowColor, HoverColor_0) == 0x000010, "Member 'CircleArrowButton_C_UpdateArrowColor::HoverColor_0' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_UpdateArrowColor, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'CircleArrowButton_C_UpdateArrowColor::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

