#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClothCoreSettingStruct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ClothCoreSettingStruct.ClothCoreSettingStruct
// 0x0048 (0x0048 - 0x0000)
struct FClothCoreSettingStruct final
{
public:
	struct FVector2D                              EdgeStiffness_28_9A24DA0842E21D5736699499F1DE1171; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              BendingStiffness_29_6CD0864B4078D8378C061197E9B1B094; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              AreaStiffness_30_0D981B4E4039D5A0C6A4C78D6F09D510; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TetherStiffness_24_A5C4B017498D3154D76CECAB9AE7BDF2; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CollisionThickness_14_DACF320B4C03C6BD248A8E9B7B867FC7; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrictionCoefficient_15_E5761CE84E8E52EEBD663B9DC3A0906F; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SelfCollisionThickness_16_98974B1C4B5ABE4EA1CFF7A791319392; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DampingCoefficient_17_A343D5A54D704F5B249C8E907DA80101; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              AnimDriveStiffness_27_E54C28B348B4C35A1D0817AFA9FF0423; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              AnimDriveDamping_26_F9EDBF5240E75A4905AFA1A8240922C8; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberIterations_21_8E04A8E94B2040C7DBF93194733AC36A; // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberSubsteps_23_5108D5FA40140A1AAD38459100B14261; // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClothCoreSettingStruct) == 0x000004, "Wrong alignment on FClothCoreSettingStruct");
static_assert(sizeof(FClothCoreSettingStruct) == 0x000048, "Wrong size on FClothCoreSettingStruct");
static_assert(offsetof(FClothCoreSettingStruct, EdgeStiffness_28_9A24DA0842E21D5736699499F1DE1171) == 0x000000, "Member 'FClothCoreSettingStruct::EdgeStiffness_28_9A24DA0842E21D5736699499F1DE1171' has a wrong offset!");
static_assert(offsetof(FClothCoreSettingStruct, BendingStiffness_29_6CD0864B4078D8378C061197E9B1B094) == 0x000008, "Member 'FClothCoreSettingStruct::BendingStiffness_29_6CD0864B4078D8378C061197E9B1B094' has a wrong offset!");
static_assert(offsetof(FClothCoreSettingStruct, AreaStiffness_30_0D981B4E4039D5A0C6A4C78D6F09D510) == 0x000010, "Member 'FClothCoreSettingStruct::AreaStiffness_30_0D981B4E4039D5A0C6A4C78D6F09D510' has a wrong offset!");
static_assert(offsetof(FClothCoreSettingStruct, TetherStiffness_24_A5C4B017498D3154D76CECAB9AE7BDF2) == 0x000018, "Member 'FClothCoreSettingStruct::TetherStiffness_24_A5C4B017498D3154D76CECAB9AE7BDF2' has a wrong offset!");
static_assert(offsetof(FClothCoreSettingStruct, CollisionThickness_14_DACF320B4C03C6BD248A8E9B7B867FC7) == 0x000020, "Member 'FClothCoreSettingStruct::CollisionThickness_14_DACF320B4C03C6BD248A8E9B7B867FC7' has a wrong offset!");
static_assert(offsetof(FClothCoreSettingStruct, FrictionCoefficient_15_E5761CE84E8E52EEBD663B9DC3A0906F) == 0x000024, "Member 'FClothCoreSettingStruct::FrictionCoefficient_15_E5761CE84E8E52EEBD663B9DC3A0906F' has a wrong offset!");
static_assert(offsetof(FClothCoreSettingStruct, SelfCollisionThickness_16_98974B1C4B5ABE4EA1CFF7A791319392) == 0x000028, "Member 'FClothCoreSettingStruct::SelfCollisionThickness_16_98974B1C4B5ABE4EA1CFF7A791319392' has a wrong offset!");
static_assert(offsetof(FClothCoreSettingStruct, DampingCoefficient_17_A343D5A54D704F5B249C8E907DA80101) == 0x00002C, "Member 'FClothCoreSettingStruct::DampingCoefficient_17_A343D5A54D704F5B249C8E907DA80101' has a wrong offset!");
static_assert(offsetof(FClothCoreSettingStruct, AnimDriveStiffness_27_E54C28B348B4C35A1D0817AFA9FF0423) == 0x000030, "Member 'FClothCoreSettingStruct::AnimDriveStiffness_27_E54C28B348B4C35A1D0817AFA9FF0423' has a wrong offset!");
static_assert(offsetof(FClothCoreSettingStruct, AnimDriveDamping_26_F9EDBF5240E75A4905AFA1A8240922C8) == 0x000038, "Member 'FClothCoreSettingStruct::AnimDriveDamping_26_F9EDBF5240E75A4905AFA1A8240922C8' has a wrong offset!");
static_assert(offsetof(FClothCoreSettingStruct, NumberIterations_21_8E04A8E94B2040C7DBF93194733AC36A) == 0x000040, "Member 'FClothCoreSettingStruct::NumberIterations_21_8E04A8E94B2040C7DBF93194733AC36A' has a wrong offset!");
static_assert(offsetof(FClothCoreSettingStruct, NumberSubsteps_23_5108D5FA40140A1AAD38459100B14261) == 0x000044, "Member 'FClothCoreSettingStruct::NumberSubsteps_23_5108D5FA40140A1AAD38459100B14261' has a wrong offset!");

}

