#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClothParamsStruct

#include "Basic.hpp"

#include "ClothSettingStruct_structs.hpp"


namespace SDK
{

// UserDefinedStruct ClothParamsStruct.ClothParamsStruct
// 0x0230 (0x0230 - 0x0000)
struct FClothParamsStruct final
{
public:
	struct FClothSettingStruct                    Skydive_GoingUp_12_C026BDA74BFBABA6672DFE8FFDAAFC1B; // 0x0000(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Skydive_FloatingDown_10_2CBF3D3F421785F8994502931454A81F; // 0x0038(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Skydive_DivingDown_11_EC7BEC4D406A8A98E60D7B9374C5E457; // 0x0070(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Skydive_Parachuting_13_A88C4A0A407F497561D31287CB20250F; // 0x00A8(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    OnGround_Standing_15_267DB1464D0D3A29D99E94ADFCB4AFEC; // 0x00E0(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    OnGround_Moving_16_807A66B64D7B3B2FCF080B833B8A6254; // 0x0118(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    OnGround_Crouch_Moving_27_CE0B8BFB4E3417C0F790F7AE38DD7735; // 0x0150(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    EmoteOrMelee_25_CFCF66B5492987CBD638EC98EB34D572;  // 0x0188(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Swimming_3_33CE87CE4D4F712B1384E29115845962;       // 0x01C0(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Front_End_20_C7A4562A48E9BC9B4CD34D963CFC6490;     // 0x01F8(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClothParamsStruct) == 0x000004, "Wrong alignment on FClothParamsStruct");
static_assert(sizeof(FClothParamsStruct) == 0x000230, "Wrong size on FClothParamsStruct");
static_assert(offsetof(FClothParamsStruct, Skydive_GoingUp_12_C026BDA74BFBABA6672DFE8FFDAAFC1B) == 0x000000, "Member 'FClothParamsStruct::Skydive_GoingUp_12_C026BDA74BFBABA6672DFE8FFDAAFC1B' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Skydive_FloatingDown_10_2CBF3D3F421785F8994502931454A81F) == 0x000038, "Member 'FClothParamsStruct::Skydive_FloatingDown_10_2CBF3D3F421785F8994502931454A81F' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Skydive_DivingDown_11_EC7BEC4D406A8A98E60D7B9374C5E457) == 0x000070, "Member 'FClothParamsStruct::Skydive_DivingDown_11_EC7BEC4D406A8A98E60D7B9374C5E457' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Skydive_Parachuting_13_A88C4A0A407F497561D31287CB20250F) == 0x0000A8, "Member 'FClothParamsStruct::Skydive_Parachuting_13_A88C4A0A407F497561D31287CB20250F' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, OnGround_Standing_15_267DB1464D0D3A29D99E94ADFCB4AFEC) == 0x0000E0, "Member 'FClothParamsStruct::OnGround_Standing_15_267DB1464D0D3A29D99E94ADFCB4AFEC' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, OnGround_Moving_16_807A66B64D7B3B2FCF080B833B8A6254) == 0x000118, "Member 'FClothParamsStruct::OnGround_Moving_16_807A66B64D7B3B2FCF080B833B8A6254' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, OnGround_Crouch_Moving_27_CE0B8BFB4E3417C0F790F7AE38DD7735) == 0x000150, "Member 'FClothParamsStruct::OnGround_Crouch_Moving_27_CE0B8BFB4E3417C0F790F7AE38DD7735' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, EmoteOrMelee_25_CFCF66B5492987CBD638EC98EB34D572) == 0x000188, "Member 'FClothParamsStruct::EmoteOrMelee_25_CFCF66B5492987CBD638EC98EB34D572' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Swimming_3_33CE87CE4D4F712B1384E29115845962) == 0x0001C0, "Member 'FClothParamsStruct::Swimming_3_33CE87CE4D4F712B1384E29115845962' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Front_End_20_C7A4562A48E9BC9B4CD34D963CFC6490) == 0x0001F8, "Member 'FClothParamsStruct::Front_End_20_C7A4562A48E9BC9B4CD34D963CFC6490' has a wrong offset!");

}

