#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClothSettingStruct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ClothSettingStruct.ClothSettingStruct
// 0x0038 (0x0038 - 0x0000)
struct FClothSettingStruct final
{
public:
	struct FVector                                LinearVelocityScale_7_9CBE863E417FC965C07809A2FE55ADFD; // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AngularVelocityScale_6_6A3DFE4A481AD4D7CB18D79F95CC88E8; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FictitiousAngularScale_10_C5F4D16F48D0BEDC3F0FA38B2648511B; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GravityOverride_15_9C3CF2B14934A1AC917C4C99F03AFC6E; // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              DragCoefficient_23_FE68F666411FF9F29BA84CB4BE726A52; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LiftCoefficient_24_BB285D994A5B3AFF167F4793D7ECA837; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   JointName_27_C74F3B2245EA319DE82A629FF3C17CCA;     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClothSettingStruct) == 0x000004, "Wrong alignment on FClothSettingStruct");
static_assert(sizeof(FClothSettingStruct) == 0x000038, "Wrong size on FClothSettingStruct");
static_assert(offsetof(FClothSettingStruct, LinearVelocityScale_7_9CBE863E417FC965C07809A2FE55ADFD) == 0x000000, "Member 'FClothSettingStruct::LinearVelocityScale_7_9CBE863E417FC965C07809A2FE55ADFD' has a wrong offset!");
static_assert(offsetof(FClothSettingStruct, AngularVelocityScale_6_6A3DFE4A481AD4D7CB18D79F95CC88E8) == 0x00000C, "Member 'FClothSettingStruct::AngularVelocityScale_6_6A3DFE4A481AD4D7CB18D79F95CC88E8' has a wrong offset!");
static_assert(offsetof(FClothSettingStruct, FictitiousAngularScale_10_C5F4D16F48D0BEDC3F0FA38B2648511B) == 0x000010, "Member 'FClothSettingStruct::FictitiousAngularScale_10_C5F4D16F48D0BEDC3F0FA38B2648511B' has a wrong offset!");
static_assert(offsetof(FClothSettingStruct, GravityOverride_15_9C3CF2B14934A1AC917C4C99F03AFC6E) == 0x000014, "Member 'FClothSettingStruct::GravityOverride_15_9C3CF2B14934A1AC917C4C99F03AFC6E' has a wrong offset!");
static_assert(offsetof(FClothSettingStruct, DragCoefficient_23_FE68F666411FF9F29BA84CB4BE726A52) == 0x000020, "Member 'FClothSettingStruct::DragCoefficient_23_FE68F666411FF9F29BA84CB4BE726A52' has a wrong offset!");
static_assert(offsetof(FClothSettingStruct, LiftCoefficient_24_BB285D994A5B3AFF167F4793D7ECA837) == 0x000028, "Member 'FClothSettingStruct::LiftCoefficient_24_BB285D994A5B3AFF167F4793D7ECA837' has a wrong offset!");
static_assert(offsetof(FClothSettingStruct, JointName_27_C74F3B2245EA319DE82A629FF3C17CCA) == 0x000030, "Member 'FClothSettingStruct::JointName_27_C74F3B2245EA319DE82A629FF3C17CCA' has a wrong offset!");

}

