#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContentOnDemand

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ContentOnDemand.ContentOnDemand_C
// 0x0038 (0x0370 - 0x0338)
class UContentOnDemand_C final : public UFortContentOnDemand
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Downloaded;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Downloading;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         LastNotifiedNumDownload;                           // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastDisplayedNumDownload;                          // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_ContentOnDemand(int32 EntryPoint);
	void OnUpdatedState(int32 NumActiveDownloads, int32 NumErrors);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ContentOnDemand_C">();
	}
	static class UContentOnDemand_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentOnDemand_C>();
	}
};
static_assert(alignof(UContentOnDemand_C) == 0x000008, "Wrong alignment on UContentOnDemand_C");
static_assert(sizeof(UContentOnDemand_C) == 0x000370, "Wrong size on UContentOnDemand_C");
static_assert(offsetof(UContentOnDemand_C, UberGraphFrame) == 0x000338, "Member 'UContentOnDemand_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UContentOnDemand_C, Intro) == 0x000340, "Member 'UContentOnDemand_C::Intro' has a wrong offset!");
static_assert(offsetof(UContentOnDemand_C, Outro) == 0x000348, "Member 'UContentOnDemand_C::Outro' has a wrong offset!");
static_assert(offsetof(UContentOnDemand_C, Check) == 0x000350, "Member 'UContentOnDemand_C::Check' has a wrong offset!");
static_assert(offsetof(UContentOnDemand_C, Text_Downloaded) == 0x000358, "Member 'UContentOnDemand_C::Text_Downloaded' has a wrong offset!");
static_assert(offsetof(UContentOnDemand_C, Text_Downloading) == 0x000360, "Member 'UContentOnDemand_C::Text_Downloading' has a wrong offset!");
static_assert(offsetof(UContentOnDemand_C, LastNotifiedNumDownload) == 0x000368, "Member 'UContentOnDemand_C::LastNotifiedNumDownload' has a wrong offset!");
static_assert(offsetof(UContentOnDemand_C, LastDisplayedNumDownload) == 0x00036C, "Member 'UContentOnDemand_C::LastDisplayedNumDownload' has a wrong offset!");

}

