#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticLoadoutSelector

#include "Basic.hpp"


namespace SDK::Params
{

// Function CosmeticLoadoutSelector.CosmeticLoadoutSelector_C.ExecuteUbergraph_CosmeticLoadoutSelector
// 0x0028 (0x0028 - 0x0000)
struct CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NumLoadouts;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Selection;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector) == 0x000008, "Wrong alignment on CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector");
static_assert(sizeof(CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector) == 0x000028, "Wrong size on CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector");
static_assert(offsetof(CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector, EntryPoint) == 0x000000, "Member 'CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector, K2Node_Event_NumLoadouts) == 0x000004, "Member 'CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector::K2Node_Event_NumLoadouts' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000018, "Member 'CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector, K2Node_Event_Selection) == 0x000020, "Member 'CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector::K2Node_Event_Selection' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000024, "Member 'CosmeticLoadoutSelector_C_ExecuteUbergraph_CosmeticLoadoutSelector::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");

// Function CosmeticLoadoutSelector.CosmeticLoadoutSelector_C.OnLoadoutSet
// 0x0004 (0x0004 - 0x0000)
struct CosmeticLoadoutSelector_C_OnLoadoutSet final
{
public:
	int32                                         Selection;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutSelector_C_OnLoadoutSet) == 0x000004, "Wrong alignment on CosmeticLoadoutSelector_C_OnLoadoutSet");
static_assert(sizeof(CosmeticLoadoutSelector_C_OnLoadoutSet) == 0x000004, "Wrong size on CosmeticLoadoutSelector_C_OnLoadoutSet");
static_assert(offsetof(CosmeticLoadoutSelector_C_OnLoadoutSet, Selection) == 0x000000, "Member 'CosmeticLoadoutSelector_C_OnLoadoutSet::Selection' has a wrong offset!");

// Function CosmeticLoadoutSelector.CosmeticLoadoutSelector_C.OnNumLoadoutsFound
// 0x0004 (0x0004 - 0x0000)
struct CosmeticLoadoutSelector_C_OnNumLoadoutsFound final
{
public:
	int32                                         NumLoadouts;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutSelector_C_OnNumLoadoutsFound) == 0x000004, "Wrong alignment on CosmeticLoadoutSelector_C_OnNumLoadoutsFound");
static_assert(sizeof(CosmeticLoadoutSelector_C_OnNumLoadoutsFound) == 0x000004, "Wrong size on CosmeticLoadoutSelector_C_OnNumLoadoutsFound");
static_assert(offsetof(CosmeticLoadoutSelector_C_OnNumLoadoutsFound, NumLoadouts) == 0x000000, "Member 'CosmeticLoadoutSelector_C_OnNumLoadoutsFound::NumLoadouts' has a wrong offset!");

}

