#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticLoadoutCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CosmeticLoadoutCard.CosmeticLoadoutCard_C
// 0x0080 (0x0490 - 0x0410)
class UCosmeticLoadoutCard_C final : public UFortCosmeticLoadoutCard
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnRefreshCard;                                     // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnSelected;                                        // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortLazyImage*                         Image_Card;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PresetName;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RefreshBacking;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Header;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               UnsavedBang;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBMainCard;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                CharacterAsset;                                    // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                BackblingAsset;                                    // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                PickaxeAsset;                                      // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                GliderAsset;                                       // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                WrapAsset;                                         // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLargeTile;                                       // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0489(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_CosmeticLoadoutCard(int32 EntryPoint);
	void Get_First_Item(TArray<class UFortItemDefinition*>& inArray, class UFortItemDefinition** Result);
	void IsBlank(bool* Blank);
	void OnLoaded_1E2615E24358EA93BCC3BBB4925113EE(class UObject* Loaded);
	void OnLoaded_720B049647023D90A92C789B29FB1060(class UObject* Loaded);
	void OnLoaded_9C1753664F831A575C95389EB3050D6D(class UObject* Loaded);
	void OnLoaded_B0945C234A1D7EE9DB994DA20F20FC55(class UObject* Loaded);
	void OnLoaded_C53A1CD444E6E41E6696819693452D69(class UObject* Loaded);
	void OnUpdateCard();
	void PlayHoverForward();
	void PlayHoverReverse();
	void PlaySelectedForward();
	void PlaySelectedReverse();
	void PreConstruct(bool IsDesignTime);
	void UpdateLoadoutSlotVisuals(class FName PreviewImageTextureParameterName, class FName DefaultSwitchScalarName, class UObject* Object, class UTexture2D* DefaultTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CosmeticLoadoutCard_C">();
	}
	static class UCosmeticLoadoutCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmeticLoadoutCard_C>();
	}
};
static_assert(alignof(UCosmeticLoadoutCard_C) == 0x000008, "Wrong alignment on UCosmeticLoadoutCard_C");
static_assert(sizeof(UCosmeticLoadoutCard_C) == 0x000490, "Wrong size on UCosmeticLoadoutCard_C");
static_assert(offsetof(UCosmeticLoadoutCard_C, UberGraphFrame) == 0x000410, "Member 'UCosmeticLoadoutCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutCard_C, OnRefreshCard) == 0x000418, "Member 'UCosmeticLoadoutCard_C::OnRefreshCard' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutCard_C, OnSelected) == 0x000420, "Member 'UCosmeticLoadoutCard_C::OnSelected' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutCard_C, OnHover) == 0x000428, "Member 'UCosmeticLoadoutCard_C::OnHover' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutCard_C, Image_Card) == 0x000430, "Member 'UCosmeticLoadoutCard_C::Image_Card' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutCard_C, PresetName) == 0x000438, "Member 'UCosmeticLoadoutCard_C::PresetName' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutCard_C, RefreshBacking) == 0x000440, "Member 'UCosmeticLoadoutCard_C::RefreshBacking' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutCard_C, SizeBox_Header) == 0x000448, "Member 'UCosmeticLoadoutCard_C::SizeBox_Header' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutCard_C, UnsavedBang) == 0x000450, "Member 'UCosmeticLoadoutCard_C::UnsavedBang' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutCard_C, VBMainCard) == 0x000458, "Member 'UCosmeticLoadoutCard_C::VBMainCard' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutCard_C, CharacterAsset) == 0x000460, "Member 'UCosmeticLoadoutCard_C::CharacterAsset' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutCard_C, BackblingAsset) == 0x000468, "Member 'UCosmeticLoadoutCard_C::BackblingAsset' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutCard_C, PickaxeAsset) == 0x000470, "Member 'UCosmeticLoadoutCard_C::PickaxeAsset' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutCard_C, GliderAsset) == 0x000478, "Member 'UCosmeticLoadoutCard_C::GliderAsset' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutCard_C, WrapAsset) == 0x000480, "Member 'UCosmeticLoadoutCard_C::WrapAsset' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutCard_C, IsLargeTile) == 0x000488, "Member 'UCosmeticLoadoutCard_C::IsLargeTile' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutCard_C, Selected) == 0x000489, "Member 'UCosmeticLoadoutCard_C::Selected' has a wrong offset!");

}

