#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrewPurchaseScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CrewUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.BeginProgress
// 0x0018 (0x0018 - 0x0000)
struct CrewPurchaseScreen_C_BeginProgress final
{
public:
	class FText                                   ProgressLabel;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CrewPurchaseScreen_C_BeginProgress) == 0x000008, "Wrong alignment on CrewPurchaseScreen_C_BeginProgress");
static_assert(sizeof(CrewPurchaseScreen_C_BeginProgress) == 0x000018, "Wrong size on CrewPurchaseScreen_C_BeginProgress");
static_assert(offsetof(CrewPurchaseScreen_C_BeginProgress, ProgressLabel) == 0x000000, "Member 'CrewPurchaseScreen_C_BeginProgress::ProgressLabel' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.ExecuteUbergraph_CrewPurchaseScreen
// 0x00E8 (0x00E8 - 0x0000)
struct CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bTabsVisible;                         // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_SpacingAdjustmentForTabs;             // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_NewBackground;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBorder*>                        K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPurchaseNavButton_C*                   K2Node_DynamicCast_AsPurchase_Nav_Button;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen) == 0x000008, "Wrong alignment on CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen");
static_assert(sizeof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen) == 0x0000E8, "Wrong size on CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, EntryPoint) == 0x000000, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Event_bTabsVisible) == 0x000004, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Event_bTabsVisible' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Event_SpacingAdjustmentForTabs) == 0x000008, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Event_SpacingAdjustmentForTabs' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_struct_Variable) == 0x00000C, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_bool_Variable) == 0x000014, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_float_Variable) == 0x000018, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_float_Variable_1) == 0x00001C, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Event_IsDesignTime) == 0x000020, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Event_NewBackground) == 0x000028, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Event_NewBackground' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_struct_Variable_1) == 0x000038, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_GetEndTime_ReturnValue) == 0x000048, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_bool_Variable_1) == 0x00004C, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_MakeArray_Array) == 0x000058, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_DynamicCast_AsPurchase_Nav_Button) == 0x000068, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_DynamicCast_AsPurchase_Nav_Button' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_int_Array_Index_Variable) == 0x000074, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_Array_Get_Item) == 0x000078, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Select_Default) == 0x000080, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Select_Default_1) == 0x000088, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_MakeStruct_Margin) == 0x00008C, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000A0, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_Less_IntInt_ReturnValue) == 0x0000A1, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000A8, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_byte_Variable) == 0x0000B0, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_byte_Variable_1) == 0x0000B1, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_bool_Variable_2) == 0x0000B2, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000B8, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0000C0, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Event_bVisible) == 0x0000C8, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_DynamicCast_AsTexture) == 0x0000D0, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Select_Default_2) == 0x0000D9, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x0000E0, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.OnContainerTabVisibilityUpdated
// 0x0008 (0x0008 - 0x0000)
struct CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated final
{
public:
	bool                                          bTabsVisible;                                      // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpacingAdjustmentForTabs;                          // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated) == 0x000004, "Wrong alignment on CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated");
static_assert(sizeof(CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated) == 0x000008, "Wrong size on CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated");
static_assert(offsetof(CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated, bTabsVisible) == 0x000000, "Member 'CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated::bTabsVisible' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated, SpacingAdjustmentForTabs) == 0x000004, "Member 'CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated::SpacingAdjustmentForTabs' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.OnDownloadBackgroundComplete
// 0x0008 (0x0008 - 0x0000)
struct CrewPurchaseScreen_C_OnDownloadBackgroundComplete final
{
public:
	class UTexture2D*                             NewBackground;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchaseScreen_C_OnDownloadBackgroundComplete) == 0x000008, "Wrong alignment on CrewPurchaseScreen_C_OnDownloadBackgroundComplete");
static_assert(sizeof(CrewPurchaseScreen_C_OnDownloadBackgroundComplete) == 0x000008, "Wrong size on CrewPurchaseScreen_C_OnDownloadBackgroundComplete");
static_assert(offsetof(CrewPurchaseScreen_C_OnDownloadBackgroundComplete, NewBackground) == 0x000000, "Member 'CrewPurchaseScreen_C_OnDownloadBackgroundComplete::NewBackground' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.OnUpdatePurchaseButtonState
// 0x0010 (0x0010 - 0x0000)
struct CrewPurchaseScreen_C_OnUpdatePurchaseButtonState final
{
public:
	ECrewPurchaseButtonState                      ButtonState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrewPurchaseButtonState                      Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidget*                          K2Node_Select_Default;                             // 0x0008(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchaseScreen_C_OnUpdatePurchaseButtonState) == 0x000008, "Wrong alignment on CrewPurchaseScreen_C_OnUpdatePurchaseButtonState");
static_assert(sizeof(CrewPurchaseScreen_C_OnUpdatePurchaseButtonState) == 0x000010, "Wrong size on CrewPurchaseScreen_C_OnUpdatePurchaseButtonState");
static_assert(offsetof(CrewPurchaseScreen_C_OnUpdatePurchaseButtonState, ButtonState) == 0x000000, "Member 'CrewPurchaseScreen_C_OnUpdatePurchaseButtonState::ButtonState' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_OnUpdatePurchaseButtonState, Temp_byte_Variable) == 0x000001, "Member 'CrewPurchaseScreen_C_OnUpdatePurchaseButtonState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_OnUpdatePurchaseButtonState, K2Node_Select_Default) == 0x000008, "Member 'CrewPurchaseScreen_C_OnUpdatePurchaseButtonState::K2Node_Select_Default' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.OnUpdateVBuckRefundVisibility
// 0x0001 (0x0001 - 0x0000)
struct CrewPurchaseScreen_C_OnUpdateVBuckRefundVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchaseScreen_C_OnUpdateVBuckRefundVisibility) == 0x000001, "Wrong alignment on CrewPurchaseScreen_C_OnUpdateVBuckRefundVisibility");
static_assert(sizeof(CrewPurchaseScreen_C_OnUpdateVBuckRefundVisibility) == 0x000001, "Wrong size on CrewPurchaseScreen_C_OnUpdateVBuckRefundVisibility");
static_assert(offsetof(CrewPurchaseScreen_C_OnUpdateVBuckRefundVisibility, bVisible) == 0x000000, "Member 'CrewPurchaseScreen_C_OnUpdateVBuckRefundVisibility::bVisible' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CrewPurchaseScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchaseScreen_C_PreConstruct) == 0x000001, "Wrong alignment on CrewPurchaseScreen_C_PreConstruct");
static_assert(sizeof(CrewPurchaseScreen_C_PreConstruct) == 0x000001, "Wrong size on CrewPurchaseScreen_C_PreConstruct");
static_assert(offsetof(CrewPurchaseScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CrewPurchaseScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.UpdateLayoutForTabs
// 0x0038 (0x0038 - 0x0000)
struct CrewPurchaseScreen_C_UpdateLayoutForTabs final
{
public:
	bool                                          bTabsVisible;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpacingAdjustmentForTabs;                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CrewPurchaseScreen_C_UpdateLayoutForTabs) == 0x000008, "Wrong alignment on CrewPurchaseScreen_C_UpdateLayoutForTabs");
static_assert(sizeof(CrewPurchaseScreen_C_UpdateLayoutForTabs) == 0x000038, "Wrong size on CrewPurchaseScreen_C_UpdateLayoutForTabs");
static_assert(offsetof(CrewPurchaseScreen_C_UpdateLayoutForTabs, bTabsVisible) == 0x000000, "Member 'CrewPurchaseScreen_C_UpdateLayoutForTabs::bTabsVisible' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_UpdateLayoutForTabs, SpacingAdjustmentForTabs) == 0x000004, "Member 'CrewPurchaseScreen_C_UpdateLayoutForTabs::SpacingAdjustmentForTabs' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_UpdateLayoutForTabs, Temp_bool_Variable) == 0x000008, "Member 'CrewPurchaseScreen_C_UpdateLayoutForTabs::Temp_bool_Variable' has a wrong offset!");
