#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrewPurchase_RewardTile

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CrewPurchase_RewardTile.CrewPurchase_RewardTile_C.ExecuteUbergraph_CrewPurchase_RewardTile
// 0x0058 (0x0058 - 0x0000)
struct CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOwned;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCrewPurchaseScreen_C*                  K2Node_DynamicCast_AsCrew_Purchase_Screen;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Event_Texture;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile) == 0x000008, "Wrong alignment on CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile");
static_assert(sizeof(CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile) == 0x000058, "Wrong size on CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile");
static_assert(offsetof(CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile, EntryPoint) == 0x000000, "Member 'CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile, Temp_byte_Variable) == 0x000004, "Member 'CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile, Temp_byte_Variable_1) == 0x000005, "Member 'CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000010, "Member 'CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000020, "Member 'CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile, K2Node_Event_bOwned) == 0x000028, "Member 'CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile::K2Node_Event_bOwned' has a wrong offset!");
static_assert(offsetof(CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile, CallFunc_FindParentWidgetOfType_ReturnValue) == 0x000030, "Member 'CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile::CallFunc_FindParentWidgetOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile, K2Node_DynamicCast_AsCrew_Purchase_Screen) == 0x000038, "Member 'CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile::K2Node_DynamicCast_AsCrew_Purchase_Screen' has a wrong offset!");
static_assert(offsetof(CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile, K2Node_Event_Texture) == 0x000048, "Member 'CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile::K2Node_Event_Texture' has a wrong offset!");
static_assert(offsetof(CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile, Temp_bool_Variable) == 0x000050, "Member 'CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile, K2Node_Select_Default) == 0x000051, "Member 'CrewPurchase_RewardTile_C_ExecuteUbergraph_CrewPurchase_RewardTile::K2Node_Select_Default' has a wrong offset!");

// Function CrewPurchase_RewardTile.CrewPurchase_RewardTile_C.OnDownloadTileImageComplete
// 0x0008 (0x0008 - 0x0000)
struct CrewPurchase_RewardTile_C_OnDownloadTileImageComplete final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchase_RewardTile_C_OnDownloadTileImageComplete) == 0x000008, "Wrong alignment on CrewPurchase_RewardTile_C_OnDownloadTileImageComplete");
static_assert(sizeof(CrewPurchase_RewardTile_C_OnDownloadTileImageComplete) == 0x000008, "Wrong size on CrewPurchase_RewardTile_C_OnDownloadTileImageComplete");
static_assert(offsetof(CrewPurchase_RewardTile_C_OnDownloadTileImageComplete, Texture) == 0x000000, "Member 'CrewPurchase_RewardTile_C_OnDownloadTileImageComplete::Texture' has a wrong offset!");

// Function CrewPurchase_RewardTile.CrewPurchase_RewardTile_C.OnUpdateOwnedState
// 0x0001 (0x0001 - 0x0000)
struct CrewPurchase_RewardTile_C_OnUpdateOwnedState final
{
public:
	bool                                          bOwned;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchase_RewardTile_C_OnUpdateOwnedState) == 0x000001, "Wrong alignment on CrewPurchase_RewardTile_C_OnUpdateOwnedState");
static_assert(sizeof(CrewPurchase_RewardTile_C_OnUpdateOwnedState) == 0x000001, "Wrong size on CrewPurchase_RewardTile_C_OnUpdateOwnedState");
static_assert(offsetof(CrewPurchase_RewardTile_C_OnUpdateOwnedState, bOwned) == 0x000000, "Member 'CrewPurchase_RewardTile_C_OnUpdateOwnedState::bOwned' has a wrong offset!");

}

