#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrewCrown_Animated

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CrewCrown_Animated.CrewCrown_Animated_C
// 0x0030 (0x0278 - 0x0248)
class UCrewCrown_Animated_C final : public UUserWidget
{
public:
	class UImage*                                 Image_107;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_108;                                         // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_109;                                         // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Crown;                                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LowerGlow;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_UpperGlow;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CrewCrown_Animated_C">();
	}
	static class UCrewCrown_Animated_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewCrown_Animated_C>();
	}
};
static_assert(alignof(UCrewCrown_Animated_C) == 0x000008, "Wrong alignment on UCrewCrown_Animated_C");
static_assert(sizeof(UCrewCrown_Animated_C) == 0x000278, "Wrong size on UCrewCrown_Animated_C");
static_assert(offsetof(UCrewCrown_Animated_C, Image_107) == 0x000248, "Member 'UCrewCrown_Animated_C::Image_107' has a wrong offset!");
static_assert(offsetof(UCrewCrown_Animated_C, Image_108) == 0x000250, "Member 'UCrewCrown_Animated_C::Image_108' has a wrong offset!");
static_assert(offsetof(UCrewCrown_Animated_C, Image_109) == 0x000258, "Member 'UCrewCrown_Animated_C::Image_109' has a wrong offset!");
static_assert(offsetof(UCrewCrown_Animated_C, Image_Crown) == 0x000260, "Member 'UCrewCrown_Animated_C::Image_Crown' has a wrong offset!");
static_assert(offsetof(UCrewCrown_Animated_C, Image_LowerGlow) == 0x000268, "Member 'UCrewCrown_Animated_C::Image_LowerGlow' has a wrong offset!");
static_assert(offsetof(UCrewCrown_Animated_C, Image_UpperGlow) == 0x000270, "Member 'UCrewCrown_Animated_C::Image_UpperGlow' has a wrong offset!");

}

