#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrewBenefitsAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CrewBenefitsAnim.CrewBenefitsAnim_C
// 0x0080 (0x03E0 - 0x0360)
class UCrewBenefitsAnim_C final : public USubscriptionWelcomePreMessage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_arcs;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arcs2;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arcs3;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arcs4;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG_Crown;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BGPattern;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Blackout;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Cross;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FireAdd;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FireSolid;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HazardGlow;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Lightning1;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Lightning1_1;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void EventPlayIntro();
	void ExecuteUbergraph_CrewBenefitsAnim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CrewBenefitsAnim_C">();
	}
	static class UCrewBenefitsAnim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewBenefitsAnim_C>();
	}
};
static_assert(alignof(UCrewBenefitsAnim_C) == 0x000008, "Wrong alignment on UCrewBenefitsAnim_C");
static_assert(sizeof(UCrewBenefitsAnim_C) == 0x0003E0, "Wrong size on UCrewBenefitsAnim_C");
static_assert(offsetof(UCrewBenefitsAnim_C, UberGraphFrame) == 0x000360, "Member 'UCrewBenefitsAnim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCrewBenefitsAnim_C, Intro) == 0x000368, "Member 'UCrewBenefitsAnim_C::Intro' has a wrong offset!");
static_assert(offsetof(UCrewBenefitsAnim_C, Image_arcs) == 0x000370, "Member 'UCrewBenefitsAnim_C::Image_arcs' has a wrong offset!");
static_assert(offsetof(UCrewBenefitsAnim_C, Image_Arcs2) == 0x000378, "Member 'UCrewBenefitsAnim_C::Image_Arcs2' has a wrong offset!");
static_assert(offsetof(UCrewBenefitsAnim_C, Image_Arcs3) == 0x000380, "Member 'UCrewBenefitsAnim_C::Image_Arcs3' has a wrong offset!");
static_assert(offsetof(UCrewBenefitsAnim_C, Image_Arcs4) == 0x000388, "Member 'UCrewBenefitsAnim_C::Image_Arcs4' has a wrong offset!");
static_assert(offsetof(UCrewBenefitsAnim_C, Image_BG_Crown) == 0x000390, "Member 'UCrewBenefitsAnim_C::Image_BG_Crown' has a wrong offset!");
static_assert(offsetof(UCrewBenefitsAnim_C, Image_BGPattern) == 0x000398, "Member 'UCrewBenefitsAnim_C::Image_BGPattern' has a wrong offset!");
static_assert(offsetof(UCrewBenefitsAnim_C, Image_Blackout) == 0x0003A0, "Member 'UCrewBenefitsAnim_C::Image_Blackout' has a wrong offset!");
static_assert(offsetof(UCrewBenefitsAnim_C, Image_Cross) == 0x0003A8, "Member 'UCrewBenefitsAnim_C::Image_Cross' has a wrong offset!");
static_assert(offsetof(UCrewBenefitsAnim_C, Image_FireAdd) == 0x0003B0, "Member 'UCrewBenefitsAnim_C::Image_FireAdd' has a wrong offset!");
static_assert(offsetof(UCrewBenefitsAnim_C, Image_FireSolid) == 0x0003B8, "Member 'UCrewBenefitsAnim_C::Image_FireSolid' has a wrong offset!");
static_assert(offsetof(UCrewBenefitsAnim_C, Image_Glow) == 0x0003C0, "Member 'UCrewBenefitsAnim_C::Image_Glow' has a wrong offset!");
static_assert(offsetof(UCrewBenefitsAnim_C, Image_HazardGlow) == 0x0003C8, "Member 'UCrewBenefitsAnim_C::Image_HazardGlow' has a wrong offset!");
static_assert(offsetof(UCrewBenefitsAnim_C, Image_Lightning1) == 0x0003D0, "Member 'UCrewBenefitsAnim_C::Image_Lightning1' has a wrong offset!");
static_assert(offsetof(UCrewBenefitsAnim_C, Image_Lightning1_1) == 0x0003D8, "Member 'UCrewBenefitsAnim_C::Image_Lightning1_1' has a wrong offset!");

}

