#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrewSeasonLaunchScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function CrewSeasonLaunchScreen.CrewSeasonLaunchScreen_C.ExecuteUbergraph_CrewSeasonLaunchScreen
// 0x0010 (0x0010 - 0x0000)
struct CrewSeasonLaunchScreen_C_ExecuteUbergraph_CrewSeasonLaunchScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Event_NewBackground;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewSeasonLaunchScreen_C_ExecuteUbergraph_CrewSeasonLaunchScreen) == 0x000008, "Wrong alignment on CrewSeasonLaunchScreen_C_ExecuteUbergraph_CrewSeasonLaunchScreen");
static_assert(sizeof(CrewSeasonLaunchScreen_C_ExecuteUbergraph_CrewSeasonLaunchScreen) == 0x000010, "Wrong size on CrewSeasonLaunchScreen_C_ExecuteUbergraph_CrewSeasonLaunchScreen");
static_assert(offsetof(CrewSeasonLaunchScreen_C_ExecuteUbergraph_CrewSeasonLaunchScreen, EntryPoint) == 0x000000, "Member 'CrewSeasonLaunchScreen_C_ExecuteUbergraph_CrewSeasonLaunchScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(CrewSeasonLaunchScreen_C_ExecuteUbergraph_CrewSeasonLaunchScreen, K2Node_Event_NewBackground) == 0x000008, "Member 'CrewSeasonLaunchScreen_C_ExecuteUbergraph_CrewSeasonLaunchScreen::K2Node_Event_NewBackground' has a wrong offset!");

// Function CrewSeasonLaunchScreen.CrewSeasonLaunchScreen_C.OnDownloadBackgroundComplete
// 0x0008 (0x0008 - 0x0000)
struct CrewSeasonLaunchScreen_C_OnDownloadBackgroundComplete final
{
public:
	class UTexture2D*                             NewBackground;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewSeasonLaunchScreen_C_OnDownloadBackgroundComplete) == 0x000008, "Wrong alignment on CrewSeasonLaunchScreen_C_OnDownloadBackgroundComplete");
static_assert(sizeof(CrewSeasonLaunchScreen_C_OnDownloadBackgroundComplete) == 0x000008, "Wrong size on CrewSeasonLaunchScreen_C_OnDownloadBackgroundComplete");
static_assert(offsetof(CrewSeasonLaunchScreen_C_OnDownloadBackgroundComplete, NewBackground) == 0x000000, "Member 'CrewSeasonLaunchScreen_C_OnDownloadBackgroundComplete::NewBackground' has a wrong offset!");

}

