#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrewPurchaseScreen

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CrewUI_structs.hpp"
#include "CrewUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CrewPurchaseScreen.CrewPurchaseScreen_C
// 0x0168 (0x0688 - 0x0520)
class UCrewPurchaseScreen_C final : public UCrewPurchaseScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewTile;                                           // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TransitionOut;                                     // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TransitionIn;                                      // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_Disclaimer;                                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Border_LimitedTimeText;                            // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Border_RecurringText;                              // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Border_Subtitle;                                   // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCrewCrown_Animated_C*                  CrewCrown_Animated;                                // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BGDarken;                                    // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CMSBG;                                       // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ErrorBG;                                     // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ErrorBG_Accent;                              // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            LightBox_Progress;                                 // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Background;                                // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_MainContent;                               // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ProgressVBox;                                      // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_BottomRight;                              // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_TopRight;                                 // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Content;                                   // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_LeftContent;                               // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Null;                                         // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_NavPlaceholder;                             // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Content;                                  // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ProgressLabel;                                // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUpsell_TutorialTooltip_C*              Upsell_TutorialTooltip;                            // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              VisibilitySwitcher_PurchaseRejoinState;            // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UBorder*>                        RowTitles;                                         // 0x0600(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FLinearColor                           AccentColor;                                       // 0x0610(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SubHeaderColor;                                    // 0x0620(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FadeColor;                                         // 0x0630(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ImageMID;                                          // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Dispatch_TransitionIn;                             // 0x0648(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             OldBackground;                                     // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                DesignTimeAsset;                                   // 0x0660(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void BeginProgress(const class FText& ProgressLabel);
	void BP_OnActivated();
	void Construct();
	void EndProgress();
	void EventScreenTransitionIn();
	void EventSetColors();
	void ExecuteUbergraph_CrewPurchaseScreen(int32 EntryPoint);
	void OnContainerTabVisibilityUpdated(const bool bTabsVisible, const float SpacingAdjustmentForTabs);
	void OnDownloadBackgroundComplete(class UTexture2D* NewBackground);
	void OnStartingDownloadBackground();
	void OnUpdatePurchaseButtonState(ECrewPurchaseButtonState ButtonState);
	void OnUpdateVBuckRefundVisibility(bool bVisible);
	void PreConstruct(bool IsDesignTime);
	void SetDesignTimeImages();
	void UpdateLayoutForTabs(bool bTabsVisible, float SpacingAdjustmentForTabs);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CrewPurchaseScreen_C">();
	}
	static class UCrewPurchaseScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewPurchaseScreen_C>();
	}
};
static_assert(alignof(UCrewPurchaseScreen_C) == 0x000008, "Wrong alignment on UCrewPurchaseScreen_C");
static_assert(sizeof(UCrewPurchaseScreen_C) == 0x000688, "Wrong size on UCrewPurchaseScreen_C");
static_assert(offsetof(UCrewPurchaseScreen_C, UberGraphFrame) == 0x000520, "Member 'UCrewPurchaseScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, NewTile) == 0x000528, "Member 'UCrewPurchaseScreen_C::NewTile' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, TransitionOut) == 0x000530, "Member 'UCrewPurchaseScreen_C::TransitionOut' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, TransitionIn) == 0x000538, "Member 'UCrewPurchaseScreen_C::TransitionIn' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, Border_Disclaimer) == 0x000540, "Member 'UCrewPurchaseScreen_C::Border_Disclaimer' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, Border_LimitedTimeText) == 0x000548, "Member 'UCrewPurchaseScreen_C::Border_LimitedTimeText' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, Border_RecurringText) == 0x000550, "Member 'UCrewPurchaseScreen_C::Border_RecurringText' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, Border_Subtitle) == 0x000558, "Member 'UCrewPurchaseScreen_C::Border_Subtitle' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, CrewCrown_Animated) == 0x000560, "Member 'UCrewPurchaseScreen_C::CrewCrown_Animated' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, Image_BGDarken) == 0x000568, "Member 'UCrewPurchaseScreen_C::Image_BGDarken' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, Image_CMSBG) == 0x000570, "Member 'UCrewPurchaseScreen_C::Image_CMSBG' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, Image_ErrorBG) == 0x000578, "Member 'UCrewPurchaseScreen_C::Image_ErrorBG' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, Image_ErrorBG_Accent) == 0x000580, "Member 'UCrewPurchaseScreen_C::Image_ErrorBG_Accent' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, LightBox_Progress) == 0x000588, "Member 'UCrewPurchaseScreen_C::LightBox_Progress' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, Overlay_Background) == 0x000590, "Member 'UCrewPurchaseScreen_C::Overlay_Background' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, Overlay_MainContent) == 0x000598, "Member 'UCrewPurchaseScreen_C::Overlay_MainContent' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, ProgressSpinner) == 0x0005A0, "Member 'UCrewPurchaseScreen_C::ProgressSpinner' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, ProgressVBox) == 0x0005A8, "Member 'UCrewPurchaseScreen_C::ProgressVBox' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, SafeZone_BottomRight) == 0x0005B0, "Member 'UCrewPurchaseScreen_C::SafeZone_BottomRight' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, SafeZone_TopRight) == 0x0005B8, "Member 'UCrewPurchaseScreen_C::SafeZone_TopRight' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, SizeBox_Content) == 0x0005C0, "Member 'UCrewPurchaseScreen_C::SizeBox_Content' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, SizeBox_LeftContent) == 0x0005C8, "Member 'UCrewPurchaseScreen_C::SizeBox_LeftContent' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, Slot_Null) == 0x0005D0, "Member 'UCrewPurchaseScreen_C::Slot_Null' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, Spacer_NavPlaceholder) == 0x0005D8, "Member 'UCrewPurchaseScreen_C::Spacer_NavPlaceholder' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, Switcher_Content) == 0x0005E0, "Member 'UCrewPurchaseScreen_C::Switcher_Content' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, Text_ProgressLabel) == 0x0005E8, "Member 'UCrewPurchaseScreen_C::Text_ProgressLabel' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, Upsell_TutorialTooltip) == 0x0005F0, "Member 'UCrewPurchaseScreen_C::Upsell_TutorialTooltip' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, VisibilitySwitcher_PurchaseRejoinState) == 0x0005F8, "Member 'UCrewPurchaseScreen_C::VisibilitySwitcher_PurchaseRejoinState' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, RowTitles) == 0x000600, "Member 'UCrewPurchaseScreen_C::RowTitles' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, AccentColor) == 0x000610, "Member 'UCrewPurchaseScreen_C::AccentColor' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, SubHeaderColor) == 0x000620, "Member 'UCrewPurchaseScreen_C::SubHeaderColor' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, FadeColor) == 0x000630, "Member 'UCrewPurchaseScreen_C::FadeColor' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, ImageMID) == 0x000640, "Member 'UCrewPurchaseScreen_C::ImageMID' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, Dispatch_TransitionIn) == 0x000648, "Member 'UCrewPurchaseScreen_C::Dispatch_TransitionIn' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, OldBackground) == 0x000658, "Member 'UCrewPurchaseScreen_C::OldBackground' has a wrong offset!");
static_assert(offsetof(UCrewPurchaseScreen_C, DesignTimeAsset) == 0x000660, "Member 'UCrewPurchaseScreen_C::DesignTimeAsset' has a wrong offset!");

}

