#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_BoostJumpPack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_BoostJumpPack.DA_BoostJumpPack_C
// 0x0048 (0x1530 - 0x14E8)
class ADA_BoostJumpPack_C final : public AFortCustomizableAbilityDecoTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  ErrorReason;                                       // 0x14F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  ErrorReasonGamepad;                                // 0x1510(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BPPressTrigger(class AFortDecoHelper* FortDecoHelper);
	void ExecuteUbergraph_DA_BoostJumpPack(int32 EntryPoint);
	void IsOnGround(bool* bOnGround);
	void RaiseUsageError(const struct FGameplayTagContainer& FailedReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DA_BoostJumpPack_C">();
	}
	static class ADA_BoostJumpPack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADA_BoostJumpPack_C>();
	}
};
static_assert(alignof(ADA_BoostJumpPack_C) == 0x000008, "Wrong alignment on ADA_BoostJumpPack_C");
static_assert(sizeof(ADA_BoostJumpPack_C) == 0x001530, "Wrong size on ADA_BoostJumpPack_C");
static_assert(offsetof(ADA_BoostJumpPack_C, UberGraphFrame) == 0x0014E8, "Member 'ADA_BoostJumpPack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADA_BoostJumpPack_C, ErrorReason) == 0x0014F0, "Member 'ADA_BoostJumpPack_C::ErrorReason' has a wrong offset!");
static_assert(offsetof(ADA_BoostJumpPack_C, ErrorReasonGamepad) == 0x001510, "Member 'ADA_BoostJumpPack_C::ErrorReasonGamepad' has a wrong offset!");

}

