#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBNO_Carried

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct DBNO_Carried.DBNO_Carried_C.AnimBlueprintGeneratedConstantData
// 0x0147 (0x0148 - 0x0001)
struct DBNO_Carried::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_95;                                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_96;                                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_97;                                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_98;                                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          StructProperty_99;                                 // 0x0028(0x002C)(NoDestructor)
	float                                         FloatProperty_100;                                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_101;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_102;                                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_103;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           ByteProperty_104;                                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_105;                                  // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_106;                                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BoolProperty_107;                                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               EnumProperty_108;                                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                ByteProperty_109;                                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_110;                                  // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_111;                                  // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   StructProperty_112;                                // 0x0090(0x0020)(NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
};
static_assert(alignof(DBNO_Carried::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on DBNO_Carried::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(DBNO_Carried::FAnimBlueprintGeneratedConstantData) == 0x000148, "Wrong size on DBNO_Carried::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, NameProperty_95) == 0x000004, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::NameProperty_95' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, ObjectProperty_96) == 0x000010, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::ObjectProperty_96' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, ObjectProperty_97) == 0x000018, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::ObjectProperty_97' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, NameProperty_98) == 0x000020, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::NameProperty_98' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, StructProperty_99) == 0x000028, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::StructProperty_99' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, FloatProperty_100) == 0x000054, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::FloatProperty_100' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, ObjectProperty_101) == 0x000058, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::ObjectProperty_101' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, NameProperty_102) == 0x000060, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::NameProperty_102' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, FloatProperty_103) == 0x000068, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::FloatProperty_103' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, ByteProperty_104) == 0x00006C, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::ByteProperty_104' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, BoolProperty_105) == 0x00006D, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::BoolProperty_105' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, ObjectProperty_106) == 0x000070, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::ObjectProperty_106' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, BoolProperty_107) == 0x000078, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::BoolProperty_107' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, EnumProperty_108) == 0x000079, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::EnumProperty_108' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, ByteProperty_109) == 0x00007A, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::ByteProperty_109' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, NameProperty_110) == 0x00007C, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::NameProperty_110' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, NameProperty_111) == 0x000084, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::NameProperty_111' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, StructProperty_112) == 0x000090, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::StructProperty_112' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'DBNO_Carried::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct DBNO_Carried.DBNO_Carried_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct DBNO_Carried::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty;                                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_0;                                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBNO_Carried::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on DBNO_Carried::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(DBNO_Carried::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on DBNO_Carried::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedMutableData, FloatProperty) == 0x000004, "Member 'DBNO_Carried::FAnimBlueprintGeneratedMutableData::FloatProperty' has a wrong offset!");
static_assert(offsetof(DBNO_Carried::FAnimBlueprintGeneratedMutableData, FloatProperty_0) == 0x000008, "Member 'DBNO_Carried::FAnimBlueprintGeneratedMutableData::FloatProperty_0' has a wrong offset!");

}

