#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBNO_Carried_Simulation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function DBNO_Carried_Simulation.DBNO_Carried_Simulation_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct DBNO_Carried_Simulation_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(DBNO_Carried_Simulation_C_AnimGraph) == 0x000008, "Wrong alignment on DBNO_Carried_Simulation_C_AnimGraph");
static_assert(sizeof(DBNO_Carried_Simulation_C_AnimGraph) == 0x000020, "Wrong size on DBNO_Carried_Simulation_C_AnimGraph");
static_assert(offsetof(DBNO_Carried_Simulation_C_AnimGraph, InPose) == 0x000000, "Member 'DBNO_Carried_Simulation_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(DBNO_Carried_Simulation_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'DBNO_Carried_Simulation_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function DBNO_Carried_Simulation.DBNO_Carried_Simulation_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct DBNO_Carried_Simulation_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBNO_Carried_Simulation_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on DBNO_Carried_Simulation_C_BlueprintUpdateAnimation");
static_assert(sizeof(DBNO_Carried_Simulation_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on DBNO_Carried_Simulation_C_BlueprintUpdateAnimation");
static_assert(offsetof(DBNO_Carried_Simulation_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'DBNO_Carried_Simulation_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function DBNO_Carried_Simulation.DBNO_Carried_Simulation_C.ExecuteUbergraph_DBNO_Carried_Simulation
// 0x0028 (0x0028 - 0x0000)
struct DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomBodyType                           CallFunc_GetCharacterBodyType_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGender_IsMale;                         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGender_IsFemale;                       // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation) == 0x000008, "Wrong alignment on DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation");
static_assert(sizeof(DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation) == 0x000028, "Wrong size on DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation");
static_assert(offsetof(DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation, EntryPoint) == 0x000000, "Member 'DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation::EntryPoint' has a wrong offset!");
static_assert(offsetof(DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000010, "Member 'DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation, K2Node_Event_DeltaTimeX) == 0x00001C, "Member 'DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation, CallFunc_GetCharacterBodyType_ReturnValue) == 0x000020, "Member 'DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation::CallFunc_GetCharacterBodyType_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation, CallFunc_GetGender_IsMale) == 0x000021, "Member 'DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation::CallFunc_GetGender_IsMale' has a wrong offset!");
static_assert(offsetof(DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation, CallFunc_GetGender_IsFemale) == 0x000022, "Member 'DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation::CallFunc_GetGender_IsFemale' has a wrong offset!");
static_assert(offsetof(DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000023, "Member 'DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000024, "Member 'DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000025, "Member 'DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation, Temp_bool_Has_Been_Initd_Variable) == 0x000026, "Member 'DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation, Temp_bool_IsClosed_Variable) == 0x000027, "Member 'DBNO_Carried_Simulation_C_ExecuteUbergraph_DBNO_Carried_Simulation::Temp_bool_IsClosed_Variable' has a wrong offset!");

}

