#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBNO_Carried

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "DBNO_Carried_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass DBNO_Carried.DBNO_Carried_C
// 0x0AE0 (0x28C0 - 0x1DE0)
class UDBNO_Carried_C final : public UFortPlayerAnimInstance_DBNOCarried
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1DE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct DBNO_Carried::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x1DE8(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_1DF4[0x4];                                     // 0x1DF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1DF8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1E00(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1E08(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1E28(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1E48(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1F50(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x2058(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x2098(0x00C8)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x2160(0x01E0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance;                         // 0x2340(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x23E0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2400(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2428(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x2450(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x2490(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x24B0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x24F0(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x2510(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2550(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2570(0x00B8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x2628(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x26F0(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x27F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2820(0x0028)()
	EFortPlayerAnimBodyType                       __CustomProperty_my_animbodytype_BC9172D64300E6A13C48509FE2988A40; // 0x2848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomGender                             __CustomProperty_my_gender_BC9172D64300E6A13C48509FE2988A40; // 0x2849(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Carried;                                           // 0x284A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284B[0x5];                                     // 0x284B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   CarrierPawn;                                       // 0x2850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlayerAnimInstance*                CarrierAnimBP;                                     // 0x2858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LHandIKLocation;                                   // 0x2860(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LHandIKRotation;                                   // 0x286C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                TempAttachLocation;                                // 0x2878(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TempAttachRotation;                                // 0x2884(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         SubAnimPhysicsWeight;                              // 0x2890(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBeingDropped;                                    // 0x2894(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2895[0x3];                                     // 0x2895(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DropMontagePosition;                               // 0x2898(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289C[0x4];                                     // 0x289C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CarrierDropMontage;                                // 0x28A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CarrierPickupMontage;                              // 0x28A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBeingPickedUp;                                   // 0x28B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B1[0x3];                                     // 0x28B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PickupMontagePosition;                             // 0x28B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TransitionFromPickupToIdle;                        // 0x28B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DBNO_Carried_AnimGraphNode_ApplyAdditive_56B19EE040BEEBC25D674F8DC99831B9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DBNO_Carried_AnimGraphNode_ModifyBone_59E069244645BEF22808AB9196186F3F();
	void ExecuteUbergraph_DBNO_Carried(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DBNO_Carried_C">();
	}
	static class UDBNO_Carried_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBNO_Carried_C>();
	}
};
static_assert(alignof(UDBNO_Carried_C) == 0x000010, "Wrong alignment on UDBNO_Carried_C");
static_assert(sizeof(UDBNO_Carried_C) == 0x0028C0, "Wrong size on UDBNO_Carried_C");
static_assert(offsetof(UDBNO_Carried_C, UberGraphFrame) == 0x001DE0, "Member 'UDBNO_Carried_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, __AnimBlueprintMutables) == 0x001DE8, "Member 'UDBNO_Carried_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimBlueprintExtension_PropertyAccess) == 0x001DF8, "Member 'UDBNO_Carried_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimBlueprintExtension_Base) == 0x001E00, "Member 'UDBNO_Carried_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_Root) == 0x001E08, "Member 'UDBNO_Carried_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_LocalToComponentSpace) == 0x001E28, "Member 'UDBNO_Carried_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_ModifyBone_1) == 0x001E48, "Member 'UDBNO_Carried_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_ModifyBone) == 0x001F50, "Member 'UDBNO_Carried_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_SequencePlayer_1) == 0x002058, "Member 'UDBNO_Carried_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_ApplyAdditive) == 0x002098, "Member 'UDBNO_Carried_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_TwoBoneIK) == 0x002160, "Member 'UDBNO_Carried_C::AnimGraphNode_TwoBoneIK' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_SubInstance) == 0x002340, "Member 'UDBNO_Carried_C::AnimGraphNode_SubInstance' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_ComponentToLocalSpace) == 0x0023E0, "Member 'UDBNO_Carried_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_TransitionResult_1) == 0x002400, "Member 'UDBNO_Carried_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_TransitionResult) == 0x002428, "Member 'UDBNO_Carried_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_SequenceEvaluator_1) == 0x002450, "Member 'UDBNO_Carried_C::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_StateResult_2) == 0x002490, "Member 'UDBNO_Carried_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_SequencePlayer) == 0x0024B0, "Member 'UDBNO_Carried_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_StateResult_1) == 0x0024F0, "Member 'UDBNO_Carried_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_SequenceEvaluator) == 0x002510, "Member 'UDBNO_Carried_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_StateResult) == 0x002550, "Member 'UDBNO_Carried_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_StateMachine) == 0x002570, "Member 'UDBNO_Carried_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_TwoWayBlend) == 0x002628, "Member 'UDBNO_Carried_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_SaveCachedPose) == 0x0026F0, "Member 'UDBNO_Carried_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_UseCachedPose_1) == 0x0027F8, "Member 'UDBNO_Carried_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, AnimGraphNode_UseCachedPose) == 0x002820, "Member 'UDBNO_Carried_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, __CustomProperty_my_animbodytype_BC9172D64300E6A13C48509FE2988A40) == 0x002848, "Member 'UDBNO_Carried_C::__CustomProperty_my_animbodytype_BC9172D64300E6A13C48509FE2988A40' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, __CustomProperty_my_gender_BC9172D64300E6A13C48509FE2988A40) == 0x002849, "Member 'UDBNO_Carried_C::__CustomProperty_my_gender_BC9172D64300E6A13C48509FE2988A40' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, Carried) == 0x00284A, "Member 'UDBNO_Carried_C::Carried' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, CarrierPawn) == 0x002850, "Member 'UDBNO_Carried_C::CarrierPawn' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, CarrierAnimBP) == 0x002858, "Member 'UDBNO_Carried_C::CarrierAnimBP' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, LHandIKLocation) == 0x002860, "Member 'UDBNO_Carried_C::LHandIKLocation' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, LHandIKRotation) == 0x00286C, "Member 'UDBNO_Carried_C::LHandIKRotation' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, TempAttachLocation) == 0x002878, "Member 'UDBNO_Carried_C::TempAttachLocation' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, TempAttachRotation) == 0x002884, "Member 'UDBNO_Carried_C::TempAttachRotation' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, SubAnimPhysicsWeight) == 0x002890, "Member 'UDBNO_Carried_C::SubAnimPhysicsWeight' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, IsBeingDropped) == 0x002894, "Member 'UDBNO_Carried_C::IsBeingDropped' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, DropMontagePosition) == 0x002898, "Member 'UDBNO_Carried_C::DropMontagePosition' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, CarrierDropMontage) == 0x0028A0, "Member 'UDBNO_Carried_C::CarrierDropMontage' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, CarrierPickupMontage) == 0x0028A8, "Member 'UDBNO_Carried_C::CarrierPickupMontage' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, IsBeingPickedUp) == 0x0028B0, "Member 'UDBNO_Carried_C::IsBeingPickedUp' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, PickupMontagePosition) == 0x0028B4, "Member 'UDBNO_Carried_C::PickupMontagePosition' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_C, TransitionFromPickupToIdle) == 0x0028B8, "Member 'UDBNO_Carried_C::TransitionFromPickupToIdle' has a wrong offset!");

}

