#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiscoveryLobbyMatchmakingPlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DiscoveryLobbyMatchmakingPlay.DiscoveryLobbyMatchmakingPlay_C
// 0x0070 (0x04D8 - 0x0468)
class UDiscoveryLobbyMatchmakingPlay_C final : public UFortAthenaMatchmakingWidgetLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowMatchmakingDetails;                            // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewModeViolation;                                  // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_DisableFillBP;                              // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_DisableLobbyBP;                             // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Box_LimitedMatchmaking;                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMatchmakingInputIndicator_C*           MatchmakingInputIndicator;                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SpinnerAndTextContainer;                           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ViolatorSwitcher;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           ShowNewPlaylistTimer;                              // 0x04B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             MatchmakingSucceededSound;                         // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaylistAthena*                    PlaylistData;                                      // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShowingMatchmakingDetails;                       // 0x04C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CreativeMatchmakingSucceededSound;                 // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimateViolator();
	void BndEvt__Button_Play_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay(int32 EntryPoint);
	void OnCrossplayPreferencesChanged(bool IsCrossplayEnabled);
	void OnMatchmakingFinishedBlueprint(bool bSuccess, const class UFortPlaylistAthena* Playlist);
	void OnPrivateMatchButtonEnabledStateUpdated(const bool bIsLocalPlayerPartyLeader);
	void OnSetCancelButtonText(const class FText& CancelButtonText);
	void OnSetPlayButtonText(const class FText& PlayButtonText);
	void OnSquadFillButtonEnabledStateUpdated(const bool bIsLocalPlayerPartyLeader);
	void OnViolatorStyleRefreshed(const EFortMatchmakingViolatorStyle NewViolatorStyle);
	void PickMatchmakingSucceededSound(class USoundBase** SelectedMatchmakingSucceededSound);
	void PlaylistChanged(const struct FPlaylistFrontEndData& NewPlaylist, const class FText& PlaylistCMSOverrideName, EFortLobbyType LobbyType);
	void ShouldShowMatchmakingDetails(bool bShow);

	class FText GetButtonPrivateMatchText() const;
	class FText GetButtonPublicMatchText() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DiscoveryLobbyMatchmakingPlay_C">();
	}
	static class UDiscoveryLobbyMatchmakingPlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDiscoveryLobbyMatchmakingPlay_C>();
	}
};
static_assert(alignof(UDiscoveryLobbyMatchmakingPlay_C) == 0x000008, "Wrong alignment on UDiscoveryLobbyMatchmakingPlay_C");
static_assert(sizeof(UDiscoveryLobbyMatchmakingPlay_C) == 0x0004D8, "Wrong size on UDiscoveryLobbyMatchmakingPlay_C");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, UberGraphFrame) == 0x000468, "Member 'UDiscoveryLobbyMatchmakingPlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, ShowMatchmakingDetails) == 0x000470, "Member 'UDiscoveryLobbyMatchmakingPlay_C::ShowMatchmakingDetails' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, NewModeViolation) == 0x000478, "Member 'UDiscoveryLobbyMatchmakingPlay_C::NewModeViolation' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, Border_DisableFillBP) == 0x000480, "Member 'UDiscoveryLobbyMatchmakingPlay_C::Border_DisableFillBP' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, Border_DisableLobbyBP) == 0x000488, "Member 'UDiscoveryLobbyMatchmakingPlay_C::Border_DisableLobbyBP' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, Box_LimitedMatchmaking) == 0x000490, "Member 'UDiscoveryLobbyMatchmakingPlay_C::Box_LimitedMatchmaking' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, MatchmakingInputIndicator) == 0x000498, "Member 'UDiscoveryLobbyMatchmakingPlay_C::MatchmakingInputIndicator' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, SpinnerAndTextContainer) == 0x0004A0, "Member 'UDiscoveryLobbyMatchmakingPlay_C::SpinnerAndTextContainer' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, ViolatorSwitcher) == 0x0004A8, "Member 'UDiscoveryLobbyMatchmakingPlay_C::ViolatorSwitcher' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, ShowNewPlaylistTimer) == 0x0004B0, "Member 'UDiscoveryLobbyMatchmakingPlay_C::ShowNewPlaylistTimer' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, MatchmakingSucceededSound) == 0x0004B8, "Member 'UDiscoveryLobbyMatchmakingPlay_C::MatchmakingSucceededSound' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, PlaylistData) == 0x0004C0, "Member 'UDiscoveryLobbyMatchmakingPlay_C::PlaylistData' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, IsShowingMatchmakingDetails) == 0x0004C8, "Member 'UDiscoveryLobbyMatchmakingPlay_C::IsShowingMatchmakingDetails' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, CreativeMatchmakingSucceededSound) == 0x0004D0, "Member 'UDiscoveryLobbyMatchmakingPlay_C::CreativeMatchmakingSucceededSound' has a wrong offset!");

}

