#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DivisionDetailsProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DivisionDetailsProgress.DivisionDetailsProgress_C
// 0x0018 (0x0298 - 0x0280)
class UDivisionDetailsProgress_C final : public UFortShowdownDivisionRankProgressView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          CommonBorder_CalloutOffset;                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ProgressBarContainer;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DivisionDetailsProgress(int32 EntryPoint);
	void OnSetInProgress(float NewPercent, bool bIsInProgress);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DivisionDetailsProgress_C">();
	}
	static class UDivisionDetailsProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDivisionDetailsProgress_C>();
	}
};
static_assert(alignof(UDivisionDetailsProgress_C) == 0x000008, "Wrong alignment on UDivisionDetailsProgress_C");
static_assert(sizeof(UDivisionDetailsProgress_C) == 0x000298, "Wrong size on UDivisionDetailsProgress_C");
static_assert(offsetof(UDivisionDetailsProgress_C, UberGraphFrame) == 0x000280, "Member 'UDivisionDetailsProgress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDivisionDetailsProgress_C, CommonBorder_CalloutOffset) == 0x000288, "Member 'UDivisionDetailsProgress_C::CommonBorder_CalloutOffset' has a wrong offset!");
static_assert(offsetof(UDivisionDetailsProgress_C, ProgressBarContainer) == 0x000290, "Member 'UDivisionDetailsProgress_C::ProgressBarContainer' has a wrong offset!");

}

