#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DivisionDetailsProgress

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DivisionDetailsProgress.DivisionDetailsProgress_C.ExecuteUbergraph_DivisionDetailsProgress
// 0x0020 (0x0020 - 0x0000)
struct DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewPercent;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInProgress;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress) == 0x000004, "Wrong alignment on DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress");
static_assert(sizeof(DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress) == 0x000020, "Wrong size on DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress");
static_assert(offsetof(DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress, EntryPoint) == 0x000000, "Member 'DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress, K2Node_Event_NewPercent) == 0x000004, "Member 'DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress::K2Node_Event_NewPercent' has a wrong offset!");
static_assert(offsetof(DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress, K2Node_Event_bIsInProgress) == 0x000008, "Member 'DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress::K2Node_Event_bIsInProgress' has a wrong offset!");
static_assert(offsetof(DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress, CallFunc_Less_FloatFloat_ReturnValue) == 0x000014, "Member 'DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'DivisionDetailsProgress_C_ExecuteUbergraph_DivisionDetailsProgress::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function DivisionDetailsProgress.DivisionDetailsProgress_C.OnSetInProgress
// 0x0008 (0x0008 - 0x0000)
struct DivisionDetailsProgress_C_OnSetInProgress final
{
public:
	float                                         NewPercent;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInProgress;                                     // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DivisionDetailsProgress_C_OnSetInProgress) == 0x000004, "Wrong alignment on DivisionDetailsProgress_C_OnSetInProgress");
static_assert(sizeof(DivisionDetailsProgress_C_OnSetInProgress) == 0x000008, "Wrong size on DivisionDetailsProgress_C_OnSetInProgress");
static_assert(offsetof(DivisionDetailsProgress_C_OnSetInProgress, NewPercent) == 0x000000, "Member 'DivisionDetailsProgress_C_OnSetInProgress::NewPercent' has a wrong offset!");
static_assert(offsetof(DivisionDetailsProgress_C_OnSetInProgress, bIsInProgress) == 0x000004, "Member 'DivisionDetailsProgress_C_OnSetInProgress::bIsInProgress' has a wrong offset!");

}

