#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DivisionIconButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DivisionIconButton.DivisionIconButton_C
// 0x0020 (0x0F20 - 0x0F00)
class UDivisionIconButton_C final : public UFortShowdownDivisionRankButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Hover;                                       // 0x0F10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_DivisionIconButton(int32 EntryPoint);
	void OnRankButtonSelected(bool bIsSelected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DivisionIconButton_C">();
	}
	static class UDivisionIconButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDivisionIconButton_C>();
	}
};
static_assert(alignof(UDivisionIconButton_C) == 0x000010, "Wrong alignment on UDivisionIconButton_C");
static_assert(sizeof(UDivisionIconButton_C) == 0x000F20, "Wrong size on UDivisionIconButton_C");
static_assert(offsetof(UDivisionIconButton_C, UberGraphFrame) == 0x000F00, "Member 'UDivisionIconButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDivisionIconButton_C, Selected) == 0x000F08, "Member 'UDivisionIconButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UDivisionIconButton_C, Image_Hover) == 0x000F10, "Member 'UDivisionIconButton_C::Image_Hover' has a wrong offset!");

}

