#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function DynamicUI.DynamicUIManager.AddScene
// 0x0010 (0x0010 - 0x0000)
struct DynamicUIManager_AddScene final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicUIManager_AddScene) == 0x000008, "Wrong alignment on DynamicUIManager_AddScene");
static_assert(sizeof(DynamicUIManager_AddScene) == 0x000010, "Wrong size on DynamicUIManager_AddScene");
static_assert(offsetof(DynamicUIManager_AddScene, Scene) == 0x000000, "Member 'DynamicUIManager_AddScene::Scene' has a wrong offset!");
static_assert(offsetof(DynamicUIManager_AddScene, OptionalContext) == 0x000008, "Member 'DynamicUIManager_AddScene::OptionalContext' has a wrong offset!");

// Function DynamicUI.DynamicUIManager.AddScenes
// 0x0018 (0x0018 - 0x0000)
struct DynamicUIManager_AddScenes final
{
public:
	TArray<class UDynamicUIScene*>                Scenes;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicUIManager_AddScenes) == 0x000008, "Wrong alignment on DynamicUIManager_AddScenes");
static_assert(sizeof(DynamicUIManager_AddScenes) == 0x000018, "Wrong size on DynamicUIManager_AddScenes");
static_assert(offsetof(DynamicUIManager_AddScenes, Scenes) == 0x000000, "Member 'DynamicUIManager_AddScenes::Scenes' has a wrong offset!");
static_assert(offsetof(DynamicUIManager_AddScenes, OptionalContext) == 0x000010, "Member 'DynamicUIManager_AddScenes::OptionalContext' has a wrong offset!");

// Function DynamicUI.DynamicUIManager.RemoveScene
// 0x0010 (0x0010 - 0x0000)
struct DynamicUIManager_RemoveScene final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicUIManager_RemoveScene) == 0x000008, "Wrong alignment on DynamicUIManager_RemoveScene");
static_assert(sizeof(DynamicUIManager_RemoveScene) == 0x000010, "Wrong size on DynamicUIManager_RemoveScene");
static_assert(offsetof(DynamicUIManager_RemoveScene, Scene) == 0x000000, "Member 'DynamicUIManager_RemoveScene::Scene' has a wrong offset!");
static_assert(offsetof(DynamicUIManager_RemoveScene, OptionalContext) == 0x000008, "Member 'DynamicUIManager_RemoveScene::OptionalContext' has a wrong offset!");

// Function DynamicUI.DynamicUIManager.RemoveScenes
// 0x0018 (0x0018 - 0x0000)
struct DynamicUIManager_RemoveScenes final
{
public:
	TArray<class UDynamicUIScene*>                Scenes;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicUIManager_RemoveScenes) == 0x000008, "Wrong alignment on DynamicUIManager_RemoveScenes");
static_assert(sizeof(DynamicUIManager_RemoveScenes) == 0x000018, "Wrong size on DynamicUIManager_RemoveScenes");
static_assert(offsetof(DynamicUIManager_RemoveScenes, Scenes) == 0x000000, "Member 'DynamicUIManager_RemoveScenes::Scenes' has a wrong offset!");
static_assert(offsetof(DynamicUIManager_RemoveScenes, OptionalContext) == 0x000010, "Member 'DynamicUIManager_RemoveScenes::OptionalContext' has a wrong offset!");

}

