#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmergencyNoticeWidgetBR

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function EmergencyNoticeWidgetBR.EmergencyNoticeWidgetBR_C.ExecuteUbergraph_EmergencyNoticeWidgetBR
// 0x0068 (0x0068 - 0x0000)
struct EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Title;                                // 0x0008(0x0018)(ConstParm)
	class FText                                   K2Node_Event_Body;                                 // 0x0020(0x0018)(ConstParm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0038(0x0018)()
	ETextJustify                                  Temp_byte_Variable_3;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  K2Node_Select_Default;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_1;                           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR) == 0x000008, "Wrong alignment on EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR");
static_assert(sizeof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR) == 0x000068, "Wrong size on EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, EntryPoint) == 0x000000, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::EntryPoint' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, Temp_byte_Variable) == 0x000004, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, Temp_bool_Variable) == 0x000005, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, Temp_byte_Variable_1) == 0x000006, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, Temp_byte_Variable_2) == 0x000007, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, K2Node_Event_Title) == 0x000008, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::K2Node_Event_Title' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, K2Node_Event_Body) == 0x000020, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::K2Node_Event_Body' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, CallFunc_TextToUpper_ReturnValue) == 0x000038, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, Temp_byte_Variable_3) == 0x000050, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, Temp_bool_Variable_1) == 0x000051, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, CallFunc_IsMobileGame_ReturnValue) == 0x000052, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000058, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, K2Node_Select_Default) == 0x000060, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, K2Node_Select_Default_1) == 0x000061, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::K2Node_Select_Default_1' has a wrong offset!");

// Function EmergencyNoticeWidgetBR.EmergencyNoticeWidgetBR_C.Show Notice
// 0x0008 (0x0008 - 0x0000)
struct EmergencyNoticeWidgetBR_C_Show_Notice final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyNoticeWidgetBR_C_Show_Notice) == 0x000008, "Wrong alignment on EmergencyNoticeWidgetBR_C_Show_Notice");
static_assert(sizeof(EmergencyNoticeWidgetBR_C_Show_Notice) == 0x000008, "Wrong size on EmergencyNoticeWidgetBR_C_Show_Notice");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_Show_Notice, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'EmergencyNoticeWidgetBR_C_Show_Notice::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function EmergencyNoticeWidgetBR.EmergencyNoticeWidgetBR_C.ShowNotice
// 0x0030 (0x0030 - 0x0000)
struct EmergencyNoticeWidgetBR_C_ShowNotice final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Body;                                              // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(EmergencyNoticeWidgetBR_C_ShowNotice) == 0x000008, "Wrong alignment on EmergencyNoticeWidgetBR_C_ShowNotice");
static_assert(sizeof(EmergencyNoticeWidgetBR_C_ShowNotice) == 0x000030, "Wrong size on EmergencyNoticeWidgetBR_C_ShowNotice");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ShowNotice, Title) == 0x000000, "Member 'EmergencyNoticeWidgetBR_C_ShowNotice::Title' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ShowNotice, Body) == 0x000018, "Member 'EmergencyNoticeWidgetBR_C_ShowNotice::Body' has a wrong offset!");

}

