#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnemyPawn_Parent_Deimos

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass EnemyPawn_Parent_Deimos.EnemyPawn_Parent_Deimos_C
// 0x0330 (0x2B40 - 0x2810)
class AEnemyPawn_Parent_Deimos_C : public AFortAIPawn
{
public:
	uint8                                         Pad_2808[0x8];                                     // 0x2808(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2810(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USoundLibraryComponent*                 SoundLibrary;                                      // 0x2818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      WeaponCapsuleCollision;                            // 0x2820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Elemental_Layer_Audio_Loop;                        // 0x2828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Enemy_Spawn_Out_TL_ColorFadeOutTrack_37A083E44F5772C5FFF36680D2AD7D94; // 0x2830(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Enemy_Spawn_Out_TL_FadeInTrack_37A083E44F5772C5FFF36680D2AD7D94; // 0x2834(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Enemy_Spawn_Out_TL__Direction_37A083E44F5772C5FFF36680D2AD7D94; // 0x2838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2839[0x7];                                     // 0x2839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Enemy_Spawn_Out_TL;                                // 0x2840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnemySpawnInTL_ColorFadeOutTrack_515E6B424789F427A1B9ACAD857FFF5D; // 0x2848(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnemySpawnInTL_FadeInTrack_515E6B424789F427A1B9ACAD857FFF5D; // 0x284C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EnemySpawnInTL__Direction_515E6B424789F427A1B9ACAD857FFF5D; // 0x2850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2851[0x7];                                     // 0x2851(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EnemySpawnInTL;                                    // 0x2858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             SpawnParticlesTransform;                           // 0x2860(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        SpawnParticles;                                    // 0x2890(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CharacterElementalParticles;                       // 0x2898(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowHeadshot;                                     // 0x28A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A1[0x7];                                     // 0x28A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TC_RangedWeapon;                                   // 0x28A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystemComponent*               HeadshotParticleSystemComp;                        // 0x28C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Additive_Hit_React_Montage;                        // 0x28D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Death_Normal_Sound;                                // 0x28D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Elemental_Audio_Layer_Sound;                       // 0x28E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Headshot_FX_Socket;                                // 0x28E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class USkeletalMeshComponent*, class UFXSkeletonMeshComponent_C*> AwakenFXSkeletalMeshes;                            // 0x28F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class UStaticMeshComponent*, class UFXStaticMeshComponent_C*> AwakenFXStaticMeshes;                              // 0x2940(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         AwokenMaxDistance;                                 // 0x2990(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AwakenDuration;                                    // 0x2994(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DestroyAwakenFXTimer;                              // 0x2998(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class USkeletalMeshComponent*, class UFXSkeletonMeshComponent_C*> BuildingHitFXSkeletalMeshes;                       // 0x29A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class UStaticMeshComponent*, class UFXStaticMeshComponent_C*> BuildingHitFXStaticMeshes;                         // 0x29F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         BuildingHitDuration;                               // 0x2A40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A44[0x4];                                     // 0x2A44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DestroyBuildingHitFXTimer;                         // 0x2A48(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFXSkeletonMeshComponent_C*             TempFXSkeletalMesh;                                // 0x2A50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         RegisteredSkeletalMeshesForEffects;                // 0x2A58(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           RegisteredStaticMeshesForEffects;                  // 0x2A68(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          HasGlowColorsAssigned;                             // 0x2A78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnInTimelineCompletedSuccessfully;              // 0x2A79(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A7A[0x6];                                     // 0x2A7A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CharacterSpawnInSafetyCheckHandle;                 // 0x2A80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       Previous_MID;                                      // 0x2A88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystem*                        CharacterAmbientParticlesTemplate;                 // 0x2A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CharacterAmbientParticles;                         // 0x2AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 DuplicateCharacterMesh;                            // 0x2AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DuplicateCharacterMID;                             // 0x2AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        Auxillary_Objects;                                 // 0x2AB8(0x0010)(Edit, BlueprintVisible)
	TArray<class UObject*>                        Duplicate_Auxillary_Objects;                       // 0x2AC8(0x0010)(Edit, BlueprintVisible)
	class UParticleSystemComponent*               MinibossPSComponent;                               // 0x2AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CharacterParticlesMaxDrawDistance;                 // 0x2AE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AE4[0x4];                                     // 0x2AE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicalMaterial*>              Original_Phys_Material;                            // 0x2AE8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>       Previous_MID_AuxObjs;                              // 0x2AF8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Restoring_Array_Index;                             // 0x2B08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseHeadShotFX;                                     // 0x2B0C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B0D[0x3];                                     // 0x2B0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Death_Dematerialize_Sound;                         // 0x2B10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HeadShot_Sound;                                    // 0x2B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdditiveHitReactRetriggerDelay;                    // 0x2B20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_SidewaysSpawnFx;                                // 0x2B24(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B2C[0x4];                                     // 0x2B2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USimpleSoundLibraryContext*             SoundLibraryContext;                               // 0x2B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_OnSpawnFX;                                      // 0x2B38(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AdditiveHitReactDelay();
	void ApplyAwakenEffectToSkeletalMesh(class USkeletalMeshComponent* Mesh_0);
	void ApplyAwakenEffectToStaticMesh(class UStaticMeshComponent* Mesh_0);
	void ApplyBuildingHitEffectToSkeletalMesh(class USkeletalMeshComponent* Mesh_0);
	void ApplyBuildingHitEffectToStaticMesh(class UStaticMeshComponent* Mesh_0);
	void CharacterSpawnInSafetyCheck();
	void DebugEnemySpawnIn();
	void DeregisterEffectSkeletalMesh(class USkeletalMeshComponent* Mesh_0);
	void DeregisterEffectStaticMesh(class UStaticMeshComponent* Mesh_0);
	void DespawnEnemy(const struct FVector& RiftLocationWS);
	void DestroyBuildingHitEffect();
	void Enemy_Spawn_Out_TL__FinishedFunc();
	void Enemy_Spawn_Out_TL__UpdateFunc();
	void EnemySpawnInTL__FinishedFunc();
	void EnemySpawnInTL__Spawn__EventFunc();
	void EnemySpawnInTL__UpdateFunc();
	void ExecuteUbergraph_EnemyPawn_Parent_Deimos(int32 EntryPoint);
	void ManualDespawnEnemy(const struct FVector& RiftLocationWS);
	void ManualEnemySpawnIn(const struct FVector& RiftLocationWS);
	void OnBeginDance();
	void OnBeginDeepWaterInteraction(const struct FVector& WaterSurfaceLocation, float WaterDepth);
	void OnBuildingHitPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, const struct FGameplayEffectContextHandle& EffectContext, bool bPlayerPlaced);
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnEndDance();
	void OnFinishedEncounterSpawn();
	void OnStartedEncounterSpawn();
	void OnWaterDeepNavMeshEnter();
	void Orphaned(bool* IsOrphaned, class AFortPawn** AttachedPawn);
	void PlayAdditiveHitReacts(const struct FVector& Hit_Direction, class UAnimMontage* Anim_Montage);
	void PlaySoundLibraryAudio(const struct FGameplayTag& Event_Name);
	void PostSpawnIn();
	void ReceiveBeginPlay();
	void RegisterEffectSkeletalMesh(class USkeletalMeshComponent* Mesh_0);
	void RegisterEffectStaticMesh(class UStaticMeshComponent* Mesh_0);
	void SetScalarParameterOnAllCharacterMIDs(class FName Parameter_Name, float Scalar_Value, bool AlsoModifyOriginalMIDs);
	void SetVectorParameterOnAllCharacterMIDs(class FName Parameter_Name, const struct FVector& Vector_Value, bool Propagate_to_Auxiliary_Meshes);
	void SpawnInSafetyCheck();
	void SpawnParticleSystemOnCharacterMesh(class UParticleSystem* ParticleSystemTemplate, class UParticleSystemComponent* ParticleSystemComponentReferenceVar, class FName AttachPointName, const struct FVector& Location, const struct FRotator& Rotation, TArray<struct FParticleSysParam>& InstanceParameters, bool AutoActivate, bool AutoDestroy, bool AbsoluteLocation, bool AbsoluteRotation, bool AbsoluteScale, class UParticleSystemComponent** PSComponentReference);
	void TriggerDeathFX();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EnemyPawn_Parent_Deimos_C">();
	}
	static class AEnemyPawn_Parent_Deimos_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEnemyPawn_Parent_Deimos_C>();
	}
};
static_assert(alignof(AEnemyPawn_Parent_Deimos_C) == 0x000010, "Wrong alignment on AEnemyPawn_Parent_Deimos_C");
static_assert(sizeof(AEnemyPawn_Parent_Deimos_C) == 0x002B40, "Wrong size on AEnemyPawn_Parent_Deimos_C");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, UberGraphFrame) == 0x002810, "Member 'AEnemyPawn_Parent_Deimos_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, SoundLibrary) == 0x002818, "Member 'AEnemyPawn_Parent_Deimos_C::SoundLibrary' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, WeaponCapsuleCollision) == 0x002820, "Member 'AEnemyPawn_Parent_Deimos_C::WeaponCapsuleCollision' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Elemental_Layer_Audio_Loop) == 0x002828, "Member 'AEnemyPawn_Parent_Deimos_C::Elemental_Layer_Audio_Loop' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Enemy_Spawn_Out_TL_ColorFadeOutTrack_37A083E44F5772C5FFF36680D2AD7D94) == 0x002830, "Member 'AEnemyPawn_Parent_Deimos_C::Enemy_Spawn_Out_TL_ColorFadeOutTrack_37A083E44F5772C5FFF36680D2AD7D94' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Enemy_Spawn_Out_TL_FadeInTrack_37A083E44F5772C5FFF36680D2AD7D94) == 0x002834, "Member 'AEnemyPawn_Parent_Deimos_C::Enemy_Spawn_Out_TL_FadeInTrack_37A083E44F5772C5FFF36680D2AD7D94' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Enemy_Spawn_Out_TL__Direction_37A083E44F5772C5FFF36680D2AD7D94) == 0x002838, "Member 'AEnemyPawn_Parent_Deimos_C::Enemy_Spawn_Out_TL__Direction_37A083E44F5772C5FFF36680D2AD7D94' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Enemy_Spawn_Out_TL) == 0x002840, "Member 'AEnemyPawn_Parent_Deimos_C::Enemy_Spawn_Out_TL' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, EnemySpawnInTL_ColorFadeOutTrack_515E6B424789F427A1B9ACAD857FFF5D) == 0x002848, "Member 'AEnemyPawn_Parent_Deimos_C::EnemySpawnInTL_ColorFadeOutTrack_515E6B424789F427A1B9ACAD857FFF5D' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, EnemySpawnInTL_FadeInTrack_515E6B424789F427A1B9ACAD857FFF5D) == 0x00284C, "Member 'AEnemyPawn_Parent_Deimos_C::EnemySpawnInTL_FadeInTrack_515E6B424789F427A1B9ACAD857FFF5D' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, EnemySpawnInTL__Direction_515E6B424789F427A1B9ACAD857FFF5D) == 0x002850, "Member 'AEnemyPawn_Parent_Deimos_C::EnemySpawnInTL__Direction_515E6B424789F427A1B9ACAD857FFF5D' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, EnemySpawnInTL) == 0x002858, "Member 'AEnemyPawn_Parent_Deimos_C::EnemySpawnInTL' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, SpawnParticlesTransform) == 0x002860, "Member 'AEnemyPawn_Parent_Deimos_C::SpawnParticlesTransform' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, SpawnParticles) == 0x002890, "Member 'AEnemyPawn_Parent_Deimos_C::SpawnParticles' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, CharacterElementalParticles) == 0x002898, "Member 'AEnemyPawn_Parent_Deimos_C::CharacterElementalParticles' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, AllowHeadshot) == 0x0028A0, "Member 'AEnemyPawn_Parent_Deimos_C::AllowHeadshot' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, TC_RangedWeapon) == 0x0028A8, "Member 'AEnemyPawn_Parent_Deimos_C::TC_RangedWeapon' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, HeadshotParticleSystemComp) == 0x0028C8, "Member 'AEnemyPawn_Parent_Deimos_C::HeadshotParticleSystemComp' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Additive_Hit_React_Montage) == 0x0028D0, "Member 'AEnemyPawn_Parent_Deimos_C::Additive_Hit_React_Montage' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Death_Normal_Sound) == 0x0028D8, "Member 'AEnemyPawn_Parent_Deimos_C::Death_Normal_Sound' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Elemental_Audio_Layer_Sound) == 0x0028E0, "Member 'AEnemyPawn_Parent_Deimos_C::Elemental_Audio_Layer_Sound' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Headshot_FX_Socket) == 0x0028E8, "Member 'AEnemyPawn_Parent_Deimos_C::Headshot_FX_Socket' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, AwakenFXSkeletalMeshes) == 0x0028F0, "Member 'AEnemyPawn_Parent_Deimos_C::AwakenFXSkeletalMeshes' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, AwakenFXStaticMeshes) == 0x002940, "Member 'AEnemyPawn_Parent_Deimos_C::AwakenFXStaticMeshes' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, AwokenMaxDistance) == 0x002990, "Member 'AEnemyPawn_Parent_Deimos_C::AwokenMaxDistance' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, AwakenDuration) == 0x002994, "Member 'AEnemyPawn_Parent_Deimos_C::AwakenDuration' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, DestroyAwakenFXTimer) == 0x002998, "Member 'AEnemyPawn_Parent_Deimos_C::DestroyAwakenFXTimer' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, BuildingHitFXSkeletalMeshes) == 0x0029A0, "Member 'AEnemyPawn_Parent_Deimos_C::BuildingHitFXSkeletalMeshes' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, BuildingHitFXStaticMeshes) == 0x0029F0, "Member 'AEnemyPawn_Parent_Deimos_C::BuildingHitFXStaticMeshes' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, BuildingHitDuration) == 0x002A40, "Member 'AEnemyPawn_Parent_Deimos_C::BuildingHitDuration' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, DestroyBuildingHitFXTimer) == 0x002A48, "Member 'AEnemyPawn_Parent_Deimos_C::DestroyBuildingHitFXTimer' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, TempFXSkeletalMesh) == 0x002A50, "Member 'AEnemyPawn_Parent_Deimos_C::TempFXSkeletalMesh' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, RegisteredSkeletalMeshesForEffects) == 0x002A58, "Member 'AEnemyPawn_Parent_Deimos_C::RegisteredSkeletalMeshesForEffects' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, RegisteredStaticMeshesForEffects) == 0x002A68, "Member 'AEnemyPawn_Parent_Deimos_C::RegisteredStaticMeshesForEffects' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, HasGlowColorsAssigned) == 0x002A78, "Member 'AEnemyPawn_Parent_Deimos_C::HasGlowColorsAssigned' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, SpawnInTimelineCompletedSuccessfully) == 0x002A79, "Member 'AEnemyPawn_Parent_Deimos_C::SpawnInTimelineCompletedSuccessfully' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, CharacterSpawnInSafetyCheckHandle) == 0x002A80, "Member 'AEnemyPawn_Parent_Deimos_C::CharacterSpawnInSafetyCheckHandle' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Previous_MID) == 0x002A88, "Member 'AEnemyPawn_Parent_Deimos_C::Previous_MID' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, CharacterAmbientParticlesTemplate) == 0x002A98, "Member 'AEnemyPawn_Parent_Deimos_C::CharacterAmbientParticlesTemplate' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, CharacterAmbientParticles) == 0x002AA0, "Member 'AEnemyPawn_Parent_Deimos_C::CharacterAmbientParticles' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, DuplicateCharacterMesh) == 0x002AA8, "Member 'AEnemyPawn_Parent_Deimos_C::DuplicateCharacterMesh' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, DuplicateCharacterMID) == 0x002AB0, "Member 'AEnemyPawn_Parent_Deimos_C::DuplicateCharacterMID' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Auxillary_Objects) == 0x002AB8, "Member 'AEnemyPawn_Parent_Deimos_C::Auxillary_Objects' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Duplicate_Auxillary_Objects) == 0x002AC8, "Member 'AEnemyPawn_Parent_Deimos_C::Duplicate_Auxillary_Objects' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, MinibossPSComponent) == 0x002AD8, "Member 'AEnemyPawn_Parent_Deimos_C::MinibossPSComponent' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, CharacterParticlesMaxDrawDistance) == 0x002AE0, "Member 'AEnemyPawn_Parent_Deimos_C::CharacterParticlesMaxDrawDistance' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Original_Phys_Material) == 0x002AE8, "Member 'AEnemyPawn_Parent_Deimos_C::Original_Phys_Material' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Previous_MID_AuxObjs) == 0x002AF8, "Member 'AEnemyPawn_Parent_Deimos_C::Previous_MID_AuxObjs' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Restoring_Array_Index) == 0x002B08, "Member 'AEnemyPawn_Parent_Deimos_C::Restoring_Array_Index' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, UseHeadShotFX) == 0x002B0C, "Member 'AEnemyPawn_Parent_Deimos_C::UseHeadShotFX' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Death_Dematerialize_Sound) == 0x002B10, "Member 'AEnemyPawn_Parent_Deimos_C::Death_Dematerialize_Sound' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, HeadShot_Sound) == 0x002B18, "Member 'AEnemyPawn_Parent_Deimos_C::HeadShot_Sound' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, AdditiveHitReactRetriggerDelay) == 0x002B20, "Member 'AEnemyPawn_Parent_Deimos_C::AdditiveHitReactRetriggerDelay' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, GC_SidewaysSpawnFx) == 0x002B24, "Member 'AEnemyPawn_Parent_Deimos_C::GC_SidewaysSpawnFx' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, SoundLibraryContext) == 0x002B30, "Member 'AEnemyPawn_Parent_Deimos_C::SoundLibraryContext' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, GC_OnSpawnFX) == 0x002B38, "Member 'AEnemyPawn_Parent_Deimos_C::GC_OnSpawnFX' has a wrong offset!");

}

