#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnemyPawn_Parent_Deimos

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "SoundLibrary_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function EnemyPawn_Parent_Deimos.EnemyPawn_Parent_Deimos_C.ApplyAwakenEffectToSkeletalMesh
// 0x0070 (0x0070 - 0x0000)
struct EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 Mesh_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSkeletonMeshComponent_C*             FXSkeletalMesh;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSkeletonMeshComponent_C*             CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UFXSkeletonMeshComponent_C*             CallFunc_AddComponent_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh) == 0x000010, "Wrong alignment on EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh");
static_assert(sizeof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh) == 0x000070, "Wrong size on EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh, Mesh_0) == 0x000000, "Member 'EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh::Mesh_0' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh, FXSkeletalMesh) == 0x000008, "Member 'EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh::FXSkeletalMesh' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh, CallFunc_Map_Find_Value) == 0x000018, "Member 'EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh, Temp_struct_Variable) == 0x000030, "Member 'EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh, CallFunc_AddComponent_ReturnValue) == 0x000060, "Member 'EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToSkeletalMesh::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function EnemyPawn_Parent_Deimos.EnemyPawn_Parent_Deimos_C.ApplyAwakenEffectToStaticMesh
// 0x0070 (0x0070 - 0x0000)
struct EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh final
{
public:
	class UStaticMeshComponent*                   Mesh_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXStaticMeshComponent_C*               FXStaticMesh;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXStaticMeshComponent_C*               CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXStaticMeshComponent_C*               CallFunc_AddComponent_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh) == 0x000010, "Wrong alignment on EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh");
static_assert(sizeof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh) == 0x000070, "Wrong size on EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh, Mesh_0) == 0x000000, "Member 'EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh::Mesh_0' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh, FXStaticMesh) == 0x000008, "Member 'EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh::FXStaticMesh' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh, CallFunc_Map_Find_Value) == 0x000018, "Member 'EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh, Temp_struct_Variable) == 0x000030, "Member 'EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh, CallFunc_AddComponent_ReturnValue) == 0x000068, "Member 'EnemyPawn_Parent_Deimos_C_ApplyAwakenEffectToStaticMesh::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function EnemyPawn_Parent_Deimos.EnemyPawn_Parent_Deimos_C.ApplyBuildingHitEffectToSkeletalMesh
// 0x0070 (0x0070 - 0x0000)
struct EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 Mesh_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSkeletonMeshComponent_C*             FXSkeletalMesh;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSkeletonMeshComponent_C*             CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSkeletonMeshComponent_C*             CallFunc_AddComponent_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh) == 0x000010, "Wrong alignment on EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh");
static_assert(sizeof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh) == 0x000070, "Wrong size on EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh, Mesh_0) == 0x000000, "Member 'EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh::Mesh_0' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh, FXSkeletalMesh) == 0x000008, "Member 'EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh::FXSkeletalMesh' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh, CallFunc_Map_Find_Value) == 0x000018, "Member 'EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh, Temp_struct_Variable) == 0x000030, "Member 'EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh, CallFunc_AddComponent_ReturnValue) == 0x000068, "Member 'EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToSkeletalMesh::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function EnemyPawn_Parent_Deimos.EnemyPawn_Parent_Deimos_C.ApplyBuildingHitEffectToStaticMesh
// 0x0070 (0x0070 - 0x0000)
struct EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh final
{
public:
	class UStaticMeshComponent*                   Mesh_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXStaticMeshComponent_C*               FXStaticMesh;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXStaticMeshComponent_C*               CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0xE];                                       // 0x0022(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UFXStaticMeshComponent_C*               CallFunc_AddComponent_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh) == 0x000010, "Wrong alignment on EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh");
static_assert(sizeof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh) == 0x000070, "Wrong size on EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh, Mesh_0) == 0x000000, "Member 'EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh::Mesh_0' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh, FXStaticMesh) == 0x000008, "Member 'EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh::FXStaticMesh' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh, CallFunc_Map_Find_Value) == 0x000018, "Member 'EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh, Temp_struct_Variable) == 0x000030, "Member 'EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh, CallFunc_AddComponent_ReturnValue) == 0x000060, "Member 'EnemyPawn_Parent_Deimos_C_ApplyBuildingHitEffectToStaticMesh::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function EnemyPawn_Parent_Deimos.EnemyPawn_Parent_Deimos_C.DeregisterEffectSkeletalMesh
// 0x0030 (0x0030 - 0x0000)
struct EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 Mesh_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSkeletonMeshComponent_C*             CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue_1;                 // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSkeletonMeshComponent_C*             CallFunc_Map_Find_Value_1;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh) == 0x000008, "Wrong alignment on EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh");
static_assert(sizeof(EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh) == 0x000030, "Wrong size on EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh, Mesh_0) == 0x000000, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh::Mesh_0' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh, CallFunc_Map_Find_Value) == 0x000010, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh, CallFunc_Map_Remove_ReturnValue) == 0x00001A, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh, CallFunc_Map_Remove_ReturnValue_1) == 0x00001B, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh::CallFunc_Map_Remove_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh, CallFunc_Array_RemoveItem_ReturnValue) == 0x00001C, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh, CallFunc_Map_Find_Value_1) == 0x000020, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh, CallFunc_Map_Find_ReturnValue_1) == 0x000028, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh, CallFunc_IsValid_ReturnValue_2) == 0x000029, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectSkeletalMesh::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function EnemyPawn_Parent_Deimos.EnemyPawn_Parent_Deimos_C.DeregisterEffectStaticMesh
// 0x0030 (0x0030 - 0x0000)
struct EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh final
{
public:
	class UStaticMeshComponent*                   Mesh_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXStaticMeshComponent_C*               CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXStaticMeshComponent_C*               CallFunc_Map_Find_Value_1;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue_1;                 // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh) == 0x000008, "Wrong alignment on EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh");
static_assert(sizeof(EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh) == 0x000030, "Wrong size on EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh, Mesh_0) == 0x000000, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh::Mesh_0' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh, CallFunc_Map_Find_Value) == 0x000010, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh, CallFunc_Map_Find_Value_1) == 0x000020, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh, CallFunc_Map_Find_ReturnValue_1) == 0x000028, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh, CallFunc_Map_Remove_ReturnValue) == 0x000029, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh, CallFunc_IsValid_ReturnValue_2) == 0x00002A, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh, CallFunc_Map_Remove_ReturnValue_1) == 0x00002B, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh::CallFunc_Map_Remove_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh, CallFunc_Array_RemoveItem_ReturnValue) == 0x00002C, "Member 'EnemyPawn_Parent_Deimos_C_DeregisterEffectStaticMesh::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function EnemyPawn_Parent_Deimos.EnemyPawn_Parent_Deimos_C.DespawnEnemy
// 0x000C (0x000C - 0x0000)
struct EnemyPawn_Parent_Deimos_C_DespawnEnemy final
{
public:
	struct FVector                                RiftLocationWS;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EnemyPawn_Parent_Deimos_C_DespawnEnemy) == 0x000004, "Wrong alignment on EnemyPawn_Parent_Deimos_C_DespawnEnemy");
static_assert(sizeof(EnemyPawn_Parent_Deimos_C_DespawnEnemy) == 0x00000C, "Wrong size on EnemyPawn_Parent_Deimos_C_DespawnEnemy");
static_assert(offsetof(EnemyPawn_Parent_Deimos_C_DespawnEnemy, RiftLocationWS) == 0x000000, "Member 'EnemyPawn_Parent_Deimos_C_DespawnEnemy::RiftLocationWS' has a wrong offset!");

// Function EnemyPawn_Parent_Deimos.EnemyPawn_Parent_Deimos_C.ExecuteUbergraph_EnemyPawn_Parent_Deimos
// 0x0780 (0x0780 - 0x0000)
struct EnemyPawn_Parent_Deimos_C_ExecuteUbergraph_EnemyPawn_Parent_Deimos final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_WaterSurfaceLocation;                 // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_WaterDepth;                           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x00B0(0x00C0)(ContainsInstancedReference)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue;         // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x0180(0x00C0)(ContainsInstancedReference)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage_2;                             // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_2;                         // 0x0258(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_2;                           // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_2;                            // 0x0284(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy_1;                       // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_2;                      // 0x0330(0x0018)()
	EFortDamageZone                               CallFunc_GetDamageZone_ReturnValue;                // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34A[0x2];                                      // 0x034A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x034C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_1;          // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_RiftLocationWS_2;               // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_RiftLocationWS_1;               // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x038C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x039C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_RiftLocationWS;                 // 0x03A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Option_B___If_false__use_Option_A_Variable; // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x03CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x03FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0408(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0414(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0420(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x042C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0440(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingRift*                          K2Node_DynamicCast_AsBuilding_Rift;                // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0451(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_452[0x2];                                      // 0x0452(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0454(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0460(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x046C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_478[0x8];                                      // 0x0478(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0480(0x0030)(IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x04B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x04B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x04D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D3[0x1];                                      // 0x04D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage_1;                             // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x04D8(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x04F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x0504(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x05B0(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    K2Node_DynamicCast_AsFort_Projectile_Base;         // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x05D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DA[0x6];                                      // 0x05DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            K2Node_DynamicCast_AsFort_Weapon;                  // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDamageZone                               CallFunc_GetDamageZone_ReturnValue_1;              // 0x05E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x05EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x05EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x05EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ED[0x3];                                      // 0x05ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F9[0x3];                                      // 0x05F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0604(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_605[0x3];                                      // 0x0605(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0608(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614[0x4];                                      // 0x0614(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSkeletonMeshComponent_C*             CallFunc_Map_Find_Value;                           // 0x0618(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621[0x3];                                      // 0x0621(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0629(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62A[0x6];                                      // 0x062A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_2;                         // 0x0630(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63C[0x4];                                      // 0x063C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXStaticMeshComponent_C*               CallFunc_Map_Find_Value_1;                         // 0x0640(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x3];                                      // 0x0649(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0651(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0652(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeaponDataHasAnyMatchingGameplayTags_ReturnValue; // 0x0653(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_654[0x4];                                      // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0658(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_3;                         // 0x0660(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x0671(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x0672(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_673[0x1];                                      // 0x0673(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0678(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0680(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0690(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x06B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x06BC(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0758(0x0018)()
