#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventPlayerStatProfileSelector

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function EventPlayerStatProfileSelector.EventPlayerStatProfileSelector_C.BndEvt__CloseMainPanel_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EventPlayerStatProfileSelector_C_BndEvt__CloseMainPanel_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventPlayerStatProfileSelector_C_BndEvt__CloseMainPanel_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on EventPlayerStatProfileSelector_C_BndEvt__CloseMainPanel_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(EventPlayerStatProfileSelector_C_BndEvt__CloseMainPanel_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on EventPlayerStatProfileSelector_C_BndEvt__CloseMainPanel_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(EventPlayerStatProfileSelector_C_BndEvt__CloseMainPanel_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'EventPlayerStatProfileSelector_C_BndEvt__CloseMainPanel_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function EventPlayerStatProfileSelector.EventPlayerStatProfileSelector_C.ExecuteUbergraph_EventPlayerStatProfileSelector
// 0x0018 (0x0018 - 0x0000)
struct EventPlayerStatProfileSelector_C_ExecuteUbergraph_EventPlayerStatProfileSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventPlayerStatProfileSelector_C_ExecuteUbergraph_EventPlayerStatProfileSelector) == 0x000008, "Wrong alignment on EventPlayerStatProfileSelector_C_ExecuteUbergraph_EventPlayerStatProfileSelector");
static_assert(sizeof(EventPlayerStatProfileSelector_C_ExecuteUbergraph_EventPlayerStatProfileSelector) == 0x000018, "Wrong size on EventPlayerStatProfileSelector_C_ExecuteUbergraph_EventPlayerStatProfileSelector");
static_assert(offsetof(EventPlayerStatProfileSelector_C_ExecuteUbergraph_EventPlayerStatProfileSelector, EntryPoint) == 0x000000, "Member 'EventPlayerStatProfileSelector_C_ExecuteUbergraph_EventPlayerStatProfileSelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(EventPlayerStatProfileSelector_C_ExecuteUbergraph_EventPlayerStatProfileSelector, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'EventPlayerStatProfileSelector_C_ExecuteUbergraph_EventPlayerStatProfileSelector::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventPlayerStatProfileSelector_C_ExecuteUbergraph_EventPlayerStatProfileSelector, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'EventPlayerStatProfileSelector_C_ExecuteUbergraph_EventPlayerStatProfileSelector::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function EventPlayerStatProfileSelector.EventPlayerStatProfileSelector_C.Set Up Profile Selector Style
// 0x01E8 (0x01E8 - 0x0000)
struct EventPlayerStatProfileSelector_C_Set_Up_Profile_Selector_Style final
{
public:
	struct FFortTournamentDisplayInfo             Tournament_Display_Info;                           // 0x0000(0x01D0)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01D0(0x0014)()
};
static_assert(alignof(EventPlayerStatProfileSelector_C_Set_Up_Profile_Selector_Style) == 0x000008, "Wrong alignment on EventPlayerStatProfileSelector_C_Set_Up_Profile_Selector_Style");
static_assert(sizeof(EventPlayerStatProfileSelector_C_Set_Up_Profile_Selector_Style) == 0x0001E8, "Wrong size on EventPlayerStatProfileSelector_C_Set_Up_Profile_Selector_Style");
static_assert(offsetof(EventPlayerStatProfileSelector_C_Set_Up_Profile_Selector_Style, Tournament_Display_Info) == 0x000000, "Member 'EventPlayerStatProfileSelector_C_Set_Up_Profile_Selector_Style::Tournament_Display_Info' has a wrong offset!");
static_assert(offsetof(EventPlayerStatProfileSelector_C_Set_Up_Profile_Selector_Style, K2Node_MakeStruct_SlateColor) == 0x0001D0, "Member 'EventPlayerStatProfileSelector_C_Set_Up_Profile_Selector_Style::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

