#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventScoreBigStat

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventScoreBigStat.EventScoreBigStat_C
// 0x0020 (0x0268 - 0x0248)
class UEventScoreBigStat_C final : public UUserWidget
{
public:
	class UCommonBorder*                          CommonBorder_GoalScore;                            // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_GoalScore;                           // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StatLabelText;                                     // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StatValueText;                                     // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetData(const class FText& Label, int32 Value, int32 ValueContext, const class FText& FormatterText, const struct FFortTournamentDisplayInfo& Tournament_Display_Info);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventScoreBigStat_C">();
	}
	static class UEventScoreBigStat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventScoreBigStat_C>();
	}
};
static_assert(alignof(UEventScoreBigStat_C) == 0x000008, "Wrong alignment on UEventScoreBigStat_C");
static_assert(sizeof(UEventScoreBigStat_C) == 0x000268, "Wrong size on UEventScoreBigStat_C");
static_assert(offsetof(UEventScoreBigStat_C, CommonBorder_GoalScore) == 0x000248, "Member 'UEventScoreBigStat_C::CommonBorder_GoalScore' has a wrong offset!");
static_assert(offsetof(UEventScoreBigStat_C, RichTextBlock_GoalScore) == 0x000250, "Member 'UEventScoreBigStat_C::RichTextBlock_GoalScore' has a wrong offset!");
static_assert(offsetof(UEventScoreBigStat_C, StatLabelText) == 0x000258, "Member 'UEventScoreBigStat_C::StatLabelText' has a wrong offset!");
static_assert(offsetof(UEventScoreBigStat_C, StatValueText) == 0x000260, "Member 'UEventScoreBigStat_C::StatValueText' has a wrong offset!");

}

