#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventLeaderboardEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EventLeaderboardEntry.EventLeaderboardEntry_C.ExecuteUbergraph_EventLeaderboardEntry
// 0x0128 (0x0128 - 0x0000)
struct EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortEventLeaderboardEntryData*         K2Node_DynamicCast_AsFort_Event_Leaderboard_Entry_Data; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortShowdownDetailView*                K2Node_DynamicCast_AsFort_Showdown_Detail_View;    // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x009C(0x0014)()
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortEventLeaderboardEntryData*   K2Node_Event_LeaderboardEntryData;                 // 0x0120(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry) == 0x000008, "Wrong alignment on EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry");
static_assert(sizeof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry) == 0x000128, "Wrong size on EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, EntryPoint) == 0x000000, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, Temp_bool_Variable) == 0x000004, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, Temp_struct_Variable) == 0x000008, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, Temp_bool_Variable_1) == 0x000018, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, Temp_struct_Variable_1) == 0x00001C, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, Temp_bool_Variable_2) == 0x00002C, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, Temp_struct_Variable_2) == 0x000030, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, Temp_bool_Variable_3) == 0x000040, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, Temp_struct_Variable_3) == 0x000044, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, K2Node_Event_IsDesignTime) == 0x000054, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, CallFunc_Not_PreBool_ReturnValue) == 0x000055, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, K2Node_Event_ListItemObject) == 0x000058, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, CallFunc_BooleanAND_ReturnValue) == 0x000060, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, K2Node_DynamicCast_AsFort_Event_Leaderboard_Entry_Data) == 0x000068, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::K2Node_DynamicCast_AsFort_Event_Leaderboard_Entry_Data' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000078, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, CallFunc_PlayAnimationForward_ReturnValue) == 0x000080, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, CallFunc_FindParentWidgetOfType_ReturnValue) == 0x000088, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::CallFunc_FindParentWidgetOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, K2Node_DynamicCast_AsFort_Showdown_Detail_View) == 0x000090, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::K2Node_DynamicCast_AsFort_Showdown_Detail_View' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, K2Node_MakeStruct_SlateColor) == 0x00009C, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, K2Node_Select_Default) == 0x0000B0, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, CallFunc_BreakColor_R) == 0x0000C0, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, CallFunc_BreakColor_G) == 0x0000C4, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, CallFunc_BreakColor_B) == 0x0000C8, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, CallFunc_BreakColor_A) == 0x0000CC, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, CallFunc_MakeColor_ReturnValue) == 0x0000D0, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, K2Node_MakeStruct_LinearColor) == 0x0000E0, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, K2Node_Select_Default_1) == 0x0000F0, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, K2Node_Select_Default_2) == 0x000100, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, K2Node_Select_Default_3) == 0x000110, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry, K2Node_Event_LeaderboardEntryData) == 0x000120, "Member 'EventLeaderboardEntry_C_ExecuteUbergraph_EventLeaderboardEntry::K2Node_Event_LeaderboardEntryData' has a wrong offset!");

// Function EventLeaderboardEntry.EventLeaderboardEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct EventLeaderboardEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardEntry_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on EventLeaderboardEntry_C_OnListItemObjectSet");
static_assert(sizeof(EventLeaderboardEntry_C_OnListItemObjectSet) == 0x000008, "Wrong size on EventLeaderboardEntry_C_OnListItemObjectSet");
static_assert(offsetof(EventLeaderboardEntry_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'EventLeaderboardEntry_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function EventLeaderboardEntry.EventLeaderboardEntry_C.OnTeammateDisplayNameAdded
// 0x0008 (0x0008 - 0x0000)
struct EventLeaderboardEntry_C_OnTeammateDisplayNameAdded final
{
public:
	const class UFortEventLeaderboardEntryData*   LeaderboardEntryData;                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardEntry_C_OnTeammateDisplayNameAdded) == 0x000008, "Wrong alignment on EventLeaderboardEntry_C_OnTeammateDisplayNameAdded");
static_assert(sizeof(EventLeaderboardEntry_C_OnTeammateDisplayNameAdded) == 0x000008, "Wrong size on EventLeaderboardEntry_C_OnTeammateDisplayNameAdded");
static_assert(offsetof(EventLeaderboardEntry_C_OnTeammateDisplayNameAdded, LeaderboardEntryData) == 0x000000, "Member 'EventLeaderboardEntry_C_OnTeammateDisplayNameAdded::LeaderboardEntryData' has a wrong offset!");

// Function EventLeaderboardEntry.EventLeaderboardEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct EventLeaderboardEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardEntry_C_PreConstruct) == 0x000001, "Wrong alignment on EventLeaderboardEntry_C_PreConstruct");
static_assert(sizeof(EventLeaderboardEntry_C_PreConstruct) == 0x000001, "Wrong size on EventLeaderboardEntry_C_PreConstruct");
static_assert(offsetof(EventLeaderboardEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'EventLeaderboardEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function EventLeaderboardEntry.EventLeaderboardEntry_C.SetEntryDetails
// 0x0130 (0x0130 - 0x0000)
struct EventLeaderboardEntry_C_SetEntryDetails final
{
public:
	class UFortEventLeaderboardEntryData*         EntryData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowQualifiedIcon_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesLeaderboardHaveQualifiedIcons_ReturnValue; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetScore_ReturnValue;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLiveSessionId_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPageIndex_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRank_ReturnValue;                      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0068(0x0018)()
	bool                                          CallFunc_GetIsMatchPointWinner_ReturnValue;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	float                                         Temp_float_Variable;                               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardEntry_C_SetEntryDetails) == 0x000008, "Wrong alignment on EventLeaderboardEntry_C_SetEntryDetails");
static_assert(sizeof(EventLeaderboardEntry_C_SetEntryDetails) == 0x000130, "Wrong size on EventLeaderboardEntry_C_SetEntryDetails");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, EntryData) == 0x000000, "Member 'EventLeaderboardEntry_C_SetEntryDetails::EntryData' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, Temp_byte_Variable) == 0x000008, "Member 'EventLeaderboardEntry_C_SetEntryDetails::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, CallFunc_ShouldShowQualifiedIcon_ReturnValue) == 0x000009, "Member 'EventLeaderboardEntry_C_SetEntryDetails::CallFunc_ShouldShowQualifiedIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, CallFunc_DoesLeaderboardHaveQualifiedIcons_ReturnValue) == 0x00000A, "Member 'EventLeaderboardEntry_C_SetEntryDetails::CallFunc_DoesLeaderboardHaveQualifiedIcons_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, CallFunc_GetScore_ReturnValue) == 0x00000C, "Member 'EventLeaderboardEntry_C_SetEntryDetails::CallFunc_GetScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, CallFunc_GetLiveSessionId_ReturnValue) == 0x000010, "Member 'EventLeaderboardEntry_C_SetEntryDetails::CallFunc_GetLiveSessionId_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'EventLeaderboardEntry_C_SetEntryDetails::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'EventLeaderboardEntry_C_SetEntryDetails::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, CallFunc_TextIsEmpty_ReturnValue) == 0x000050, "Member 'EventLeaderboardEntry_C_SetEntryDetails::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, CallFunc_GetPageIndex_ReturnValue) == 0x000054, "Member 'EventLeaderboardEntry_C_SetEntryDetails::CallFunc_GetPageIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, CallFunc_Percent_IntInt_ReturnValue) == 0x000058, "Member 'EventLeaderboardEntry_C_SetEntryDetails::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, CallFunc_GetRank_ReturnValue) == 0x00005C, "Member 'EventLeaderboardEntry_C_SetEntryDetails::CallFunc_GetRank_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000060, "Member 'EventLeaderboardEntry_C_SetEntryDetails::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000061, "Member 'EventLeaderboardEntry_C_SetEntryDetails::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000068, "Member 'EventLeaderboardEntry_C_SetEntryDetails::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, CallFunc_GetIsMatchPointWinner_ReturnValue) == 0x000080, "Member 'EventLeaderboardEntry_C_SetEntryDetails::CallFunc_GetIsMatchPointWinner_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'EventLeaderboardEntry_C_SetEntryDetails::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, K2Node_MakeArray_Array) == 0x0000C8, "Member 'EventLeaderboardEntry_C_SetEntryDetails::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, Temp_bool_Variable) == 0x0000D8, "Member 'EventLeaderboardEntry_C_SetEntryDetails::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'EventLeaderboardEntry_C_SetEntryDetails::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, Temp_float_Variable) == 0x0000F8, "Member 'EventLeaderboardEntry_C_SetEntryDetails::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, Temp_float_Variable_1) == 0x0000FC, "Member 'EventLeaderboardEntry_C_SetEntryDetails::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, Temp_bool_Variable_1) == 0x000100, "Member 'EventLeaderboardEntry_C_SetEntryDetails::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, K2Node_Select_Default) == 0x000104, "Member 'EventLeaderboardEntry_C_SetEntryDetails::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, K2Node_MakeStruct_Margin) == 0x000108, "Member 'EventLeaderboardEntry_C_SetEntryDetails::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, Temp_int_Variable) == 0x000118, "Member 'EventLeaderboardEntry_C_SetEntryDetails::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, Temp_int_Variable_1) == 0x00011C, "Member 'EventLeaderboardEntry_C_SetEntryDetails::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, Temp_byte_Variable_1) == 0x000120, "Member 'EventLeaderboardEntry_C_SetEntryDetails::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, K2Node_Select_Default_1) == 0x000124, "Member 'EventLeaderboardEntry_C_SetEntryDetails::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, Temp_bool_Variable_2) == 0x000128, "Member 'EventLeaderboardEntry_C_SetEntryDetails::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, K2Node_Select_Default_2) == 0x000129, "Member 'EventLeaderboardEntry_C_SetEntryDetails::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, Temp_byte_Variable_2) == 0x00012A, "Member 'EventLeaderboardEntry_C_SetEntryDetails::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, Temp_byte_Variable_3) == 0x00012B, "Member 'EventLeaderboardEntry_C_SetEntryDetails::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, Temp_bool_Variable_3) == 0x00012C, "Member 'EventLeaderboardEntry_C_SetEntryDetails::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetEntryDetails, K2Node_Select_Default_3) == 0x00012D, "Member 'EventLeaderboardEntry_C_SetEntryDetails::K2Node_Select_Default_3' has a wrong offset!");

// Function EventLeaderboardEntry.EventLeaderboardEntry_C.SetTeamDisplayNames
// 0x0298 (0x0298 - 0x0000)
struct EventLeaderboardEntry_C_SetTeamDisplayNames final
{
public:
	class UFortEventLeaderboardEntryData*         Entry_Data;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumTeammates_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTeamDisplayNameText_ReturnValue;       // 0x0010(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetTeammateDisplayNames_DisplayNames;     // 0x0030(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00F8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0120(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0160(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0178(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x01C8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01F8(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0240(0x0010)(ReferenceParm)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0258(0x0018)()
	int32                                         Temp_int_Variable_1;                               // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0280(0x0018)()
};
static_assert(alignof(EventLeaderboardEntry_C_SetTeamDisplayNames) == 0x000008, "Wrong alignment on EventLeaderboardEntry_C_SetTeamDisplayNames");
static_assert(sizeof(EventLeaderboardEntry_C_SetTeamDisplayNames) == 0x000298, "Wrong size on EventLeaderboardEntry_C_SetTeamDisplayNames");
static_assert(offsetof(EventLeaderboardEntry_C_SetTeamDisplayNames, Entry_Data) == 0x000000, "Member 'EventLeaderboardEntry_C_SetTeamDisplayNames::Entry_Data' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetTeamDisplayNames, Temp_bool_Variable) == 0x000008, "Member 'EventLeaderboardEntry_C_SetTeamDisplayNames::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntry_C_SetTeamDisplayNames, CallFunc_GetNumTeammates_ReturnValue) == 0x00000C, "Member 'EventLeaderboardEntry_C_SetTeamDisplayNames::CallFunc_GetNumTeammates_ReturnValue' has a wrong offset!");
