#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventLeaderboardEntryDetails

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function EventLeaderboardEntryDetails.EventLeaderboardEntryDetails_C.BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EventLeaderboardEntryDetails_C_BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardEntryDetails_C_BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on EventLeaderboardEntryDetails_C_BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(EventLeaderboardEntryDetails_C_BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on EventLeaderboardEntryDetails_C_BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(EventLeaderboardEntryDetails_C_BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'EventLeaderboardEntryDetails_C_BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function EventLeaderboardEntryDetails.EventLeaderboardEntryDetails_C.BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EventLeaderboardEntryDetails_C_BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardEntryDetails_C_BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on EventLeaderboardEntryDetails_C_BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(EventLeaderboardEntryDetails_C_BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on EventLeaderboardEntryDetails_C_BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(EventLeaderboardEntryDetails_C_BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'EventLeaderboardEntryDetails_C_BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function EventLeaderboardEntryDetails.EventLeaderboardEntryDetails_C.BndEvt__Button_WatchLive_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EventLeaderboardEntryDetails_C_BndEvt__Button_WatchLive_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardEntryDetails_C_BndEvt__Button_WatchLive_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on EventLeaderboardEntryDetails_C_BndEvt__Button_WatchLive_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(EventLeaderboardEntryDetails_C_BndEvt__Button_WatchLive_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on EventLeaderboardEntryDetails_C_BndEvt__Button_WatchLive_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(EventLeaderboardEntryDetails_C_BndEvt__Button_WatchLive_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'EventLeaderboardEntryDetails_C_BndEvt__Button_WatchLive_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function EventLeaderboardEntryDetails.EventLeaderboardEntryDetails_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function EventLeaderboardEntryDetails.EventLeaderboardEntryDetails_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function EventLeaderboardEntryDetails.EventLeaderboardEntryDetails_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'EventLeaderboardEntryDetails_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function EventLeaderboardEntryDetails.EventLeaderboardEntryDetails_C.EventColorize
// 0x01D0 (0x01D0 - 0x0000)
struct EventLeaderboardEntryDetails_C_EventColorize final
{
public:
	struct FFortTournamentDisplayInfo             TournamentDisplayInfo;                             // 0x0000(0x01D0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(EventLeaderboardEntryDetails_C_EventColorize) == 0x000008, "Wrong alignment on EventLeaderboardEntryDetails_C_EventColorize");
static_assert(sizeof(EventLeaderboardEntryDetails_C_EventColorize) == 0x0001D0, "Wrong size on EventLeaderboardEntryDetails_C_EventColorize");
static_assert(offsetof(EventLeaderboardEntryDetails_C_EventColorize, TournamentDisplayInfo) == 0x000000, "Member 'EventLeaderboardEntryDetails_C_EventColorize::TournamentDisplayInfo' has a wrong offset!");

// Function EventLeaderboardEntryDetails.EventLeaderboardEntryDetails_C.ExecuteUbergraph_EventLeaderboardEntryDetails
// 0x0450 (0x0450 - 0x0000)
struct EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTournamentDisplayInfo             K2Node_CustomEvent_TournamentDisplayInfo;          // 0x0008(0x01D0)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        K2Node_DynamicCast_AsEvent_Leaderboard_Details_Stat; // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_5;               // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue_1;     // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEventPlayerStatProfileSelector_C*      CallFunc_Create_ReturnValue;                       // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaStatsTab_C*                      CallFunc_Create_ReturnValue_1;                     // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetTeammateDisplayNames_DisplayNames;     // 0x0258(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetTeamAccountId_ReturnValue;             // 0x0268(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0288(0x0018)()
	int32                                         CallFunc_GetNumTeammates_ReturnValue;              // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0xB];                                      // 0x02A5(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_GetSafeZonePadding_SafePadding;           // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSafeZonePadding_SafePaddingScale;      // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_GetSafeZonePadding_SpillOverPadding;      // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_1;          // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_4;               // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_3;               // 0x0338(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x035C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x0368(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0388(0x0058)(HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x03E0(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x03F4(0x0014)()
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_2;               // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0410(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0418(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEventTeamMatchHistoryModal_C*          CallFunc_Create_ReturnValue_2;                     // 0x0430(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails) == 0x000010, "Wrong alignment on EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails");
static_assert(sizeof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails) == 0x000450, "Wrong size on EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, EntryPoint) == 0x000000, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_CustomEvent_TournamentDisplayInfo) == 0x000008, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_CustomEvent_TournamentDisplayInfo' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0001D8, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001E0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, Temp_int_Variable) == 0x0001E4, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetContext_ReturnValue) == 0x0001E8, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_IsUsingGamepad_ReturnValue) == 0x0001F0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Add_IntInt_ReturnValue) == 0x0001F4, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetChildAt_ReturnValue) == 0x0001F8, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000200, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_DynamicCast_AsEvent_Leaderboard_Details_Stat) == 0x000208, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_DynamicCast_AsEvent_Leaderboard_Details_Stat' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_DynamicCast_bSuccess) == 0x000210, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetChildrenCount_ReturnValue) == 0x000214, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, Temp_float_Variable) == 0x000218, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00021C, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_ComponentBoundEvent_Button_5) == 0x000220, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000228, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetEndTime_ReturnValue) == 0x000230, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetOwningPlayer_ReturnValue) == 0x000238, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_PlayAnimationTimeRange_ReturnValue_1) == 0x000240, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_PlayAnimationTimeRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Create_ReturnValue) == 0x000248, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Create_ReturnValue_1) == 0x000250, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetTeammateDisplayNames_DisplayNames) == 0x000258, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetTeammateDisplayNames_DisplayNames' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetTeamAccountId_ReturnValue) == 0x000268, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetTeamAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Array_Get_Item) == 0x000278, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Conv_StringToText_ReturnValue) == 0x000288, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetNumTeammates_ReturnValue) == 0x0002A0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetNumTeammates_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002A4, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetSafeZonePadding_SafePadding) == 0x0002B0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetSafeZonePadding_SafePadding' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetSafeZonePadding_SafePaddingScale) == 0x0002C0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetSafeZonePadding_SafePaddingScale' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetSafeZonePadding_SpillOverPadding) == 0x0002D0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetSafeZonePadding_SpillOverPadding' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_BreakVector2D_X) == 0x0002E0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_BreakVector2D_Y) == 0x0002E4, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0002E8, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0002EC, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0002F0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0002F4, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0002F8, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0002FC, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000300, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000304, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000308, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x00030C, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_MakeStruct_Margin) == 0x000310, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000320, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetRuntimeOptions_ReturnValue_1) == 0x000328, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetRuntimeOptions_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_ComponentBoundEvent_Button_4) == 0x000330, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_ComponentBoundEvent_Button_3) == 0x000338, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, Temp_bool_Variable) == 0x000340, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000348, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_PlayAnimationForward_ReturnValue) == 0x000350, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_Select_Default) == 0x000358, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_MakeVector2D_ReturnValue) == 0x00035C, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_MakeStruct_FontOutlineSettings) == 0x000368, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_MakeStruct_FontOutlineSettings' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_MakeStruct_SlateFontInfo) == 0x000388, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_MakeStruct_SlateColor) == 0x0003E0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_MakeStruct_SlateColor_1) == 0x0003F4, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_ComponentBoundEvent_Button_2) == 0x000408, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_ComponentBoundEvent_Button_1) == 0x000410, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_ComponentBoundEvent_Button) == 0x000418, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000420, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000428, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Create_ReturnValue_2) == 0x000430, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000438, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, Temp_float_Variable_1) == 0x000440, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, Temp_float_Variable_2) == 0x000444, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, Temp_bool_Variable_1) == 0x000448, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_Select_Default_1) == 0x00044C, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_Select_Default_1' has a wrong offset!");

// Function EventLeaderboardEntryDetails.EventLeaderboardEntryDetails_C.SetTournamentValues
// 0x0020 (0x0020 - 0x0000)
struct EventLeaderboardEntryDetails_C_SetTournamentValues final
{
public:
	class FString                                 InTournamentId;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 InEventWindowId;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardEntryDetails_C_SetTournamentValues) == 0x000008, "Wrong alignment on EventLeaderboardEntryDetails_C_SetTournamentValues");
static_assert(sizeof(EventLeaderboardEntryDetails_C_SetTournamentValues) == 0x000020, "Wrong size on EventLeaderboardEntryDetails_C_SetTournamentValues");
static_assert(offsetof(EventLeaderboardEntryDetails_C_SetTournamentValues, InTournamentId) == 0x000000, "Member 'EventLeaderboardEntryDetails_C_SetTournamentValues::InTournamentId' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_SetTournamentValues, InEventWindowId) == 0x000010, "Member 'EventLeaderboardEntryDetails_C_SetTournamentValues::InEventWindowId' has a wrong offset!");

// Function EventLeaderboardEntryDetails.EventLeaderboardEntryDetails_C.Show Details
// 0x03D0 (0x03D0 - 0x0000)
struct EventLeaderboardEntryDetails_C_Show_Details final
{
public:
	class UFortEventLeaderboardEntryData*         EntryData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETournamentDisplayType                        EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TotalScoredPoints;                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0080(0x0018)()
	bool                                          Temp_bool_Variable_4;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetLiveSessionId_ReturnValue;             // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalPointsForCategory_ReturnValue;    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalPointsForCategory_ReturnValue_1;  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalMatchesPlayed_ReturnValue;        // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E7[0x1];                                       // 0x00E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalPointsForCategory_ReturnValue_2;  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00F0(0x0040)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalPointsForCategory_ReturnValue_3;  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0140(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetTeamDisplayNameText_ReturnValue;       // 0x0180(0x0018)()
	int32                                         CallFunc_GetNumTeammates_ReturnValue;              // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01A0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01E0(0x0010)(ReferenceParm)
	class FText                                   K2Node_Select_Default_3;                           // 0x01F0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0208(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_16;                             // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_223[0x1];                                      // 0x0223(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalVictoryRoyales_ReturnValue;       // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
