#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventLeaderboardHeader

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function EventLeaderboardHeader.EventLeaderboardHeader_C.ExecuteUbergraph_EventLeaderboardHeader
// 0x0038 (0x0038 - 0x0000)
struct EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetWindowRoundDisplayString_ReturnValue;  // 0x0008(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0014)()
};
static_assert(alignof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader) == 0x000008, "Wrong alignment on EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader");
static_assert(sizeof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader) == 0x000038, "Wrong size on EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, EntryPoint) == 0x000000, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::EntryPoint' has a wrong offset!");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, CallFunc_GetWindowRoundDisplayString_ReturnValue) == 0x000008, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::CallFunc_GetWindowRoundDisplayString_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

