#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventLeaderboardEntryDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventLeaderboardEntryDetails.EventLeaderboardEntryDetails_C
// 0x0368 (0x05E0 - 0x0278)
class UEventLeaderboardEntryDetails_C final : public UFortLeaderboardEntryDetails
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MatchHistoryHover;                                 // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ProfileHover;                                      // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_MatchHistory;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_Profiles;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_ElimPointer;                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_PlacementPointer;                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorderMainContent;                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_MatchHistoryTextMatchHistory;      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_Placement;                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_PlayerNames;                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_PlayerNamesTitle;                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_ProfileText;                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_Score;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_Title;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_31;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_32;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_57;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_58;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_93;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_94;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DetailsBG;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ElimIcon;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LiveMatch;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Pie;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PieShadow;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlacementIcon;                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlayernameBG;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlayernameBG_Shadow;                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Placement;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PointBreakdown;                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_TeamMembers;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_AveragePlacement;                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_AveragePointsPerMatch;                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_MatchesPlayed;                                // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_TotalEliminations;                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_VictoryRoyales;                               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_EliminationPointInfo;                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_PlacementPointInfo;                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Placement;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_StatContainer;                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortEventLeaderboardEntryData*         LeaderboardEntryData;                              // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ProfileSelectedFromSelector;                       // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UEventPlayerStatProfileSelector_C*      ProfileSelectorInstance;                           // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 TournamentId;                                      // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 EventWindowId;                                     // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FFortTournamentDisplayInfo             CurrentDisplayInfo;                                // 0x0410(0x01D0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_WatchLive_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void Construct();
	void EventColorize(const struct FFortTournamentDisplayInfo& TournamentDisplayInfo);
	void EventIntro();
	void ExecuteUbergraph_EventLeaderboardEntryDetails(int32 EntryPoint);
	void LeaderboardEntryDoubleClicked();
	void SetTournamentValues(const class FString& InTournamentId, const class FString& InEventWindowId);
	void Show_Details(class UFortEventLeaderboardEntryData* EntryData, ETournamentDisplayType EventType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventLeaderboardEntryDetails_C">();
	}
	static class UEventLeaderboardEntryDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventLeaderboardEntryDetails_C>();
	}
};
static_assert(alignof(UEventLeaderboardEntryDetails_C) == 0x000008, "Wrong alignment on UEventLeaderboardEntryDetails_C");
static_assert(sizeof(UEventLeaderboardEntryDetails_C) == 0x0005E0, "Wrong size on UEventLeaderboardEntryDetails_C");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, UberGraphFrame) == 0x000278, "Member 'UEventLeaderboardEntryDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, MatchHistoryHover) == 0x000280, "Member 'UEventLeaderboardEntryDetails_C::MatchHistoryHover' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, ProfileHover) == 0x000288, "Member 'UEventLeaderboardEntryDetails_C::ProfileHover' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Intro) == 0x000290, "Member 'UEventLeaderboardEntryDetails_C::Intro' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Button_MatchHistory) == 0x000298, "Member 'UEventLeaderboardEntryDetails_C::Button_MatchHistory' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Button_Profiles) == 0x0002A0, "Member 'UEventLeaderboardEntryDetails_C::Button_Profiles' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonBorder_ElimPointer) == 0x0002A8, "Member 'UEventLeaderboardEntryDetails_C::CommonBorder_ElimPointer' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonBorder_PlacementPointer) == 0x0002B0, "Member 'UEventLeaderboardEntryDetails_C::CommonBorder_PlacementPointer' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonBorderMainContent) == 0x0002B8, "Member 'UEventLeaderboardEntryDetails_C::CommonBorderMainContent' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_1) == 0x0002C0, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_1' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_MatchHistoryTextMatchHistory) == 0x0002C8, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_MatchHistoryTextMatchHistory' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_Placement) == 0x0002D0, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_Placement' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_PlayerNames) == 0x0002D8, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_PlayerNames' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_PlayerNamesTitle) == 0x0002E0, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_PlayerNamesTitle' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_ProfileText) == 0x0002E8, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_ProfileText' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_Score) == 0x0002F0, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_Score' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_Title) == 0x0002F8, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_Title' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_31) == 0x000300, "Member 'UEventLeaderboardEntryDetails_C::Image_31' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_32) == 0x000308, "Member 'UEventLeaderboardEntryDetails_C::Image_32' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_57) == 0x000310, "Member 'UEventLeaderboardEntryDetails_C::Image_57' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_58) == 0x000318, "Member 'UEventLeaderboardEntryDetails_C::Image_58' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_93) == 0x000320, "Member 'UEventLeaderboardEntryDetails_C::Image_93' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_94) == 0x000328, "Member 'UEventLeaderboardEntryDetails_C::Image_94' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_DetailsBG) == 0x000330, "Member 'UEventLeaderboardEntryDetails_C::Image_DetailsBG' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_ElimIcon) == 0x000338, "Member 'UEventLeaderboardEntryDetails_C::Image_ElimIcon' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_LiveMatch) == 0x000340, "Member 'UEventLeaderboardEntryDetails_C::Image_LiveMatch' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_Pie) == 0x000348, "Member 'UEventLeaderboardEntryDetails_C::Image_Pie' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_PieShadow) == 0x000350, "Member 'UEventLeaderboardEntryDetails_C::Image_PieShadow' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_PlacementIcon) == 0x000358, "Member 'UEventLeaderboardEntryDetails_C::Image_PlacementIcon' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_PlayernameBG) == 0x000360, "Member 'UEventLeaderboardEntryDetails_C::Image_PlayernameBG' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_PlayernameBG_Shadow) == 0x000368, "Member 'UEventLeaderboardEntryDetails_C::Image_PlayernameBG_Shadow' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Overlay_Placement) == 0x000370, "Member 'UEventLeaderboardEntryDetails_C::Overlay_Placement' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Overlay_PointBreakdown) == 0x000378, "Member 'UEventLeaderboardEntryDetails_C::Overlay_PointBreakdown' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Overlay_TeamMembers) == 0x000380, "Member 'UEventLeaderboardEntryDetails_C::Overlay_TeamMembers' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_AveragePlacement) == 0x000388, "Member 'UEventLeaderboardEntryDetails_C::Stat_AveragePlacement' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_AveragePointsPerMatch) == 0x000390, "Member 'UEventLeaderboardEntryDetails_C::Stat_AveragePointsPerMatch' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_MatchesPlayed) == 0x000398, "Member 'UEventLeaderboardEntryDetails_C::Stat_MatchesPlayed' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_TotalEliminations) == 0x0003A0, "Member 'UEventLeaderboardEntryDetails_C::Stat_TotalEliminations' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_VictoryRoyales) == 0x0003A8, "Member 'UEventLeaderboardEntryDetails_C::Stat_VictoryRoyales' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Text_EliminationPointInfo) == 0x0003B0, "Member 'UEventLeaderboardEntryDetails_C::Text_EliminationPointInfo' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Text_PlacementPointInfo) == 0x0003B8, "Member 'UEventLeaderboardEntryDetails_C::Text_PlacementPointInfo' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, VerticalBox_Placement) == 0x0003C0, "Member 'UEventLeaderboardEntryDetails_C::VerticalBox_Placement' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, VerticalBox_StatContainer) == 0x0003C8, "Member 'UEventLeaderboardEntryDetails_C::VerticalBox_StatContainer' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, LeaderboardEntryData) == 0x0003D0, "Member 'UEventLeaderboardEntryDetails_C::LeaderboardEntryData' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, ProfileSelectedFromSelector) == 0x0003D8, "Member 'UEventLeaderboardEntryDetails_C::ProfileSelectedFromSelector' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, ProfileSelectorInstance) == 0x0003E8, "Member 'UEventLeaderboardEntryDetails_C::ProfileSelectorInstance' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, TournamentId) == 0x0003F0, "Member 'UEventLeaderboardEntryDetails_C::TournamentId' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, EventWindowId) == 0x000400, "Member 'UEventLeaderboardEntryDetails_C::EventWindowId' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CurrentDisplayInfo) == 0x000410, "Member 'UEventLeaderboardEntryDetails_C::CurrentDisplayInfo' has a wrong offset!");

}

