#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventModeUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class EventModeUI.FocusButton
// 0x0010 (0x03C8 - 0x03B8)
class UFocusButton final : public UBacchusActionButton
{
public:
	class UPaperSprite*                           StartFocusingSprite;                               // 0x03B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPaperSprite*                           StopFocusingSprite;                                // 0x03C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleCanUseEventModeFocusChanged(bool bCanUseEventModeFocus);
	void HandleEventModeFocusingChanged(bool bIsEventModeFocusing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FocusButton">();
	}
	static class UFocusButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFocusButton>();
	}
};
static_assert(alignof(UFocusButton) == 0x000008, "Wrong alignment on UFocusButton");
static_assert(sizeof(UFocusButton) == 0x0003C8, "Wrong size on UFocusButton");
static_assert(offsetof(UFocusButton, StartFocusingSprite) == 0x0003B8, "Member 'UFocusButton::StartFocusingSprite' has a wrong offset!");
static_assert(offsetof(UFocusButton, StopFocusingSprite) == 0x0003C0, "Member 'UFocusButton::StopFocusingSprite' has a wrong offset!");

// Class EventModeUI.FortEventModeEmotesWidget
// 0x00B0 (0x0360 - 0x02B0)
class UFortEventModeEmotesWidget final : public UFortHUDElementWidget
{
public:
	TSoftObjectPtr<class UFortMontageItemDefinitionBase> Emote1;                                            // 0x02B0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortMontageItemDefinitionBase> Emote2;                                            // 0x02D8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortMontageItemDefinitionBase> Emote3;                                            // 0x0300(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UFortMontageItemDefinitionBase>> RandomEmotes;                                      // 0x0328(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         Text_Emote1;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_Emote2;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_Emote3;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_EmoteRandom;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnFocusAvailableChanged(bool bIsFocusAvailable);
	void OnFocusStateChanged(bool bIsFocusing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventModeEmotesWidget">();
	}
	static class UFortEventModeEmotesWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventModeEmotesWidget>();
	}
};
static_assert(alignof(UFortEventModeEmotesWidget) == 0x000008, "Wrong alignment on UFortEventModeEmotesWidget");
static_assert(sizeof(UFortEventModeEmotesWidget) == 0x000360, "Wrong size on UFortEventModeEmotesWidget");
static_assert(offsetof(UFortEventModeEmotesWidget, Emote1) == 0x0002B0, "Member 'UFortEventModeEmotesWidget::Emote1' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Emote2) == 0x0002D8, "Member 'UFortEventModeEmotesWidget::Emote2' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Emote3) == 0x000300, "Member 'UFortEventModeEmotesWidget::Emote3' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, RandomEmotes) == 0x000328, "Member 'UFortEventModeEmotesWidget::RandomEmotes' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Text_Emote1) == 0x000340, "Member 'UFortEventModeEmotesWidget::Text_Emote1' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Text_Emote2) == 0x000348, "Member 'UFortEventModeEmotesWidget::Text_Emote2' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Text_Emote3) == 0x000350, "Member 'UFortEventModeEmotesWidget::Text_Emote3' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Text_EmoteRandom) == 0x000358, "Member 'UFortEventModeEmotesWidget::Text_EmoteRandom' has a wrong offset!");

// Class EventModeUI.FortMobileActionButtonBehavior_Focus
// 0x0008 (0x0100 - 0x00F8)
class UFortMobileActionButtonBehavior_Focus : public UFortMobileActionButtonBehavior
{
public:
	class UPaperSprite*                           StopFocusingSprite;                                // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleCanUseEventModeFocusChanged(bool bCanUseEventModeFocus);
	void HandleEventModeFocusingChanged(bool bIsEventModeFocusing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileActionButtonBehavior_Focus">();
	}
	static class UFortMobileActionButtonBehavior_Focus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionButtonBehavior_Focus>();
	}
};
static_assert(alignof(UFortMobileActionButtonBehavior_Focus) == 0x000008, "Wrong alignment on UFortMobileActionButtonBehavior_Focus");
static_assert(sizeof(UFortMobileActionButtonBehavior_Focus) == 0x000100, "Wrong size on UFortMobileActionButtonBehavior_Focus");
static_assert(offsetof(UFortMobileActionButtonBehavior_Focus, StopFocusingSprite) == 0x0000F8, "Member 'UFortMobileActionButtonBehavior_Focus::StopFocusingSprite' has a wrong offset!");

}

