#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventsSimpleTab

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function EventsSimpleTab.EventsSimpleTab_C.ExecuteUbergraph_EventsSimpleTab
// 0x0180 (0x0180 - 0x0000)
struct EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonLegacy* Button, bool Selected)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0038(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_2;                            // 0x0058(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_3;                            // 0x0080(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Map_Find_Value_1;                         // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Map_Find_Value_2;                         // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Map_Find_Value_3;                         // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00CC(0x0014)()
	bool                                          Temp_bool_Variable;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x00F0(0x0018)()
	class FString                                 K2Node_CustomEvent_ParameterName;                  // 0x0108(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_New_Color;                      // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCommonButtonLegacy*                    K2Node_CustomEvent_Button;                         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Selected;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab) == 0x000008, "Wrong alignment on EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab");
static_assert(sizeof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab) == 0x000180, "Wrong size on EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, EntryPoint) == 0x000000, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, Temp_string_Variable) == 0x000008, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, Temp_string_Variable_1) == 0x000018, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_TextToUpper_ReturnValue) == 0x000038, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, K2Node_Event_IsDesignTime) == 0x000050, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, Temp_string_Variable_2) == 0x000058, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_Map_Find_Value) == 0x000068, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_Map_Find_ReturnValue) == 0x000078, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, Temp_string_Variable_3) == 0x000080, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_Map_Find_Value_1) == 0x000090, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_Map_Find_ReturnValue_1) == 0x0000A0, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_Map_Find_Value_2) == 0x0000A4, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_Map_Find_ReturnValue_2) == 0x0000B4, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_Map_Find_Value_3) == 0x0000B8, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_Map_Find_ReturnValue_3) == 0x0000C8, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, K2Node_MakeStruct_SlateColor) == 0x0000CC, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, Temp_bool_Variable) == 0x0000E0, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000E8, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, K2Node_Select_Default) == 0x0000F0, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, K2Node_CustomEvent_ParameterName) == 0x000108, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::K2Node_CustomEvent_ParameterName' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, K2Node_CustomEvent_New_Color) == 0x000118, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::K2Node_CustomEvent_New_Color' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_BreakVector2D_X) == 0x000128, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_BreakVector2D_Y) == 0x00012C, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, K2Node_MakeStruct_Margin) == 0x000130, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, K2Node_CustomEvent_Button) == 0x000140, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, K2Node_CustomEvent_Selected) == 0x000148, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::K2Node_CustomEvent_Selected' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000150, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_PlayAnimationForward_ReturnValue) == 0x000158, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000160, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000168, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000170, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab, CallFunc_IsMobileGame_ReturnValue) == 0x000178, "Member 'EventsSimpleTab_C_ExecuteUbergraph_EventsSimpleTab::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");

// Function EventsSimpleTab.EventsSimpleTab_C.OnSelectedChangedEvent
// 0x0010 (0x0010 - 0x0000)
struct EventsSimpleTab_C_OnSelectedChangedEvent final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected_0;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventsSimpleTab_C_OnSelectedChangedEvent) == 0x000008, "Wrong alignment on EventsSimpleTab_C_OnSelectedChangedEvent");
static_assert(sizeof(EventsSimpleTab_C_OnSelectedChangedEvent) == 0x000010, "Wrong size on EventsSimpleTab_C_OnSelectedChangedEvent");
static_assert(offsetof(EventsSimpleTab_C_OnSelectedChangedEvent, Button) == 0x000000, "Member 'EventsSimpleTab_C_OnSelectedChangedEvent::Button' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_OnSelectedChangedEvent, Selected_0) == 0x000008, "Member 'EventsSimpleTab_C_OnSelectedChangedEvent::Selected_0' has a wrong offset!");

// Function EventsSimpleTab.EventsSimpleTab_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct EventsSimpleTab_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventsSimpleTab_C_PreConstruct) == 0x000001, "Wrong alignment on EventsSimpleTab_C_PreConstruct");
static_assert(sizeof(EventsSimpleTab_C_PreConstruct) == 0x000001, "Wrong size on EventsSimpleTab_C_PreConstruct");
static_assert(offsetof(EventsSimpleTab_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'EventsSimpleTab_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function EventsSimpleTab.EventsSimpleTab_C.UpdateColor
// 0x0020 (0x0020 - 0x0000)
struct EventsSimpleTab_C_UpdateColor final
{
public:
	class FString                                 ParameterName;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           New_Color;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventsSimpleTab_C_UpdateColor) == 0x000008, "Wrong alignment on EventsSimpleTab_C_UpdateColor");
static_assert(sizeof(EventsSimpleTab_C_UpdateColor) == 0x000020, "Wrong size on EventsSimpleTab_C_UpdateColor");
static_assert(offsetof(EventsSimpleTab_C_UpdateColor, ParameterName) == 0x000000, "Member 'EventsSimpleTab_C_UpdateColor::ParameterName' has a wrong offset!");
static_assert(offsetof(EventsSimpleTab_C_UpdateColor, New_Color) == 0x000010, "Member 'EventsSimpleTab_C_UpdateColor::New_Color' has a wrong offset!");

}

