#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Temple_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct F_MED_Temple_FaceAcc_AnimBP.F_MED_Temple_FaceAcc_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00F7 (0x00F8 - 0x0001)
struct F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_85;                                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_86;                                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   StructProperty_87;                                 // 0x0018(0x0020)(NoDestructor)
	class UBlendProfile*                          ObjectProperty_88;                                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            ObjectProperty_89;                                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BoolProperty_90;                                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             EnumProperty_91;                                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      EnumProperty_92;                                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ArrayProperty_93;                                  // 0x0050(0x0010)()
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0060(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00E0(0x0018)()
};
static_assert(alignof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000F8, "Wrong size on F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_85) == 0x000004, "Member 'F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_85' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_86) == 0x00000C, "Member 'F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_86' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_87) == 0x000018, "Member 'F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_87' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_88) == 0x000038, "Member 'F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_88' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_89) == 0x000040, "Member 'F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_89' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_90) == 0x000048, "Member 'F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_90' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_91) == 0x000049, "Member 'F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_91' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_92) == 0x00004A, "Member 'F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_92' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_93) == 0x000050, "Member 'F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_93' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000060, "Member 'F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000E0, "Member 'F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct F_MED_Temple_FaceAcc_AnimBP.F_MED_Temple_FaceAcc_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0002 (0x0003 - 0x0001)
struct F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          BoolProperty;                                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_0;                                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000003, "Wrong size on F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData, BoolProperty) == 0x000001, "Member 'F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData::BoolProperty' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData, BoolProperty_0) == 0x000002, "Member 'F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData::BoolProperty_0' has a wrong offset!");

}

