#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Temple_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function F_MED_Temple_AnimBP.F_MED_Temple_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct F_MED_Temple_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(F_MED_Temple_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on F_MED_Temple_AnimBP_C_AnimGraph");
static_assert(sizeof(F_MED_Temple_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on F_MED_Temple_AnimBP_C_AnimGraph");
static_assert(offsetof(F_MED_Temple_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'F_MED_Temple_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function F_MED_Temple_AnimBP.F_MED_Temple_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct F_MED_Temple_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Temple_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on F_MED_Temple_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(F_MED_Temple_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on F_MED_Temple_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(F_MED_Temple_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'F_MED_Temple_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function F_MED_Temple_AnimBP.F_MED_Temple_AnimBP_C.ExecuteUbergraph_F_MED_Temple_AnimBP
// 0x0030 (0x0030 - 0x0000)
struct F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_1; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP) == 0x000008, "Wrong alignment on F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP");
static_assert(sizeof(F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP) == 0x000030, "Wrong size on F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP");
static_assert(offsetof(F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP, EntryPoint) == 0x000000, "Member 'F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP, CallFunc_GetPartSkeletalMeshComponent_ReturnValue) == 0x000010, "Member 'F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP::CallFunc_GetPartSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput) == 0x000018, "Member 'F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput) == 0x00001C, "Member 'F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_1) == 0x000020, "Member 'F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_1' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_1) == 0x000024, "Member 'F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_1' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000028, "Member 'F_MED_Temple_AnimBP_C_ExecuteUbergraph_F_MED_Temple_AnimBP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

