#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Temple_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Temple_AnimBP.F_MED_Temple_AnimBP_C
// 0x3120 (0x36A0 - 0x0580)
class UF_MED_Temple_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0588(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0590(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0598(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x05B8(0x0188)(ContainsInstancedReference)
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0740(0x0108)()
	uint8                                         Pad_848[0x8];                                      // 0x0848(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x0850(0x0440)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0C90(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0D98(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0DB8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0DD8(0x0108)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x0EE0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x1320(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x1760(0x0440)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x1BA0(0x07F0)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5;                        // 0x2390(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x2498(0x0108)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x25A0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x29E0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x2E20(0x0440)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x3260(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x3368(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x3470(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x3578(0x0108)()
	class USkeletalMeshComponent*                 skel_mesh;                                         // 0x3680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         thigh_rot_l;                                       // 0x3688(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         thigh_rot_r;                                       // 0x368C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         pack_alpha;                                        // 0x3690(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_F_MED_Temple_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Temple_AnimBP_C">();
	}
	static class UF_MED_Temple_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Temple_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Temple_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Temple_AnimBP_C");
static_assert(sizeof(UF_MED_Temple_AnimBP_C) == 0x0036A0, "Wrong size on UF_MED_Temple_AnimBP_C");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, UberGraphFrame) == 0x000580, "Member 'UF_MED_Temple_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000588, "Member 'UF_MED_Temple_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimBlueprintExtension_Base) == 0x000590, "Member 'UF_MED_Temple_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_Root) == 0x000598, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0005B8, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x000740, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_AnimDynamics_6) == 0x000850, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000C90, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000D98, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000DB8, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000DD8, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x000EE0, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x001320, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x001760, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_RigidBody) == 0x001BA0, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_Constraint_5) == 0x002390, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_Constraint_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_Constraint_4) == 0x002498, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x0025A0, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x0029E0, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x002E20, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_Constraint_3) == 0x003260, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_Constraint_2) == 0x003368, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_Constraint_1) == 0x003470, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_Constraint) == 0x003578, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, skel_mesh) == 0x003680, "Member 'UF_MED_Temple_AnimBP_C::skel_mesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, thigh_rot_l) == 0x003688, "Member 'UF_MED_Temple_AnimBP_C::thigh_rot_l' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, thigh_rot_r) == 0x00368C, "Member 'UF_MED_Temple_AnimBP_C::thigh_rot_r' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, pack_alpha) == 0x003690, "Member 'UF_MED_Temple_AnimBP_C::pack_alpha' has a wrong offset!");

}

