#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint.F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// 0x00CF (0x00D0 - 0x0001)
struct F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_4;                                    // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_5;                                    // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   StructProperty_6;                                  // 0x0018(0x0020)(NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0038(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00B8(0x0018)()
};
static_assert(alignof(F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x0000D0, "Wrong size on F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, NameProperty_4) == 0x000004, "Member 'F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::NameProperty_4' has a wrong offset!");
static_assert(offsetof(F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, NameProperty_5) == 0x00000C, "Member 'F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::NameProperty_5' has a wrong offset!");
static_assert(offsetof(F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, StructProperty_6) == 0x000018, "Member 'F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::StructProperty_6' has a wrong offset!");
static_assert(offsetof(F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000038, "Member 'F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000B8, "Member 'F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

