#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Temple_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "F_MED_Temple_FaceAcc_AnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GravityOverrideParamsStruct_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Temple_FaceAcc_AnimBP.F_MED_Temple_FaceAcc_AnimBP_C
// 0x3040 (0x35C0 - 0x0580)
class UF_MED_Temple_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct F_MED_Temple_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0588(0x0003)(HasGetValueTypeHash)
	uint8                                         Pad_58B[0x5];                                      // 0x058B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0590(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0598(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x05A0(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x05C0(0x0188)(ContainsInstancedReference)
	uint8                                         Pad_748[0x8];                                      // 0x0748(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x0750(0x07F0)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x0F40(0x07F0)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x1730(0x07F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x1F20(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x2028(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x2048(0x0028)()
	struct FAnimNode_Trail                        AnimGraphNode_Trail;                               // 0x2070(0x0260)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x22D0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x22F8(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2380(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x23A8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x23C8(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x23F0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2410(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x2518(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x2538(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x2640(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x2748(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x2850(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x2958(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2A60(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2A80(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x2AA0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x2EE0(0x0440)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x3320(0x0088)()
	bool                                          isWearingBackbling;                                // 0x33A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A9[0x3];                                     // 0x33A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IsWearingCape;                                     // 0x33AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                gravityVector;                                     // 0x33B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         templePackAlpha;                                   // 0x33BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         isGenericBackpackAlpha;                            // 0x33C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isWearingCapeBool;                                 // 0x33C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isWearingBackpack;                                 // 0x33C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isTemplePack;                                      // 0x33C6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C7[0x1];                                     // 0x33C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGravityOverrideParamsStruct           Gravity_Override_Params;                           // 0x33C8(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Temple_FaceAcc_AnimBP_C">();
	}
	static class UF_MED_Temple_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Temple_FaceAcc_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Temple_FaceAcc_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Temple_FaceAcc_AnimBP_C");
static_assert(sizeof(UF_MED_Temple_FaceAcc_AnimBP_C) == 0x0035C0, "Wrong size on UF_MED_Temple_FaceAcc_AnimBP_C");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, UberGraphFrame) == 0x000580, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, __AnimBlueprintMutables) == 0x000588, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000590, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimBlueprintExtension_Base) == 0x000598, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_Root) == 0x0005A0, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0005C0, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_RigidBody_2) == 0x000750, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_RigidBody_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x000F40, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_RigidBody) == 0x001730, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x001F20, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x002028, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_UseCachedPose_3) == 0x002048, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_Trail) == 0x002070, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_Trail' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x0022D0, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x0022F8, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x002380, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace_2) == 0x0023A8, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x0023C8, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x0023F0, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x002410, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x002518, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_Constraint_4) == 0x002538, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_Constraint_3) == 0x002640, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_Constraint_2) == 0x002748, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_Constraint_1) == 0x002850, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_Constraint) == 0x002958, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x002A60, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x002A80, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x002AA0, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x002EE0, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x003320, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, isWearingBackbling) == 0x0033A8, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::isWearingBackbling' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, IsWearingCape) == 0x0033AC, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::IsWearingCape' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, gravityVector) == 0x0033B0, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::gravityVector' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, templePackAlpha) == 0x0033BC, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::templePackAlpha' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, isGenericBackpackAlpha) == 0x0033C0, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::isGenericBackpackAlpha' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, isWearingCapeBool) == 0x0033C4, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::isWearingCapeBool' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, isWearingBackpack) == 0x0033C5, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::isWearingBackpack' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, isTemplePack) == 0x0033C6, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::isTemplePack' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_FaceAcc_AnimBP_C, Gravity_Override_Params) == 0x0033C8, "Member 'UF_MED_Temple_FaceAcc_AnimBP_C::Gravity_Override_Params' has a wrong offset!");

}

