#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FeatTimelineListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FeatTimelineListEntry.FeatTimelineListEntry_C
// 0x0068 (0x0338 - 0x02D0)
class UFeatTimelineListEntry_C final : public UAthenaFeatTimelineListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnActivated;                                       // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnShowCompleted;                                   // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                AnimBoundTileBorder;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 burst;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Default;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryVisbilityBorder;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SeasonNumber;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Contents;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Date;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         TimespanMaxWidth;                                  // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanWidthPerDay;                               // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWaitingForCompletedTimer;                         // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void ExecuteUbergraph_FeatTimelineListEntry(int32 EntryPoint);
	void HoverFeat();
	void OnFeatCompletedThisSession();
	void OnFeatInfoSet(int32 NumFeatsOnDay, int32 IdxOnDay);
	void OnTimespanInfoSet(int32 NumDays);
	void OnWaitingForCompletedTimer();
	void PreConstruct(bool IsDesignTime);
	void SetSeasonStyle();
	void UnHoverFeat();
	void WidgetAnimationEvt_OnShowCompleted_K2Node_WidgetAnimationEvent_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FeatTimelineListEntry_C">();
	}
	static class UFeatTimelineListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFeatTimelineListEntry_C>();
	}
};
static_assert(alignof(UFeatTimelineListEntry_C) == 0x000008, "Wrong alignment on UFeatTimelineListEntry_C");
static_assert(sizeof(UFeatTimelineListEntry_C) == 0x000338, "Wrong size on UFeatTimelineListEntry_C");
static_assert(offsetof(UFeatTimelineListEntry_C, UberGraphFrame) == 0x0002D0, "Member 'UFeatTimelineListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFeatTimelineListEntry_C, OnActivated) == 0x0002D8, "Member 'UFeatTimelineListEntry_C::OnActivated' has a wrong offset!");
static_assert(offsetof(UFeatTimelineListEntry_C, OnShowCompleted) == 0x0002E0, "Member 'UFeatTimelineListEntry_C::OnShowCompleted' has a wrong offset!");
static_assert(offsetof(UFeatTimelineListEntry_C, OnHover) == 0x0002E8, "Member 'UFeatTimelineListEntry_C::OnHover' has a wrong offset!");
static_assert(offsetof(UFeatTimelineListEntry_C, AnimBoundTileBorder) == 0x0002F0, "Member 'UFeatTimelineListEntry_C::AnimBoundTileBorder' has a wrong offset!");
static_assert(offsetof(UFeatTimelineListEntry_C, burst) == 0x0002F8, "Member 'UFeatTimelineListEntry_C::burst' has a wrong offset!");
static_assert(offsetof(UFeatTimelineListEntry_C, Default) == 0x000300, "Member 'UFeatTimelineListEntry_C::Default' has a wrong offset!");
static_assert(offsetof(UFeatTimelineListEntry_C, EntryVisbilityBorder) == 0x000308, "Member 'UFeatTimelineListEntry_C::EntryVisbilityBorder' has a wrong offset!");
static_assert(offsetof(UFeatTimelineListEntry_C, SeasonNumber) == 0x000310, "Member 'UFeatTimelineListEntry_C::SeasonNumber' has a wrong offset!");
static_assert(offsetof(UFeatTimelineListEntry_C, SizeBox_Contents) == 0x000318, "Member 'UFeatTimelineListEntry_C::SizeBox_Contents' has a wrong offset!");
static_assert(offsetof(UFeatTimelineListEntry_C, SizeBox_Date) == 0x000320, "Member 'UFeatTimelineListEntry_C::SizeBox_Date' has a wrong offset!");
static_assert(offsetof(UFeatTimelineListEntry_C, TimespanMaxWidth) == 0x000328, "Member 'UFeatTimelineListEntry_C::TimespanMaxWidth' has a wrong offset!");
static_assert(offsetof(UFeatTimelineListEntry_C, TimespanWidthPerDay) == 0x00032C, "Member 'UFeatTimelineListEntry_C::TimespanWidthPerDay' has a wrong offset!");
static_assert(offsetof(UFeatTimelineListEntry_C, bWaitingForCompletedTimer) == 0x000330, "Member 'UFeatTimelineListEntry_C::bWaitingForCompletedTimer' has a wrong offset!");

}

