#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FIlteredTextEntryWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FIlteredTextEntryWidget.FilteredTextEntryWidget_C
// 0x0B10 (0x0E90 - 0x0380)
class UFilteredTextEntryWidget_C final : public UFortEditableFilteredCountedTextBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Error;                                             // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_Prompt;                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ErrorText;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Info;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_119;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    InputActionWidget;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_InputAction;                               // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WarningImage;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bUseOverrideStyle;                                 // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0xF];                                      // 0x03D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditableTextBoxStyle                  OverrideStyle;                                     // 0x03E0(0x0A00)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bHideValidationInfo;                               // 0x0DE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	ETextJustify                                  Justification;                                     // 0x0DE1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowTextPrompt;                                    // 0x0DE2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_DE3[0x5];                                      // 0x0DE3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 PromptTextStyle;                                   // 0x0DE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   PromptText;                                        // 0x0DF0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void(class FText Text)> OnTextChanged;                                     // 0x0E08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bUseHintText;                                      // 0x0E18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E19[0x7];                                      // 0x0E19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HintText;                                          // 0x0E20(0x0018)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void(class FText Text, bool BadText)> OnSanitizedTextReady;                              // 0x0E38(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnTextCommitByEnter;                               // 0x0E48(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          SanitizedTextReady;                                // 0x0E58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E59[0x7];                                      // 0x0E59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnTextCommitted;                                   // 0x0E60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   PersistentIDValidationErrorText;                   // 0x0E70(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__EditText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__EditText_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void Construct();
	void ExecuteUbergraph_FilteredTextEntryWidget(int32 EntryPoint);
	void GetCurrentText(class FText* Text);
	void GetErrorText(bool Additional_Validator_Failed, class FText* Appropriate_Text);
	void HandleShowPrompt(const class FText& CurrentText);
	void OnDirtyTextAttempted(bool bIsBadText, bool bAdditionalValidationFailed);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void SetTextFocus();
	void UpdateConfiguration(bool bOverrideStyle, bool bHideValidation, ETextJustify TextJustification, bool bShouldShowTextPrompt, const class FText& PromptDisplayText, class UClass* TextStyle);
	void ValidatePersistentID(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FilteredTextEntryWidget_C">();
	}
	static class UFilteredTextEntryWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFilteredTextEntryWidget_C>();
	}
};
static_assert(alignof(UFilteredTextEntryWidget_C) == 0x000010, "Wrong alignment on UFilteredTextEntryWidget_C");
static_assert(sizeof(UFilteredTextEntryWidget_C) == 0x000E90, "Wrong size on UFilteredTextEntryWidget_C");
static_assert(offsetof(UFilteredTextEntryWidget_C, UberGraphFrame) == 0x000380, "Member 'UFilteredTextEntryWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, Error) == 0x000388, "Member 'UFilteredTextEntryWidget_C::Error' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, CommonTextBlock_Prompt) == 0x000390, "Member 'UFilteredTextEntryWidget_C::CommonTextBlock_Prompt' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, ErrorText) == 0x000398, "Member 'UFilteredTextEntryWidget_C::ErrorText' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, HorizontalBox_Info) == 0x0003A0, "Member 'UFilteredTextEntryWidget_C::HorizontalBox_Info' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, Image_119) == 0x0003A8, "Member 'UFilteredTextEntryWidget_C::Image_119' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, Image_Selected) == 0x0003B0, "Member 'UFilteredTextEntryWidget_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, InputActionWidget) == 0x0003B8, "Member 'UFilteredTextEntryWidget_C::InputActionWidget' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, Overlay_InputAction) == 0x0003C0, "Member 'UFilteredTextEntryWidget_C::Overlay_InputAction' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, WarningImage) == 0x0003C8, "Member 'UFilteredTextEntryWidget_C::WarningImage' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, bUseOverrideStyle) == 0x0003D0, "Member 'UFilteredTextEntryWidget_C::bUseOverrideStyle' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, OverrideStyle) == 0x0003E0, "Member 'UFilteredTextEntryWidget_C::OverrideStyle' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, bHideValidationInfo) == 0x000DE0, "Member 'UFilteredTextEntryWidget_C::bHideValidationInfo' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, Justification) == 0x000DE1, "Member 'UFilteredTextEntryWidget_C::Justification' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, ShowTextPrompt) == 0x000DE2, "Member 'UFilteredTextEntryWidget_C::ShowTextPrompt' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, PromptTextStyle) == 0x000DE8, "Member 'UFilteredTextEntryWidget_C::PromptTextStyle' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, PromptText) == 0x000DF0, "Member 'UFilteredTextEntryWidget_C::PromptText' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, OnTextChanged) == 0x000E08, "Member 'UFilteredTextEntryWidget_C::OnTextChanged' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, bUseHintText) == 0x000E18, "Member 'UFilteredTextEntryWidget_C::bUseHintText' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, HintText) == 0x000E20, "Member 'UFilteredTextEntryWidget_C::HintText' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, OnSanitizedTextReady) == 0x000E38, "Member 'UFilteredTextEntryWidget_C::OnSanitizedTextReady' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, OnTextCommitByEnter) == 0x000E48, "Member 'UFilteredTextEntryWidget_C::OnTextCommitByEnter' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, SanitizedTextReady) == 0x000E58, "Member 'UFilteredTextEntryWidget_C::SanitizedTextReady' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, OnTextCommitted) == 0x000E60, "Member 'UFilteredTextEntryWidget_C::OnTextCommitted' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, PersistentIDValidationErrorText) == 0x000E70, "Member 'UFilteredTextEntryWidget_C::PersistentIDValidationErrorText' has a wrong offset!");

}

