#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlagSelectionModal

#include "Basic.hpp"


namespace SDK::Params
{

// Function FlagSelectionModal.FlagSelectionModal_C.BndEvt__Button_Change_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FlagSelectionModal_C_BndEvt__Button_Change_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FlagSelectionModal_C_BndEvt__Button_Change_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FlagSelectionModal_C_BndEvt__Button_Change_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FlagSelectionModal_C_BndEvt__Button_Change_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FlagSelectionModal_C_BndEvt__Button_Change_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FlagSelectionModal_C_BndEvt__Button_Change_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FlagSelectionModal_C_BndEvt__Button_Change_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FlagSelectionModal.FlagSelectionModal_C.BndEvt__Button_ConfirmationCancel_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FlagSelectionModal_C_BndEvt__Button_ConfirmationCancel_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FlagSelectionModal_C_BndEvt__Button_ConfirmationCancel_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FlagSelectionModal_C_BndEvt__Button_ConfirmationCancel_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FlagSelectionModal_C_BndEvt__Button_ConfirmationCancel_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FlagSelectionModal_C_BndEvt__Button_ConfirmationCancel_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FlagSelectionModal_C_BndEvt__Button_ConfirmationCancel_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FlagSelectionModal_C_BndEvt__Button_ConfirmationCancel_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FlagSelectionModal.FlagSelectionModal_C.ExecuteUbergraph_FlagSelectionModal
// 0x0020 (0x0020 - 0x0000)
struct FlagSelectionModal_C_ExecuteUbergraph_FlagSelectionModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FlagSelectionModal_C_ExecuteUbergraph_FlagSelectionModal) == 0x000008, "Wrong alignment on FlagSelectionModal_C_ExecuteUbergraph_FlagSelectionModal");
static_assert(sizeof(FlagSelectionModal_C_ExecuteUbergraph_FlagSelectionModal) == 0x000020, "Wrong size on FlagSelectionModal_C_ExecuteUbergraph_FlagSelectionModal");
static_assert(offsetof(FlagSelectionModal_C_ExecuteUbergraph_FlagSelectionModal, EntryPoint) == 0x000000, "Member 'FlagSelectionModal_C_ExecuteUbergraph_FlagSelectionModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(FlagSelectionModal_C_ExecuteUbergraph_FlagSelectionModal, K2Node_ComponentBoundEvent_Button_1) == 0x000008, "Member 'FlagSelectionModal_C_ExecuteUbergraph_FlagSelectionModal::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(FlagSelectionModal_C_ExecuteUbergraph_FlagSelectionModal, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'FlagSelectionModal_C_ExecuteUbergraph_FlagSelectionModal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FlagSelectionModal_C_ExecuteUbergraph_FlagSelectionModal, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'FlagSelectionModal_C_ExecuteUbergraph_FlagSelectionModal::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function FlagSelectionModal.FlagSelectionModal_C.Handle Back
// 0x0001 (0x0001 - 0x0000)
struct FlagSelectionModal_C_Handle_Back final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FlagSelectionModal_C_Handle_Back) == 0x000001, "Wrong alignment on FlagSelectionModal_C_Handle_Back");
static_assert(sizeof(FlagSelectionModal_C_Handle_Back) == 0x000001, "Wrong size on FlagSelectionModal_C_Handle_Back");
static_assert(offsetof(FlagSelectionModal_C_Handle_Back, PassThrough) == 0x000000, "Member 'FlagSelectionModal_C_Handle_Back::PassThrough' has a wrong offset!");

}

