#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FNEventsMetadataOverlay

#include "Basic.hpp"


namespace SDK::Params
{

// Function FNEventsMetadataOverlay.FNEventsMetadataOverlay_C.ExecuteUbergraph_FNEventsMetadataOverlay
// 0x0048 (0x0048 - 0x0000)
struct FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPictureInPictureSubsystem*             CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPictureInPicturePartnerControls*       CallFunc_GetPartnerControls_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPictureInPictureFNEventsController*    K2Node_DynamicCast_AsPicture_in_Picture_FNEvents_Controller; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPictureInPictureSubsystem*             CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay) == 0x000008, "Wrong alignment on FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay");
static_assert(sizeof(FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay) == 0x000048, "Wrong size on FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay");
static_assert(offsetof(FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay, EntryPoint) == 0x000000, "Member 'FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000008, "Member 'FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay, CallFunc_GetPartnerControls_ReturnValue) == 0x000010, "Member 'FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay::CallFunc_GetPartnerControls_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay, K2Node_DynamicCast_AsPicture_in_Picture_FNEvents_Controller) == 0x000030, "Member 'FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay::K2Node_DynamicCast_AsPicture_in_Picture_FNEvents_Controller' has a wrong offset!");
static_assert(offsetof(FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x000040, "Member 'FNEventsMetadataOverlay_C_ExecuteUbergraph_FNEventsMetadataOverlay::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");

}

