#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortQuestMenuAutoRunWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortQuestMenuAutoRunWidget.FortQuestMenuAutoRunWidget_C
// 0x0038 (0x02B8 - 0x0280)
class UFortQuestMenuAutoRunWidget_C final : public UFortQuestMenuAutoRunWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortLazyImage*                         Image_Background;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Run;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text;                                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_FortQuestMenuAutoRunWidget(int32 EntryPoint);
	void OnAutoRunEnabled(bool bAutoRunEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortQuestMenuAutoRunWidget_C">();
	}
	static class UFortQuestMenuAutoRunWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestMenuAutoRunWidget_C>();
	}
};
static_assert(alignof(UFortQuestMenuAutoRunWidget_C) == 0x000008, "Wrong alignment on UFortQuestMenuAutoRunWidget_C");
static_assert(sizeof(UFortQuestMenuAutoRunWidget_C) == 0x0002B8, "Wrong size on UFortQuestMenuAutoRunWidget_C");
static_assert(offsetof(UFortQuestMenuAutoRunWidget_C, UberGraphFrame) == 0x000280, "Member 'UFortQuestMenuAutoRunWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortQuestMenuAutoRunWidget_C, Outro) == 0x000288, "Member 'UFortQuestMenuAutoRunWidget_C::Outro' has a wrong offset!");
static_assert(offsetof(UFortQuestMenuAutoRunWidget_C, Intro) == 0x000290, "Member 'UFortQuestMenuAutoRunWidget_C::Intro' has a wrong offset!");
static_assert(offsetof(UFortQuestMenuAutoRunWidget_C, Image_Background) == 0x000298, "Member 'UFortQuestMenuAutoRunWidget_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UFortQuestMenuAutoRunWidget_C, Image_Run) == 0x0002A0, "Member 'UFortQuestMenuAutoRunWidget_C::Image_Run' has a wrong offset!");
static_assert(offsetof(UFortQuestMenuAutoRunWidget_C, Overlay_0) == 0x0002A8, "Member 'UFortQuestMenuAutoRunWidget_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UFortQuestMenuAutoRunWidget_C, Text) == 0x0002B0, "Member 'UFortQuestMenuAutoRunWidget_C::Text' has a wrong offset!");

}

