#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_M_Avg_Player_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.BlueprintProcessAnimInputEvent
// 0x0008 (0x0008 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintProcessAnimInputEvent final
{
public:
	const class UFortAnimInputEvent*              AnimInputEvent;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintProcessAnimInputEvent) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintProcessAnimInputEvent");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintProcessAnimInputEvent) == 0x000008, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintProcessAnimInputEvent");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintProcessAnimInputEvent, AnimInputEvent) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintProcessAnimInputEvent::AnimInputEvent' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.CharacterSkeletalControlPostLegIK
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_CharacterSkeletalControlPostLegIK final
{
public:
	struct FPoseLink                              InPosePostLegIK;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CharacterSkeletalControlPostLegIK_0;               // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_CharacterSkeletalControlPostLegIK) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_CharacterSkeletalControlPostLegIK");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_CharacterSkeletalControlPostLegIK) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_CharacterSkeletalControlPostLegIK");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_CharacterSkeletalControlPostLegIK, InPosePostLegIK) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_CharacterSkeletalControlPostLegIK::InPosePostLegIK' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_CharacterSkeletalControlPostLegIK, CharacterSkeletalControlPostLegIK_0) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_CharacterSkeletalControlPostLegIK::CharacterSkeletalControlPostLegIK_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.CharPartEvent
// 0x0008 (0x0008 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_CharPartEvent final
{
public:
	class UFortPlayerAnimInstance*                CharPart;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_CharPartEvent) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_CharPartEvent");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_CharPartEvent) == 0x000008, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_CharPartEvent");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_CharPartEvent, CharPart) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_CharPartEvent::CharPart' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.CustomLocomotionFullBodyAdditive
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyAdditive final
{
public:
	struct FPoseLink                              InPoseFullBodyAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CustomLocomotionFullBodyAdditive_0;                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyAdditive) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyAdditive");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyAdditive) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyAdditive");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyAdditive, InPoseFullBodyAdditive) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyAdditive::InPoseFullBodyAdditive' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyAdditive, CustomLocomotionFullBodyAdditive_0) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyAdditive::CustomLocomotionFullBodyAdditive_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.CustomLocomotionFullBodyLayer
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyLayer final
{
public:
	struct FPoseLink                              PassThroughCustomFullBody;                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CustomLocomotionFullBodyLayer_0;                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyLayer) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyLayer");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyLayer) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyLayer");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyLayer, PassThroughCustomFullBody) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyLayer::PassThroughCustomFullBody' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyLayer, CustomLocomotionFullBodyLayer_0) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionFullBodyLayer::CustomLocomotionFullBodyLayer_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.CustomLocomotionPreIKLayer
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionPreIKLayer final
{
public:
	struct FPoseLink                              InPosePreIK;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CustomLocomotionPreIKLayer_0;                      // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionPreIKLayer) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionPreIKLayer");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionPreIKLayer) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionPreIKLayer");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionPreIKLayer, InPosePreIK) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionPreIKLayer::InPosePreIK' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionPreIKLayer, CustomLocomotionPreIKLayer_0) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_CustomLocomotionPreIKLayer::CustomLocomotionPreIKLayer_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint
// 0x0170 (0x0170 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterfacePlayerPawn_C> K2Node_DynamicCast_AsInterface_Player_Pawn;        // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterfacePlayerPawn_C> K2Node_DynamicCast_AsInterface_Player_Pawn_1;      // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_2;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_3;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_2;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_3;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterfacePlayerPawn_C> K2Node_DynamicCast_AsInterface_Player_Pawn_2;      // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterfacePlayerPawn_C> K2Node_DynamicCast_AsInterface_Player_Pawn_3;      // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlayerAnimInstance*                K2Node_CustomEvent_CharPart;                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateZone*                     K2Node_DynamicCast_AsFort_Game_State_Zone;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortAnimInputEvent*              K2Node_Event_AnimInputEvent;                       // 0x00F0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNamed_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_4;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_4;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterfacePlayerPawn_C> K2Node_DynamicCast_AsInterface_Player_Pawn_4;      // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_5;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_5;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterfacePlayerPawn_C> K2Node_DynamicCast_AsInterface_Player_Pawn_5;      // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint) == 0x000170, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, EntryPoint) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000004, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue_1) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsFort_Pawn) == 0x000018, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsFort_Pawn_1) == 0x000028, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsFort_Pawn_1' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsInterface_Player_Pawn) == 0x000038, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsInterface_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsInterface_Player_Pawn_1) == 0x000050, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsInterface_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_3) == 0x000060, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue_2) == 0x000068, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue_3) == 0x000070, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsFort_Pawn_2) == 0x000078, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsFort_Pawn_2' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_4) == 0x000080, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsFort_Pawn_3) == 0x000088, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsFort_Pawn_3' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_5) == 0x000090, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsInterface_Player_Pawn_2) == 0x000098, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsInterface_Player_Pawn_2' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_6) == 0x0000A8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsInterface_Player_Pawn_3) == 0x0000B0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsInterface_Player_Pawn_3' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_7) == 0x0000C0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_CustomEvent_CharPart) == 0x0000C8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_CustomEvent_CharPart' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_GetGameState_ReturnValue) == 0x0000D0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, Temp_bool_Has_Been_Initd_Variable) == 0x0000D8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsFort_Game_State_Zone) == 0x0000E0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsFort_Game_State_Zone' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_8) == 0x0000E8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_BooleanAND_ReturnValue) == 0x0000E9, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_Event_AnimInputEvent) == 0x0000F0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_Event_AnimInputEvent' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_IsNamed_ReturnValue) == 0x0000F8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_IsNamed_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, Temp_bool_IsClosed_Variable) == 0x0000F9, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue_4) == 0x000100, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, Temp_bool_Variable) == 0x000108, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsFort_Pawn_4) == 0x000110, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsFort_Pawn_4' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_9) == 0x000118, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_Not_PreBool_ReturnValue) == 0x000119, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsInterface_Player_Pawn_4) == 0x000120, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsInterface_Player_Pawn_4' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_10) == 0x000130, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue_5) == 0x000138, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000140, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsFort_Pawn_5) == 0x000148, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsFort_Pawn_5' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_11) == 0x000150, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsInterface_Player_Pawn_5) == 0x000158, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsInterface_Player_Pawn_5' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_12) == 0x000168, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.FullBodyOverride
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_FullBodyOverride final
{
public:
	struct FPoseLink                              PassThroughFullBodyPose;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FullBodyOverride_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_FullBodyOverride) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_FullBodyOverride");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_FullBodyOverride) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_FullBodyOverride");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_FullBodyOverride, PassThroughFullBodyPose) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_FullBodyOverride::PassThroughFullBodyPose' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_FullBodyOverride, FullBodyOverride_0) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_FullBodyOverride::FullBodyOverride_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemAimOffset
// 0x0040 (0x0040 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset final
{
public:
	struct FPoseLink                              InPose_AimOffset;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         AimOffsetAlpha;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pitch;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              InPose_UpperLowerPreMeleeAO;                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemAimOffset_0;                                   // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset) == 0x000040, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset, InPose_AimOffset) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset::InPose_AimOffset' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset, AimOffsetAlpha) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset::AimOffsetAlpha' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset, Yaw) == 0x000014, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset::Yaw' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset, Pitch) == 0x000018, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset::Pitch' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset, InPose_UpperLowerPreMeleeAO) == 0x000020, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset::InPose_UpperLowerPreMeleeAO' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset, ItemAimOffset_0) == 0x000030, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemAimOffset::ItemAimOffset_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemCrouchTurningAdditive
// 0x0010 (0x0010 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemCrouchTurningAdditive final
{
public:
	struct FPoseLink                              ItemCrouchTurningAdditive_0;                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemCrouchTurningAdditive) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemCrouchTurningAdditive");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemCrouchTurningAdditive) == 0x000010, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemCrouchTurningAdditive");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemCrouchTurningAdditive, ItemCrouchTurningAdditive_0) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemCrouchTurningAdditive::ItemCrouchTurningAdditive_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemFallAdditive
// 0x0010 (0x0010 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFallAdditive final
{
public:
	struct FPoseLink                              ItemFallAdditive_0;                                // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFallAdditive) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFallAdditive");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFallAdditive) == 0x000010, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFallAdditive");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFallAdditive, ItemFallAdditive_0) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFallAdditive::ItemFallAdditive_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemFallLandAdditive
// 0x0010 (0x0010 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFallLandAdditive final
{
public:
	struct FPoseLink                              ItemFallLandAdditive_0;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFallLandAdditive) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFallLandAdditive");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFallLandAdditive) == 0x000010, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFallLandAdditive");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFallLandAdditive, ItemFallLandAdditive_0) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFallLandAdditive::ItemFallLandAdditive_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemFlyModeLoopAdditive
// 0x0010 (0x0010 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFlyModeLoopAdditive final
{
public:
	struct FPoseLink                              ItemFlyModeLoopAdditive_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFlyModeLoopAdditive) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFlyModeLoopAdditive");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFlyModeLoopAdditive) == 0x000010, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFlyModeLoopAdditive");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFlyModeLoopAdditive, ItemFlyModeLoopAdditive_0) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFlyModeLoopAdditive::ItemFlyModeLoopAdditive_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemFlyModeStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFlyModeStartAdditive final
{
public:
	struct FPoseLink                              ItemFlyModeStartAdditive_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFlyModeStartAdditive) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFlyModeStartAdditive");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFlyModeStartAdditive) == 0x000010, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFlyModeStartAdditive");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFlyModeStartAdditive, ItemFlyModeStartAdditive_0) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFlyModeStartAdditive::ItemFlyModeStartAdditive_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemFullBodyOverride
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodyOverride final
{
public:
	struct FPoseLink                              InPoseFullBody;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemFullBodyOverride_0;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodyOverride) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodyOverride");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodyOverride) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodyOverride");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodyOverride, InPoseFullBody) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodyOverride::InPoseFullBody' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodyOverride, ItemFullBodyOverride_0) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodyOverride::ItemFullBodyOverride_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemFullBodySprint
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodySprint final
{
public:
	struct FPoseLink                              InPoseSprint;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemFullBodySprint_0;                              // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodySprint) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodySprint");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodySprint) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodySprint");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodySprint, InPoseSprint) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodySprint::InPoseSprint' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodySprint, ItemFullBodySprint_0) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemFullBodySprint::ItemFullBodySprint_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemIdleAdditive
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemIdleAdditive final
{
public:
	struct FPoseLink                              InPoseIdleAdditive;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemIdleAdditive_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemIdleAdditive) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemIdleAdditive");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemIdleAdditive) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemIdleAdditive");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemIdleAdditive, InPoseIdleAdditive) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemIdleAdditive::InPoseIdleAdditive' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemIdleAdditive, ItemIdleAdditive_0) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemIdleAdditive::ItemIdleAdditive_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemJetPackJumpAdditive
// 0x0010 (0x0010 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJetPackJumpAdditive final
{
public:
	struct FPoseLink                              ItemJetPackJumpAdditive_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJetPackJumpAdditive) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJetPackJumpAdditive");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJetPackJumpAdditive) == 0x000010, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJetPackJumpAdditive");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJetPackJumpAdditive, ItemJetPackJumpAdditive_0) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJetPackJumpAdditive::ItemJetPackJumpAdditive_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemJetPackStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJetPackStartAdditive final
{
public:
	struct FPoseLink                              ItemJetPackStartAdditive_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJetPackStartAdditive) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJetPackStartAdditive");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJetPackStartAdditive) == 0x000010, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJetPackStartAdditive");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJetPackStartAdditive, ItemJetPackStartAdditive_0) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJetPackStartAdditive::ItemJetPackStartAdditive_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemJogPostPivotAdditive
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPostPivotAdditive final
{
public:
	struct FPoseLink                              InPosePostPivotAdditive;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogPostPivotAdditive_0;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPostPivotAdditive) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPostPivotAdditive");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPostPivotAdditive) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPostPivotAdditive");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPostPivotAdditive, InPosePostPivotAdditive) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPostPivotAdditive::InPosePostPivotAdditive' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPostPivotAdditive, ItemJogPostPivotAdditive_0) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPostPivotAdditive::ItemJogPostPivotAdditive_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemJogPrePivotAdditive
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPrePivotAdditive final
{
public:
	struct FPoseLink                              InPosePrePivotAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogPrePivotAdditive_0;                         // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPrePivotAdditive) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPrePivotAdditive");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPrePivotAdditive) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPrePivotAdditive");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPrePivotAdditive, InPosePrePivotAdditive) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPrePivotAdditive::InPosePrePivotAdditive' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPrePivotAdditive, ItemJogPrePivotAdditive_0) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPrePivotAdditive::ItemJogPrePivotAdditive_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemJogStartAdditive
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStartAdditive final
{
public:
	struct FPoseLink                              InPoseJogStartAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogStartAdditive_0;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStartAdditive) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStartAdditive");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStartAdditive) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStartAdditive");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStartAdditive, InPoseJogStartAdditive) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStartAdditive::InPoseJogStartAdditive' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStartAdditive, ItemJogStartAdditive_0) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStartAdditive::ItemJogStartAdditive_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemJogStopAdditive
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStopAdditive final
{
public:
	struct FPoseLink                              InPoseJogStopAdditive;                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogStopAdditive_0;                             // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStopAdditive) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStopAdditive");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStopAdditive) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStopAdditive");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStopAdditive, InPoseJogStopAdditive) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStopAdditive::InPoseJogStopAdditive' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStopAdditive, ItemJogStopAdditive_0) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogStopAdditive::ItemJogStopAdditive_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemJumpLoopAdditive
// 0x0010 (0x0010 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJumpLoopAdditive final
{
public:
	struct FPoseLink                              ItemJumpLoopAdditive_0;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJumpLoopAdditive) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJumpLoopAdditive");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJumpLoopAdditive) == 0x000010, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJumpLoopAdditive");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJumpLoopAdditive, ItemJumpLoopAdditive_0) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJumpLoopAdditive::ItemJumpLoopAdditive_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemJumpUpAdditive
// 0x0010 (0x0010 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJumpUpAdditive final
{
public:
	struct FPoseLink                              ItemJumpUpAdditive_0;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJumpUpAdditive) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJumpUpAdditive");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJumpUpAdditive) == 0x000010, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJumpUpAdditive");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJumpUpAdditive, ItemJumpUpAdditive_0) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJumpUpAdditive::ItemJumpUpAdditive_0' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemLowerBodyJogPostPivot
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogPostPivot;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogPostPivot_0;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot, InPoseLowerBodyJogPostPivot) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot::InPoseLowerBodyJogPostPivot' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot, ItemLowerBodyJogPostPivot_0) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot::ItemLowerBodyJogPostPivot_0' has a wrong offset!");

