#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortCosmeticItemCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortCosmeticItemCard.FortCosmeticItemCard_C
// 0x0018 (0x02D8 - 0x02C0)
class UFortCosmeticItemCard_C final : public UFortCosmeticItemCard
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Hover;                                        // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ImageMaterial_NewItemCard;                         // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FortCosmeticItemCard(int32 EntryPoint);
	void HandleUpdateRarity(const struct FFortColorPalette& RarityColors);
	void HandleUpdateVisuals(bool bIsItem, bool bIsBorderAnimated, bool IsHero, bool IsReward, bool IsShuffleItem);
	void OnHover();
	void OnSizeChanged(float InCardWidth);
	void OnUnhover();
	void OnUpdateEnhanced(bool bEnhanced);
	void OnUpdateItemCardIcon(class UTexture2D* Icon);
	void OnUpdateItemCardMaterial(class UMaterialInterface* Material);
	void OnUpdateSeriesOrRarityColors(const struct FFortColorPalette& ColorPalette);
	void UpdateVisuals(bool bIsItem, bool bIsBorderAnimated, bool bIsHero, bool bReward, bool bIsShuffleItem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortCosmeticItemCard_C">();
	}
	static class UFortCosmeticItemCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCosmeticItemCard_C>();
	}
};
static_assert(alignof(UFortCosmeticItemCard_C) == 0x000008, "Wrong alignment on UFortCosmeticItemCard_C");
static_assert(sizeof(UFortCosmeticItemCard_C) == 0x0002D8, "Wrong size on UFortCosmeticItemCard_C");
static_assert(offsetof(UFortCosmeticItemCard_C, UberGraphFrame) == 0x0002C0, "Member 'UFortCosmeticItemCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortCosmeticItemCard_C, Anim_Hover) == 0x0002C8, "Member 'UFortCosmeticItemCard_C::Anim_Hover' has a wrong offset!");
static_assert(offsetof(UFortCosmeticItemCard_C, ImageMaterial_NewItemCard) == 0x0002D0, "Member 'UFortCosmeticItemCard_C::ImageMaterial_NewItemCard' has a wrong offset!");

}

