#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontEnd_RockyRidgeV2_Final_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FrontEnd_RockyRidgeV2_Final_New.FrontEnd_RockyRidgeV2_Final_New_C
// 0x0160 (0x04F0 - 0x0390)
class UFrontEnd_RockyRidgeV2_Final_New_C final : public UFortUIStateWidget_NightNightBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BGReveal;                                          // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CountdownIntro;                                    // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewSeason;                                         // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToBeContinued4;                                    // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToBeContinued3;                                    // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToBeContinued2;                                    // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToBeContinued1;                                    // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USkewButton_C*                          CloseButton;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_AnimStates;                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow_0;                                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow_1;                                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow_2;                                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow_3;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_103;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BGColor;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fade;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Logo;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_TextLines;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Button_Close;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Countdown_value;                              // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_line1;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_line2;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_line3;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_line4;                                        // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         CurrentTime;                                       // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ToBeContinuedText;                                 // 0x04C8(0x0018)(Edit, BlueprintVisible)
	TArray<class FString>                         TextArray;                                         // 0x04E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__SkewButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BP_OnActivated();
	void Construct();
	void DialogResult_F5CDF2014834DA2289AC4A9C8C219485(EFortDialogResult Result, class FName ResultName);
	void ExecuteUbergraph_FrontEnd_RockyRidgeV2_Final_New(int32 EntryPoint);
	void Finished_009FE66B4A5DE041C9AA728E656E3D34();
	void Finished_24AAB65A42736580C51BD3BB9210CF74();
	void Finished_388F0DBF48A3BD71CA4248816CD1A310();
	void Finished_5FFD204542BF85A654213A9C63D02822();
	void Finished_6D646E07453715C140E19082FCFB49E2();
	void Finished_7A14662040CAA9993EEA69A3B3F098D9();
	void Finished_8824F67B4A44C9BC1A26E3BEF904F050();
	void PreConstruct(bool IsDesignTime);
	void SoundMaybe(int32 Index_0, class USoundBase* Sound);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateCountdown();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FrontEnd_RockyRidgeV2_Final_New_C">();
	}
	static class UFrontEnd_RockyRidgeV2_Final_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFrontEnd_RockyRidgeV2_Final_New_C>();
	}
};
static_assert(alignof(UFrontEnd_RockyRidgeV2_Final_New_C) == 0x000008, "Wrong alignment on UFrontEnd_RockyRidgeV2_Final_New_C");
static_assert(sizeof(UFrontEnd_RockyRidgeV2_Final_New_C) == 0x0004F0, "Wrong size on UFrontEnd_RockyRidgeV2_Final_New_C");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, UberGraphFrame) == 0x000390, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, BGReveal) == 0x000398, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::BGReveal' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, FadeIn) == 0x0003A0, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, CountdownIntro) == 0x0003A8, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::CountdownIntro' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, NewSeason) == 0x0003B0, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::NewSeason' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, ToBeContinued4) == 0x0003B8, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::ToBeContinued4' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, ToBeContinued3) == 0x0003C0, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::ToBeContinued3' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, ToBeContinued2) == 0x0003C8, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::ToBeContinued2' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, ToBeContinued1) == 0x0003D0, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::ToBeContinued1' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, CloseButton) == 0x0003D8, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, CommonWidgetSwitcher_AnimStates) == 0x0003E0, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::CommonWidgetSwitcher_AnimStates' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Glow) == 0x0003E8, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Glow' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Glow_0) == 0x0003F0, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Glow_0' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Glow_1) == 0x0003F8, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Glow_1' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Glow_2) == 0x000400, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Glow_2' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Glow_3) == 0x000408, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Glow_3' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Image) == 0x000410, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Image' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Image_1) == 0x000418, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Image_1' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Image_2) == 0x000420, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Image_2' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Image_3) == 0x000428, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Image_3' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Image_4) == 0x000430, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Image_4' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Image_5) == 0x000438, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Image_5' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Image_6) == 0x000440, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Image_6' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Image_7) == 0x000448, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Image_7' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Image_8) == 0x000450, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Image_8' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Image_103) == 0x000458, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Image_103' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Image_BGColor) == 0x000460, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Image_BGColor' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Image_Fade) == 0x000468, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Image_Fade' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Image_Logo) == 0x000470, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Image_Logo' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Overlay_TextLines) == 0x000478, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Overlay_TextLines' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, RetainerBox_0) == 0x000480, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, SafeZone_0) == 0x000488, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Text_Button_Close) == 0x000490, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Text_Button_Close' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Text_Countdown_value) == 0x000498, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Text_Countdown_value' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Text_line1) == 0x0004A0, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Text_line1' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Text_line2) == 0x0004A8, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Text_line2' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Text_line3) == 0x0004B0, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Text_line3' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, Text_line4) == 0x0004B8, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::Text_line4' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, CurrentTime) == 0x0004C0, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::CurrentTime' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, ToBeContinuedText) == 0x0004C8, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::ToBeContinuedText' has a wrong offset!");
static_assert(offsetof(UFrontEnd_RockyRidgeV2_Final_New_C, TextArray) == 0x0004E0, "Member 'UFrontEnd_RockyRidgeV2_Final_New_C::TextArray' has a wrong offset!");

}

