#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FXSkeletonMeshComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function FXSkeletonMeshComponent.FXSkeletonMeshComponent_C.ApplyBuildingHitEffect
// 0x0008 (0x0008 - 0x0000)
struct FXSkeletonMeshComponent_C_ApplyBuildingHitEffect final
{
public:
	class UMaterialInstanceDynamic*               Effect_MID;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FXSkeletonMeshComponent_C_ApplyBuildingHitEffect) == 0x000008, "Wrong alignment on FXSkeletonMeshComponent_C_ApplyBuildingHitEffect");
static_assert(sizeof(FXSkeletonMeshComponent_C_ApplyBuildingHitEffect) == 0x000008, "Wrong size on FXSkeletonMeshComponent_C_ApplyBuildingHitEffect");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyBuildingHitEffect, Effect_MID) == 0x000000, "Member 'FXSkeletonMeshComponent_C_ApplyBuildingHitEffect::Effect_MID' has a wrong offset!");

// Function FXSkeletonMeshComponent.FXSkeletonMeshComponent_C.ApplyEffect
// 0x0070 (0x0070 - 0x0000)
struct FXSkeletonMeshComponent_C_ApplyEffect final
{
public:
	class UMaterialInterface*                     SourceMaterial;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeInTime;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeOutTime;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Effect_MID;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetMIDForSkeletalMeshComponent_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FXSkeletonMeshComponent_C_ApplyEffect) == 0x000008, "Wrong alignment on FXSkeletonMeshComponent_C_ApplyEffect");
static_assert(sizeof(FXSkeletonMeshComponent_C_ApplyEffect) == 0x000070, "Wrong size on FXSkeletonMeshComponent_C_ApplyEffect");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, SourceMaterial) == 0x000000, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::SourceMaterial' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, FadeInTime) == 0x000008, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::FadeInTime' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, Duration) == 0x00000C, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::Duration' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, FadeOutTime) == 0x000010, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::FadeOutTime' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, Effect_MID) == 0x000018, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::Effect_MID' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000020, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, Temp_int_Variable) == 0x000024, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000028, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, CallFunc_GetMIDForSkeletalMeshComponent_ReturnValue) == 0x000040, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::CallFunc_GetMIDForSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, CallFunc_K2_GetTextureParameterValue_ReturnValue) == 0x000048, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::CallFunc_K2_GetTextureParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, CallFunc_K2_GetTextureParameterValue_ReturnValue_1) == 0x000050, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::CallFunc_K2_GetTextureParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, CallFunc_IsValid_ReturnValue_2) == 0x000059, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, CallFunc_GetNumMaterials_ReturnValue) == 0x00005C, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000060, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, CallFunc_Subtract_IntInt_ReturnValue) == 0x000064, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FXSkeletonMeshComponent_C_ApplyEffect, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000068, "Member 'FXSkeletonMeshComponent_C_ApplyEffect::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

}

