#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AthenaExitVehicle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AthenaExitVehicle.GA_AthenaExitVehicle_C
// 0x0030 (0x0AD8 - 0x0AA8)
class UGA_AthenaExitVehicle_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           Keep_DBNO_players_in_Vehicles;                     // 0x0AB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Event_Damage_Died_Tags;                            // 0x0AB8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_AthenaExitVehicle(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_AthenaExitVehicle_C">();
	}
	static class UGA_AthenaExitVehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AthenaExitVehicle_C>();
	}
};
static_assert(alignof(UGA_AthenaExitVehicle_C) == 0x000008, "Wrong alignment on UGA_AthenaExitVehicle_C");
static_assert(sizeof(UGA_AthenaExitVehicle_C) == 0x000AD8, "Wrong size on UGA_AthenaExitVehicle_C");
static_assert(offsetof(UGA_AthenaExitVehicle_C, UberGraphFrame) == 0x000AA8, "Member 'UGA_AthenaExitVehicle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_AthenaExitVehicle_C, Keep_DBNO_players_in_Vehicles) == 0x000AB0, "Member 'UGA_AthenaExitVehicle_C::Keep_DBNO_players_in_Vehicles' has a wrong offset!");
static_assert(offsetof(UGA_AthenaExitVehicle_C, Event_Damage_Died_Tags) == 0x000AB8, "Member 'UGA_AthenaExitVehicle_C::Event_Damage_Died_Tags' has a wrong offset!");

}

