#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_FallDmgImmune_RemoveFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_FallDmgImmune_RemoveFX.GA_Athena_FallDmgImmune_RemoveFX_C
// 0x0028 (0x0AD0 - 0x0AA8)
class UGA_Athena_FallDmgImmune_RemoveFX_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Looping_GC;                                        // 0x0AB8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Player_Landing_GC;                                 // 0x0AC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           VehicleOnGroundTimer;                              // 0x0AC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_FallDmgImmune_RemoveFX(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnChange_E07DC5494A7BED888E9B24AA514662A5(EMovementMode NewMovementMode);
	void OnChange_FD84FE4040E65CB60551DE8433D51332(EMovementMode NewMovementMode);
	void VehicleLandedCheck();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_FallDmgImmune_RemoveFX_C">();
	}
	static class UGA_Athena_FallDmgImmune_RemoveFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_FallDmgImmune_RemoveFX_C>();
	}
};
static_assert(alignof(UGA_Athena_FallDmgImmune_RemoveFX_C) == 0x000008, "Wrong alignment on UGA_Athena_FallDmgImmune_RemoveFX_C");
static_assert(sizeof(UGA_Athena_FallDmgImmune_RemoveFX_C) == 0x000AD0, "Wrong size on UGA_Athena_FallDmgImmune_RemoveFX_C");
static_assert(offsetof(UGA_Athena_FallDmgImmune_RemoveFX_C, UberGraphFrame) == 0x000AA8, "Member 'UGA_Athena_FallDmgImmune_RemoveFX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FallDmgImmune_RemoveFX_C, PlayerPawn) == 0x000AB0, "Member 'UGA_Athena_FallDmgImmune_RemoveFX_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FallDmgImmune_RemoveFX_C, Looping_GC) == 0x000AB8, "Member 'UGA_Athena_FallDmgImmune_RemoveFX_C::Looping_GC' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FallDmgImmune_RemoveFX_C, Player_Landing_GC) == 0x000AC0, "Member 'UGA_Athena_FallDmgImmune_RemoveFX_C::Player_Landing_GC' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FallDmgImmune_RemoveFX_C, VehicleOnGroundTimer) == 0x000AC8, "Member 'UGA_Athena_FallDmgImmune_RemoveFX_C::VehicleOnGroundTimer' has a wrong offset!");

}

