#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Galileo_Lobster_Block_Break

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Galileo_Lobster_Block_Break.GA_Galileo_Lobster_Block_Break_C.Cancelled_D1B82CD04940A900D0C5A5BEFF3AF323
// 0x0030 (0x0030 - 0x0000)
struct GA_Galileo_Lobster_Block_Break_C_Cancelled_D1B82CD04940A900D0C5A5BEFF3AF323 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Galileo_Lobster_Block_Break_C_Cancelled_D1B82CD04940A900D0C5A5BEFF3AF323) == 0x000008, "Wrong alignment on GA_Galileo_Lobster_Block_Break_C_Cancelled_D1B82CD04940A900D0C5A5BEFF3AF323");
static_assert(sizeof(GA_Galileo_Lobster_Block_Break_C_Cancelled_D1B82CD04940A900D0C5A5BEFF3AF323) == 0x000030, "Wrong size on GA_Galileo_Lobster_Block_Break_C_Cancelled_D1B82CD04940A900D0C5A5BEFF3AF323");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_Cancelled_D1B82CD04940A900D0C5A5BEFF3AF323, TargetData) == 0x000000, "Member 'GA_Galileo_Lobster_Block_Break_C_Cancelled_D1B82CD04940A900D0C5A5BEFF3AF323::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_Cancelled_D1B82CD04940A900D0C5A5BEFF3AF323, ApplicationTag) == 0x000028, "Member 'GA_Galileo_Lobster_Block_Break_C_Cancelled_D1B82CD04940A900D0C5A5BEFF3AF323::ApplicationTag' has a wrong offset!");

// Function GA_Galileo_Lobster_Block_Break.GA_Galileo_Lobster_Block_Break_C.Completed_D1B82CD04940A900D0C5A5BEFF3AF323
// 0x0030 (0x0030 - 0x0000)
struct GA_Galileo_Lobster_Block_Break_C_Completed_D1B82CD04940A900D0C5A5BEFF3AF323 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Galileo_Lobster_Block_Break_C_Completed_D1B82CD04940A900D0C5A5BEFF3AF323) == 0x000008, "Wrong alignment on GA_Galileo_Lobster_Block_Break_C_Completed_D1B82CD04940A900D0C5A5BEFF3AF323");
static_assert(sizeof(GA_Galileo_Lobster_Block_Break_C_Completed_D1B82CD04940A900D0C5A5BEFF3AF323) == 0x000030, "Wrong size on GA_Galileo_Lobster_Block_Break_C_Completed_D1B82CD04940A900D0C5A5BEFF3AF323");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_Completed_D1B82CD04940A900D0C5A5BEFF3AF323, TargetData) == 0x000000, "Member 'GA_Galileo_Lobster_Block_Break_C_Completed_D1B82CD04940A900D0C5A5BEFF3AF323::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_Completed_D1B82CD04940A900D0C5A5BEFF3AF323, ApplicationTag) == 0x000028, "Member 'GA_Galileo_Lobster_Block_Break_C_Completed_D1B82CD04940A900D0C5A5BEFF3AF323::ApplicationTag' has a wrong offset!");

// Function GA_Galileo_Lobster_Block_Break.GA_Galileo_Lobster_Block_Break_C.ExecuteUbergraph_GA_Galileo_Lobster_Block_Break
// 0x0108 (0x0108 - 0x0000)
struct GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0008(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0048(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0088(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x00D0(0x0028)()
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break) == 0x000008, "Wrong alignment on GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break");
static_assert(sizeof(GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break) == 0x000108, "Wrong size on GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break, EntryPoint) == 0x000000, "Member 'GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break, K2Node_CustomEvent_TargetData_2) == 0x000008, "Member 'GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break, K2Node_CustomEvent_ApplicationTag_2) == 0x000030, "Member 'GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break, K2Node_CustomEvent_TargetData_1) == 0x000048, "Member 'GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break, K2Node_CustomEvent_ApplicationTag_1) == 0x000070, "Member 'GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break, K2Node_CreateDelegate_OutputDelegate_1) == 0x000078, "Member 'GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break, K2Node_CustomEvent_TargetData) == 0x000088, "Member 'GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break, K2Node_CustomEvent_ApplicationTag) == 0x0000B0, "Member 'GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B8, "Member 'GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break, Temp_struct_Variable) == 0x0000C8, "Member 'GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break, Temp_struct_Variable_1) == 0x0000D0, "Member 'GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x0000F8, "Member 'GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'GA_Galileo_Lobster_Block_Break_C_ExecuteUbergraph_GA_Galileo_Lobster_Block_Break::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Galileo_Lobster_Block_Break.GA_Galileo_Lobster_Block_Break_C.Triggered_D1B82CD04940A900D0C5A5BEFF3AF323
// 0x0030 (0x0030 - 0x0000)
struct GA_Galileo_Lobster_Block_Break_C_Triggered_D1B82CD04940A900D0C5A5BEFF3AF323 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Galileo_Lobster_Block_Break_C_Triggered_D1B82CD04940A900D0C5A5BEFF3AF323) == 0x000008, "Wrong alignment on GA_Galileo_Lobster_Block_Break_C_Triggered_D1B82CD04940A900D0C5A5BEFF3AF323");
static_assert(sizeof(GA_Galileo_Lobster_Block_Break_C_Triggered_D1B82CD04940A900D0C5A5BEFF3AF323) == 0x000030, "Wrong size on GA_Galileo_Lobster_Block_Break_C_Triggered_D1B82CD04940A900D0C5A5BEFF3AF323");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_Triggered_D1B82CD04940A900D0C5A5BEFF3AF323, TargetData) == 0x000000, "Member 'GA_Galileo_Lobster_Block_Break_C_Triggered_D1B82CD04940A900D0C5A5BEFF3AF323::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Galileo_Lobster_Block_Break_C_Triggered_D1B82CD04940A900D0C5A5BEFF3AF323, ApplicationTag) == 0x000028, "Member 'GA_Galileo_Lobster_Block_Break_C_Triggered_D1B82CD04940A900D0C5A5BEFF3AF323::ApplicationTag' has a wrong offset!");

}

