#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Galileo_Lobster_Melee_Mantis

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_Melee_Mantis_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Galileo_Lobster_Melee_Mantis.GA_Galileo_Lobster_Melee_Mantis_C
// 0x00B0 (0x0C08 - 0x0B58)
class UGA_Galileo_Lobster_Melee_Mantis_C final : public UGA_Melee_Mantis_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Galileo_Lobster_Melee_Mantis_C;  // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           T_MeleeAbility;                                    // 0x0B60(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_GCMeleeClash;                                    // 0x0B68(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          StaggerMelee;                                      // 0x0B70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B71[0x7];                                      // 0x0B71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         EnableStagger;                                     // 0x0B78(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ImpulseXY;                                         // 0x0BA0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ImpulseZ;                                          // 0x0BC8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           T_StaggerEvent;                                    // 0x0BF0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_StaggerEnemy;                                   // 0x0BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        Fort_Player_Pawn;                                  // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Added_257119E44AAC9BD082F95A9F3201447E();
	void BP_OnMantisTechniqueHit(const struct FGameplayAbilityTargetDataHandle& TargetDataHandle, const struct FGameplayTag& ApplicationTag);
	void EventReceived_3D9CCD6F49D4ABCB0E35DB855ADE0B29(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_Galileo_Lobster_Melee_Mantis(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Galileo_Lobster_Melee_Mantis_C">();
	}
	static class UGA_Galileo_Lobster_Melee_Mantis_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Galileo_Lobster_Melee_Mantis_C>();
	}
};
static_assert(alignof(UGA_Galileo_Lobster_Melee_Mantis_C) == 0x000008, "Wrong alignment on UGA_Galileo_Lobster_Melee_Mantis_C");
static_assert(sizeof(UGA_Galileo_Lobster_Melee_Mantis_C) == 0x000C08, "Wrong size on UGA_Galileo_Lobster_Melee_Mantis_C");
static_assert(offsetof(UGA_Galileo_Lobster_Melee_Mantis_C, UberGraphFrame_GA_Galileo_Lobster_Melee_Mantis_C) == 0x000B58, "Member 'UGA_Galileo_Lobster_Melee_Mantis_C::UberGraphFrame_GA_Galileo_Lobster_Melee_Mantis_C' has a wrong offset!");
static_assert(offsetof(UGA_Galileo_Lobster_Melee_Mantis_C, T_MeleeAbility) == 0x000B60, "Member 'UGA_Galileo_Lobster_Melee_Mantis_C::T_MeleeAbility' has a wrong offset!");
static_assert(offsetof(UGA_Galileo_Lobster_Melee_Mantis_C, T_GCMeleeClash) == 0x000B68, "Member 'UGA_Galileo_Lobster_Melee_Mantis_C::T_GCMeleeClash' has a wrong offset!");
static_assert(offsetof(UGA_Galileo_Lobster_Melee_Mantis_C, StaggerMelee) == 0x000B70, "Member 'UGA_Galileo_Lobster_Melee_Mantis_C::StaggerMelee' has a wrong offset!");
static_assert(offsetof(UGA_Galileo_Lobster_Melee_Mantis_C, EnableStagger) == 0x000B78, "Member 'UGA_Galileo_Lobster_Melee_Mantis_C::EnableStagger' has a wrong offset!");
static_assert(offsetof(UGA_Galileo_Lobster_Melee_Mantis_C, ImpulseXY) == 0x000BA0, "Member 'UGA_Galileo_Lobster_Melee_Mantis_C::ImpulseXY' has a wrong offset!");
static_assert(offsetof(UGA_Galileo_Lobster_Melee_Mantis_C, ImpulseZ) == 0x000BC8, "Member 'UGA_Galileo_Lobster_Melee_Mantis_C::ImpulseZ' has a wrong offset!");
static_assert(offsetof(UGA_Galileo_Lobster_Melee_Mantis_C, T_StaggerEvent) == 0x000BF0, "Member 'UGA_Galileo_Lobster_Melee_Mantis_C::T_StaggerEvent' has a wrong offset!");
static_assert(offsetof(UGA_Galileo_Lobster_Melee_Mantis_C, GE_StaggerEnemy) == 0x000BF8, "Member 'UGA_Galileo_Lobster_Melee_Mantis_C::GE_StaggerEnemy' has a wrong offset!");
static_assert(offsetof(UGA_Galileo_Lobster_Melee_Mantis_C, Fort_Player_Pawn) == 0x000C00, "Member 'UGA_Galileo_Lobster_Melee_Mantis_C::Fort_Player_Pawn' has a wrong offset!");

}

