#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Melee_Mantis_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "MantisRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Melee_Mantis_Parent.GA_Melee_Mantis_Parent_C
// 0x0088 (0x0B58 - 0x0AD0)
class UGA_Melee_Mantis_Parent_C : public UFortGameplayAbility_Mantis
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerCharacter;                                   // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanSwingInWater;                                   // 0x0AE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE1[0x7];                                      // 0x0AE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_KnockBackImmunity;                              // 0x0AE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Handle_KnockbackImmunity;                          // 0x0AF0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   SavedCollisionChannel;                             // 0x0AF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdditionalLevels;                                  // 0x0B00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GELevel;                                           // 0x0B04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultLevel;                                      // 0x0B08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RarityUncommon;                                    // 0x0B0C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RarityRare;                                        // 0x0B14(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RarityEpic;                                        // 0x0B1C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RarityLegendary;                                   // 0x0B24(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RarityMythic;                                      // 0x0B2C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B34[0x4];                                      // 0x0B34(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 AimAssistTarget;                                   // 0x0B38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasAimAssistTarget;                                // 0x0B40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B41[0x3];                                      // 0x0B41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeOfLastTarget;                                  // 0x0B44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinDistanceToTarget_0;                             // 0x0B48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinTimeBetweenTargets;                             // 0x0B4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTargetingPreset*                       Targeting_Preset;                                  // 0x0B50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Added_9D0C0593477CDD4D8DCFB8ABA9C68A6D();
	void BP_OnMantisTechniqueHit(const struct FGameplayAbilityTargetDataHandle& TargetDataHandle, const struct FGameplayTag& ApplicationTag);
	void ConfigureRootMotionWarping(class AActor** OutTargetActor, bool* bOutAllowTranslationWarp, bool* bOutAllowRotationWarp, bool* bOutSnapshotTargetLocation);
	void ExecuteUbergraph_GA_Melee_Mantis_Parent(int32 EntryPoint);
	void GetAimAssistTarget();
	void InitAbility(class AFortPlayerPawn** Output_Get);
	bool IsValidTarget(class AActor* Actor);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void SetKnockbackImmunity(bool ImmunityOn);
	void SetPawnCollision(class AFortPawn* Fort_Pawn, bool Collision_On);
	bool Should_Switch_Targets(const TArray<class AActor*>& AllTarget, const class AActor*& CurrentTarget);
	void Targeted_A97B41C34D59B42DF83C0EAAB120D871(const struct FTargetingRequestHandle& TargetingHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Melee_Mantis_Parent_C">();
	}
	static class UGA_Melee_Mantis_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Melee_Mantis_Parent_C>();
	}
};
static_assert(alignof(UGA_Melee_Mantis_Parent_C) == 0x000008, "Wrong alignment on UGA_Melee_Mantis_Parent_C");
static_assert(sizeof(UGA_Melee_Mantis_Parent_C) == 0x000B58, "Wrong size on UGA_Melee_Mantis_Parent_C");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, UberGraphFrame) == 0x000AD0, "Member 'UGA_Melee_Mantis_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, PlayerCharacter) == 0x000AD8, "Member 'UGA_Melee_Mantis_Parent_C::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, CanSwingInWater) == 0x000AE0, "Member 'UGA_Melee_Mantis_Parent_C::CanSwingInWater' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, GE_KnockBackImmunity) == 0x000AE8, "Member 'UGA_Melee_Mantis_Parent_C::GE_KnockBackImmunity' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, Handle_KnockbackImmunity) == 0x000AF0, "Member 'UGA_Melee_Mantis_Parent_C::Handle_KnockbackImmunity' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, SavedCollisionChannel) == 0x000AF8, "Member 'UGA_Melee_Mantis_Parent_C::SavedCollisionChannel' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, AdditionalLevels) == 0x000B00, "Member 'UGA_Melee_Mantis_Parent_C::AdditionalLevels' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, GELevel) == 0x000B04, "Member 'UGA_Melee_Mantis_Parent_C::GELevel' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, DefaultLevel) == 0x000B08, "Member 'UGA_Melee_Mantis_Parent_C::DefaultLevel' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, RarityUncommon) == 0x000B0C, "Member 'UGA_Melee_Mantis_Parent_C::RarityUncommon' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, RarityRare) == 0x000B14, "Member 'UGA_Melee_Mantis_Parent_C::RarityRare' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, RarityEpic) == 0x000B1C, "Member 'UGA_Melee_Mantis_Parent_C::RarityEpic' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, RarityLegendary) == 0x000B24, "Member 'UGA_Melee_Mantis_Parent_C::RarityLegendary' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, RarityMythic) == 0x000B2C, "Member 'UGA_Melee_Mantis_Parent_C::RarityMythic' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, AimAssistTarget) == 0x000B38, "Member 'UGA_Melee_Mantis_Parent_C::AimAssistTarget' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, HasAimAssistTarget) == 0x000B40, "Member 'UGA_Melee_Mantis_Parent_C::HasAimAssistTarget' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, TimeOfLastTarget) == 0x000B44, "Member 'UGA_Melee_Mantis_Parent_C::TimeOfLastTarget' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, MinDistanceToTarget_0) == 0x000B48, "Member 'UGA_Melee_Mantis_Parent_C::MinDistanceToTarget_0' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, MinTimeBetweenTargets) == 0x000B4C, "Member 'UGA_Melee_Mantis_Parent_C::MinTimeBetweenTargets' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Mantis_Parent_C, Targeting_Preset) == 0x000B50, "Member 'UGA_Melee_Mantis_Parent_C::Targeting_Preset' has a wrong offset!");

}

