#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Melee_Mantis_Parent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "TargetingSystem_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Melee_Mantis_Parent.GA_Melee_Mantis_Parent_C.BP_OnMantisTechniqueHit
// 0x0030 (0x0030 - 0x0000)
struct GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetDataHandle;                                  // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit) == 0x000008, "Wrong alignment on GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit");
static_assert(sizeof(GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit) == 0x000030, "Wrong size on GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit, TargetDataHandle) == 0x000000, "Member 'GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit::TargetDataHandle' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit, ApplicationTag) == 0x000028, "Member 'GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit::ApplicationTag' has a wrong offset!");

// Function GA_Melee_Mantis_Parent.GA_Melee_Mantis_Parent_C.ConfigureRootMotionWarping
// 0x0030 (0x0030 - 0x0000)
struct GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping final
{
public:
	class AActor*                                 OutTargetActor;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOutAllowTranslationWarp;                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOutAllowRotationWarp;                             // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOutSnapshotTargetLocation;                        // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidTarget_ReturnValue;                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping) == 0x000008, "Wrong alignment on GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping");
static_assert(sizeof(GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping) == 0x000030, "Wrong size on GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping, OutTargetActor) == 0x000000, "Member 'GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping::OutTargetActor' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping, bOutAllowTranslationWarp) == 0x000008, "Member 'GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping::bOutAllowTranslationWarp' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping, bOutAllowRotationWarp) == 0x000009, "Member 'GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping::bOutAllowRotationWarp' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping, bOutSnapshotTargetLocation) == 0x00000A, "Member 'GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping::bOutSnapshotTargetLocation' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping, CallFunc_IsValidTarget_ReturnValue) == 0x00000B, "Member 'GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping::CallFunc_IsValidTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'GA_Melee_Mantis_Parent_C_ConfigureRootMotionWarping::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function GA_Melee_Mantis_Parent.GA_Melee_Mantis_Parent_C.ExecuteUbergraph_GA_Melee_Mantis_Parent
// 0x0108 (0x0108 - 0x0000)
struct GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTargetingRequestHandle                K2Node_CustomEvent_TargetingHandle;                // 0x0004(0x0004)(NoDestructor)
	struct FTargetingRequestHandle                Temp_struct_Variable;                              // 0x0008(0x0004)(NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetTargetingResultsActors_Targets;        // 0x0010(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidTarget_ReturnValue;                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_Event_TargetDataHandle;                     // 0x0030(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_Event_ApplicationTag;                       // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            CallFunc_GetCurrentSourceWeapon_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class AB_Mantis_Weapon_Parent_C*              K2Node_DynamicCast_AsB_Mantis_Weapon_Parent;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CallFunc_GetCurrentSourceWeapon_ReturnValue_1;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Mantis_Weapon_Parent_C*              K2Node_DynamicCast_AsB_Mantis_Weapon_Parent_1;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_InitAbility_Output_Get;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x00B0(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(const struct FTargetingRequestHandle& TargetingHandle)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue;    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Should_Switch_Targets_ReturnValue;        // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_PerformTargeting*          CallFunc_PerformTargetingRequest_ReturnValue;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent) == 0x000008, "Wrong alignment on GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent");
static_assert(sizeof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent) == 0x000108, "Wrong size on GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, EntryPoint) == 0x000000, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_CustomEvent_TargetingHandle) == 0x000004, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_CustomEvent_TargetingHandle' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, Temp_struct_Variable) == 0x000008, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_GetTargetingResultsActors_Targets) == 0x000010, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_GetTargetingResultsActors_Targets' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_Array_Get_Item) == 0x000020, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_IsValidTarget_ReturnValue) == 0x00002D, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_IsValidTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_Event_TargetDataHandle) == 0x000030, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_Event_TargetDataHandle' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_Event_ApplicationTag) == 0x000058, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_Event_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_GetCurrentSourceWeapon_ReturnValue) == 0x000060, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_GetCurrentSourceWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_DynamicCast_AsB_Mantis_Weapon_Parent) == 0x000078, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_DynamicCast_AsB_Mantis_Weapon_Parent' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_Event_bWasCancelled) == 0x000081, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_GetCurrentSourceWeapon_ReturnValue_1) == 0x000088, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_GetCurrentSourceWeapon_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_DynamicCast_AsB_Mantis_Weapon_Parent_1) == 0x000090, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_DynamicCast_AsB_Mantis_Weapon_Parent_1' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_InitAbility_Output_Get) == 0x0000A0, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_InitAbility_Output_Get' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_FTrunc_ReturnValue) == 0x0000A8, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x0000B0, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C0, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue) == 0x0000D0, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_Should_Switch_Targets_ReturnValue) == 0x0000D8, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_Should_Switch_Targets_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_IsValid_ReturnValue) == 0x0000D9, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000DA, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x0000E0, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_IsValid_ReturnValue_1) == 0x0000E8, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x0000EC, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_IsValid_ReturnValue_2) == 0x0000F0, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_PerformTargetingRequest_ReturnValue) == 0x0000F8, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_PerformTargetingRequest_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_IsValid_ReturnValue_3) == 0x000100, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function GA_Melee_Mantis_Parent.GA_Melee_Mantis_Parent_C.InitAbility
// 0x0030 (0x0030 - 0x0000)
struct GA_Melee_Mantis_Parent_C_InitAbility final
{
public:
	class AFortPlayerPawn*                        Output_Get;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_1; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_2; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_3; // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_4; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Melee_Mantis_Parent_C_InitAbility) == 0x000008, "Wrong alignment on GA_Melee_Mantis_Parent_C_InitAbility");
static_assert(sizeof(GA_Melee_Mantis_Parent_C_InitAbility) == 0x000030, "Wrong size on GA_Melee_Mantis_Parent_C_InitAbility");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_InitAbility, Output_Get) == 0x000000, "Member 'GA_Melee_Mantis_Parent_C_InitAbility::Output_Get' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_InitAbility, CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue) == 0x000008, "Member 'GA_Melee_Mantis_Parent_C_InitAbility::CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_InitAbility, CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_1) == 0x000009, "Member 'GA_Melee_Mantis_Parent_C_InitAbility::CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_InitAbility, CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_2) == 0x00000A, "Member 'GA_Melee_Mantis_Parent_C_InitAbility::CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_InitAbility, CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_3) == 0x00000B, "Member 'GA_Melee_Mantis_Parent_C_InitAbility::CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_InitAbility, CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_4) == 0x00000C, "Member 'GA_Melee_Mantis_Parent_C_InitAbility::CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_InitAbility, CallFunc_GetActivatingPawn_ReturnValue) == 0x000010, "Member 'GA_Melee_Mantis_Parent_C_InitAbility::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_InitAbility, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'GA_Melee_Mantis_Parent_C_InitAbility::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_InitAbility, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000020, "Member 'GA_Melee_Mantis_Parent_C_InitAbility::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_InitAbility, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GA_Melee_Mantis_Parent_C_InitAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Melee_Mantis_Parent.GA_Melee_Mantis_Parent_C.IsValidTarget
// 0x0030 (0x0030 - 0x0000)
struct GA_Melee_Mantis_Parent_C_IsValidTarget final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceBetweenActors_Distance;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Melee_Mantis_Parent_C_IsValidTarget) == 0x000008, "Wrong alignment on GA_Melee_Mantis_Parent_C_IsValidTarget");
static_assert(sizeof(GA_Melee_Mantis_Parent_C_IsValidTarget) == 0x000030, "Wrong size on GA_Melee_Mantis_Parent_C_IsValidTarget");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_IsValidTarget, Actor) == 0x000000, "Member 'GA_Melee_Mantis_Parent_C_IsValidTarget::Actor' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_IsValidTarget, ReturnValue) == 0x000008, "Member 'GA_Melee_Mantis_Parent_C_IsValidTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_IsValidTarget, K2Node_DynamicCast_AsFort_Pawn) == 0x000010, "Member 'GA_Melee_Mantis_Parent_C_IsValidTarget::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_IsValidTarget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_Melee_Mantis_Parent_C_IsValidTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_IsValidTarget, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'GA_Melee_Mantis_Parent_C_IsValidTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_IsValidTarget, CallFunc_IsDead_ReturnValue) == 0x00001A, "Member 'GA_Melee_Mantis_Parent_C_IsValidTarget::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_IsValidTarget, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000020, "Member 'GA_Melee_Mantis_Parent_C_IsValidTarget::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_IsValidTarget, CallFunc_GetDistanceBetweenActors_Distance) == 0x000028, "Member 'GA_Melee_Mantis_Parent_C_IsValidTarget::CallFunc_GetDistanceBetweenActors_Distance' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_IsValidTarget, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00002C, "Member 'GA_Melee_Mantis_Parent_C_IsValidTarget::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function GA_Melee_Mantis_Parent.GA_Melee_Mantis_Parent_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Melee_Mantis_Parent_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Melee_Mantis_Parent_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Melee_Mantis_Parent_C_K2_OnEndAbility");
static_assert(sizeof(GA_Melee_Mantis_Parent_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Melee_Mantis_Parent_C_K2_OnEndAbility");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Melee_Mantis_Parent_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Melee_Mantis_Parent.GA_Melee_Mantis_Parent_C.SetKnockbackImmunity
// 0x0020 (0x0020 - 0x0000)
struct GA_Melee_Mantis_Parent_C_SetKnockbackImmunity final
{
public:
	bool                                          ImmunityOn;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0008(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Melee_Mantis_Parent_C_SetKnockbackImmunity) == 0x000008, "Wrong alignment on GA_Melee_Mantis_Parent_C_SetKnockbackImmunity");
static_assert(sizeof(GA_Melee_Mantis_Parent_C_SetKnockbackImmunity) == 0x000020, "Wrong size on GA_Melee_Mantis_Parent_C_SetKnockbackImmunity");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_SetKnockbackImmunity, ImmunityOn) == 0x000000, "Member 'GA_Melee_Mantis_Parent_C_SetKnockbackImmunity::ImmunityOn' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_SetKnockbackImmunity, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000008, "Member 'GA_Melee_Mantis_Parent_C_SetKnockbackImmunity::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_SetKnockbackImmunity, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000018, "Member 'GA_Melee_Mantis_Parent_C_SetKnockbackImmunity::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");

// Function GA_Melee_Mantis_Parent.GA_Melee_Mantis_Parent_C.SetPawnCollision
// 0x0018 (0x0018 - 0x0000)
struct GA_Melee_Mantis_Parent_C_SetPawnCollision final
{
public:
	class AFortPawn*                              Fort_Pawn;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Collision_On;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue;      // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Melee_Mantis_Parent_C_SetPawnCollision) == 0x000008, "Wrong alignment on GA_Melee_Mantis_Parent_C_SetPawnCollision");
static_assert(sizeof(GA_Melee_Mantis_Parent_C_SetPawnCollision) == 0x000018, "Wrong size on GA_Melee_Mantis_Parent_C_SetPawnCollision");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_SetPawnCollision, Fort_Pawn) == 0x000000, "Member 'GA_Melee_Mantis_Parent_C_SetPawnCollision::Fort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_SetPawnCollision, Collision_On) == 0x000008, "Member 'GA_Melee_Mantis_Parent_C_SetPawnCollision::Collision_On' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_SetPawnCollision, CallFunc_NotEqual_NameName_ReturnValue) == 0x000009, "Member 'GA_Melee_Mantis_Parent_C_SetPawnCollision::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_SetPawnCollision, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'GA_Melee_Mantis_Parent_C_SetPawnCollision::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_SetPawnCollision, CallFunc_GetCollisionProfileName_ReturnValue) == 0x00000C, "Member 'GA_Melee_Mantis_Parent_C_SetPawnCollision::CallFunc_GetCollisionProfileName_ReturnValue' has a wrong offset!");

// Function GA_Melee_Mantis_Parent.GA_Melee_Mantis_Parent_C.Should Switch Targets
// 0x0028 (0x0028 - 0x0000)
struct GA_Melee_Mantis_Parent_C_Should_Switch_Targets final
{
public:
	TArray<class AActor*>                         AllTarget;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class AActor*                           CurrentTarget;                                     // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Melee_Mantis_Parent_C_Should_Switch_Targets) == 0x000008, "Wrong alignment on GA_Melee_Mantis_Parent_C_Should_Switch_Targets");
static_assert(sizeof(GA_Melee_Mantis_Parent_C_Should_Switch_Targets) == 0x000028, "Wrong size on GA_Melee_Mantis_Parent_C_Should_Switch_Targets");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_Should_Switch_Targets, AllTarget) == 0x000000, "Member 'GA_Melee_Mantis_Parent_C_Should_Switch_Targets::AllTarget' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_Should_Switch_Targets, CurrentTarget) == 0x000010, "Member 'GA_Melee_Mantis_Parent_C_Should_Switch_Targets::CurrentTarget' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_Should_Switch_Targets, ReturnValue) == 0x000018, "Member 'GA_Melee_Mantis_Parent_C_Should_Switch_Targets::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_Should_Switch_Targets, CallFunc_Array_Contains_ReturnValue) == 0x000019, "Member 'GA_Melee_Mantis_Parent_C_Should_Switch_Targets::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_Should_Switch_Targets, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00001C, "Member 'GA_Melee_Mantis_Parent_C_Should_Switch_Targets::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_Should_Switch_Targets, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000020, "Member 'GA_Melee_Mantis_Parent_C_Should_Switch_Targets::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_Should_Switch_Targets, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000024, "Member 'GA_Melee_Mantis_Parent_C_Should_Switch_Targets::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function GA_Melee_Mantis_Parent.GA_Melee_Mantis_Parent_C.Targeted_A97B41C34D59B42DF83C0EAAB120D871
// 0x0004 (0x0004 - 0x0000)
struct GA_Melee_Mantis_Parent_C_Targeted_A97B41C34D59B42DF83C0EAAB120D871 final
{
public:
	struct FTargetingRequestHandle                TargetingHandle;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GA_Melee_Mantis_Parent_C_Targeted_A97B41C34D59B42DF83C0EAAB120D871) == 0x000004, "Wrong alignment on GA_Melee_Mantis_Parent_C_Targeted_A97B41C34D59B42DF83C0EAAB120D871");
static_assert(sizeof(GA_Melee_Mantis_Parent_C_Targeted_A97B41C34D59B42DF83C0EAAB120D871) == 0x000004, "Wrong size on GA_Melee_Mantis_Parent_C_Targeted_A97B41C34D59B42DF83C0EAAB120D871");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_Targeted_A97B41C34D59B42DF83C0EAAB120D871, TargetingHandle) == 0x000000, "Member 'GA_Melee_Mantis_Parent_C_Targeted_A97B41C34D59B42DF83C0EAAB120D871::TargetingHandle' has a wrong offset!");

}

