#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Ostrich_LoadSingleRocket

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Ostrich_LoadSingleRocket.GA_Ostrich_LoadSingleRocket_C
// 0x0038 (0x0AE0 - 0x0AA8)
class UGA_Ostrich_LoadSingleRocket_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystem*                        P_BoostFin;                                        // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_Boost_Aftermath_LeftLeg;                         // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_Boost_Aftermath_RightLeg;                        // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_Boost_Aftermath_LeftFoot;                        // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_Boost_Aftermath_RightFoot;                       // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_Boost_Eye;                                       // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Ostrich_LoadSingleRocket(int32 EntryPoint);
	void K2_ActivateAbility();
	void SpawnFX(class AFortCharacterVehicle* Vehicle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Ostrich_LoadSingleRocket_C">();
	}
	static class UGA_Ostrich_LoadSingleRocket_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Ostrich_LoadSingleRocket_C>();
	}
};
static_assert(alignof(UGA_Ostrich_LoadSingleRocket_C) == 0x000008, "Wrong alignment on UGA_Ostrich_LoadSingleRocket_C");
static_assert(sizeof(UGA_Ostrich_LoadSingleRocket_C) == 0x000AE0, "Wrong size on UGA_Ostrich_LoadSingleRocket_C");
static_assert(offsetof(UGA_Ostrich_LoadSingleRocket_C, UberGraphFrame) == 0x000AA8, "Member 'UGA_Ostrich_LoadSingleRocket_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Ostrich_LoadSingleRocket_C, P_BoostFin) == 0x000AB0, "Member 'UGA_Ostrich_LoadSingleRocket_C::P_BoostFin' has a wrong offset!");
static_assert(offsetof(UGA_Ostrich_LoadSingleRocket_C, P_Boost_Aftermath_LeftLeg) == 0x000AB8, "Member 'UGA_Ostrich_LoadSingleRocket_C::P_Boost_Aftermath_LeftLeg' has a wrong offset!");
static_assert(offsetof(UGA_Ostrich_LoadSingleRocket_C, P_Boost_Aftermath_RightLeg) == 0x000AC0, "Member 'UGA_Ostrich_LoadSingleRocket_C::P_Boost_Aftermath_RightLeg' has a wrong offset!");
static_assert(offsetof(UGA_Ostrich_LoadSingleRocket_C, P_Boost_Aftermath_LeftFoot) == 0x000AC8, "Member 'UGA_Ostrich_LoadSingleRocket_C::P_Boost_Aftermath_LeftFoot' has a wrong offset!");
static_assert(offsetof(UGA_Ostrich_LoadSingleRocket_C, P_Boost_Aftermath_RightFoot) == 0x000AD0, "Member 'UGA_Ostrich_LoadSingleRocket_C::P_Boost_Aftermath_RightFoot' has a wrong offset!");
static_assert(offsetof(UGA_Ostrich_LoadSingleRocket_C, P_Boost_Eye) == 0x000AD8, "Member 'UGA_Ostrich_LoadSingleRocket_C::P_Boost_Eye' has a wrong offset!");

}

