#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Vehicle_ExitHoldEvent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Vehicle_ExitHoldEvent.GA_Vehicle_ExitHoldEvent_C
// 0x0018 (0x0AC0 - 0x0AA8)
class UGA_Vehicle_ExitHoldEvent_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EquippingCue;                                      // 0x0AB8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void EventReceived_209BF560404B83EBEAA8DD8090C443AC(const struct FGameplayEventData& Payload);
	void EventReceived_7AE1D485464AEC7EB429C3877D33AF69(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_Vehicle_ExitHoldEvent(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Vehicle_ExitHoldEvent_C">();
	}
	static class UGA_Vehicle_ExitHoldEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Vehicle_ExitHoldEvent_C>();
	}
};
static_assert(alignof(UGA_Vehicle_ExitHoldEvent_C) == 0x000008, "Wrong alignment on UGA_Vehicle_ExitHoldEvent_C");
static_assert(sizeof(UGA_Vehicle_ExitHoldEvent_C) == 0x000AC0, "Wrong size on UGA_Vehicle_ExitHoldEvent_C");
static_assert(offsetof(UGA_Vehicle_ExitHoldEvent_C, UberGraphFrame) == 0x000AA8, "Member 'UGA_Vehicle_ExitHoldEvent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Vehicle_ExitHoldEvent_C, PlayerPawn) == 0x000AB0, "Member 'UGA_Vehicle_ExitHoldEvent_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Vehicle_ExitHoldEvent_C, EquippingCue) == 0x000AB8, "Member 'UGA_Vehicle_ExitHoldEvent_C::EquippingCue' has a wrong offset!");

}

