#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_AthenaDBNORevive

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6
// 0x0030 (0x0030 - 0x0000)
struct GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6) == 0x000008, "Wrong alignment on GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6");
static_assert(sizeof(GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6) == 0x000030, "Wrong size on GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6, TargetData) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6, ApplicationTag) == 0x000028, "Member 'GAB_AthenaDBNORevive_C_Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6::ApplicationTag' has a wrong offset!");

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Cancelled_779E7BAA49FEAD286C5164B83CDFD609
// 0x0030 (0x0030 - 0x0000)
struct GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609) == 0x000008, "Wrong alignment on GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609");
static_assert(sizeof(GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609) == 0x000030, "Wrong size on GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609, TargetData) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609, ApplicationTag) == 0x000028, "Member 'GAB_AthenaDBNORevive_C_Cancelled_779E7BAA49FEAD286C5164B83CDFD609::ApplicationTag' has a wrong offset!");

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Completed_23712DBC45E68EA0C91A4895CBD8B3A6
// 0x0030 (0x0030 - 0x0000)
struct GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6) == 0x000008, "Wrong alignment on GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6");
static_assert(sizeof(GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6) == 0x000030, "Wrong size on GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6, TargetData) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6, ApplicationTag) == 0x000028, "Member 'GAB_AthenaDBNORevive_C_Completed_23712DBC45E68EA0C91A4895CBD8B3A6::ApplicationTag' has a wrong offset!");

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.ExecuteUbergraph_GAB_AthenaDBNORevive
// 0x0448 (0x0448 - 0x0000)
struct GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_Get_DBNO_Outro_Montage_DBNOMontageOutro;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_3;                   // 0x0010(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_3;               // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0050(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0098(0x0028)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x00C0(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0100(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_3;                            // 0x0148(0x0028)()
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayAbilityMontageInfo        K2Node_MakeStruct_FortGameplayAbilityMontageInfo;  // 0x0180(0x0058)()
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x01D8(0x00B0)(ConstParm)
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0298(0x0048)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector_NetQuantize10                  CallFunc_MakeVector_NetQuantize10_ReturnValue;     // 0x0310(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector_NetQuantizeNormal              CallFunc_MakeVector_NetQuantizeNormal_ReturnValue; // 0x0338(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_4;                   // 0x0348(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_4;               // 0x0370(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0378(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0388(0x00C0)(ContainsInstancedReference)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive) == 0x000008, "Wrong alignment on GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive");
static_assert(sizeof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive) == 0x000448, "Wrong size on GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, EntryPoint) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_Get_DBNO_Outro_Montage_DBNOMontageOutro) == 0x000008, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_Get_DBNO_Outro_Montage_DBNOMontageOutro' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_TargetData_3) == 0x000010, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_TargetData_3' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_ApplicationTag_3) == 0x000038, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_ApplicationTag_3' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_TargetData_2) == 0x000050, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_ApplicationTag_2) == 0x000078, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CreateDelegate_OutputDelegate_1) == 0x000080, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, Temp_struct_Variable) == 0x000090, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, Temp_struct_Variable_1) == 0x000098, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_TargetData_1) == 0x0000C0, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_ApplicationTag_1) == 0x0000E8, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000F0, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_TargetData) == 0x000100, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_ApplicationTag) == 0x000128, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CreateDelegate_OutputDelegate_3) == 0x000130, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, Temp_struct_Variable_2) == 0x000140, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, Temp_struct_Variable_3) == 0x000148, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_WaitTargetSelection_ReturnValue) == 0x000170, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_IsValid_ReturnValue) == 0x000178, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_MakeStruct_FortGameplayAbilityMontageInfo) == 0x000180, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_MakeStruct_FortGameplayAbilityMontageInfo' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_Event_EventData) == 0x0001D8, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000288, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_IsValid_ReturnValue_1) == 0x000290, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_GetActorInfo_ReturnValue) == 0x000298, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0002E0, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_DynamicCast_bSuccess) == 0x0002E8, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_GetSocketLocation_ReturnValue) == 0x0002EC, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_BreakVector_X) == 0x0002F8, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_BreakVector_Y) == 0x0002FC, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_BreakVector_Z) == 0x000300, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_GetSocketRotation_ReturnValue) == 0x000304, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_MakeVector_NetQuantize10_ReturnValue) == 0x000310, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_MakeVector_NetQuantize10_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x00031C, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_BreakVector_X_1) == 0x000328, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_BreakVector_Y_1) == 0x00032C, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_BreakVector_Z_1) == 0x000330, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_Event_bWasCancelled) == 0x000334, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_MakeVector_NetQuantizeNormal_ReturnValue) == 0x000338, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_MakeVector_NetQuantizeNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_TargetData_4) == 0x000348, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_TargetData_4' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CustomEvent_ApplicationTag_4) == 0x000370, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CustomEvent_ApplicationTag_4' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, K2Node_CreateDelegate_OutputDelegate_4) == 0x000378, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000388, "Member 'GAB_AthenaDBNORevive_C_ExecuteUbergraph_GAB_AthenaDBNORevive::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Get DBNO Outro Montage
// 0x0010 (0x0010 - 0x0000)
struct GAB_AthenaDBNORevive_C_Get_DBNO_Outro_Montage final
{
public:
	class UAnimMontage*                           DBNOMontageOutro_0;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSurfaceSwimming_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_Get_DBNO_Outro_Montage) == 0x000008, "Wrong alignment on GAB_AthenaDBNORevive_C_Get_DBNO_Outro_Montage");
static_assert(sizeof(GAB_AthenaDBNORevive_C_Get_DBNO_Outro_Montage) == 0x000010, "Wrong size on GAB_AthenaDBNORevive_C_Get_DBNO_Outro_Montage");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Get_DBNO_Outro_Montage, DBNOMontageOutro_0) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_Get_DBNO_Outro_Montage::DBNOMontageOutro_0' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Get_DBNO_Outro_Montage, CallFunc_IsSurfaceSwimming_ReturnValue) == 0x000008, "Member 'GAB_AthenaDBNORevive_C_Get_DBNO_Outro_Montage::CallFunc_IsSurfaceSwimming_ReturnValue' has a wrong offset!");

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GAB_AthenaDBNORevive_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GAB_AthenaDBNORevive_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GAB_AthenaDBNORevive_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GAB_AthenaDBNORevive_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GAB_AthenaDBNORevive_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GAB_AthenaDBNORevive_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GAB_AthenaDBNORevive_C_K2_OnEndAbility");
static_assert(sizeof(GAB_AthenaDBNORevive_C_K2_OnEndAbility) == 0x000001, "Wrong size on GAB_AthenaDBNORevive_C_K2_OnEndAbility");
static_assert(offsetof(GAB_AthenaDBNORevive_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Targeted_779E7BAA49FEAD286C5164B83CDFD609
// 0x0030 (0x0030 - 0x0000)
struct GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609) == 0x000008, "Wrong alignment on GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609");
static_assert(sizeof(GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609) == 0x000030, "Wrong size on GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609, TargetData) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609, ApplicationTag) == 0x000028, "Member 'GAB_AthenaDBNORevive_C_Targeted_779E7BAA49FEAD286C5164B83CDFD609::ApplicationTag' has a wrong offset!");

// Function GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Triggered_23712DBC45E68EA0C91A4895CBD8B3A6
// 0x0030 (0x0030 - 0x0000)
struct GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6) == 0x000008, "Wrong alignment on GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6");
static_assert(sizeof(GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6) == 0x000030, "Wrong size on GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6, TargetData) == 0x000000, "Member 'GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6, ApplicationTag) == 0x000028, "Member 'GAB_AthenaDBNORevive_C_Triggered_23712DBC45E68EA0C91A4895CBD8B3A6::ApplicationTag' has a wrong offset!");

}

