#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_GenericApplyKnockback

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.CalculateImpulseDirection
// 0x00B0 (0x00B0 - 0x0000)
struct GAB_GenericApplyKnockback_C_CalculateImpulseDirection final
{
public:
	class AFortPlayerPawn*                        InPawn;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_1;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection) == 0x000008, "Wrong alignment on GAB_GenericApplyKnockback_C_CalculateImpulseDirection");
static_assert(sizeof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection) == 0x0000B0, "Wrong size on GAB_GenericApplyKnockback_C_CalculateImpulseDirection");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, InPawn) == 0x000000, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::InPawn' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, ReturnValue) == 0x000008, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_GetActivatingPawn_ReturnValue) == 0x000018, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00002C, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x00003C, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_GetActivatingPawn_ReturnValue_1) == 0x000048, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_GetActivatingPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_GetVelocity_ReturnValue) == 0x000050, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00005C, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_BreakVector_X) == 0x000068, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_BreakVector_Y) == 0x00006C, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_BreakVector_Z) == 0x000070, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000074, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_MakeVector_ReturnValue) == 0x000080, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_Normal_ReturnValue) == 0x00008C, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_Normal_ReturnValue_1) == 0x000098, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_VSize_ReturnValue) == 0x0000A4, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CalculateImpulseDirection, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0000A8, "Member 'GAB_GenericApplyKnockback_C_CalculateImpulseDirection::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.CheckForPawnDeath
// 0x0018 (0x0018 - 0x0000)
struct GAB_GenericApplyKnockback_C_CheckForPawnDeath final
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDead;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_GenericApplyKnockback_C_CheckForPawnDeath) == 0x000008, "Wrong alignment on GAB_GenericApplyKnockback_C_CheckForPawnDeath");
static_assert(sizeof(GAB_GenericApplyKnockback_C_CheckForPawnDeath) == 0x000018, "Wrong size on GAB_GenericApplyKnockback_C_CheckForPawnDeath");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CheckForPawnDeath, Pawn) == 0x000000, "Member 'GAB_GenericApplyKnockback_C_CheckForPawnDeath::Pawn' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CheckForPawnDeath, IsDead) == 0x000008, "Member 'GAB_GenericApplyKnockback_C_CheckForPawnDeath::IsDead' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CheckForPawnDeath, CallFunc_GetHealth_ReturnValue) == 0x00000C, "Member 'GAB_GenericApplyKnockback_C_CheckForPawnDeath::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_CheckForPawnDeath, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'GAB_GenericApplyKnockback_C_CheckForPawnDeath::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.DoesUseInstagorInsteadOfImpulseDirection
// 0x0060 (0x0060 - 0x0000)
struct GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection final
{
public:
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                OptionalObject;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           GT_IgnoreImpulseDirection;                         // 0x0024(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayEffect*                        K2Node_DynamicCast_AsGameplay_Effect;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_EffectContextGetSourceObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection) == 0x000008, "Wrong alignment on GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection");
static_assert(sizeof(GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection) == 0x000060, "Wrong size on GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection");
static_assert(offsetof(GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection, EffectContext) == 0x000000, "Member 'GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection::EffectContext' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection, OptionalObject) == 0x000018, "Member 'GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection::OptionalObject' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection, Value) == 0x000020, "Member 'GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection::Value' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection, GT_IgnoreImpulseDirection) == 0x000024, "Member 'GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection::GT_IgnoreImpulseDirection' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection, Temp_bool_Variable) == 0x00002C, "Member 'GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection, K2Node_DynamicCast_AsGameplay_Effect) == 0x000030, "Member 'GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection::K2Node_DynamicCast_AsGameplay_Effect' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection, CallFunc_EffectContextGetSourceObject_ReturnValue) == 0x000040, "Member 'GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection::CallFunc_EffectContextGetSourceObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000048, "Member 'GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection, CallFunc_HasTag_ReturnValue) == 0x000059, "Member 'GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x00005A, "Member 'GAB_GenericApplyKnockback_C_DoesUseInstagorInsteadOfImpulseDirection::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

// Function GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.ExecuteUbergraph_GAB_GenericApplyKnockback
// 0x06A8 (0x06A8 - 0x0000)
struct GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_1;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_2;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_3;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_4;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_5;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit_1;                          // 0x018C(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_CustomEvent_SelfActor;                      // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NormalImpulse;                  // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0244(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromHitResult_ReturnValue; // 0x02E0(0x0028)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0310(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_6;          // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_7;          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0348(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_8;          // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetActivatingAbilityComponent_ReturnValue; // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0374(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x0384(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x0394(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_9;          // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B3[0x1];                                      // 0x03B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x03B4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BD[0x3];                                      // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_10;         // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x03C8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x03D8(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_3; // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F2[0x6];                                      // 0x03F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_4; // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetActivatingAbilityComponent_ReturnValue_1; // 0x0400(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2; // 0x040C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_11;         // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0423(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_3; // 0x0424(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x042C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x043C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x044C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_20;           // 0x045C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_12;         // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x3];                                      // 0x0479(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x047C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0488(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x04A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x04AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x04B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_13;         // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_21;           // 0x04D0(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_14;         // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_Character;                      // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_CustomEvent_PrevMovementMode;               // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_PreviousCustomMode;             // 0x04F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckForPawnDeath_IsDead;                 // 0x04F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x04F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x04F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_15;         // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMovementComp_Character*            K2Node_DynamicCast_AsFort_Movement_Comp_Character; // 0x0510(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0519(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51A[0x6];                                      // 0x051A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_16;         // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0530(0x00B0)(ConstParm)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1[0x3];                                      // 0x05E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetImpulseData_ImpulseDirection;          // 0x05E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetImpulseData_KnockbackMagnitude;        // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetImpulseData_KnockbackZAngle;           // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesUseInstagorInsteadOfImpulseDirection_Value; // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F9[0x3];                                      // 0x05F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0604(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_EffectContextGetInstigatorActor_ReturnValue; // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetPawnFromPlayerStateZone_OutPawn;       // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPawnFromPlayerStateZone_PawnReturned;  // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap;                // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x3];                                      // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CalculateImpulseDirection_ReturnValue;    // 0x0634(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingTrapFloor*                     K2Node_DynamicCast_AsBuilding_Trap_Floor;          // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x3];                                      // 0x0649(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_22;           // 0x064C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_65C[0x4];                                      // 0x065C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetActivatingAbilityComponent_ReturnValue_2; // 0x0660(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue_1; // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_669[0x7];                                      // 0x0669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_17;         // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0678(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_684[0x4];                                      // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0688(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_691[0x3];                                      // 0x0691(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_23;           // 0x0694(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback) == 0x000008, "Wrong alignment on GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback");
static_assert(sizeof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback) == 0x0006A8, "Wrong size on GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, EntryPoint) == 0x000000, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate_4) == 0x000044, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate_5) == 0x000054, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate_6) == 0x000064, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, Temp_bool_Variable) == 0x000074, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate_7) == 0x000078, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000088, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate_8) == 0x000090, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsValid_ReturnValue_1) == 0x0000A1, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsValid_ReturnValue_2) == 0x0000A2, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue) == 0x0000A8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue_1) == 0x0000B0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue_2) == 0x0000C8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000D0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsFalling_ReturnValue) == 0x0000E0, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate_10) == 0x0000E4, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue_3) == 0x0000F8, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue_4) == 0x000100, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue_5) == 0x000108, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000110, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000118, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_Add_VectorVector_ReturnValue) == 0x000124, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsValid_ReturnValue_3) == 0x000130, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x000138, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2) == 0x000140, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsValid_ReturnValue_4) == 0x000148, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_IsValid_ReturnValue_5) == 0x000149, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_BreakVector_X) == 0x00014C, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_BreakVector_Y) == 0x000150, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_BreakVector_Z) == 0x000154, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, K2Node_CreateDelegate_OutputDelegate_11) == 0x000158, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_MakeVector_ReturnValue) == 0x000168, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback, CallFunc_Normal_ReturnValue) == 0x000174, "Member 'GAB_GenericApplyKnockback_C_ExecuteUbergraph_GAB_GenericApplyKnockback::CallFunc_Normal_ReturnValue' has a wrong offset!");
