#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_ThrowPlayer

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GAB_ThrowPlayer.GAB_ThrowPlayer_C.Cancelled_45B7744E4902B26207BAA1954E6BCDEE
// 0x0030 (0x0030 - 0x0000)
struct GAB_ThrowPlayer_C_Cancelled_45B7744E4902B26207BAA1954E6BCDEE final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_ThrowPlayer_C_Cancelled_45B7744E4902B26207BAA1954E6BCDEE) == 0x000008, "Wrong alignment on GAB_ThrowPlayer_C_Cancelled_45B7744E4902B26207BAA1954E6BCDEE");
static_assert(sizeof(GAB_ThrowPlayer_C_Cancelled_45B7744E4902B26207BAA1954E6BCDEE) == 0x000030, "Wrong size on GAB_ThrowPlayer_C_Cancelled_45B7744E4902B26207BAA1954E6BCDEE");
static_assert(offsetof(GAB_ThrowPlayer_C_Cancelled_45B7744E4902B26207BAA1954E6BCDEE, TargetData) == 0x000000, "Member 'GAB_ThrowPlayer_C_Cancelled_45B7744E4902B26207BAA1954E6BCDEE::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_Cancelled_45B7744E4902B26207BAA1954E6BCDEE, ApplicationTag) == 0x000028, "Member 'GAB_ThrowPlayer_C_Cancelled_45B7744E4902B26207BAA1954E6BCDEE::ApplicationTag' has a wrong offset!");

// Function GAB_ThrowPlayer.GAB_ThrowPlayer_C.Completed_45B7744E4902B26207BAA1954E6BCDEE
// 0x0030 (0x0030 - 0x0000)
struct GAB_ThrowPlayer_C_Completed_45B7744E4902B26207BAA1954E6BCDEE final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_ThrowPlayer_C_Completed_45B7744E4902B26207BAA1954E6BCDEE) == 0x000008, "Wrong alignment on GAB_ThrowPlayer_C_Completed_45B7744E4902B26207BAA1954E6BCDEE");
static_assert(sizeof(GAB_ThrowPlayer_C_Completed_45B7744E4902B26207BAA1954E6BCDEE) == 0x000030, "Wrong size on GAB_ThrowPlayer_C_Completed_45B7744E4902B26207BAA1954E6BCDEE");
static_assert(offsetof(GAB_ThrowPlayer_C_Completed_45B7744E4902B26207BAA1954E6BCDEE, TargetData) == 0x000000, "Member 'GAB_ThrowPlayer_C_Completed_45B7744E4902B26207BAA1954E6BCDEE::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_Completed_45B7744E4902B26207BAA1954E6BCDEE, ApplicationTag) == 0x000028, "Member 'GAB_ThrowPlayer_C_Completed_45B7744E4902B26207BAA1954E6BCDEE::ApplicationTag' has a wrong offset!");

// Function GAB_ThrowPlayer.GAB_ThrowPlayer_C.ExecuteUbergraph_GAB_ThrowPlayer
// 0x01A0 (0x01A0 - 0x0000)
struct GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0018(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0048(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0090(0x0028)()
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x00B8(0x0048)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0110(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0138(0x0010)(ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0148(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer) == 0x000008, "Wrong alignment on GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer");
static_assert(sizeof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer) == 0x0001A0, "Wrong size on GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, EntryPoint) == 0x000000, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, K2Node_CustomEvent_TargetData_1) == 0x000018, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, K2Node_CustomEvent_ApplicationTag_1) == 0x000040, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, K2Node_CustomEvent_TargetData) == 0x000048, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, K2Node_CustomEvent_ApplicationTag) == 0x000070, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000078, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, Temp_struct_Variable) == 0x000088, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, Temp_struct_Variable_1) == 0x000090, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, CallFunc_GetActorInfo_ReturnValue) == 0x0000B8, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000100, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, CallFunc_K2_CommitAbility_ReturnValue) == 0x000109, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000110, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000138, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, K2Node_CustomEvent_TargetData_2) == 0x000148, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, K2Node_CustomEvent_ApplicationTag_2) == 0x000170, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, K2Node_CreateDelegate_OutputDelegate_2) == 0x000178, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, K2Node_Event_bWasCancelled) == 0x000188, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000190, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer, CallFunc_IsValid_ReturnValue) == 0x000198, "Member 'GAB_ThrowPlayer_C_ExecuteUbergraph_GAB_ThrowPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GAB_ThrowPlayer.GAB_ThrowPlayer_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GAB_ThrowPlayer_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_ThrowPlayer_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GAB_ThrowPlayer_C_K2_OnEndAbility");
static_assert(sizeof(GAB_ThrowPlayer_C_K2_OnEndAbility) == 0x000001, "Wrong size on GAB_ThrowPlayer_C_K2_OnEndAbility");
static_assert(offsetof(GAB_ThrowPlayer_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GAB_ThrowPlayer_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GAB_ThrowPlayer.GAB_ThrowPlayer_C.Triggered_45B7744E4902B26207BAA1954E6BCDEE
// 0x0030 (0x0030 - 0x0000)
struct GAB_ThrowPlayer_C_Triggered_45B7744E4902B26207BAA1954E6BCDEE final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_ThrowPlayer_C_Triggered_45B7744E4902B26207BAA1954E6BCDEE) == 0x000008, "Wrong alignment on GAB_ThrowPlayer_C_Triggered_45B7744E4902B26207BAA1954E6BCDEE");
static_assert(sizeof(GAB_ThrowPlayer_C_Triggered_45B7744E4902B26207BAA1954E6BCDEE) == 0x000030, "Wrong size on GAB_ThrowPlayer_C_Triggered_45B7744E4902B26207BAA1954E6BCDEE");
static_assert(offsetof(GAB_ThrowPlayer_C_Triggered_45B7744E4902B26207BAA1954E6BCDEE, TargetData) == 0x000000, "Member 'GAB_ThrowPlayer_C_Triggered_45B7744E4902B26207BAA1954E6BCDEE::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_ThrowPlayer_C_Triggered_45B7744E4902B26207BAA1954E6BCDEE, ApplicationTag) == 0x000028, "Member 'GAB_ThrowPlayer_C_Triggered_45B7744E4902B26207BAA1954E6BCDEE::ApplicationTag' has a wrong offset!");

}

