#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_Emote_Generic

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.Cancelled_DE7019AA4E006879EDD264899869FEE2
// 0x0030 (0x0030 - 0x0000)
struct GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2");
static_assert(sizeof(GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2) == 0x000030, "Wrong size on GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2");
static_assert(offsetof(GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2, TargetData) == 0x000000, "Member 'GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2, ApplicationTag) == 0x000028, "Member 'GAB_Emote_Generic_C_Cancelled_DE7019AA4E006879EDD264899869FEE2::ApplicationTag' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.Completed_DE7019AA4E006879EDD264899869FEE2
// 0x0030 (0x0030 - 0x0000)
struct GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2");
static_assert(sizeof(GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2) == 0x000030, "Wrong size on GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2");
static_assert(offsetof(GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2, TargetData) == 0x000000, "Member 'GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2, ApplicationTag) == 0x000028, "Member 'GAB_Emote_Generic_C_Completed_DE7019AA4E006879EDD264899869FEE2::ApplicationTag' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.ExecuteUbergraph_GAB_Emote_Generic
// 0x02A0 (0x02A0 - 0x0000)
struct GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDefaultBlendOutTime_ReturnValue;       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetCurrentSourceObject_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMontageItemDefinitionBase*         K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomBodyType                           CallFunc_GetBodyTypeAndGender_BodyType;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomGender                             CallFunc_GetBodyTypeAndGender_Gender;              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            CallFunc_GetMontageToPlay_ReturnValue;             // 0x0078(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsAssetNull_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_1;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMontagePlaying_Result;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetCurrentSourceObject_ReturnValue_1;     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMontageItemDefinitionBase*         K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base_1; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPersistentName_ReturnValue;            // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0120(0x0028)()
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldHolsterWeapon_ReturnValue;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_PickMontageSection_ReturnValue;           // 0x0154(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_2;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoftObjectPath>                CallFunc_GatherVariantAssets_VariantAssetsNeeded;  // 0x0178(0x0010)(ReferenceParm)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        CallFunc_Array_Get_Item;                           // 0x0190(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue; // 0x01A8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x01F0(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0218(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0230(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0258(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0260(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0270(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0298(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic");
static_assert(sizeof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic) == 0x0002A0, "Wrong size on GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, EntryPoint) == 0x000000, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000020, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetDefaultBlendOutTime_ReturnValue) == 0x00002C, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetDefaultBlendOutTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetCurrentSourceObject_ReturnValue) == 0x000038, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetCurrentSourceObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base) == 0x000040, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CreateDelegate_OutputDelegate_1) == 0x00004C, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, Temp_object_Variable) == 0x000060, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetBodyTypeAndGender_BodyType) == 0x000068, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetBodyTypeAndGender_BodyType' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetBodyTypeAndGender_Gender) == 0x000069, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetBodyTypeAndGender_Gender' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CustomEvent_Loaded) == 0x000070, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetMontageToPlay_ReturnValue) == 0x000078, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetMontageToPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_IsAssetNull_ReturnValue) == 0x0000A0, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_IsAssetNull_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetActivatingPawn_ReturnValue) == 0x0000A8, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, Temp_int_Variable) == 0x0000B0, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_IsValid_ReturnValue_2) == 0x0000B4, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B5, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetActivatingPawn_ReturnValue_1) == 0x0000B8, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetActivatingPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000C0, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, Temp_object_Variable_1) == 0x0000D0, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_AsAnim_Montage) == 0x0000D8, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_bSuccess_2) == 0x0000E0, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_IsMontagePlaying_Result) == 0x0000E1, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_IsMontagePlaying_Result' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetCurrentSourceObject_ReturnValue_1) == 0x0000E8, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetCurrentSourceObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base_1) == 0x0000F0, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_bSuccess_3) == 0x0000F8, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CustomEvent_Loaded_1) == 0x000100, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetPersistentName_ReturnValue) == 0x000108, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetPersistentName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_Conv_StringToName_ReturnValue) == 0x000118, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, Temp_struct_Variable) == 0x000120, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, Temp_struct_Variable_1) == 0x000148, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_ShouldHolsterWeapon_ReturnValue) == 0x000150, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_ShouldHolsterWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_PickMontageSection_ReturnValue) == 0x000154, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_PickMontageSection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GetActivatingPawn_ReturnValue_2) == 0x000160, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GetActivatingPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000168, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_DynamicCast_bSuccess_4) == 0x000170, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_GatherVariantAssets_VariantAssetsNeeded) == 0x000178, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_GatherVariantAssets_VariantAssetsNeeded' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_Subtract_IntInt_ReturnValue) == 0x000188, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_Array_Get_Item) == 0x000190, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue) == 0x0001A8, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_Array_Length_ReturnValue) == 0x0001D0, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_Less_IntInt_ReturnValue) == 0x0001D4, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_Array_Length_ReturnValue_1) == 0x0001D8, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, CallFunc_Conv_IntToBool_ReturnValue) == 0x0001DC, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001E0, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CustomEvent_TargetData) == 0x0001F0, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CustomEvent_ApplicationTag) == 0x000218, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CreateDelegate_OutputDelegate_3) == 0x000220, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CustomEvent_TargetData_1) == 0x000230, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CustomEvent_ApplicationTag_1) == 0x000258, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CreateDelegate_OutputDelegate_4) == 0x000260, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CustomEvent_TargetData_2) == 0x000270, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic, K2Node_CustomEvent_ApplicationTag_2) == 0x000298, "Member 'GAB_Emote_Generic_C_ExecuteUbergraph_GAB_Emote_Generic::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.ForceStopMontage
// 0x0020 (0x0020 - 0x0000)
struct GAB_Emote_Generic_C_ForceStopMontage final
{
public:
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDefaultBlendOutTime_ReturnValue;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_ForceStopMontage) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_ForceStopMontage");
static_assert(sizeof(GAB_Emote_Generic_C_ForceStopMontage) == 0x000020, "Wrong size on GAB_Emote_Generic_C_ForceStopMontage");
static_assert(offsetof(GAB_Emote_Generic_C_ForceStopMontage, CallFunc_GetActivatingPawn_ReturnValue) == 0x000000, "Member 'GAB_Emote_Generic_C_ForceStopMontage::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ForceStopMontage, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'GAB_Emote_Generic_C_ForceStopMontage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ForceStopMontage, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'GAB_Emote_Generic_C_ForceStopMontage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ForceStopMontage, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'GAB_Emote_Generic_C_ForceStopMontage::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ForceStopMontage, CallFunc_GetDefaultBlendOutTime_ReturnValue) == 0x000018, "Member 'GAB_Emote_Generic_C_ForceStopMontage::CallFunc_GetDefaultBlendOutTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ForceStopMontage, CallFunc_IsValid_ReturnValue_2) == 0x00001C, "Member 'GAB_Emote_Generic_C_ForceStopMontage::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.GetBodyTypeAndGender
// 0x0020 (0x0020 - 0x0000)
struct GAB_Emote_Generic_C_GetBodyTypeAndGender final
{
public:
	EFortCustomBodyType                           BodyType;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomGender                             Gender;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomBodyType                           CallFunc_GetCharacterBodyType_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomGender                             CallFunc_GetCharacterGender_ReturnValue;           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_GetBodyTypeAndGender) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_GetBodyTypeAndGender");
static_assert(sizeof(GAB_Emote_Generic_C_GetBodyTypeAndGender) == 0x000020, "Wrong size on GAB_Emote_Generic_C_GetBodyTypeAndGender");
static_assert(offsetof(GAB_Emote_Generic_C_GetBodyTypeAndGender, BodyType) == 0x000000, "Member 'GAB_Emote_Generic_C_GetBodyTypeAndGender::BodyType' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetBodyTypeAndGender, Gender) == 0x000001, "Member 'GAB_Emote_Generic_C_GetBodyTypeAndGender::Gender' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetBodyTypeAndGender, CallFunc_GetActivatingPawn_ReturnValue) == 0x000008, "Member 'GAB_Emote_Generic_C_GetBodyTypeAndGender::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetBodyTypeAndGender, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000010, "Member 'GAB_Emote_Generic_C_GetBodyTypeAndGender::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetBodyTypeAndGender, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GAB_Emote_Generic_C_GetBodyTypeAndGender::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetBodyTypeAndGender, CallFunc_GetCharacterBodyType_ReturnValue) == 0x000019, "Member 'GAB_Emote_Generic_C_GetBodyTypeAndGender::CallFunc_GetCharacterBodyType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetBodyTypeAndGender, CallFunc_GetCharacterGender_ReturnValue) == 0x00001A, "Member 'GAB_Emote_Generic_C_GetBodyTypeAndGender::CallFunc_GetCharacterGender_ReturnValue' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.GetMontageToPlay
// 0x0060 (0x0060 - 0x0000)
struct GAB_Emote_Generic_C_GetMontageToPlay final
{
public:
	class UFortMontageItemDefinitionBase*         EmoteAsset;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomBodyType                           BodyType;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomGender                             Gender;                                            // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            ReturnValue;                                       // 0x0010(0x0028)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            CallFunc_GetAnimation_ReturnValue;                 // 0x0038(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_GetMontageToPlay) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_GetMontageToPlay");
static_assert(sizeof(GAB_Emote_Generic_C_GetMontageToPlay) == 0x000060, "Wrong size on GAB_Emote_Generic_C_GetMontageToPlay");
static_assert(offsetof(GAB_Emote_Generic_C_GetMontageToPlay, EmoteAsset) == 0x000000, "Member 'GAB_Emote_Generic_C_GetMontageToPlay::EmoteAsset' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetMontageToPlay, BodyType) == 0x000008, "Member 'GAB_Emote_Generic_C_GetMontageToPlay::BodyType' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetMontageToPlay, Gender) == 0x000009, "Member 'GAB_Emote_Generic_C_GetMontageToPlay::Gender' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetMontageToPlay, ReturnValue) == 0x000010, "Member 'GAB_Emote_Generic_C_GetMontageToPlay::ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_GetMontageToPlay, CallFunc_GetAnimation_ReturnValue) == 0x000038, "Member 'GAB_Emote_Generic_C_GetMontageToPlay::CallFunc_GetAnimation_ReturnValue' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.IsMontagePlaying
// 0x0020 (0x0020 - 0x0000)
struct GAB_Emote_Generic_C_IsMontagePlaying final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Montage_IsPlaying_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_IsMontagePlaying) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_IsMontagePlaying");
static_assert(sizeof(GAB_Emote_Generic_C_IsMontagePlaying) == 0x000020, "Wrong size on GAB_Emote_Generic_C_IsMontagePlaying");
static_assert(offsetof(GAB_Emote_Generic_C_IsMontagePlaying, Montage) == 0x000000, "Member 'GAB_Emote_Generic_C_IsMontagePlaying::Montage' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_IsMontagePlaying, Result) == 0x000008, "Member 'GAB_Emote_Generic_C_IsMontagePlaying::Result' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_IsMontagePlaying, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'GAB_Emote_Generic_C_IsMontagePlaying::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_IsMontagePlaying, CallFunc_Montage_IsPlaying_ReturnValue) == 0x000018, "Member 'GAB_Emote_Generic_C_IsMontagePlaying::CallFunc_Montage_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_IsMontagePlaying, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'GAB_Emote_Generic_C_IsMontagePlaying::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.K2_OnEndAbility
// 0x0028 (0x0028 - 0x0000)
struct GAB_Emote_Generic_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetCurrentSourceObject_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMontageItemDefinitionBase*         K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_K2_OnEndAbility) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_K2_OnEndAbility");
static_assert(sizeof(GAB_Emote_Generic_C_K2_OnEndAbility) == 0x000028, "Wrong size on GAB_Emote_Generic_C_K2_OnEndAbility");
static_assert(offsetof(GAB_Emote_Generic_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GAB_Emote_Generic_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_OnEndAbility, CallFunc_GetCurrentSourceObject_ReturnValue) == 0x000008, "Member 'GAB_Emote_Generic_C_K2_OnEndAbility::CallFunc_GetCurrentSourceObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_OnEndAbility, K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base) == 0x000010, "Member 'GAB_Emote_Generic_C_K2_OnEndAbility::K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_OnEndAbility, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GAB_Emote_Generic_C_K2_OnEndAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_OnEndAbility, CallFunc_GetActivatingPawn_ReturnValue) == 0x000020, "Member 'GAB_Emote_Generic_C_K2_OnEndAbility::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D
// 0x0008 (0x0008 - 0x0000)
struct GAB_Emote_Generic_C_OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D");
static_assert(sizeof(GAB_Emote_Generic_C_OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D) == 0x000008, "Wrong size on GAB_Emote_Generic_C_OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D");
static_assert(offsetof(GAB_Emote_Generic_C_OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D, Loaded) == 0x000000, "Member 'GAB_Emote_Generic_C_OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D::Loaded' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.OnLoaded_DA96775D40CD998BF2FF0085FE5AB126
// 0x0008 (0x0008 - 0x0000)
struct GAB_Emote_Generic_C_OnLoaded_DA96775D40CD998BF2FF0085FE5AB126 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_OnLoaded_DA96775D40CD998BF2FF0085FE5AB126) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_OnLoaded_DA96775D40CD998BF2FF0085FE5AB126");
static_assert(sizeof(GAB_Emote_Generic_C_OnLoaded_DA96775D40CD998BF2FF0085FE5AB126) == 0x000008, "Wrong size on GAB_Emote_Generic_C_OnLoaded_DA96775D40CD998BF2FF0085FE5AB126");
static_assert(offsetof(GAB_Emote_Generic_C_OnLoaded_DA96775D40CD998BF2FF0085FE5AB126, Loaded) == 0x000000, "Member 'GAB_Emote_Generic_C_OnLoaded_DA96775D40CD998BF2FF0085FE5AB126::Loaded' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.SetReticleVisibility
// 0x0020 (0x0020 - 0x0000)
struct GAB_Emote_Generic_C_SetReticleVisibility final
{
public:
	bool                                          ShouldHide;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerZone*              K2Node_DynamicCast_AsFort_Player_Controller_Zone;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_SetReticleVisibility) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_SetReticleVisibility");
static_assert(sizeof(GAB_Emote_Generic_C_SetReticleVisibility) == 0x000020, "Wrong size on GAB_Emote_Generic_C_SetReticleVisibility");
static_assert(offsetof(GAB_Emote_Generic_C_SetReticleVisibility, ShouldHide) == 0x000000, "Member 'GAB_Emote_Generic_C_SetReticleVisibility::ShouldHide' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_SetReticleVisibility, CallFunc_IsServer_ReturnValue) == 0x000001, "Member 'GAB_Emote_Generic_C_SetReticleVisibility::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_SetReticleVisibility, CallFunc_GetInstigatorController_ReturnValue) == 0x000008, "Member 'GAB_Emote_Generic_C_SetReticleVisibility::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_SetReticleVisibility, K2Node_DynamicCast_AsFort_Player_Controller_Zone) == 0x000010, "Member 'GAB_Emote_Generic_C_SetReticleVisibility::K2Node_DynamicCast_AsFort_Player_Controller_Zone' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_SetReticleVisibility, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GAB_Emote_Generic_C_SetReticleVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.Triggered_DE7019AA4E006879EDD264899869FEE2
// 0x0030 (0x0030 - 0x0000)
struct GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2");
static_assert(sizeof(GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2) == 0x000030, "Wrong size on GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2");
static_assert(offsetof(GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2, TargetData) == 0x000000, "Member 'GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2, ApplicationTag) == 0x000028, "Member 'GAB_Emote_Generic_C_Triggered_DE7019AA4E006879EDD264899869FEE2::ApplicationTag' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.K2_CanActivateAbility
// 0x00C8 (0x00C8 - 0x0000)
struct GAB_Emote_Generic_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0048(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0050(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetSourceObject_BP_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMontageItemDefinitionBase*         K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_CanActivateMontageItem_OutFailureTags;    // 0x00A0(0x0020)()
	bool                                          CallFunc_CanActivateMontageItem_ReturnValue;       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_K2_CanActivateAbility");
static_assert(sizeof(GAB_Emote_Generic_C_K2_CanActivateAbility) == 0x0000C8, "Wrong size on GAB_Emote_Generic_C_K2_CanActivateAbility");
static_assert(offsetof(GAB_Emote_Generic_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GAB_Emote_Generic_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_CanActivateAbility, Handle) == 0x000048, "Member 'GAB_Emote_Generic_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_CanActivateAbility, RelevantTags) == 0x000050, "Member 'GAB_Emote_Generic_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_CanActivateAbility, ReturnValue) == 0x000070, "Member 'GAB_Emote_Generic_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_CanActivateAbility, CallFunc_GetSourceObject_BP_ReturnValue) == 0x000078, "Member 'GAB_Emote_Generic_C_K2_CanActivateAbility::CallFunc_GetSourceObject_BP_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_CanActivateAbility, K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base) == 0x000080, "Member 'GAB_Emote_Generic_C_K2_CanActivateAbility::K2Node_DynamicCast_AsFort_Montage_Item_Definition_Base' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'GAB_Emote_Generic_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_CanActivateAbility, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000090, "Member 'GAB_Emote_Generic_C_K2_CanActivateAbility::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'GAB_Emote_Generic_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_CanActivateAbility, CallFunc_CanActivateMontageItem_OutFailureTags) == 0x0000A0, "Member 'GAB_Emote_Generic_C_K2_CanActivateAbility::CallFunc_CanActivateMontageItem_OutFailureTags' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_K2_CanActivateAbility, CallFunc_CanActivateMontageItem_ReturnValue) == 0x0000C0, "Member 'GAB_Emote_Generic_C_K2_CanActivateAbility::CallFunc_CanActivateMontageItem_ReturnValue' has a wrong offset!");

// Function GAB_Emote_Generic.GAB_Emote_Generic_C.ShouldPlayFailedMontage
// 0x0068 (0x0068 - 0x0000)
struct GAB_Emote_Generic_C_ShouldPlayFailedMontage final
{
public:
	struct FGameplayTagContainer                  FailedReason;                                      // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_ShouldPlayFailedMontage_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0040(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Emote_Generic_C_ShouldPlayFailedMontage) == 0x000008, "Wrong alignment on GAB_Emote_Generic_C_ShouldPlayFailedMontage");
static_assert(sizeof(GAB_Emote_Generic_C_ShouldPlayFailedMontage) == 0x000068, "Wrong size on GAB_Emote_Generic_C_ShouldPlayFailedMontage");
static_assert(offsetof(GAB_Emote_Generic_C_ShouldPlayFailedMontage, FailedReason) == 0x000000, "Member 'GAB_Emote_Generic_C_ShouldPlayFailedMontage::FailedReason' has a wrong offset!");
static_assert(offsetof(GAB_Emote_Generic_C_ShouldPlayFailedMontage, ReturnValue) == 0x000020, "Member 'GAB_Emote_Generic_C_ShouldPlayFailedMontage::ReturnValue' has a wrong offset!");
