#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_AthenaDBNORevive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C
// 0x0038 (0x0AE0 - 0x0AA8)
class UGAB_AthenaDBNORevive_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           EC_AppliedEffect;                                  // 0x0AB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ResurrectCue;                                      // 0x0AC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ResurrectAthenaCue;                                // 0x0AC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           DBNOMontageOutro;                                  // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           DBNOMontageOutroSwimming;                          // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_779E7BAA49FEAD286C5164B83CDFD609(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_23712DBC45E68EA0C91A4895CBD8B3A6(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void ExecuteUbergraph_GAB_AthenaDBNORevive(int32 EntryPoint);
	void Get_DBNO_Outro_Montage(class UAnimMontage** DBNOMontageOutro_0);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void Targeted_779E7BAA49FEAD286C5164B83CDFD609(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Triggered_23712DBC45E68EA0C91A4895CBD8B3A6(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_AthenaDBNORevive_C">();
	}
	static class UGAB_AthenaDBNORevive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_AthenaDBNORevive_C>();
	}
};
static_assert(alignof(UGAB_AthenaDBNORevive_C) == 0x000008, "Wrong alignment on UGAB_AthenaDBNORevive_C");
static_assert(sizeof(UGAB_AthenaDBNORevive_C) == 0x000AE0, "Wrong size on UGAB_AthenaDBNORevive_C");
static_assert(offsetof(UGAB_AthenaDBNORevive_C, UberGraphFrame) == 0x000AA8, "Member 'UGAB_AthenaDBNORevive_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNORevive_C, EC_AppliedEffect) == 0x000AB0, "Member 'UGAB_AthenaDBNORevive_C::EC_AppliedEffect' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNORevive_C, PlayerPawn) == 0x000AB8, "Member 'UGAB_AthenaDBNORevive_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNORevive_C, ResurrectCue) == 0x000AC0, "Member 'UGAB_AthenaDBNORevive_C::ResurrectCue' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNORevive_C, ResurrectAthenaCue) == 0x000AC8, "Member 'UGAB_AthenaDBNORevive_C::ResurrectAthenaCue' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNORevive_C, DBNOMontageOutro) == 0x000AD0, "Member 'UGAB_AthenaDBNORevive_C::DBNOMontageOutro' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNORevive_C, DBNOMontageOutroSwimming) == 0x000AD8, "Member 'UGAB_AthenaDBNORevive_C::DBNOMontageOutroSwimming' has a wrong offset!");

}

