#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_Spray_Generic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GAB_Spray_Generic.GAB_Spray_Generic_C.ExecuteUbergraph_GAB_Spray_Generic
// 0x00F0 (0x00F0 - 0x0000)
struct GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_1;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TargetLineTrace_HitSomething;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_TargetLineTrace_Location;                 // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TargetLineTrace_Normal;                   // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPermissionToEditWorld_ReturnValue;     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SprayDecal_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlaceInstanceOfClass_ReturnValue;      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetCurrentSourceObject_ReturnValue;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSprayItemDefinition*             K2Node_DynamicCast_AsAthena_Spray_Item_Definition; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic) == 0x000010, "Wrong alignment on GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic");
static_assert(sizeof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic) == 0x0000F0, "Wrong size on GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, EntryPoint) == 0x000000, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_GetActivatingPawn_ReturnValue) == 0x000008, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_GetActivatingPawn_ReturnValue_1) == 0x000010, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_GetActivatingPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_GetRightVector_ReturnValue) == 0x00001C, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_TargetLineTrace_HitSomething) == 0x000028, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_TargetLineTrace_HitSomething' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_TargetLineTrace_Location) == 0x00002C, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_TargetLineTrace_Location' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_TargetLineTrace_Normal) == 0x000038, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_TargetLineTrace_Normal' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000044, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_Cross_VectorVector_ReturnValue) == 0x000050, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x00005C, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_GetController_ReturnValue) == 0x000068, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, K2Node_DynamicCast_AsFort_Player_Controller) == 0x0000A0, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000B0, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_HasPermissionToEditWorld_ReturnValue) == 0x0000B8, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_HasPermissionToEditWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000C0, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_CanPlaceInstanceOfClass_ReturnValue) == 0x0000C8, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_CanPlaceInstanceOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_BooleanAND_ReturnValue) == 0x0000C9, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_IsServer_ReturnValue) == 0x0000CA, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, CallFunc_GetCurrentSourceObject_ReturnValue) == 0x0000D0, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::CallFunc_GetCurrentSourceObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, K2Node_DynamicCast_AsAthena_Spray_Item_Definition) == 0x0000D8, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::K2Node_DynamicCast_AsAthena_Spray_Item_Definition' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'GAB_Spray_Generic_C_ExecuteUbergraph_GAB_Spray_Generic::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function GAB_Spray_Generic.GAB_Spray_Generic_C.GetMontageToPlay
// 0x0098 (0x0098 - 0x0000)
struct GAB_Spray_Generic_C_GetMontageToPlay final
{
public:
	class UFortMontageItemDefinitionBase*         EmoteAsset;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomBodyType                           BodyType;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomGender                             Gender;                                            // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            ReturnValue;                                       // 0x0010(0x0028)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	EFortCustomGender                             Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            CallFunc_GetMontageToPlay_ReturnValue;             // 0x0040(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsAssetNull_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            K2Node_Select_Default;                             // 0x0070(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(GAB_Spray_Generic_C_GetMontageToPlay) == 0x000008, "Wrong alignment on GAB_Spray_Generic_C_GetMontageToPlay");
static_assert(sizeof(GAB_Spray_Generic_C_GetMontageToPlay) == 0x000098, "Wrong size on GAB_Spray_Generic_C_GetMontageToPlay");
static_assert(offsetof(GAB_Spray_Generic_C_GetMontageToPlay, EmoteAsset) == 0x000000, "Member 'GAB_Spray_Generic_C_GetMontageToPlay::EmoteAsset' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_GetMontageToPlay, BodyType) == 0x000008, "Member 'GAB_Spray_Generic_C_GetMontageToPlay::BodyType' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_GetMontageToPlay, Gender) == 0x000009, "Member 'GAB_Spray_Generic_C_GetMontageToPlay::Gender' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_GetMontageToPlay, ReturnValue) == 0x000010, "Member 'GAB_Spray_Generic_C_GetMontageToPlay::ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_GetMontageToPlay, Temp_byte_Variable) == 0x000038, "Member 'GAB_Spray_Generic_C_GetMontageToPlay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_GetMontageToPlay, CallFunc_GetMontageToPlay_ReturnValue) == 0x000040, "Member 'GAB_Spray_Generic_C_GetMontageToPlay::CallFunc_GetMontageToPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_GetMontageToPlay, CallFunc_IsAssetNull_ReturnValue) == 0x000068, "Member 'GAB_Spray_Generic_C_GetMontageToPlay::CallFunc_IsAssetNull_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_GetMontageToPlay, K2Node_Select_Default) == 0x000070, "Member 'GAB_Spray_Generic_C_GetMontageToPlay::K2Node_Select_Default' has a wrong offset!");

// Function GAB_Spray_Generic.GAB_Spray_Generic_C.TargetLineTrace
// 0x0220 (0x0220 - 0x0000)
struct GAB_Spray_Generic_C_TargetLineTrace final
{
public:
	class AFortPawn*                              ActivatingPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HitSomething;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Normal;                                            // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBaseAimRotation_ReturnValue;           // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCapsuleComponent*                      K2Node_DynamicCast_AsCapsule_Collision;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00A8(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_147[0x1];                                      // 0x0147(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingGameplayActor*                 K2Node_DynamicCast_AsBuilding_Gameplay_Actor;      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AcceptsEmoteSprays_ReturnValue;           // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_203[0x5];                                      // 0x0203(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x021B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Spray_Generic_C_TargetLineTrace) == 0x000008, "Wrong alignment on GAB_Spray_Generic_C_TargetLineTrace");
static_assert(sizeof(GAB_Spray_Generic_C_TargetLineTrace) == 0x000220, "Wrong size on GAB_Spray_Generic_C_TargetLineTrace");
static_assert(offsetof(GAB_Spray_Generic_C_TargetLineTrace, ActivatingPawn) == 0x000000, "Member 'GAB_Spray_Generic_C_TargetLineTrace::ActivatingPawn' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_TargetLineTrace, HitSomething) == 0x000008, "Member 'GAB_Spray_Generic_C_TargetLineTrace::HitSomething' has a wrong offset!");
static_assert(offsetof(GAB_Spray_Generic_C_TargetLineTrace, Location) == 0x00000C, "Member 'GAB_Spray_Generic_C_TargetLineTrace::Location' has a wrong offset!");
