#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_InterrogatePlayer_Reveal

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.Cancelled_23F3C2DB411862D627ACFCA8233F7B33
// 0x0030 (0x0030 - 0x0000)
struct GAB_InterrogatePlayer_Reveal_C_Cancelled_23F3C2DB411862D627ACFCA8233F7B33 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Reveal_C_Cancelled_23F3C2DB411862D627ACFCA8233F7B33) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Reveal_C_Cancelled_23F3C2DB411862D627ACFCA8233F7B33");
static_assert(sizeof(GAB_InterrogatePlayer_Reveal_C_Cancelled_23F3C2DB411862D627ACFCA8233F7B33) == 0x000030, "Wrong size on GAB_InterrogatePlayer_Reveal_C_Cancelled_23F3C2DB411862D627ACFCA8233F7B33");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_Cancelled_23F3C2DB411862D627ACFCA8233F7B33, TargetData) == 0x000000, "Member 'GAB_InterrogatePlayer_Reveal_C_Cancelled_23F3C2DB411862D627ACFCA8233F7B33::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_Cancelled_23F3C2DB411862D627ACFCA8233F7B33, ApplicationTag) == 0x000028, "Member 'GAB_InterrogatePlayer_Reveal_C_Cancelled_23F3C2DB411862D627ACFCA8233F7B33::ApplicationTag' has a wrong offset!");

// Function GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.Cancelled_3C2C8C224B62B00BDEEAF5AF38A401C1
// 0x0030 (0x0030 - 0x0000)
struct GAB_InterrogatePlayer_Reveal_C_Cancelled_3C2C8C224B62B00BDEEAF5AF38A401C1 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Reveal_C_Cancelled_3C2C8C224B62B00BDEEAF5AF38A401C1) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Reveal_C_Cancelled_3C2C8C224B62B00BDEEAF5AF38A401C1");
static_assert(sizeof(GAB_InterrogatePlayer_Reveal_C_Cancelled_3C2C8C224B62B00BDEEAF5AF38A401C1) == 0x000030, "Wrong size on GAB_InterrogatePlayer_Reveal_C_Cancelled_3C2C8C224B62B00BDEEAF5AF38A401C1");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_Cancelled_3C2C8C224B62B00BDEEAF5AF38A401C1, TargetData) == 0x000000, "Member 'GAB_InterrogatePlayer_Reveal_C_Cancelled_3C2C8C224B62B00BDEEAF5AF38A401C1::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_Cancelled_3C2C8C224B62B00BDEEAF5AF38A401C1, ApplicationTag) == 0x000028, "Member 'GAB_InterrogatePlayer_Reveal_C_Cancelled_3C2C8C224B62B00BDEEAF5AF38A401C1::ApplicationTag' has a wrong offset!");

// Function GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.Completed_23F3C2DB411862D627ACFCA8233F7B33
// 0x0030 (0x0030 - 0x0000)
struct GAB_InterrogatePlayer_Reveal_C_Completed_23F3C2DB411862D627ACFCA8233F7B33 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Reveal_C_Completed_23F3C2DB411862D627ACFCA8233F7B33) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Reveal_C_Completed_23F3C2DB411862D627ACFCA8233F7B33");
static_assert(sizeof(GAB_InterrogatePlayer_Reveal_C_Completed_23F3C2DB411862D627ACFCA8233F7B33) == 0x000030, "Wrong size on GAB_InterrogatePlayer_Reveal_C_Completed_23F3C2DB411862D627ACFCA8233F7B33");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_Completed_23F3C2DB411862D627ACFCA8233F7B33, TargetData) == 0x000000, "Member 'GAB_InterrogatePlayer_Reveal_C_Completed_23F3C2DB411862D627ACFCA8233F7B33::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_Completed_23F3C2DB411862D627ACFCA8233F7B33, ApplicationTag) == 0x000028, "Member 'GAB_InterrogatePlayer_Reveal_C_Completed_23F3C2DB411862D627ACFCA8233F7B33::ApplicationTag' has a wrong offset!");

// Function GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.Completed_3C2C8C224B62B00BDEEAF5AF38A401C1
// 0x0030 (0x0030 - 0x0000)
struct GAB_InterrogatePlayer_Reveal_C_Completed_3C2C8C224B62B00BDEEAF5AF38A401C1 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Reveal_C_Completed_3C2C8C224B62B00BDEEAF5AF38A401C1) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Reveal_C_Completed_3C2C8C224B62B00BDEEAF5AF38A401C1");
static_assert(sizeof(GAB_InterrogatePlayer_Reveal_C_Completed_3C2C8C224B62B00BDEEAF5AF38A401C1) == 0x000030, "Wrong size on GAB_InterrogatePlayer_Reveal_C_Completed_3C2C8C224B62B00BDEEAF5AF38A401C1");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_Completed_3C2C8C224B62B00BDEEAF5AF38A401C1, TargetData) == 0x000000, "Member 'GAB_InterrogatePlayer_Reveal_C_Completed_3C2C8C224B62B00BDEEAF5AF38A401C1::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_Completed_3C2C8C224B62B00BDEEAF5AF38A401C1, ApplicationTag) == 0x000028, "Member 'GAB_InterrogatePlayer_Reveal_C_Completed_3C2C8C224B62B00BDEEAF5AF38A401C1::ApplicationTag' has a wrong offset!");

// Function GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.EndAbilityCleanup
// 0x0001 (0x0001 - 0x0000)
struct GAB_InterrogatePlayer_Reveal_C_EndAbilityCleanup final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Reveal_C_EndAbilityCleanup) == 0x000001, "Wrong alignment on GAB_InterrogatePlayer_Reveal_C_EndAbilityCleanup");
static_assert(sizeof(GAB_InterrogatePlayer_Reveal_C_EndAbilityCleanup) == 0x000001, "Wrong size on GAB_InterrogatePlayer_Reveal_C_EndAbilityCleanup");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_EndAbilityCleanup, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GAB_InterrogatePlayer_Reveal_C_EndAbilityCleanup::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.ExecuteUbergraph_GAB_InterrogatePlayer_Reveal
// 0x0368 (0x0368 - 0x0000)
struct GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_5;                   // 0x0018(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_5;               // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_4;                   // 0x0048(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_4;               // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_3;                   // 0x0088(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_3;               // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x00D0(0x0028)()
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0118(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0148(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0188(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x01B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x01C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_3;                            // 0x01D0(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageWaitTarget_ReturnValue;        // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x021C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x027C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0290(0x00B0)(ConstParm)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0350(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageWaitTarget_ReturnValue_1;      // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal");
static_assert(sizeof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal) == 0x000368, "Wrong size on GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, EntryPoint) == 0x000000, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, CallFunc_WaitDelay_ReturnValue) == 0x000008, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_TargetData_5) == 0x000018, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_TargetData_5' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_ApplicationTag_5) == 0x000040, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_ApplicationTag_5' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_TargetData_4) == 0x000048, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_TargetData_4' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_ApplicationTag_4) == 0x000070, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_ApplicationTag_4' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_TargetData_3) == 0x000088, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_TargetData_3' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_ApplicationTag_3) == 0x0000B0, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_ApplicationTag_3' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B8, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, Temp_struct_Variable) == 0x0000C8, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, Temp_struct_Variable_1) == 0x0000D0, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000F8, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CreateDelegate_OutputDelegate_3) == 0x000108, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_TargetData_2) == 0x000118, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_ApplicationTag_2) == 0x000140, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_TargetData_1) == 0x000148, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_ApplicationTag_1) == 0x000170, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CreateDelegate_OutputDelegate_4) == 0x000178, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_TargetData) == 0x000188, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_ApplicationTag) == 0x0001B0, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001B8, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, Temp_struct_Variable_2) == 0x0001C8, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, Temp_struct_Variable_3) == 0x0001D0, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001F8, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_Event_bWasCancelled) == 0x000208, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, CallFunc_PlayMontageWaitTarget_ReturnValue) == 0x000210, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::CallFunc_PlayMontageWaitTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, CallFunc_IsValid_ReturnValue_1) == 0x000218, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CreateDelegate_OutputDelegate_7) == 0x00021C, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, CallFunc_IsValid_ReturnValue_2) == 0x00022C, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_DamagedActor) == 0x000230, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_Damage) == 0x000238, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_InstigatedBy) == 0x000240, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_DamageCauser) == 0x000248, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_HitLocation) == 0x000250, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_FHitComponent) == 0x000260, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_BoneName) == 0x000268, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CustomEvent_Momentum) == 0x000270, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_CreateDelegate_OutputDelegate_8) == 0x00027C, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_Event_EventData) == 0x000290, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000340, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, K2Node_DynamicCast_bSuccess) == 0x000348, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, CallFunc_IsValid_ReturnValue_3) == 0x000349, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000350, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, CallFunc_PlayMontageWaitTarget_ReturnValue_1) == 0x000358, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::CallFunc_PlayMontageWaitTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal, CallFunc_IsValid_ReturnValue_4) == 0x000360, "Member 'GAB_InterrogatePlayer_Reveal_C_ExecuteUbergraph_GAB_InterrogatePlayer_Reveal::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");

// Function GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.GAB_InterrogatePlayer_Reveal_AutoGenFunc
// 0x0008 (0x0008 - 0x0000)
struct GAB_InterrogatePlayer_Reveal_C_GAB_InterrogatePlayer_Reveal_AutoGenFunc final
{
public:
	class AActor*                                 IndicatedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Reveal_C_GAB_InterrogatePlayer_Reveal_AutoGenFunc) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Reveal_C_GAB_InterrogatePlayer_Reveal_AutoGenFunc");
static_assert(sizeof(GAB_InterrogatePlayer_Reveal_C_GAB_InterrogatePlayer_Reveal_AutoGenFunc) == 0x000008, "Wrong size on GAB_InterrogatePlayer_Reveal_C_GAB_InterrogatePlayer_Reveal_AutoGenFunc");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GAB_InterrogatePlayer_Reveal_AutoGenFunc, IndicatedActor) == 0x000000, "Member 'GAB_InterrogatePlayer_Reveal_C_GAB_InterrogatePlayer_Reveal_AutoGenFunc::IndicatedActor' has a wrong offset!");

// Function GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.GetTeamMembers
// 0x00B8 (0x00B8 - 0x0000)
struct GAB_InterrogatePlayer_Reveal_C_GetTeamMembers final
{
public:
	class APawn*                                  Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIncludeSelf;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerStateAthena*>         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm)
	TArray<class AFortPlayerStateAthena*>         PlayerStates;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 K2Node_DynamicCast_AsFort_Player_State_Athena;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMinigame*                          CallFunc_GetMinigameForPlayerState_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerState*>               CallFunc_GetTeamMembers_OutTeamMembers;            // 0x0060(0x0010)(ReferenceParm)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerState*                       CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerStateAthena*>         CallFunc_GetSquadMemberPlayerStates_ReturnValue;   // 0x0088(0x0010)(ReferenceParm)
	class AFortPlayerStateAthena*                 K2Node_DynamicCast_AsFort_Player_State_Athena_1;   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBattleLabModePlaylist_ReturnValue;      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue; // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Reveal_C_GetTeamMembers");
static_assert(sizeof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers) == 0x0000B8, "Wrong size on GAB_InterrogatePlayer_Reveal_C_GetTeamMembers");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, Target) == 0x000000, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::Target' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, bIncludeSelf) == 0x000008, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::bIncludeSelf' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, ReturnValue) == 0x000010, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, PlayerStates) == 0x000020, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::PlayerStates' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, Temp_int_Array_Index_Variable) == 0x000030, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, K2Node_DynamicCast_AsFort_Player_State_Athena) == 0x000040, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::K2Node_DynamicCast_AsFort_Player_State_Athena' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, CallFunc_GetActorTeam_ReturnValue) == 0x000049, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, CallFunc_GetMinigameForPlayerState_ReturnValue) == 0x000050, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::CallFunc_GetMinigameForPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, CallFunc_GetGameState_ReturnValue) == 0x000058, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, CallFunc_GetTeamMembers_OutTeamMembers) == 0x000060, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::CallFunc_GetTeamMembers_OutTeamMembers' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000070, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, CallFunc_Array_Get_Item) == 0x000080, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, CallFunc_GetSquadMemberPlayerStates_ReturnValue) == 0x000088, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::CallFunc_GetSquadMemberPlayerStates_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, K2Node_DynamicCast_AsFort_Player_State_Athena_1) == 0x000098, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::K2Node_DynamicCast_AsFort_Player_State_Athena_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000A1, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, CallFunc_Array_Add_ReturnValue) == 0x0000A4, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, CallFunc_BooleanOR_ReturnValue) == 0x0000A8, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, CallFunc_IsBattleLabModePlaylist_ReturnValue) == 0x0000A9, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::CallFunc_IsBattleLabModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, CallFunc_Not_PreBool_ReturnValue) == 0x0000AA, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue) == 0x0000AB, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, CallFunc_Array_Length_ReturnValue) == 0x0000AC, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, CallFunc_BooleanAND_ReturnValue) == 0x0000B0, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_GetTeamMembers, CallFunc_Less_IntInt_ReturnValue) == 0x0000B1, "Member 'GAB_InterrogatePlayer_Reveal_C_GetTeamMembers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.InitAbility
// 0x00B0 (0x00B0 - 0x0000)
struct GAB_InterrogatePlayer_Reveal_C_InitAbility final
{
public:
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0008(0x0048)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0060(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0088(0x0010)(ReferenceParm)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Reveal_C_InitAbility) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Reveal_C_InitAbility");
static_assert(sizeof(GAB_InterrogatePlayer_Reveal_C_InitAbility) == 0x0000B0, "Wrong size on GAB_InterrogatePlayer_Reveal_C_InitAbility");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_InitAbility, CallFunc_K2_CommitAbility_ReturnValue) == 0x000000, "Member 'GAB_InterrogatePlayer_Reveal_C_InitAbility::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_InitAbility, CallFunc_GetActorInfo_ReturnValue) == 0x000008, "Member 'GAB_InterrogatePlayer_Reveal_C_InitAbility::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_InitAbility, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000050, "Member 'GAB_InterrogatePlayer_Reveal_C_InitAbility::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_InitAbility, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'GAB_InterrogatePlayer_Reveal_C_InitAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_InitAbility, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000060, "Member 'GAB_InterrogatePlayer_Reveal_C_InitAbility::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_InitAbility, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000088, "Member 'GAB_InterrogatePlayer_Reveal_C_InitAbility::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_InitAbility, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000098, "Member 'GAB_InterrogatePlayer_Reveal_C_InitAbility::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_InitAbility, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x0000A0, "Member 'GAB_InterrogatePlayer_Reveal_C_InitAbility::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_InitAbility, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'GAB_InterrogatePlayer_Reveal_C_InitAbility::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GAB_InterrogatePlayer_Reveal_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GAB_InterrogatePlayer_Reveal_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Reveal_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GAB_InterrogatePlayer_Reveal_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GAB_InterrogatePlayer_Reveal_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GAB_InterrogatePlayer_Reveal_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GAB_InterrogatePlayer_Reveal_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Reveal_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GAB_InterrogatePlayer_Reveal_C_K2_OnEndAbility");
static_assert(sizeof(GAB_InterrogatePlayer_Reveal_C_K2_OnEndAbility) == 0x000001, "Wrong size on GAB_InterrogatePlayer_Reveal_C_K2_OnEndAbility");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GAB_InterrogatePlayer_Reveal_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.OnDied_Event_1
// 0x0050 (0x0050 - 0x0000)
struct GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1 final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1");
static_assert(sizeof(GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1) == 0x000050, "Wrong size on GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1, DamagedActor) == 0x000000, "Member 'GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1::DamagedActor' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1, Damage) == 0x000008, "Member 'GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1::Damage' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1, InstigatedBy) == 0x000010, "Member 'GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1::InstigatedBy' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1, DamageCauser) == 0x000018, "Member 'GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1::DamageCauser' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1, HitLocation) == 0x000020, "Member 'GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1::HitLocation' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1, FHitComponent) == 0x000030, "Member 'GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1::FHitComponent' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1, BoneName) == 0x000038, "Member 'GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1::BoneName' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1, Momentum) == 0x000040, "Member 'GAB_InterrogatePlayer_Reveal_C_OnDied_Event_1::Momentum' has a wrong offset!");

// Function GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.Reveal
// 0x0D98 (0x0D98 - 0x0000)
struct GAB_InterrogatePlayer_Reveal_C_Reveal final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerStateAthena*>         CallFunc_GetTeamMembers_ReturnValue;               // 0x0020(0x0010)(ReferenceParm)
	TArray<class AFortPlayerStateAthena*>         CallFunc_GetTeamMembers_ReturnValue_1;             // 0x0030(0x0010)(ReferenceParm)
	class AFortPlayerStateAthena*                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawnOrVehicleDriver_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
