#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_CarryPlayer

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GAB_CarryPlayer.GAB_CarryPlayer_C.ExecuteUbergraph_GAB_CarryPlayer
// 0x0140 (0x0140 - 0x0000)
struct GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0038(0x0048)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0090(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00B8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11B[0x1];                                      // 0x011B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x011C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer) == 0x000008, "Wrong alignment on GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer");
static_assert(sizeof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer) == 0x000140, "Wrong size on GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, EntryPoint) == 0x000000, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_Event_bWasCancelled) == 0x000034, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_GetActorInfo_ReturnValue) == 0x000038, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000080, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000090, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000B8, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0000D0, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000D8, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_IsValid_ReturnValue_1) == 0x0000E4, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000E8, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_Vector_Distance_ReturnValue) == 0x0000F4, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_Round_ReturnValue) == 0x0000F8, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_Divide_IntInt_ReturnValue) == 0x0000FC, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_IsServer_ReturnValue) == 0x000100, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_IsValid_ReturnValue_2) == 0x000101, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000108, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_GetQuestManager_ReturnValue) == 0x000110, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_IsValid_ReturnValue_3) == 0x000118, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x000119, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x00011A, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_CreateDelegate_OutputDelegate_3) == 0x00011C, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_IsServer_ReturnValue_1) == 0x00012C, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x000130, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000138, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x000139, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x00013A, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x00013B, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_Not_PreBool_ReturnValue) == 0x00013C, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_K2_CommitAbility_ReturnValue) == 0x00013D, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_BooleanAND_ReturnValue) == 0x00013E, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GAB_CarryPlayer.GAB_CarryPlayer_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GAB_CarryPlayer_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_CarryPlayer_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GAB_CarryPlayer_C_K2_OnEndAbility");
static_assert(sizeof(GAB_CarryPlayer_C_K2_OnEndAbility) == 0x000001, "Wrong size on GAB_CarryPlayer_C_K2_OnEndAbility");
static_assert(offsetof(GAB_CarryPlayer_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GAB_CarryPlayer_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

