#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Galileo_LobsterLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x032F (0x0330 - 0x0001)
struct Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_619;                                  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_620;                                  // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_621;                                  // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_622;                                  // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_623;                                  // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_624;                                  // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_625;                                  // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_626;                                  // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_627;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_628;                                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_629;                                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_630;                                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_631;                                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_632;                                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_633;                                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_634;                                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_635;                                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_636;                                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_637;                                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_638;                                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_639;                                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_640;                                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_641;                                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_642;                                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_643;                                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_644;                                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_645;                                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_646;                                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         FloatProperty_647;                                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_648;                                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_649;                                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_650;                                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_651;                                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_652;                                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_653;                                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_654;                                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_655;                                // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BoolProperty_656;                                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_657;                                // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 ArrayProperty_658;                                 // 0x0140(0x0010)()
	class FName                                   NameProperty_659;                                  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_660;                                // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         FloatProperty_661;                                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          StructProperty_662;                                // 0x0164(0x002C)(NoDestructor)
	float                                         FloatProperty_663;                                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_664;                                // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               EnumProperty_665;                                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                ByteProperty_666;                                  // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          ObjectProperty_667;                                // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            ObjectProperty_668;                                // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BoolProperty_669;                                  // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             EnumProperty_670;                                  // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      EnumProperty_671;                                  // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BB[0x5];                                      // 0x01BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ArrayProperty_672;                                 // 0x01C0(0x0010)()
	class FName                                   NameProperty_673;                                  // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_674;                                  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_675;                                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_676;                                  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_677;                                  // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_678;                                  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_679;                                  // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_680;                                  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_681;                                  // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_682;                                  // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_683;                                  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_684;                                  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_685;                                  // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_686;                                  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_687;                                  // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_688;                                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_689;                                  // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_690;                                  // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_691;                                  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   StructProperty_692;                                // 0x0268(0x0020)(NoDestructor)
	class FName                                   NameProperty_693;                                  // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_694;                                  // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0298(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0318(0x0018)()
};
static_assert(alignof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000330, "Wrong size on Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_619) == 0x000004, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_619' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_620) == 0x00000C, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_620' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_621) == 0x000014, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_621' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_622) == 0x00001C, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_622' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_623) == 0x000024, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_623' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_624) == 0x00002C, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_624' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_625) == 0x000034, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_625' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_626) == 0x00003C, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_626' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_627) == 0x000048, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_627' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_628) == 0x000050, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_628' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_629) == 0x000058, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_629' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_630) == 0x000060, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_630' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_631) == 0x000068, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_631' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_632) == 0x000070, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_632' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_633) == 0x000078, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_633' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_634) == 0x000080, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_634' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_635) == 0x000088, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_635' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_636) == 0x000090, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_636' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_637) == 0x000098, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_637' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_638) == 0x0000A0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_638' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_639) == 0x0000A8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_639' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_640) == 0x0000B0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_640' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_641) == 0x0000B8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_641' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_642) == 0x0000C0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_642' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_643) == 0x0000C8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_643' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_644) == 0x0000D0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_644' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_645) == 0x0000D8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_645' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_646) == 0x0000E0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_646' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_647) == 0x0000E8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_647' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_648) == 0x0000F0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_648' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_649) == 0x0000F8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_649' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_650) == 0x000100, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_650' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_651) == 0x000108, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_651' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_652) == 0x000110, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_652' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_653) == 0x000118, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_653' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_654) == 0x000120, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_654' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_655) == 0x000128, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_655' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_656) == 0x000130, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_656' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_657) == 0x000138, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_657' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_658) == 0x000140, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_658' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_659) == 0x000150, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_659' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_660) == 0x000158, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_660' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_661) == 0x000160, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_661' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_662) == 0x000164, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_662' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_663) == 0x000190, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_663' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_664) == 0x000198, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_664' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_665) == 0x0001A0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_665' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ByteProperty_666) == 0x0001A1, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ByteProperty_666' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_667) == 0x0001A8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_667' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_668) == 0x0001B0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_668' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_669) == 0x0001B8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_669' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_670) == 0x0001B9, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_670' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_671) == 0x0001BA, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_671' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_672) == 0x0001C0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_672' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_673) == 0x0001D0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_673' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_674) == 0x0001D8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_674' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_675) == 0x0001E0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_675' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_676) == 0x0001E8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_676' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_677) == 0x0001F0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_677' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_678) == 0x0001F8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_678' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_679) == 0x000200, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_679' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_680) == 0x000208, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_680' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_681) == 0x000210, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_681' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_682) == 0x000218, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_682' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_683) == 0x000220, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_683' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_684) == 0x000228, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_684' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_685) == 0x000230, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_685' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_686) == 0x000238, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_686' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_687) == 0x000240, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_687' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_688) == 0x000248, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_688' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_689) == 0x000250, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_689' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_690) == 0x000258, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_690' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_691) == 0x000260, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_691' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_692) == 0x000268, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_692' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_693) == 0x000288, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_693' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_694) == 0x000290, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_694' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000298, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000318, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x004F (0x0050 - 0x0001)
struct Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty;                                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_0;                                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1;                                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_2;                                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_3;                                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_4;                                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_5;                                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BoolProperty_6;                                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_7;                                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_8;                                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_9;                                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_10;                                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_11;                                   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_12;                                   // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000050, "Wrong size on Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData, ObjectProperty) == 0x000008, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData::ObjectProperty' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData, ObjectProperty_0) == 0x000010, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData::ObjectProperty_0' has a wrong offset!");
