#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Abilities_Death_FadeCapsule_Athena

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Abilities_Death_FadeCapsule_Athena.GC_Abilities_Death_FadeCapsule_Athena_C.ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena
// 0x0118 (0x0118 - 0x0000)
struct GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0028(0x00C0)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena) == 0x000008, "Wrong alignment on GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena");
static_assert(sizeof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena) == 0x000118, "Wrong size on GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena, EntryPoint) == 0x000000, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena, Temp_int_Array_Index_Variable) == 0x000010, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena, K2Node_Event_MyTarget) == 0x000018, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena, K2Node_Event_EventType) == 0x000020, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena, K2Node_Event_Parameters) == 0x000028, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena, K2Node_SwitchEnum_CmpSuccess) == 0x0000E8, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x0000F0, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena, CallFunc_Lerp_ReturnValue) == 0x0000FC, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena, CallFunc_Array_Length_ReturnValue) == 0x000100, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena, CallFunc_Array_Get_Item) == 0x000108, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena, CallFunc_Less_IntInt_ReturnValue) == 0x000110, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_Athena::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GC_Abilities_Death_FadeCapsule_Athena.GC_Abilities_Death_FadeCapsule_Athena_C.K2_HandleGameplayCue
// 0x00D0 (0x00D0 - 0x0000)
struct GC_Abilities_Death_FadeCapsule_Athena_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Abilities_Death_FadeCapsule_Athena_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GC_Abilities_Death_FadeCapsule_Athena_C_K2_HandleGameplayCue");
static_assert(sizeof(GC_Abilities_Death_FadeCapsule_Athena_C_K2_HandleGameplayCue) == 0x0000D0, "Wrong size on GC_Abilities_Death_FadeCapsule_Athena_C_K2_HandleGameplayCue");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

// Function GC_Abilities_Death_FadeCapsule_Athena.GC_Abilities_Death_FadeCapsule_Athena_C.SkeletalMeshSetup
// 0x0040 (0x0040 - 0x0000)
struct GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup final
{
public:
	class AFortPlayerPawnAthena*                  FortPawn;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USkeletalMeshComponent*           Temp_object_Variable;                              // 0x0008(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup) == 0x000008, "Wrong alignment on GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup");
static_assert(sizeof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup) == 0x000040, "Wrong size on GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup, FortPawn) == 0x000000, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup::FortPawn' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup, Temp_object_Variable) == 0x000008, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup, CallFunc_MakeLiteralInt_ReturnValue) == 0x000010, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup, Temp_int_Variable) == 0x000014, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup, Temp_int_Variable_1) == 0x000018, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup, CallFunc_Conv_IntToByte_ReturnValue) == 0x00001C, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup, CallFunc_GetValidValue_ReturnValue) == 0x000024, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000025, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup, CallFunc_Less_IntInt_ReturnValue) == 0x000026, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000027, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000028, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup, CallFunc_GetSkeletalMeshForPartType_ReturnValue) == 0x000030, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup::CallFunc_GetSkeletalMeshForPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup, CallFunc_Array_RemoveItem_ReturnValue) == 0x000038, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup, CallFunc_Array_Add_ReturnValue) == 0x00003C, "Member 'GC_Abilities_Death_FadeCapsule_Athena_C_SkeletalMeshSetup::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

