#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Generic_AdrenalineRush_DirectHeal_Latent

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Generic_AdrenalineRush_DirectHeal_Latent.GC_Generic_AdrenalineRush_DirectHeal_Latent_C
// 0x0088 (0x0890 - 0x0808)
class AGC_Generic_AdrenalineRush_DirectHeal_Latent_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0808(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         HealthSweep_SafetyOpacity_AEAC519D4817261537105281CD9192C7; // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthSweep_Sweep_AEAC519D4817261537105281CD9192C7; // 0x0814(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            HealthSweep__Direction_AEAC519D4817261537105281CD9192C7; // 0x0818(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_819[0x7];                                      // 0x0819(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     HealthSweep;                                       // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       Duplicate_MIDs;                                    // 0x0828(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USkeletalMeshComponent*                 Duplicate_Head;                                    // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Duplicate_Body;                                    // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Duplicate_Hat;                                     // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Duplicate_Backpack;                                // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Duplicate_Charm;                                   // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Duplicate_Face;                                    // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Adrenaline_Rush_Color_Outer_Direct;                // 0x0868(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Adrenaline_Rush_Color_Inner_Direct;                // 0x0878(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Adrenaline_Rush_WPO_Offset;                        // 0x0888(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Duplicate_Meshes(class AFortPlayerPawn* Player_Pawn);
	void ExecuteUbergraph_GC_Generic_AdrenalineRush_DirectHeal_Latent(int32 EntryPoint);
	void HealthSweep__FinishedFunc();
	void HealthSweep__UpdateFunc();
	void K2_HandleGameplayCue(class AActor* MyTarget, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void Set_Adrenaline_Rush_Visibility(bool Visible, class AFortPlayerPawn* Player_Pawn);
	void Toggle_Mesh_Visibility(bool Visibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Generic_AdrenalineRush_DirectHeal_Latent_C">();
	}
	static class AGC_Generic_AdrenalineRush_DirectHeal_Latent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Generic_AdrenalineRush_DirectHeal_Latent_C>();
	}
};
static_assert(alignof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C) == 0x000008, "Wrong alignment on AGC_Generic_AdrenalineRush_DirectHeal_Latent_C");
static_assert(sizeof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C) == 0x000890, "Wrong size on AGC_Generic_AdrenalineRush_DirectHeal_Latent_C");
static_assert(offsetof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C, UberGraphFrame) == 0x000808, "Member 'AGC_Generic_AdrenalineRush_DirectHeal_Latent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C, HealthSweep_SafetyOpacity_AEAC519D4817261537105281CD9192C7) == 0x000810, "Member 'AGC_Generic_AdrenalineRush_DirectHeal_Latent_C::HealthSweep_SafetyOpacity_AEAC519D4817261537105281CD9192C7' has a wrong offset!");
static_assert(offsetof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C, HealthSweep_Sweep_AEAC519D4817261537105281CD9192C7) == 0x000814, "Member 'AGC_Generic_AdrenalineRush_DirectHeal_Latent_C::HealthSweep_Sweep_AEAC519D4817261537105281CD9192C7' has a wrong offset!");
static_assert(offsetof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C, HealthSweep__Direction_AEAC519D4817261537105281CD9192C7) == 0x000818, "Member 'AGC_Generic_AdrenalineRush_DirectHeal_Latent_C::HealthSweep__Direction_AEAC519D4817261537105281CD9192C7' has a wrong offset!");
static_assert(offsetof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C, HealthSweep) == 0x000820, "Member 'AGC_Generic_AdrenalineRush_DirectHeal_Latent_C::HealthSweep' has a wrong offset!");
static_assert(offsetof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C, Duplicate_MIDs) == 0x000828, "Member 'AGC_Generic_AdrenalineRush_DirectHeal_Latent_C::Duplicate_MIDs' has a wrong offset!");
static_assert(offsetof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C, Duplicate_Head) == 0x000838, "Member 'AGC_Generic_AdrenalineRush_DirectHeal_Latent_C::Duplicate_Head' has a wrong offset!");
static_assert(offsetof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C, Duplicate_Body) == 0x000840, "Member 'AGC_Generic_AdrenalineRush_DirectHeal_Latent_C::Duplicate_Body' has a wrong offset!");
static_assert(offsetof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C, Duplicate_Hat) == 0x000848, "Member 'AGC_Generic_AdrenalineRush_DirectHeal_Latent_C::Duplicate_Hat' has a wrong offset!");
static_assert(offsetof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C, Duplicate_Backpack) == 0x000850, "Member 'AGC_Generic_AdrenalineRush_DirectHeal_Latent_C::Duplicate_Backpack' has a wrong offset!");
static_assert(offsetof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C, Duplicate_Charm) == 0x000858, "Member 'AGC_Generic_AdrenalineRush_DirectHeal_Latent_C::Duplicate_Charm' has a wrong offset!");
static_assert(offsetof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C, Duplicate_Face) == 0x000860, "Member 'AGC_Generic_AdrenalineRush_DirectHeal_Latent_C::Duplicate_Face' has a wrong offset!");
static_assert(offsetof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C, Adrenaline_Rush_Color_Outer_Direct) == 0x000868, "Member 'AGC_Generic_AdrenalineRush_DirectHeal_Latent_C::Adrenaline_Rush_Color_Outer_Direct' has a wrong offset!");
static_assert(offsetof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C, Adrenaline_Rush_Color_Inner_Direct) == 0x000878, "Member 'AGC_Generic_AdrenalineRush_DirectHeal_Latent_C::Adrenaline_Rush_Color_Inner_Direct' has a wrong offset!");
static_assert(offsetof(AGC_Generic_AdrenalineRush_DirectHeal_Latent_C, Adrenaline_Rush_WPO_Offset) == 0x000888, "Member 'AGC_Generic_AdrenalineRush_DirectHeal_Latent_C::Adrenaline_Rush_WPO_Offset' has a wrong offset!");

}

