#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCL_Rift_Teleport

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCL_Rift_Teleport.GCL_Rift_Teleport_C.OnRemove
// 0x00D0 (0x00D0 - 0x0000)
struct GCL_Rift_Teleport_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCL_Rift_Teleport_C_OnRemove) == 0x000008, "Wrong alignment on GCL_Rift_Teleport_C_OnRemove");
static_assert(sizeof(GCL_Rift_Teleport_C_OnRemove) == 0x0000D0, "Wrong size on GCL_Rift_Teleport_C_OnRemove");
static_assert(offsetof(GCL_Rift_Teleport_C_OnRemove, MyTarget) == 0x000000, "Member 'GCL_Rift_Teleport_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_OnRemove, Parameters) == 0x000008, "Member 'GCL_Rift_Teleport_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_OnRemove, ReturnValue) == 0x0000C8, "Member 'GCL_Rift_Teleport_C_OnRemove::ReturnValue' has a wrong offset!");

// Function GCL_Rift_Teleport.GCL_Rift_Teleport_C.WhileActive
// 0x0130 (0x0130 - 0x0000)
struct GCL_Rift_Teleport_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICameraLensEffectInterface> CallFunc_SpawnGenericCameraLensEffect_ReturnValue; // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetVehicleUInterface_ReturnValue;         // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshComponent_ReturnValue;     // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDrivingVehicle_ReturnValue;             // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCL_Rift_Teleport_C_WhileActive) == 0x000008, "Wrong alignment on GCL_Rift_Teleport_C_WhileActive");
static_assert(sizeof(GCL_Rift_Teleport_C_WhileActive) == 0x000130, "Wrong size on GCL_Rift_Teleport_C_WhileActive");
static_assert(offsetof(GCL_Rift_Teleport_C_WhileActive, MyTarget) == 0x000000, "Member 'GCL_Rift_Teleport_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_WhileActive, Parameters) == 0x000008, "Member 'GCL_Rift_Teleport_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_WhileActive, ReturnValue) == 0x0000C8, "Member 'GCL_Rift_Teleport_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_WhileActive, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000D0, "Member 'GCL_Rift_Teleport_C_WhileActive::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_WhileActive, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'GCL_Rift_Teleport_C_WhileActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_WhileActive, CallFunc_SpawnGenericCameraLensEffect_ReturnValue) == 0x0000E0, "Member 'GCL_Rift_Teleport_C_WhileActive::CallFunc_SpawnGenericCameraLensEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_WhileActive, CallFunc_GetLocalViewingPlayerController_ReturnValue) == 0x0000F0, "Member 'GCL_Rift_Teleport_C_WhileActive::CallFunc_GetLocalViewingPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_WhileActive, CallFunc_GetVehicleUInterface_ReturnValue) == 0x0000F8, "Member 'GCL_Rift_Teleport_C_WhileActive::CallFunc_GetVehicleUInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_WhileActive, CallFunc_GetSkeletalMeshComponent_ReturnValue) == 0x000108, "Member 'GCL_Rift_Teleport_C_WhileActive::CallFunc_GetSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_WhileActive, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000110, "Member 'GCL_Rift_Teleport_C_WhileActive::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_WhileActive, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000118, "Member 'GCL_Rift_Teleport_C_WhileActive::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_WhileActive, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'GCL_Rift_Teleport_C_WhileActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_WhileActive, CallFunc_IsDrivingVehicle_ReturnValue) == 0x000121, "Member 'GCL_Rift_Teleport_C_WhileActive::CallFunc_IsDrivingVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_WhileActive, CallFunc_SpawnEmitterAttached_ReturnValue_1) == 0x000128, "Member 'GCL_Rift_Teleport_C_WhileActive::CallFunc_SpawnEmitterAttached_ReturnValue_1' has a wrong offset!");

// Function GCL_Rift_Teleport.GCL_Rift_Teleport_C.OnStartParticleSystemSpawned
// 0x00C8 (0x00C8 - 0x0000)
struct GCL_Rift_Teleport_C_OnStartParticleSystemSpawned final
{
public:
	class UParticleSystemComponent*               SpawnedParticleSysComponent;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCL_Rift_Teleport_C_OnStartParticleSystemSpawned) == 0x000008, "Wrong alignment on GCL_Rift_Teleport_C_OnStartParticleSystemSpawned");
static_assert(sizeof(GCL_Rift_Teleport_C_OnStartParticleSystemSpawned) == 0x0000C8, "Wrong size on GCL_Rift_Teleport_C_OnStartParticleSystemSpawned");
static_assert(offsetof(GCL_Rift_Teleport_C_OnStartParticleSystemSpawned, SpawnedParticleSysComponent) == 0x000000, "Member 'GCL_Rift_Teleport_C_OnStartParticleSystemSpawned::SpawnedParticleSysComponent' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_OnStartParticleSystemSpawned, Parameters) == 0x000008, "Member 'GCL_Rift_Teleport_C_OnStartParticleSystemSpawned::Parameters' has a wrong offset!");

// Function GCL_Rift_Teleport.GCL_Rift_Teleport_C.OnWhileActiveParticleSystemDeactivate
// 0x00C8 (0x00C8 - 0x0000)
struct GCL_Rift_Teleport_C_OnWhileActiveParticleSystemDeactivate final
{
public:
	class UParticleSystemComponent*               WhileActiveParticleSysComponent;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCL_Rift_Teleport_C_OnWhileActiveParticleSystemDeactivate) == 0x000008, "Wrong alignment on GCL_Rift_Teleport_C_OnWhileActiveParticleSystemDeactivate");
static_assert(sizeof(GCL_Rift_Teleport_C_OnWhileActiveParticleSystemDeactivate) == 0x0000C8, "Wrong size on GCL_Rift_Teleport_C_OnWhileActiveParticleSystemDeactivate");
static_assert(offsetof(GCL_Rift_Teleport_C_OnWhileActiveParticleSystemDeactivate, WhileActiveParticleSysComponent) == 0x000000, "Member 'GCL_Rift_Teleport_C_OnWhileActiveParticleSystemDeactivate::WhileActiveParticleSysComponent' has a wrong offset!");
static_assert(offsetof(GCL_Rift_Teleport_C_OnWhileActiveParticleSystemDeactivate, Parameters) == 0x000008, "Member 'GCL_Rift_Teleport_C_OnWhileActiveParticleSystemDeactivate::Parameters' has a wrong offset!");

}

