#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCL_BoostJumpPack_Hovering

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCL_BoostJumpPack_Hovering.GCL_BoostJumpPack_Hovering_C
// 0x00C8 (0x09E8 - 0x0920)
class AGCL_BoostJumpPack_Hovering_C final : public AGameplayCueNotify_Jetpack_Hovering
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0920(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bJetpackAudioEnabled;                              // 0x0928(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_929[0x7];                                      // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundOnStart;                                      // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnStop;                                       // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundLoopOnIdle;                                   // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundLoopOnAccel;                                  // 0x0948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundLoopOnOutOfFuel;                              // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnFuelWarning;                                // 0x0958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnOutOfFuel;                                  // 0x0960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnThrust;                                     // 0x0968(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstJump;                                      // 0x0970(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_971[0x7];                                      // 0x0971(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               GroundInteract;                                    // 0x0978(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMeshComponent>  Milo_Check;                                        // 0x0980(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, InstancedReference, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 Milo_Backpack;                                     // 0x09A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector                                Milo_LightScale;                                   // 0x09D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachSocketName;                                  // 0x09DC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCL_BoostJumpPack_Hovering(int32 EntryPoint);
	void K2_HandleGameplayCue(class AActor* MyTarget, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void On_Pawn_Landed(const struct FHitResult& Hit);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void PlayLowFuelWarning();
	void ReceiveDestroyed();
	void ResetFX();
	void SetJetpackAudioEnabled(bool Enabled);
	void TryToPlayGroundEffects();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCL_BoostJumpPack_Hovering_C">();
	}
	static class AGCL_BoostJumpPack_Hovering_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCL_BoostJumpPack_Hovering_C>();
	}
};
static_assert(alignof(AGCL_BoostJumpPack_Hovering_C) == 0x000008, "Wrong alignment on AGCL_BoostJumpPack_Hovering_C");
static_assert(sizeof(AGCL_BoostJumpPack_Hovering_C) == 0x0009E8, "Wrong size on AGCL_BoostJumpPack_Hovering_C");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, UberGraphFrame) == 0x000920, "Member 'AGCL_BoostJumpPack_Hovering_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, bJetpackAudioEnabled) == 0x000928, "Member 'AGCL_BoostJumpPack_Hovering_C::bJetpackAudioEnabled' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SoundOnStart) == 0x000930, "Member 'AGCL_BoostJumpPack_Hovering_C::SoundOnStart' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SoundOnStop) == 0x000938, "Member 'AGCL_BoostJumpPack_Hovering_C::SoundOnStop' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SoundLoopOnIdle) == 0x000940, "Member 'AGCL_BoostJumpPack_Hovering_C::SoundLoopOnIdle' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SoundLoopOnAccel) == 0x000948, "Member 'AGCL_BoostJumpPack_Hovering_C::SoundLoopOnAccel' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SoundLoopOnOutOfFuel) == 0x000950, "Member 'AGCL_BoostJumpPack_Hovering_C::SoundLoopOnOutOfFuel' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SoundOnFuelWarning) == 0x000958, "Member 'AGCL_BoostJumpPack_Hovering_C::SoundOnFuelWarning' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SoundOnOutOfFuel) == 0x000960, "Member 'AGCL_BoostJumpPack_Hovering_C::SoundOnOutOfFuel' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SoundOnThrust) == 0x000968, "Member 'AGCL_BoostJumpPack_Hovering_C::SoundOnThrust' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, bIsFirstJump) == 0x000970, "Member 'AGCL_BoostJumpPack_Hovering_C::bIsFirstJump' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, GroundInteract) == 0x000978, "Member 'AGCL_BoostJumpPack_Hovering_C::GroundInteract' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, Milo_Check) == 0x000980, "Member 'AGCL_BoostJumpPack_Hovering_C::Milo_Check' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, Milo_Backpack) == 0x0009A8, "Member 'AGCL_BoostJumpPack_Hovering_C::Milo_Backpack' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, Milo_LightScale) == 0x0009D0, "Member 'AGCL_BoostJumpPack_Hovering_C::Milo_LightScale' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, AttachSocketName) == 0x0009DC, "Member 'AGCL_BoostJumpPack_Hovering_C::AttachSocketName' has a wrong offset!");

}

