#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_HidingProp_WilliePete_Exit

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_HidingProp_WilliePete_Exit.GCN_Athena_HidingProp_WilliePete_Exit_C.OnBurst
// 0x0278 (0x0278 - 0x0000)
struct GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0108(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0130(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0150(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x01D0(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst) == 0x000008, "Wrong alignment on GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst");
static_assert(sizeof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst) == 0x000278, "Wrong size on GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, ParticleComponents) == 0x0000C8, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, AudioComponents) == 0x0000D8, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, BurstDecalInstance) == 0x0000F0, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000FC, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000100, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000108, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000120, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000128, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000130, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000150, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_Location) == 0x000170, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_Normal) == 0x00017C, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000188, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000190, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000198, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001A0, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001A8, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001AC, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001B0, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001B8, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, Temp_int_Array_Index_Variable) == 0x0001BC, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, Temp_int_Loop_Counter_Variable) == 0x0001C0, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_Array_Get_Item) == 0x0001C8, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0001D0, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_Less_IntInt_ReturnValue) == 0x00026C, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst, CallFunc_Add_IntInt_ReturnValue) == 0x000270, "Member 'GCN_Athena_HidingProp_WilliePete_Exit_C_OnBurst::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

