#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_Interrogation_Reveal_Stencil_Latent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_Interrogation_Reveal_Stencil_Latent.GCN_Athena_Interrogation_Reveal_Stencil_Latent_C.ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent
// 0x0070 (0x0070 - 0x0000)
struct GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent) == 0x000008, "Wrong alignment on GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent");
static_assert(sizeof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent) == 0x000070, "Wrong size on GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent, EntryPoint) == 0x000000, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent, K2Node_Event_EndPlayReason) == 0x000014, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent, CallFunc_MakeColor_ReturnValue) == 0x000018, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000028, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000048, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent, CallFunc_GetValueAtLevel_ReturnValue) == 0x000058, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x00005C, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent, CallFunc_Add_FloatFloat_ReturnValue) == 0x000060, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000068, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");

// Function GCN_Athena_Interrogation_Reveal_Stencil_Latent.GCN_Athena_Interrogation_Reveal_Stencil_Latent_C.OnExecute
// 0x01A8 (0x01A8 - 0x0000)
struct GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x00D8(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x00F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0100(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0120(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18B[0x5];                                      // 0x018B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute) == 0x000008, "Wrong alignment on GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute");
static_assert(sizeof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute) == 0x0001A8, "Wrong size on GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, MyTarget) == 0x000000, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, Parameters) == 0x000008, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, ReturnValue) == 0x0000C8, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000CC, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0000D0, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0000D8, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x0000F0, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0000F8, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000100, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000120, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000140, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x00014C, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000158, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000160, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000168, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000170, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000178, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00017C, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000180, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000188, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x000189, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_IsValid_ReturnValue) == 0x00018A, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000190, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x000198, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00019C, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_OnExecute::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function GCN_Athena_Interrogation_Reveal_Stencil_Latent.GCN_Athena_Interrogation_Reveal_Stencil_Latent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ReceiveEndPlay");
static_assert(sizeof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ReceiveEndPlay) == 0x000001, "Wrong size on GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ReceiveEndPlay");
static_assert(offsetof(GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'GCN_Athena_Interrogation_Reveal_Stencil_Latent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

