#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Tether_Smash

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_Tether_Smash.GCN_Tether_Smash_C.OnBurst
// 0x04A0 (0x04A0 - 0x0000)
struct GCN_Tether_Smash_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00F8(0x0010)(ConstParm, ReferenceParm)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddWorldOffset_SweepHitResult;         // 0x0114(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x01B4(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0278(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x02AC(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34B[0x1];                                      // 0x034B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0354(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0360(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x03BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x03EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x03F8(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0498(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Tether_Smash_C_OnBurst) == 0x000008, "Wrong alignment on GCN_Tether_Smash_C_OnBurst");
static_assert(sizeof(GCN_Tether_Smash_C_OnBurst) == 0x0004A0, "Wrong size on GCN_Tether_Smash_C_OnBurst");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_Tether_Smash_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_Tether_Smash_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, ParticleComponents) == 0x0000C8, "Member 'GCN_Tether_Smash_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, AudioComponents) == 0x0000D8, "Member 'GCN_Tether_Smash_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_Tether_Smash_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, BurstDecalInstance) == 0x0000F0, "Member 'GCN_Tether_Smash_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, Temp_object_Variable) == 0x0000F8, "Member 'GCN_Tether_Smash_C_OnBurst::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_Array_Get_Item) == 0x000108, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_K2_AddWorldOffset_SweepHitResult) == 0x000114, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_K2_AddWorldOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_Greater_IntInt_ReturnValue) == 0x0001B0, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0001B4, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_GetForwardVector_ReturnValue) == 0x000250, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00025C, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000268, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, K2Node_MakeArray_Array) == 0x000278, "Member 'GCN_Tether_Smash_C_OnBurst::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_Add_VectorVector_ReturnValue) == 0x000288, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000294, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0002A0, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0002AC, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000348, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_bBlockingHit) == 0x000349, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_bInitialOverlap) == 0x00034A, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_Time) == 0x00034C, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_Distance) == 0x000350, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_Location) == 0x000354, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_ImpactPoint) == 0x000360, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_Normal) == 0x00036C, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_ImpactNormal) == 0x000378, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_PhysMat) == 0x000388, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_HitActor) == 0x000390, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_HitComponent) == 0x000398, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_HitBoneName) == 0x0003A0, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_BoneName) == 0x0003A8, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_HitItem) == 0x0003B0, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_ElementIndex) == 0x0003B4, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_FaceIndex) == 0x0003B8, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_TraceStart) == 0x0003BC, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_BreakHitResult_TraceEnd) == 0x0003C8, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0003D4, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0003E0, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x0003EC, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x0003F8, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCN_Tether_Smash_C_OnBurst, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000498, "Member 'GCN_Tether_Smash_C_OnBurst::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");

}

