#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Sliding_Oneshot

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_Sliding_Oneshot.GCN_Sliding_Oneshot_C.OnBurstGeneric
// 0x0130 (0x0130 - 0x0000)
struct GCN_Sliding_Oneshot_C_OnBurstGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyViewed_ReturnValue;              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliationForActorToLocalPlayer_ReturnValue; // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterInterface> CallFunc_SetBoolParameter_self_CastInput;          // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterInterface> CallFunc_SetBoolParameter_self_CastInput_1;        // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Sliding_Oneshot_C_OnBurstGeneric) == 0x000008, "Wrong alignment on GCN_Sliding_Oneshot_C_OnBurstGeneric");
static_assert(sizeof(GCN_Sliding_Oneshot_C_OnBurstGeneric) == 0x000130, "Wrong size on GCN_Sliding_Oneshot_C_OnBurstGeneric");
static_assert(offsetof(GCN_Sliding_Oneshot_C_OnBurstGeneric, MyTarget) == 0x000000, "Member 'GCN_Sliding_Oneshot_C_OnBurstGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Sliding_Oneshot_C_OnBurstGeneric, Parameters) == 0x000008, "Member 'GCN_Sliding_Oneshot_C_OnBurstGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Sliding_Oneshot_C_OnBurstGeneric, ParticleComponents) == 0x0000C8, "Member 'GCN_Sliding_Oneshot_C_OnBurstGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Sliding_Oneshot_C_OnBurstGeneric, AudioComponents) == 0x0000D8, "Member 'GCN_Sliding_Oneshot_C_OnBurstGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Sliding_Oneshot_C_OnBurstGeneric, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_Sliding_Oneshot_C_OnBurstGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Sliding_Oneshot_C_OnBurstGeneric, BurstDecalInstance) == 0x0000F0, "Member 'GCN_Sliding_Oneshot_C_OnBurstGeneric::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Sliding_Oneshot_C_OnBurstGeneric, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'GCN_Sliding_Oneshot_C_OnBurstGeneric::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Sliding_Oneshot_C_OnBurstGeneric, K2Node_DynamicCast_AsFort_Pawn) == 0x000100, "Member 'GCN_Sliding_Oneshot_C_OnBurstGeneric::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GCN_Sliding_Oneshot_C_OnBurstGeneric, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GCN_Sliding_Oneshot_C_OnBurstGeneric::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Sliding_Oneshot_C_OnBurstGeneric, CallFunc_IsLocallyViewed_ReturnValue) == 0x000109, "Member 'GCN_Sliding_Oneshot_C_OnBurstGeneric::CallFunc_IsLocallyViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Sliding_Oneshot_C_OnBurstGeneric, CallFunc_GetTeamAffiliationForActorToLocalPlayer_ReturnValue) == 0x00010A, "Member 'GCN_Sliding_Oneshot_C_OnBurstGeneric::CallFunc_GetTeamAffiliationForActorToLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Sliding_Oneshot_C_OnBurstGeneric, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00010B, "Member 'GCN_Sliding_Oneshot_C_OnBurstGeneric::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Sliding_Oneshot_C_OnBurstGeneric, CallFunc_SetBoolParameter_self_CastInput) == 0x000110, "Member 'GCN_Sliding_Oneshot_C_OnBurstGeneric::CallFunc_SetBoolParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(GCN_Sliding_Oneshot_C_OnBurstGeneric, CallFunc_SetBoolParameter_self_CastInput_1) == 0x000120, "Member 'GCN_Sliding_Oneshot_C_OnBurstGeneric::CallFunc_SetBoolParameter_self_CastInput_1' has a wrong offset!");

}

