#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Galileo_Lobster_Attack4_Impact

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_Galileo_Lobster_Attack4_Impact.GCN_Galileo_Lobster_Attack4_Impact_C.OnBurst
// 0x0508 (0x0508 - 0x0000)
struct GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x00F8(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_1;     // 0x01B4(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0270(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0280(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32E[0x2];                                      // 0x032E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0344(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0350(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x035C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x039C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x03A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x03B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AB_Athena_Galileo_Lobster_Parent_C*     K2Node_DynamicCast_AsB_Athena_Galileo_Lobster_Parent; // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x03CC(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0468(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst) == 0x000008, "Wrong alignment on GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst");
static_assert(sizeof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst) == 0x000508, "Wrong size on GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, ParticleComponents) == 0x0000C8, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, AudioComponents) == 0x0000D8, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, BurstDecalInstance) == 0x0000F0, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x0000F8, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000194, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_Add_VectorVector_ReturnValue) == 0x0001A8, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_K2_AddLocalRotation_SweepHitResult_1) == 0x0001B4, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_K2_AddLocalRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000250, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000260, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x000268, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, Temp_object_Variable) == 0x000270, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_LineTraceSingle_OutHit) == 0x000280, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_LineTraceSingle_ReturnValue) == 0x00031C, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_GetSocketLocation_ReturnValue) == 0x000320, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_bBlockingHit) == 0x00032C, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_bInitialOverlap) == 0x00032D, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_Time) == 0x000330, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_Distance) == 0x000334, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_Location) == 0x000338, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_ImpactPoint) == 0x000344, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_Normal) == 0x000350, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_ImpactNormal) == 0x00035C, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_PhysMat) == 0x000368, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_HitActor) == 0x000370, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_HitComponent) == 0x000378, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_HitBoneName) == 0x000380, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_BoneName) == 0x000388, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_HitItem) == 0x000390, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_ElementIndex) == 0x000394, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_FaceIndex) == 0x000398, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_TraceStart) == 0x00039C, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_BreakHitResult_TraceEnd) == 0x0003A8, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_FindLookAtRotation_ReturnValue) == 0x0003B4, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, K2Node_DynamicCast_AsB_Athena_Galileo_Lobster_Parent) == 0x0003C0, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::K2Node_DynamicCast_AsB_Athena_Galileo_Lobster_Parent' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, K2Node_DynamicCast_bSuccess_1) == 0x0003C8, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x0003CC, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000468, "Member 'GCN_Galileo_Lobster_Attack4_Impact_C_OnBurst::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

}

