#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_OutsideSafeZoneDamage

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_OutsideSafeZoneDamage.GCN_Athena_OutsideSafeZoneDamage_C.ExecuteUbergraph_GCN_Athena_OutsideSafeZoneDamage
// 0x0004 (0x0004 - 0x0000)
struct GCN_Athena_OutsideSafeZoneDamage_C_ExecuteUbergraph_GCN_Athena_OutsideSafeZoneDamage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_OutsideSafeZoneDamage_C_ExecuteUbergraph_GCN_Athena_OutsideSafeZoneDamage) == 0x000004, "Wrong alignment on GCN_Athena_OutsideSafeZoneDamage_C_ExecuteUbergraph_GCN_Athena_OutsideSafeZoneDamage");
static_assert(sizeof(GCN_Athena_OutsideSafeZoneDamage_C_ExecuteUbergraph_GCN_Athena_OutsideSafeZoneDamage) == 0x000004, "Wrong size on GCN_Athena_OutsideSafeZoneDamage_C_ExecuteUbergraph_GCN_Athena_OutsideSafeZoneDamage");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_ExecuteUbergraph_GCN_Athena_OutsideSafeZoneDamage, EntryPoint) == 0x000000, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_ExecuteUbergraph_GCN_Athena_OutsideSafeZoneDamage::EntryPoint' has a wrong offset!");

// Function GCN_Athena_OutsideSafeZoneDamage.GCN_Athena_OutsideSafeZoneDamage_C.OnBurst
// 0x01E0 (0x01E0 - 0x0000)
struct GCN_Athena_OutsideSafeZoneDamage_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0108(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0130(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0150(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InWarmup_bInWarmup;                       // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst) == 0x000008, "Wrong alignment on GCN_Athena_OutsideSafeZoneDamage_C_OnBurst");
static_assert(sizeof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst) == 0x0001E0, "Wrong size on GCN_Athena_OutsideSafeZoneDamage_C_OnBurst");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, ParticleComponents) == 0x0000C8, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, AudioComponents) == 0x0000D8, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, BurstDecalInstance) == 0x0000F0, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000F8, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000FC, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000100, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000108, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000120, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000128, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000130, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000150, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_Location) == 0x000170, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_Normal) == 0x00017C, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000188, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000190, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000198, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001A0, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001A8, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001AC, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001B0, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001B8, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x0001C0, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x0001C8, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_GetLocalViewingPlayerController_ReturnValue) == 0x0001D0, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_GetLocalViewingPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_IsValid_ReturnValue) == 0x0001D8, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_InWarmup_bInWarmup) == 0x0001D9, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_InWarmup_bInWarmup' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_Not_PreBool_ReturnValue) == 0x0001DA, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_OnBurst, CallFunc_BooleanAND_ReturnValue) == 0x0001DB, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_OnBurst::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GCN_Athena_OutsideSafeZoneDamage.GCN_Athena_OutsideSafeZoneDamage_C.ZapFX
// 0x0018 (0x0018 - 0x0000)
struct GCN_Athena_OutsideSafeZoneDamage_C_ZapFX final
{
public:
	int32                                         ZapCount;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   PlayerPawnAthena;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_OutsideSafeZoneDamage_C_ZapFX) == 0x000008, "Wrong alignment on GCN_Athena_OutsideSafeZoneDamage_C_ZapFX");
static_assert(sizeof(GCN_Athena_OutsideSafeZoneDamage_C_ZapFX) == 0x000018, "Wrong size on GCN_Athena_OutsideSafeZoneDamage_C_ZapFX");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_ZapFX, ZapCount) == 0x000000, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_ZapFX::ZapCount' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_ZapFX, PlayerPawnAthena) == 0x000008, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_ZapFX::PlayerPawnAthena' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_ZapFX, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_ZapFX::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_ZapFX, CallFunc_IsActive_ReturnValue) == 0x000014, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_ZapFX::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_OutsideSafeZoneDamage_C_ZapFX, CallFunc_IsValid_ReturnValue) == 0x000015, "Member 'GCN_Athena_OutsideSafeZoneDamage_C_ZapFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

