#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_HidingProp_Wobble

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_HidingProp_Wobble.GCN_Athena_HidingProp_Wobble_C.OnBurst
// 0x0210 (0x0210 - 0x0000)
struct GCN_Athena_HidingProp_Wobble_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0100(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0128(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0148(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0xF];                                      // 0x01B1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x01C0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_SMActor;             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_HidingProp_Wobble_C_OnBurst) == 0x000010, "Wrong alignment on GCN_Athena_HidingProp_Wobble_C_OnBurst");
static_assert(sizeof(GCN_Athena_HidingProp_Wobble_C_OnBurst) == 0x000210, "Wrong size on GCN_Athena_HidingProp_Wobble_C_OnBurst");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, ParticleComponents) == 0x0000C8, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, AudioComponents) == 0x0000D8, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, BurstDecalInstance) == 0x0000F0, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000F8, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0000FC, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000100, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000118, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000120, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000128, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000148, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_Location) == 0x000168, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_Normal) == 0x000174, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000180, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000188, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000190, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000198, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001A0, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001A4, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001A8, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001B0, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_GetTransform_ReturnValue) == 0x0001C0, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, K2Node_DynamicCast_AsBuilding_SMActor) == 0x0001F0, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::K2Node_DynamicCast_AsBuilding_SMActor' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_TransformLocation_ReturnValue) == 0x0001FC, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_HidingProp_Wobble_C_OnBurst, CallFunc_GetTimeSeconds_ReturnValue) == 0x000208, "Member 'GCN_Athena_HidingProp_Wobble_C_OnBurst::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");

}

