#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Galileo_Lobster_Parent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_Galileo_Lobster_Parent.GCN_Galileo_Lobster_Parent_C.GetSoundFromBank
// 0x00B0 (0x00B0 - 0x0000)
struct GCN_Galileo_Lobster_Parent_C_GetSoundFromBank final
{
public:
	class AActor*                                 Tagged_Actor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Sound_Exists;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound;                                             // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetWeaponDataGameplayTags_GameplayTags;   // 0x0028(0x0020)()
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0048(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x005C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0064(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0078(0x0020)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CallFunc_GetSoundToPlay_ReturnValue;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank) == 0x000008, "Wrong alignment on GCN_Galileo_Lobster_Parent_C_GetSoundFromBank");
static_assert(sizeof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank) == 0x0000B0, "Wrong size on GCN_Galileo_Lobster_Parent_C_GetSoundFromBank");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, Tagged_Actor) == 0x000000, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::Tagged_Actor' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, Sound_Exists) == 0x000008, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::Sound_Exists' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, Sound) == 0x000010, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::Sound' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000018, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, Temp_int_Array_Index_Variable) == 0x000024, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, CallFunc_GetWeaponDataGameplayTags_GameplayTags) == 0x000028, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::CallFunc_GetWeaponDataGameplayTags_GameplayTags' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x000048, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, CallFunc_Array_Get_Item) == 0x00005C, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000064, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000078, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, CallFunc_GetSoundToPlay_ReturnValue) == 0x0000A0, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::CallFunc_GetSoundToPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_GetSoundFromBank, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'GCN_Galileo_Lobster_Parent_C_GetSoundFromBank::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GCN_Galileo_Lobster_Parent.GCN_Galileo_Lobster_Parent_C.OnBurst
// 0x0118 (0x0118 - 0x0000)
struct GCN_Galileo_Lobster_Parent_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSoundFromBank_Sound_Exists;            // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CallFunc_GetSoundFromBank_Sound;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Galileo_Lobster_Parent_C_OnBurst) == 0x000008, "Wrong alignment on GCN_Galileo_Lobster_Parent_C_OnBurst");
static_assert(sizeof(GCN_Galileo_Lobster_Parent_C_OnBurst) == 0x000118, "Wrong size on GCN_Galileo_Lobster_Parent_C_OnBurst");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_Galileo_Lobster_Parent_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_Galileo_Lobster_Parent_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_OnBurst, ParticleComponents) == 0x0000C8, "Member 'GCN_Galileo_Lobster_Parent_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_OnBurst, AudioComponents) == 0x0000D8, "Member 'GCN_Galileo_Lobster_Parent_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_OnBurst, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_Galileo_Lobster_Parent_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_OnBurst, BurstDecalInstance) == 0x0000F0, "Member 'GCN_Galileo_Lobster_Parent_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_OnBurst, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'GCN_Galileo_Lobster_Parent_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_OnBurst, CallFunc_Array_Length_ReturnValue) == 0x000100, "Member 'GCN_Galileo_Lobster_Parent_C_OnBurst::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_OnBurst, CallFunc_GetSoundFromBank_Sound_Exists) == 0x000104, "Member 'GCN_Galileo_Lobster_Parent_C_OnBurst::CallFunc_GetSoundFromBank_Sound_Exists' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_OnBurst, CallFunc_GetSoundFromBank_Sound) == 0x000108, "Member 'GCN_Galileo_Lobster_Parent_C_OnBurst::CallFunc_GetSoundFromBank_Sound' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Parent_C_OnBurst, CallFunc_Greater_IntInt_ReturnValue) == 0x000110, "Member 'GCN_Galileo_Lobster_Parent_C_OnBurst::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

