#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_Bush

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Athena_Bush.GCN_Athena_Bush_C
// 0x0090 (0x0898 - 0x0808)
class AGCN_Athena_Bush_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0808(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   OwningPlayer_BushMesh;                             // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow2;                                            // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BushMesh;                                          // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Trail_Leaves;                                      // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OpacityFade_OpacityFadeOut_B989988545DAA0B2E69D77AE069A4437; // 0x0840(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OpacityFade__Direction_B989988545DAA0B2E69D77AE069A4437; // 0x0844(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_845[0x3];                                      // 0x0845(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OpacityFade;                                       // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PlayerPawn;                                        // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Bush;                                          // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0860(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_861[0x7];                                      // 0x0861(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MID_OwningClientBush;                              // 0x0868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCurveTableRowHandle                   ClientBushOpacity;                                 // 0x0870(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         TargetOpacity;                                     // 0x0880(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_884[0x4];                                      // 0x0884(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        BushDestructionVFX;                                // 0x0888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             BushDestructionSFX;                                // 0x0890(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCN_Athena_Bush(int32 EntryPoint);
	void On_Player_Step();
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OpacityFade__FinishedFunc();
	void OpacityFade__UpdateFunc();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Athena_Bush_C">();
	}
	static class AGCN_Athena_Bush_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_Athena_Bush_C>();
	}
};
static_assert(alignof(AGCN_Athena_Bush_C) == 0x000008, "Wrong alignment on AGCN_Athena_Bush_C");
static_assert(sizeof(AGCN_Athena_Bush_C) == 0x000898, "Wrong size on AGCN_Athena_Bush_C");
static_assert(offsetof(AGCN_Athena_Bush_C, UberGraphFrame) == 0x000808, "Member 'AGCN_Athena_Bush_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, OwningPlayer_BushMesh) == 0x000810, "Member 'AGCN_Athena_Bush_C::OwningPlayer_BushMesh' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, Arrow2) == 0x000818, "Member 'AGCN_Athena_Bush_C::Arrow2' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, Arrow1) == 0x000820, "Member 'AGCN_Athena_Bush_C::Arrow1' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, BushMesh) == 0x000828, "Member 'AGCN_Athena_Bush_C::BushMesh' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, Arrow) == 0x000830, "Member 'AGCN_Athena_Bush_C::Arrow' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, Trail_Leaves) == 0x000838, "Member 'AGCN_Athena_Bush_C::Trail_Leaves' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, OpacityFade_OpacityFadeOut_B989988545DAA0B2E69D77AE069A4437) == 0x000840, "Member 'AGCN_Athena_Bush_C::OpacityFade_OpacityFadeOut_B989988545DAA0B2E69D77AE069A4437' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, OpacityFade__Direction_B989988545DAA0B2E69D77AE069A4437) == 0x000844, "Member 'AGCN_Athena_Bush_C::OpacityFade__Direction_B989988545DAA0B2E69D77AE069A4437' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, OpacityFade) == 0x000848, "Member 'AGCN_Athena_Bush_C::OpacityFade' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, PlayerPawn) == 0x000850, "Member 'AGCN_Athena_Bush_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, MID_Bush) == 0x000858, "Member 'AGCN_Athena_Bush_C::MID_Bush' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, IsActive) == 0x000860, "Member 'AGCN_Athena_Bush_C::IsActive' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, MID_OwningClientBush) == 0x000868, "Member 'AGCN_Athena_Bush_C::MID_OwningClientBush' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, ClientBushOpacity) == 0x000870, "Member 'AGCN_Athena_Bush_C::ClientBushOpacity' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, TargetOpacity) == 0x000880, "Member 'AGCN_Athena_Bush_C::TargetOpacity' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, BushDestructionVFX) == 0x000888, "Member 'AGCN_Athena_Bush_C::BushDestructionVFX' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, BushDestructionSFX) == 0x000890, "Member 'AGCN_Athena_Bush_C::BushDestructionSFX' has a wrong offset!");

}

