#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_LowGravity_ZipLine

#include "Basic.hpp"


namespace SDK::Params
{

// Function GCN_Athena_LowGravity_ZipLine.GCN_Athena_LowGravity_ZipLine_C.ExecuteUbergraph_GCN_Athena_LowGravity_ZipLine
// 0x0008 (0x0008 - 0x0000)
struct GCN_Athena_LowGravity_ZipLine_C_ExecuteUbergraph_GCN_Athena_LowGravity_ZipLine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_LowGravity_ZipLine_C_ExecuteUbergraph_GCN_Athena_LowGravity_ZipLine) == 0x000004, "Wrong alignment on GCN_Athena_LowGravity_ZipLine_C_ExecuteUbergraph_GCN_Athena_LowGravity_ZipLine");
static_assert(sizeof(GCN_Athena_LowGravity_ZipLine_C_ExecuteUbergraph_GCN_Athena_LowGravity_ZipLine) == 0x000008, "Wrong size on GCN_Athena_LowGravity_ZipLine_C_ExecuteUbergraph_GCN_Athena_LowGravity_ZipLine");
static_assert(offsetof(GCN_Athena_LowGravity_ZipLine_C_ExecuteUbergraph_GCN_Athena_LowGravity_ZipLine, EntryPoint) == 0x000000, "Member 'GCN_Athena_LowGravity_ZipLine_C_ExecuteUbergraph_GCN_Athena_LowGravity_ZipLine::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_Athena_LowGravity_ZipLine_C_ExecuteUbergraph_GCN_Athena_LowGravity_ZipLine, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'GCN_Athena_LowGravity_ZipLine_C_ExecuteUbergraph_GCN_Athena_LowGravity_ZipLine::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function GCN_Athena_LowGravity_ZipLine.GCN_Athena_LowGravity_ZipLine_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GCN_Athena_LowGravity_ZipLine_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_LowGravity_ZipLine_C_ReceiveTick) == 0x000004, "Wrong alignment on GCN_Athena_LowGravity_ZipLine_C_ReceiveTick");
static_assert(sizeof(GCN_Athena_LowGravity_ZipLine_C_ReceiveTick) == 0x000004, "Wrong size on GCN_Athena_LowGravity_ZipLine_C_ReceiveTick");
static_assert(offsetof(GCN_Athena_LowGravity_ZipLine_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GCN_Athena_LowGravity_ZipLine_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

