#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_MultiInteractionRemove

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_MultiInteractionRemove.GCN_MultiInteractionRemove_C.OnBurst
// 0x0200 (0x0200 - 0x0000)
struct GCN_MultiInteractionRemove_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0118(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0140(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0160(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x01CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DE[0x2];                                      // 0x01DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_MultiInteractionRemove_C_OnBurst) == 0x000008, "Wrong alignment on GCN_MultiInteractionRemove_C_OnBurst");
static_assert(sizeof(GCN_MultiInteractionRemove_C_OnBurst) == 0x000200, "Wrong size on GCN_MultiInteractionRemove_C_OnBurst");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_MultiInteractionRemove_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_MultiInteractionRemove_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, ParticleComponents) == 0x0000C8, "Member 'GCN_MultiInteractionRemove_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, AudioComponents) == 0x0000D8, "Member 'GCN_MultiInteractionRemove_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_MultiInteractionRemove_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, BurstDecalInstance) == 0x0000F0, "Member 'GCN_MultiInteractionRemove_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, Temp_struct_Variable) == 0x0000F8, "Member 'GCN_MultiInteractionRemove_C_OnBurst::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_Array_Get_Item) == 0x000108, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000110, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000114, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000118, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000130, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000138, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000140, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000160, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_Location) == 0x000180, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_Normal) == 0x00018C, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000198, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001A0, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001A8, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001B0, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001B8, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001BC, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001C0, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001C8, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, Temp_struct_Variable_1) == 0x0001CC, "Member 'GCN_MultiInteractionRemove_C_OnBurst::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001DC, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, Temp_bool_Variable) == 0x0001DD, "Member 'GCN_MultiInteractionRemove_C_OnBurst::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, K2Node_Select_Default) == 0x0001E0, "Member 'GCN_MultiInteractionRemove_C_OnBurst::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurst, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x0001F0, "Member 'GCN_MultiInteractionRemove_C_OnBurst::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");

// Function GCN_MultiInteractionRemove.GCN_MultiInteractionRemove_C.OnBurstGeneric
// 0x0238 (0x0238 - 0x0000)
struct GCN_MultiInteractionRemove_C_OnBurstGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewLocalVar_0;                                     // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0108(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0130(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0150(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_Int64Int64_ReturnValue;      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Round64_ReturnValue;                      // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_Int64ToString_ReturnValue;           // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_MultiInteractionRemove_C_OnBurstGeneric) == 0x000008, "Wrong alignment on GCN_MultiInteractionRemove_C_OnBurstGeneric");
static_assert(sizeof(GCN_MultiInteractionRemove_C_OnBurstGeneric) == 0x000238, "Wrong size on GCN_MultiInteractionRemove_C_OnBurstGeneric");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, MyTarget) == 0x000000, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, Parameters) == 0x000008, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, ParticleComponents) == 0x0000C8, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, AudioComponents) == 0x0000D8, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, BurstDecalInstance) == 0x0000F0, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, NewLocalVar_0) == 0x0000F8, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000FC, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000100, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000108, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000120, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000128, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000130, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000150, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_Location) == 0x000170, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_Normal) == 0x00017C, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000188, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000190, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000198, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001A0, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001A8, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001AC, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001B0, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001B8, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001C0, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x0001C8, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_GreaterEqual_Int64Int64_ReturnValue) == 0x0001D0, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_GreaterEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_Conv_IntToString_ReturnValue) == 0x0001D8, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x0001E8, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_Round64_ReturnValue) == 0x0001F0, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_Round64_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_Conv_Int64ToString_ReturnValue) == 0x0001F8, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_Conv_Int64ToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_Concat_StrStr_ReturnValue) == 0x000208, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000218, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_MultiInteractionRemove_C_OnBurstGeneric, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000228, "Member 'GCN_MultiInteractionRemove_C_OnBurstGeneric::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

}

