#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_Interrogation_Reveal_Stencil_Latent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Athena_Interrogation_Reveal_Stencil_Latent.GCN_Athena_Interrogation_Reveal_Stencil_Latent_C
// 0x0070 (0x04E0 - 0x0470)
class AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C final : public AFortGameplayCueNotify_BurstLatent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SweepDuration;                                     // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SweepDelayHandle;                                  // 0x0488(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         SweepRadius;                                       // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalPlayerLocation;                               // 0x0494(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   PlayerPawnAthena;                                  // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeSweep;                                  // 0x04A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DelayBeforeSweepHandle;                            // 0x04B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         StencilDuration;                                   // 0x04B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BeginSweepFX();
	void EndSweepFX();
	void ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent(int32 EntryPoint);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void PlayWorldSweep();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Athena_Interrogation_Reveal_Stencil_Latent_C">();
	}
	static class AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C>();
	}
};
static_assert(alignof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C) == 0x000008, "Wrong alignment on AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C");
static_assert(sizeof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C) == 0x0004E0, "Wrong size on AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, UberGraphFrame) == 0x000470, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, PostProcess) == 0x000478, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::PostProcess' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, SweepDuration) == 0x000480, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::SweepDuration' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, SweepDelayHandle) == 0x000488, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::SweepDelayHandle' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, SweepRadius) == 0x000490, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::SweepRadius' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, LocalPlayerLocation) == 0x000494, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::LocalPlayerLocation' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, PlayerPawnAthena) == 0x0004A0, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::PlayerPawnAthena' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, DelayBeforeSweep) == 0x0004A8, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::DelayBeforeSweep' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, DelayBeforeSweepHandle) == 0x0004B0, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::DelayBeforeSweepHandle' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, StencilDuration) == 0x0004B8, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::StencilDuration' has a wrong offset!");

}

