#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Creative_PossessProp

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Creative_PossessProp.GCNL_Creative_PossessProp_C.ExecuteUbergraph_GCNL_Creative_PossessProp
// 0x01F8 (0x01F8 - 0x0000)
struct GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x00D0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x00E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0118(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_1;                 // 0x01D8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x01E8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp) == 0x000008, "Wrong alignment on GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp");
static_assert(sizeof(GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp) == 0x0001F8, "Wrong size on GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp");
static_assert(offsetof(GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp, EntryPoint) == 0x000000, "Member 'GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp, K2Node_Event_MyTarget) == 0x000008, "Member 'GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp, K2Node_Event_Parameters) == 0x000010, "Member 'GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp, K2Node_Event_ParticleComponents) == 0x0000D0, "Member 'GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp, K2Node_Event_AudioComponents) == 0x0000E0, "Member 'GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp, K2Node_Event_BurstCameraShakeInstance) == 0x0000F0, "Member 'GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp, K2Node_Event_BurstDecalInstance) == 0x0000F8, "Member 'GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000100, "Member 'GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp, K2Node_Event_MyTarget_1) == 0x000110, "Member 'GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp, K2Node_Event_Parameters_1) == 0x000118, "Member 'GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp, K2Node_Event_ParticleComponents_1) == 0x0001D8, "Member 'GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp, K2Node_Event_AudioComponents_1) == 0x0001E8, "Member 'GCNL_Creative_PossessProp_C_ExecuteUbergraph_GCNL_Creative_PossessProp::K2Node_Event_AudioComponents_1' has a wrong offset!");

// Function GCNL_Creative_PossessProp.GCNL_Creative_PossessProp_C.OnActive
// 0x00D0 (0x00D0 - 0x0000)
struct GCNL_Creative_PossessProp_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Creative_PossessProp_C_OnActive) == 0x000008, "Wrong alignment on GCNL_Creative_PossessProp_C_OnActive");
static_assert(sizeof(GCNL_Creative_PossessProp_C_OnActive) == 0x0000D0, "Wrong size on GCNL_Creative_PossessProp_C_OnActive");
static_assert(offsetof(GCNL_Creative_PossessProp_C_OnActive, MyTarget) == 0x000000, "Member 'GCNL_Creative_PossessProp_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_OnActive, Parameters) == 0x000008, "Member 'GCNL_Creative_PossessProp_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_OnActive, ReturnValue) == 0x0000C8, "Member 'GCNL_Creative_PossessProp_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_OnActive, CallFunc_OnActive_ReturnValue) == 0x0000C9, "Member 'GCNL_Creative_PossessProp_C_OnActive::CallFunc_OnActive_ReturnValue' has a wrong offset!");

// Function GCNL_Creative_PossessProp.GCNL_Creative_PossessProp_C.OnApplication
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_Creative_PossessProp_C_OnApplication final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Creative_PossessProp_C_OnApplication) == 0x000008, "Wrong alignment on GCNL_Creative_PossessProp_C_OnApplication");
static_assert(sizeof(GCNL_Creative_PossessProp_C_OnApplication) == 0x0000F8, "Wrong size on GCNL_Creative_PossessProp_C_OnApplication");
static_assert(offsetof(GCNL_Creative_PossessProp_C_OnApplication, MyTarget) == 0x000000, "Member 'GCNL_Creative_PossessProp_C_OnApplication::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_OnApplication, Parameters) == 0x000008, "Member 'GCNL_Creative_PossessProp_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_OnApplication, ParticleComponents) == 0x0000C8, "Member 'GCNL_Creative_PossessProp_C_OnApplication::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_OnApplication, AudioComponents) == 0x0000D8, "Member 'GCNL_Creative_PossessProp_C_OnApplication::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_OnApplication, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCNL_Creative_PossessProp_C_OnApplication::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_OnApplication, BurstDecalInstance) == 0x0000F0, "Member 'GCNL_Creative_PossessProp_C_OnApplication::BurstDecalInstance' has a wrong offset!");

// Function GCNL_Creative_PossessProp.GCNL_Creative_PossessProp_C.OnLoopingStart
// 0x00E8 (0x00E8 - 0x0000)
struct GCNL_Creative_PossessProp_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCNL_Creative_PossessProp_C_OnLoopingStart) == 0x000008, "Wrong alignment on GCNL_Creative_PossessProp_C_OnLoopingStart");
static_assert(sizeof(GCNL_Creative_PossessProp_C_OnLoopingStart) == 0x0000E8, "Wrong size on GCNL_Creative_PossessProp_C_OnLoopingStart");
static_assert(offsetof(GCNL_Creative_PossessProp_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GCNL_Creative_PossessProp_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GCNL_Creative_PossessProp_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_OnLoopingStart, ParticleComponents) == 0x0000C8, "Member 'GCNL_Creative_PossessProp_C_OnLoopingStart::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_PossessProp_C_OnLoopingStart, AudioComponents) == 0x0000D8, "Member 'GCNL_Creative_PossessProp_C_OnLoopingStart::AudioComponents' has a wrong offset!");

}

