#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Uncle_Dash_Charging

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Uncle_Dash_Charging.GCNL_Uncle_Dash_Charging_C
// 0x0040 (0x0848 - 0x0808)
class AGCNL_Uncle_Dash_Charging_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0808(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               AttachedFX;                                        // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PlayerPawn;                                        // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ChargeTierTimer;                                   // 0x0820(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             AudioCue_Tier1;                                    // 0x0828(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             AudioCue_Tier2;                                    // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             AudioCue_Tier3;                                    // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Start_Spin_Audio;                                  // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChargeTierUp();
	void ExecuteUbergraph_GCNL_Uncle_Dash_Charging(int32 EntryPoint);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void ResetGate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Uncle_Dash_Charging_C">();
	}
	static class AGCNL_Uncle_Dash_Charging_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Uncle_Dash_Charging_C>();
	}
};
static_assert(alignof(AGCNL_Uncle_Dash_Charging_C) == 0x000008, "Wrong alignment on AGCNL_Uncle_Dash_Charging_C");
static_assert(sizeof(AGCNL_Uncle_Dash_Charging_C) == 0x000848, "Wrong size on AGCNL_Uncle_Dash_Charging_C");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, UberGraphFrame) == 0x000808, "Member 'AGCNL_Uncle_Dash_Charging_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, AttachedFX) == 0x000810, "Member 'AGCNL_Uncle_Dash_Charging_C::AttachedFX' has a wrong offset!");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, PlayerPawn) == 0x000818, "Member 'AGCNL_Uncle_Dash_Charging_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, ChargeTierTimer) == 0x000820, "Member 'AGCNL_Uncle_Dash_Charging_C::ChargeTierTimer' has a wrong offset!");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, AudioCue_Tier1) == 0x000828, "Member 'AGCNL_Uncle_Dash_Charging_C::AudioCue_Tier1' has a wrong offset!");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, AudioCue_Tier2) == 0x000830, "Member 'AGCNL_Uncle_Dash_Charging_C::AudioCue_Tier2' has a wrong offset!");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, AudioCue_Tier3) == 0x000838, "Member 'AGCNL_Uncle_Dash_Charging_C::AudioCue_Tier3' has a wrong offset!");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, Start_Spin_Audio) == 0x000840, "Member 'AGCNL_Uncle_Dash_Charging_C::Start_Spin_Audio' has a wrong offset!");

}

