#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_MultiInteract

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Athena_MultiInteract.GCNL_Athena_MultiInteract_C.ExecuteUbergraph_GCNL_Athena_MultiInteract
// 0x0490 (0x0490 - 0x0000)
struct GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_2;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x0010(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents_2;                 // 0x00D0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_2;                    // 0x00E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance_1;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance_1;                 // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0108(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents_1;                 // 0x01C8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x01D8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0200(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0218(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0220(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0228(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0248(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x02E0(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents;                   // 0x03A0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x03B0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1; // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude_1; // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext_1; // 0x03C8(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName_1; // 0x03E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag_1; // 0x03E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1; // 0x03F0(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1; // 0x0410(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location_1;    // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal_1;      // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator_1;  // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser_1; // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject_1; // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1; // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1; // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel_1; // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1; // 0x0470(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_1; // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena_1;         // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract) == 0x000008, "Wrong alignment on GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract");
static_assert(sizeof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract) == 0x000490, "Wrong size on GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, EntryPoint) == 0x000000, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_MyTarget_2) == 0x000008, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_MyTarget_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_Parameters_2) == 0x000010, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_Parameters_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_ParticleComponents_2) == 0x0000D0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_ParticleComponents_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_AudioComponents_2) == 0x0000E0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_AudioComponents_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_BurstCameraShakeInstance_1) == 0x0000F0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_BurstCameraShakeInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_BurstDecalInstance_1) == 0x0000F8, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_BurstDecalInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_MyTarget_1) == 0x000100, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_Parameters_1) == 0x000108, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_ParticleComponents_1) == 0x0001C8, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_AudioComponents_1) == 0x0001D8, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_BurstCameraShakeInstance) == 0x0001E8, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_BurstDecalInstance) == 0x0001F0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0001F8, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0001FC, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000200, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000218, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000220, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000228, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000248, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_Location) == 0x000268, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_Normal) == 0x000274, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000280, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000288, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000290, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000298, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0002A0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0002A4, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0002A8, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0002B0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0002B8, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_DynamicCast_bSuccess) == 0x0002C0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x0002C8, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_DynamicCast_bSuccess_1) == 0x0002D0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_MyTarget) == 0x0002D8, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_Parameters) == 0x0002E0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_ParticleComponents) == 0x0003A0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_AudioComponents) == 0x0003B0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1) == 0x0003C0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_RawMagnitude_1) == 0x0003C4, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_RawMagnitude_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_EffectContext_1) == 0x0003C8, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_EffectContext_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_MatchedTagName_1) == 0x0003E0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_MatchedTagName_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_OriginalTag_1) == 0x0003E8, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_OriginalTag_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1) == 0x0003F0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1) == 0x000410, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_Location_1) == 0x000430, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_Location_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_Normal_1) == 0x00043C, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_Normal_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_Instigator_1) == 0x000448, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_Instigator_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_EffectCauser_1) == 0x000450, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_EffectCauser_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_SourceObject_1) == 0x000458, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_SourceObject_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1) == 0x000460, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1) == 0x000468, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_AbilityLevel_1) == 0x00046C, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_AbilityLevel_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1) == 0x000470, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_1) == 0x000478, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_DynamicCast_AsPlayer_Pawn_Athena_1) == 0x000480, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_DynamicCast_AsPlayer_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_DynamicCast_bSuccess_2) == 0x000488, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function GCNL_Athena_MultiInteract.GCNL_Athena_MultiInteract_C.OnApplicationGeneric
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_Athena_MultiInteract_C_OnApplicationGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_MultiInteract_C_OnApplicationGeneric) == 0x000008, "Wrong alignment on GCNL_Athena_MultiInteract_C_OnApplicationGeneric");
static_assert(sizeof(GCNL_Athena_MultiInteract_C_OnApplicationGeneric) == 0x0000F8, "Wrong size on GCNL_Athena_MultiInteract_C_OnApplicationGeneric");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnApplicationGeneric, MyTarget) == 0x000000, "Member 'GCNL_Athena_MultiInteract_C_OnApplicationGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnApplicationGeneric, Parameters) == 0x000008, "Member 'GCNL_Athena_MultiInteract_C_OnApplicationGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnApplicationGeneric, ParticleComponents) == 0x0000C8, "Member 'GCNL_Athena_MultiInteract_C_OnApplicationGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnApplicationGeneric, AudioComponents) == 0x0000D8, "Member 'GCNL_Athena_MultiInteract_C_OnApplicationGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnApplicationGeneric, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCNL_Athena_MultiInteract_C_OnApplicationGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnApplicationGeneric, BurstDecalInstance) == 0x0000F0, "Member 'GCNL_Athena_MultiInteract_C_OnApplicationGeneric::BurstDecalInstance' has a wrong offset!");

// Function GCNL_Athena_MultiInteract.GCNL_Athena_MultiInteract_C.OnLoopingStartGeneric
// 0x00E8 (0x00E8 - 0x0000)
struct GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric) == 0x000008, "Wrong alignment on GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric");
static_assert(sizeof(GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric) == 0x0000E8, "Wrong size on GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric, MyTarget) == 0x000000, "Member 'GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric, Parameters) == 0x000008, "Member 'GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric, ParticleComponents) == 0x0000C8, "Member 'GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric, AudioComponents) == 0x0000D8, "Member 'GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric::AudioComponents' has a wrong offset!");

// Function GCNL_Athena_MultiInteract.GCNL_Athena_MultiInteract_C.OnRemovalGeneric
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_Athena_MultiInteract_C_OnRemovalGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_MultiInteract_C_OnRemovalGeneric) == 0x000008, "Wrong alignment on GCNL_Athena_MultiInteract_C_OnRemovalGeneric");
static_assert(sizeof(GCNL_Athena_MultiInteract_C_OnRemovalGeneric) == 0x0000F8, "Wrong size on GCNL_Athena_MultiInteract_C_OnRemovalGeneric");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnRemovalGeneric, MyTarget) == 0x000000, "Member 'GCNL_Athena_MultiInteract_C_OnRemovalGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnRemovalGeneric, Parameters) == 0x000008, "Member 'GCNL_Athena_MultiInteract_C_OnRemovalGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnRemovalGeneric, ParticleComponents) == 0x0000C8, "Member 'GCNL_Athena_MultiInteract_C_OnRemovalGeneric::ParticleComponents' has a wrong offset!");
