#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Vent_Enter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Vent_Enter.GCNL_Vent_Enter_C
// 0x0038 (0x0840 - 0x0808)
class AGCNL_Vent_Enter_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0808(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadePPVol_LERP_6D28D8B64202D10F474B48B80194DA6D;   // 0x0818(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadePPVol__Direction_6D28D8B64202D10F474B48B80194DA6D; // 0x081C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81D[0x3];                                      // 0x081D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadePPVol;                                         // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CameraShakeClass;                                  // 0x0828(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatineeCameraShake*                    CameraShake;                                       // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsePP;                                             // 0x0838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_Vent_Enter(int32 EntryPoint);
	void FadePPVol__FinishedFunc();
	void FadePPVol__UpdateFunc();
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Vent_Enter_C">();
	}
	static class AGCNL_Vent_Enter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Vent_Enter_C>();
	}
};
static_assert(alignof(AGCNL_Vent_Enter_C) == 0x000008, "Wrong alignment on AGCNL_Vent_Enter_C");
static_assert(sizeof(AGCNL_Vent_Enter_C) == 0x000840, "Wrong size on AGCNL_Vent_Enter_C");
static_assert(offsetof(AGCNL_Vent_Enter_C, UberGraphFrame) == 0x000808, "Member 'AGCNL_Vent_Enter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Vent_Enter_C, PostProcess) == 0x000810, "Member 'AGCNL_Vent_Enter_C::PostProcess' has a wrong offset!");
static_assert(offsetof(AGCNL_Vent_Enter_C, FadePPVol_LERP_6D28D8B64202D10F474B48B80194DA6D) == 0x000818, "Member 'AGCNL_Vent_Enter_C::FadePPVol_LERP_6D28D8B64202D10F474B48B80194DA6D' has a wrong offset!");
static_assert(offsetof(AGCNL_Vent_Enter_C, FadePPVol__Direction_6D28D8B64202D10F474B48B80194DA6D) == 0x00081C, "Member 'AGCNL_Vent_Enter_C::FadePPVol__Direction_6D28D8B64202D10F474B48B80194DA6D' has a wrong offset!");
static_assert(offsetof(AGCNL_Vent_Enter_C, FadePPVol) == 0x000820, "Member 'AGCNL_Vent_Enter_C::FadePPVol' has a wrong offset!");
static_assert(offsetof(AGCNL_Vent_Enter_C, CameraShakeClass) == 0x000828, "Member 'AGCNL_Vent_Enter_C::CameraShakeClass' has a wrong offset!");
static_assert(offsetof(AGCNL_Vent_Enter_C, CameraShake) == 0x000830, "Member 'AGCNL_Vent_Enter_C::CameraShake' has a wrong offset!");
static_assert(offsetof(AGCNL_Vent_Enter_C, UsePP) == 0x000838, "Member 'AGCNL_Vent_Enter_C::UsePP' has a wrong offset!");

}

