#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_EdgeOfStorm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_EdgeOfStorm.GCNL_EdgeOfStorm_C
// 0x0020 (0x0828 - 0x0808)
class AGCNL_EdgeOfStorm_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0808(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        StormPawn;                                         // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBoundAudioPercent;                                // 0x0820(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Activated(const struct FVector& EdgeOfStorm);
	void Deactivated();
	void ExecuteUbergraph_GCNL_EdgeOfStorm(int32 EntryPoint);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_EdgeOfStorm_C">();
	}
	static class AGCNL_EdgeOfStorm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_EdgeOfStorm_C>();
	}
};
static_assert(alignof(AGCNL_EdgeOfStorm_C) == 0x000008, "Wrong alignment on AGCNL_EdgeOfStorm_C");
static_assert(sizeof(AGCNL_EdgeOfStorm_C) == 0x000828, "Wrong size on AGCNL_EdgeOfStorm_C");
static_assert(offsetof(AGCNL_EdgeOfStorm_C, UberGraphFrame) == 0x000808, "Member 'AGCNL_EdgeOfStorm_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_EdgeOfStorm_C, Audio) == 0x000810, "Member 'AGCNL_EdgeOfStorm_C::Audio' has a wrong offset!");
static_assert(offsetof(AGCNL_EdgeOfStorm_C, StormPawn) == 0x000818, "Member 'AGCNL_EdgeOfStorm_C::StormPawn' has a wrong offset!");
static_assert(offsetof(AGCNL_EdgeOfStorm_C, bBoundAudioPercent) == 0x000820, "Member 'AGCNL_EdgeOfStorm_C::bBoundAudioPercent' has a wrong offset!");

}

