#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_Tether

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Athena_Tether.GCNL_Athena_Tether_C.BndEvt__FortLayeredAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct GCNL_Athena_Tether_C_BndEvt__FortLayeredAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature final
{
public:
	class UAudioComponent*                        AudioComponent;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ParameterName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OneshotIndex;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Tether_C_BndEvt__FortLayeredAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature) == 0x000008, "Wrong alignment on GCNL_Athena_Tether_C_BndEvt__FortLayeredAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature");
static_assert(sizeof(GCNL_Athena_Tether_C_BndEvt__FortLayeredAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature) == 0x000018, "Wrong size on GCNL_Athena_Tether_C_BndEvt__FortLayeredAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature");
static_assert(offsetof(GCNL_Athena_Tether_C_BndEvt__FortLayeredAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature, AudioComponent) == 0x000000, "Member 'GCNL_Athena_Tether_C_BndEvt__FortLayeredAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature::AudioComponent' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_BndEvt__FortLayeredAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature, ParameterName) == 0x000008, "Member 'GCNL_Athena_Tether_C_BndEvt__FortLayeredAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature::ParameterName' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_BndEvt__FortLayeredAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature, OneshotIndex) == 0x000010, "Member 'GCNL_Athena_Tether_C_BndEvt__FortLayeredAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature::OneshotIndex' has a wrong offset!");

// Function GCNL_Athena_Tether.GCNL_Athena_Tether_C.ExecuteUbergraph_GCNL_Athena_Tether
// 0x04E0 (0x04E0 - 0x0000)
struct GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_GetPrimaryParticleComponent_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInterfaceValidResult                         CallFunc_IsInterfaceValid_Result;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDynamicForceFeedbackAction                   Temp_byte_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0040(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_1;                 // 0x0100(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x0110(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance_1;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance_1;                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0130(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x01D8(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x0298(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x02A8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x02FC(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        K2Node_ComponentBoundEvent_AudioComponent;         // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_ParameterName;          // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OneshotIndex;           // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterInterface> CallFunc_SetIntParameter_self_CastInput;           // 0x03B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x03CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPC_Pawn_Wildlife_Parent_C*            K2Node_DynamicCast_AsNPC_Pawn_Wildlife_Parent;     // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICameraLensEffectInterface> CallFunc_AddGenericCameraLensEffect_ReturnValue;   // 0x03F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x040A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x040B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40D[0x3];                                      // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x042C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWaterBodyActor*                    CallFunc_GetCurrentWaterBody_ReturnValue;          // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0445(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_446[0x2];                                      // 0x0446(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x045A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCommonWaterFXParams_ReturnValue;       // 0x045B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x045D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x045E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x045F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0460(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0470(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x3];                                      // 0x0489(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_GetPrimaryParticleComponent_ReturnValue_1; // 0x0490(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInterfaceValidResult                         CallFunc_IsInterfaceValid_Result_1;                // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49A[0x6];                                      // 0x049A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor_1;                      // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInterfaceValidResult                         CallFunc_IsInterfaceValid_Result_2;                // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x04AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AB[0x5];                                      // 0x04AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_GetPrimaryParticleComponent_ReturnValue_2; // 0x04B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor_2;                      // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x04C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x04D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D5[0x3];                                      // 0x04D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether) == 0x000008, "Wrong alignment on GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether");
static_assert(sizeof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether) == 0x0004E0, "Wrong size on GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, EntryPoint) == 0x000000, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_GetPrimaryParticleComponent_ReturnValue) == 0x000008, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_GetPrimaryParticleComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000018, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_IsInterfaceValid_Result) == 0x000020, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_IsInterfaceValid_Result' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, Temp_byte_Variable) == 0x000021, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_SwitchEnum_CmpSuccess) == 0x000022, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_IsValid_ReturnValue_1) == 0x000023, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000024, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_MakeLiteralByte_ReturnValue) == 0x000030, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_Event_DeltaSeconds) == 0x000034, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_Event_MyTarget_1) == 0x000038, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_Event_Parameters_1) == 0x000040, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_Event_ParticleComponents_1) == 0x000100, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_Event_AudioComponents_1) == 0x000110, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_Event_BurstCameraShakeInstance_1) == 0x000120, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_Event_BurstCameraShakeInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_Event_BurstDecalInstance_1) == 0x000128, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_Event_BurstDecalInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000130, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_Event_MyTarget) == 0x0001D0, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_Event_Parameters) == 0x0001D8, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_Event_ParticleComponents) == 0x000298, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_Event_AudioComponents) == 0x0002A8, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_Event_BurstCameraShakeInstance) == 0x0002B8, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_Event_BurstDecalInstance) == 0x0002C0, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0002C8, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_GetForwardVector_ReturnValue) == 0x0002CC, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_GetVelocity_ReturnValue) == 0x0002D8, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Normal_ReturnValue) == 0x0002E4, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Dot_VectorVector_ReturnValue) == 0x0002F0, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_VSize_ReturnValue) == 0x0002F4, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_MapRangeClamped_ReturnValue) == 0x0002F8, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0002FC, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000398, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_ComponentBoundEvent_AudioComponent) == 0x0003A0, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_ComponentBoundEvent_AudioComponent' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_ComponentBoundEvent_ParameterName) == 0x0003A8, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_ComponentBoundEvent_ParameterName' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_ComponentBoundEvent_OneshotIndex) == 0x0003B0, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_ComponentBoundEvent_OneshotIndex' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Conv_BoolToInt_ReturnValue) == 0x0003B4, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_SetIntParameter_self_CastInput) == 0x0003B8, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_SetIntParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_IsLocallyControlled_ReturnValue) == 0x0003C8, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_GetActorForwardVector_ReturnValue) == 0x0003CC, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x0003D8, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_GetViewTarget_ReturnValue) == 0x0003E0, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_DynamicCast_AsNPC_Pawn_Wildlife_Parent) == 0x0003E8, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_DynamicCast_AsNPC_Pawn_Wildlife_Parent' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_DynamicCast_bSuccess) == 0x0003F0, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_AddGenericCameraLensEffect_ReturnValue) == 0x0003F8, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_AddGenericCameraLensEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Not_PreBool_ReturnValue) == 0x000408, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Less_FloatFloat_ReturnValue) == 0x000409, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00040A, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_BooleanOR_ReturnValue) == 0x00040B, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_BooleanOR_ReturnValue_1) == 0x00040C, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Abs_ReturnValue) == 0x000410, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_FClamp_ReturnValue) == 0x000414, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000418, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Add_FloatFloat_ReturnValue) == 0x00041C, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Abs_ReturnValue_1) == 0x000420, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000424, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000428, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_GetVelocity_ReturnValue_1) == 0x00042C, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_GetCurrentWaterBody_ReturnValue) == 0x000438, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_GetCurrentWaterBody_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_VSize_ReturnValue_1) == 0x000440, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_IsValid_ReturnValue_2) == 0x000444, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000445, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_CustomEvent_Object) == 0x000448, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_CustomEvent_Object' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000450, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_DynamicCast_bSuccess_1) == 0x000458, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000459, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00045A, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_SetCommonWaterFXParams_ReturnValue) == 0x00045B, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_SetCommonWaterFXParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00045C, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_BooleanOR_ReturnValue_2) == 0x00045D, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00045E, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_BooleanAND_ReturnValue) == 0x00045F, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_CreateDelegate_OutputDelegate) == 0x000460, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000470, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_FClamp_ReturnValue_1) == 0x000478, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00047C, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_DynamicCast_AsActor) == 0x000480, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_DynamicCast_bSuccess_2) == 0x000488, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00048C, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_GetPrimaryParticleComponent_ReturnValue_1) == 0x000490, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_GetPrimaryParticleComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_IsInterfaceValid_Result_1) == 0x000498, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_IsInterfaceValid_Result_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_SwitchEnum_CmpSuccess_1) == 0x000499, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_DynamicCast_AsActor_1) == 0x0004A0, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_DynamicCast_AsActor_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_DynamicCast_bSuccess_3) == 0x0004A8, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_IsInterfaceValid_Result_2) == 0x0004A9, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_IsInterfaceValid_Result_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_SwitchEnum_CmpSuccess_2) == 0x0004AA, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_GetPrimaryParticleComponent_ReturnValue_2) == 0x0004B0, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_GetPrimaryParticleComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_DynamicCast_AsActor_2) == 0x0004B8, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_DynamicCast_AsActor_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, K2Node_DynamicCast_bSuccess_4) == 0x0004C0, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_GetForwardVector_ReturnValue_1) == 0x0004C4, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x0004D0, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x0004D4, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x0004D8, "Member 'GCNL_Athena_Tether_C_ExecuteUbergraph_GCNL_Athena_Tether::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

// Function GCNL_Athena_Tether.GCNL_Athena_Tether_C.InitializeTetherGCNL
// 0x0008 (0x0008 - 0x0000)
struct GCNL_Athena_Tether_C_InitializeTetherGCNL final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Tether_C_InitializeTetherGCNL) == 0x000008, "Wrong alignment on GCNL_Athena_Tether_C_InitializeTetherGCNL");
static_assert(sizeof(GCNL_Athena_Tether_C_InitializeTetherGCNL) == 0x000008, "Wrong size on GCNL_Athena_Tether_C_InitializeTetherGCNL");
static_assert(offsetof(GCNL_Athena_Tether_C_InitializeTetherGCNL, Object) == 0x000000, "Member 'GCNL_Athena_Tether_C_InitializeTetherGCNL::Object' has a wrong offset!");

// Function GCNL_Athena_Tether.GCNL_Athena_Tether_C.OnApplication
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_Athena_Tether_C_OnApplication final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Tether_C_OnApplication) == 0x000008, "Wrong alignment on GCNL_Athena_Tether_C_OnApplication");
static_assert(sizeof(GCNL_Athena_Tether_C_OnApplication) == 0x0000F8, "Wrong size on GCNL_Athena_Tether_C_OnApplication");
static_assert(offsetof(GCNL_Athena_Tether_C_OnApplication, MyTarget) == 0x000000, "Member 'GCNL_Athena_Tether_C_OnApplication::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_OnApplication, Parameters) == 0x000008, "Member 'GCNL_Athena_Tether_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_OnApplication, ParticleComponents) == 0x0000C8, "Member 'GCNL_Athena_Tether_C_OnApplication::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_OnApplication, AudioComponents) == 0x0000D8, "Member 'GCNL_Athena_Tether_C_OnApplication::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_OnApplication, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCNL_Athena_Tether_C_OnApplication::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_OnApplication, BurstDecalInstance) == 0x0000F0, "Member 'GCNL_Athena_Tether_C_OnApplication::BurstDecalInstance' has a wrong offset!");

// Function GCNL_Athena_Tether.GCNL_Athena_Tether_C.OnRemoval
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_Athena_Tether_C_OnRemoval final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Tether_C_OnRemoval) == 0x000008, "Wrong alignment on GCNL_Athena_Tether_C_OnRemoval");
static_assert(sizeof(GCNL_Athena_Tether_C_OnRemoval) == 0x0000F8, "Wrong size on GCNL_Athena_Tether_C_OnRemoval");
static_assert(offsetof(GCNL_Athena_Tether_C_OnRemoval, MyTarget) == 0x000000, "Member 'GCNL_Athena_Tether_C_OnRemoval::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_OnRemoval, Parameters) == 0x000008, "Member 'GCNL_Athena_Tether_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_OnRemoval, ParticleComponents) == 0x0000C8, "Member 'GCNL_Athena_Tether_C_OnRemoval::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_OnRemoval, AudioComponents) == 0x0000D8, "Member 'GCNL_Athena_Tether_C_OnRemoval::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_OnRemoval, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCNL_Athena_Tether_C_OnRemoval::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_OnRemoval, BurstDecalInstance) == 0x0000F0, "Member 'GCNL_Athena_Tether_C_OnRemoval::BurstDecalInstance' has a wrong offset!");

// Function GCNL_Athena_Tether.GCNL_Athena_Tether_C.OnRemove
// 0x00D0 (0x00D0 - 0x0000)
struct GCNL_Athena_Tether_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Tether_C_OnRemove) == 0x000008, "Wrong alignment on GCNL_Athena_Tether_C_OnRemove");
static_assert(sizeof(GCNL_Athena_Tether_C_OnRemove) == 0x0000D0, "Wrong size on GCNL_Athena_Tether_C_OnRemove");
static_assert(offsetof(GCNL_Athena_Tether_C_OnRemove, MyTarget) == 0x000000, "Member 'GCNL_Athena_Tether_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_OnRemove, Parameters) == 0x000008, "Member 'GCNL_Athena_Tether_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_OnRemove, ReturnValue) == 0x0000C8, "Member 'GCNL_Athena_Tether_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_OnRemove, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x0000C9, "Member 'GCNL_Athena_Tether_C_OnRemove::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function GCNL_Athena_Tether.GCNL_Athena_Tether_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GCNL_Athena_Tether_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Tether_C_ReceiveTick) == 0x000004, "Wrong alignment on GCNL_Athena_Tether_C_ReceiveTick");
static_assert(sizeof(GCNL_Athena_Tether_C_ReceiveTick) == 0x000004, "Wrong size on GCNL_Athena_Tether_C_ReceiveTick");
static_assert(offsetof(GCNL_Athena_Tether_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GCNL_Athena_Tether_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GCNL_Athena_Tether.GCNL_Athena_Tether_C.UpdateAudio
// 0x0010 (0x0010 - 0x0000)
struct GCNL_Athena_Tether_C_UpdateAudio final
{
public:
	int32                                         Surface;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Tether_C_UpdateAudio) == 0x000004, "Wrong alignment on GCNL_Athena_Tether_C_UpdateAudio");
static_assert(sizeof(GCNL_Athena_Tether_C_UpdateAudio) == 0x000010, "Wrong size on GCNL_Athena_Tether_C_UpdateAudio");
static_assert(offsetof(GCNL_Athena_Tether_C_UpdateAudio, Surface) == 0x000000, "Member 'GCNL_Athena_Tether_C_UpdateAudio::Surface' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_UpdateAudio, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'GCNL_Athena_Tether_C_UpdateAudio::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_UpdateAudio, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'GCNL_Athena_Tether_C_UpdateAudio::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_UpdateAudio, CallFunc_Abs_ReturnValue) == 0x00000C, "Member 'GCNL_Athena_Tether_C_UpdateAudio::CallFunc_Abs_ReturnValue' has a wrong offset!");

// Function GCNL_Athena_Tether.GCNL_Athena_Tether_C.WhileActive
// 0x00D0 (0x00D0 - 0x0000)
struct GCNL_Athena_Tether_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Tether_C_WhileActive) == 0x000008, "Wrong alignment on GCNL_Athena_Tether_C_WhileActive");
static_assert(sizeof(GCNL_Athena_Tether_C_WhileActive) == 0x0000D0, "Wrong size on GCNL_Athena_Tether_C_WhileActive");
static_assert(offsetof(GCNL_Athena_Tether_C_WhileActive, MyTarget) == 0x000000, "Member 'GCNL_Athena_Tether_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_WhileActive, Parameters) == 0x000008, "Member 'GCNL_Athena_Tether_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Tether_C_WhileActive, ReturnValue) == 0x0000C8, "Member 'GCNL_Athena_Tether_C_WhileActive::ReturnValue' has a wrong offset!");

}

