#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_AppleSun_Bounced

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Athena_AppleSun_Bounced.GCNL_Athena_AppleSun_Bounced_C
// 0x0018 (0x0820 - 0x0808)
class AGCNL_Athena_AppleSun_Bounced_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0808(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        InUseLoopAudio;                                    // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_Athena_AppleSun_Bounced(int32 EntryPoint);
	void OnApplication(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Athena_AppleSun_Bounced_C">();
	}
	static class AGCNL_Athena_AppleSun_Bounced_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Athena_AppleSun_Bounced_C>();
	}
};
static_assert(alignof(AGCNL_Athena_AppleSun_Bounced_C) == 0x000008, "Wrong alignment on AGCNL_Athena_AppleSun_Bounced_C");
static_assert(sizeof(AGCNL_Athena_AppleSun_Bounced_C) == 0x000820, "Wrong size on AGCNL_Athena_AppleSun_Bounced_C");
static_assert(offsetof(AGCNL_Athena_AppleSun_Bounced_C, UberGraphFrame) == 0x000808, "Member 'AGCNL_Athena_AppleSun_Bounced_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_AppleSun_Bounced_C, InUseLoopAudio) == 0x000810, "Member 'AGCNL_Athena_AppleSun_Bounced_C::InUseLoopAudio' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_AppleSun_Bounced_C, Target) == 0x000818, "Member 'AGCNL_Athena_AppleSun_Bounced_C::Target' has a wrong offset!");

}

