#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_Tether

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Athena_Tether.GCNL_Athena_Tether_C
// 0x0078 (0x0880 - 0x0808)
class AGCNL_Athena_Tether_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0808(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortLayeredAudioComponent*             FortLayeredAudio;                                  // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      LandFX;                                            // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      WaterFX;                                           // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RightSki;                                          // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LeftSki;                                           // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleInSkis_SkiScalar_93783D4A4F91BF9F887B16977978DDB4; // 0x0838(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ScaleInSkis__Direction_93783D4A4F91BF9F887B16977978DDB4; // 0x083C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83D[0x3];                                      // 0x083D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ScaleInSkis;                                       // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        OwningFPP;                                         // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInWater;                                         // 0x0850(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_851[0x3];                                      // 0x0851(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NormalizedSpeed;                                   // 0x0854(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurnSpeed;                                         // 0x0858(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ForceFeedbackIntensity;                            // 0x085C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ScaleInSkisTimerHandle;                            // 0x0860(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         SkiScaleInDelay;                                   // 0x0868(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86C[0x4];                                      // 0x086C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICameraLensEffectInterface> CameraLensEffectInterface;                         // 0x0870(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void BndEvt__FortLayeredAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature(class UAudioComponent* AudioComponent, class FName ParameterName, int32 OneshotIndex);
	void ExecuteUbergraph_GCNL_Athena_Tether(int32 EntryPoint);
	void InitializeTetherGCNL(class UObject* Object);
	void OnApplication(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ScaleInSkis__FinishedFunc();
	void ScaleInSkis__UpdateFunc();
	void ScaleInSkisForPlayer();
	void StartFF();
	void StopFF();
	void UpdateAudio(int32 Surface);
	void UpdateFF();
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Athena_Tether_C">();
	}
	static class AGCNL_Athena_Tether_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Athena_Tether_C>();
	}
};
static_assert(alignof(AGCNL_Athena_Tether_C) == 0x000008, "Wrong alignment on AGCNL_Athena_Tether_C");
static_assert(sizeof(AGCNL_Athena_Tether_C) == 0x000880, "Wrong size on AGCNL_Athena_Tether_C");
static_assert(offsetof(AGCNL_Athena_Tether_C, UberGraphFrame) == 0x000808, "Member 'AGCNL_Athena_Tether_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, FortLayeredAudio) == 0x000810, "Member 'AGCNL_Athena_Tether_C::FortLayeredAudio' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, LandFX) == 0x000818, "Member 'AGCNL_Athena_Tether_C::LandFX' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, WaterFX) == 0x000820, "Member 'AGCNL_Athena_Tether_C::WaterFX' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, RightSki) == 0x000828, "Member 'AGCNL_Athena_Tether_C::RightSki' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, LeftSki) == 0x000830, "Member 'AGCNL_Athena_Tether_C::LeftSki' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, ScaleInSkis_SkiScalar_93783D4A4F91BF9F887B16977978DDB4) == 0x000838, "Member 'AGCNL_Athena_Tether_C::ScaleInSkis_SkiScalar_93783D4A4F91BF9F887B16977978DDB4' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, ScaleInSkis__Direction_93783D4A4F91BF9F887B16977978DDB4) == 0x00083C, "Member 'AGCNL_Athena_Tether_C::ScaleInSkis__Direction_93783D4A4F91BF9F887B16977978DDB4' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, ScaleInSkis) == 0x000840, "Member 'AGCNL_Athena_Tether_C::ScaleInSkis' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, OwningFPP) == 0x000848, "Member 'AGCNL_Athena_Tether_C::OwningFPP' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, IsInWater) == 0x000850, "Member 'AGCNL_Athena_Tether_C::IsInWater' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, NormalizedSpeed) == 0x000854, "Member 'AGCNL_Athena_Tether_C::NormalizedSpeed' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, TurnSpeed) == 0x000858, "Member 'AGCNL_Athena_Tether_C::TurnSpeed' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, ForceFeedbackIntensity) == 0x00085C, "Member 'AGCNL_Athena_Tether_C::ForceFeedbackIntensity' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, ScaleInSkisTimerHandle) == 0x000860, "Member 'AGCNL_Athena_Tether_C::ScaleInSkisTimerHandle' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, SkiScaleInDelay) == 0x000868, "Member 'AGCNL_Athena_Tether_C::SkiScaleInDelay' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, CameraLensEffectInterface) == 0x000870, "Member 'AGCNL_Athena_Tether_C::CameraLensEffectInterface' has a wrong offset!");

}

