#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_HidingProp_Teleporting_WilliePete

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Athena_HidingProp_Teleporting_WilliePete.GCNL_Athena_HidingProp_Teleporting_WilliePete_C
// 0x0038 (0x0840 - 0x0808)
class AGCNL_Athena_HidingProp_Teleporting_WilliePete_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0808(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_LerpWhiteWash_7F6EEB5A42EA09E354D8B4A32C35C459; // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_7F6EEB5A42EA09E354D8B4A32C35C459; // 0x0814(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_815[0x3];                                      // 0x0815(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        OnePTravelAudio;                                   // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICameraLensEffectInterface> LensEffectInterface;                               // 0x0828(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AActor*                                 LensEffectActor;                                   // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete(int32 EntryPoint);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void Timeline_0__DoFlash__EventFunc();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Athena_HidingProp_Teleporting_WilliePete_C">();
	}
	static class AGCNL_Athena_HidingProp_Teleporting_WilliePete_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Athena_HidingProp_Teleporting_WilliePete_C>();
	}
};
static_assert(alignof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C) == 0x000008, "Wrong alignment on AGCNL_Athena_HidingProp_Teleporting_WilliePete_C");
static_assert(sizeof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C) == 0x000840, "Wrong size on AGCNL_Athena_HidingProp_Teleporting_WilliePete_C");
static_assert(offsetof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C, UberGraphFrame) == 0x000808, "Member 'AGCNL_Athena_HidingProp_Teleporting_WilliePete_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C, Timeline_0_LerpWhiteWash_7F6EEB5A42EA09E354D8B4A32C35C459) == 0x000810, "Member 'AGCNL_Athena_HidingProp_Teleporting_WilliePete_C::Timeline_0_LerpWhiteWash_7F6EEB5A42EA09E354D8B4A32C35C459' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C, Timeline_0__Direction_7F6EEB5A42EA09E354D8B4A32C35C459) == 0x000814, "Member 'AGCNL_Athena_HidingProp_Teleporting_WilliePete_C::Timeline_0__Direction_7F6EEB5A42EA09E354D8B4A32C35C459' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C, Timeline_0) == 0x000818, "Member 'AGCNL_Athena_HidingProp_Teleporting_WilliePete_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C, OnePTravelAudio) == 0x000820, "Member 'AGCNL_Athena_HidingProp_Teleporting_WilliePete_C::OnePTravelAudio' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C, LensEffectInterface) == 0x000828, "Member 'AGCNL_Athena_HidingProp_Teleporting_WilliePete_C::LensEffectInterface' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C, LensEffectActor) == 0x000838, "Member 'AGCNL_Athena_HidingProp_Teleporting_WilliePete_C::LensEffectActor' has a wrong offset!");

}

