#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_SnowSurface

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GCNL_Athena_Surface_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Athena_SnowSurface.GCNL_Athena_SnowSurface_C
// 0x0020 (0x0840 - 0x0820)
class AGCNL_Athena_SnowSurface_C final : public AGCNL_Athena_Surface_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GCNL_Athena_SnowSurface_C;          // 0x0820(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      FootStepFX;                                        // 0x0828(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNotValid;                                         // 0x0830(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReplayMode;                                       // 0x0831(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_832[0x6];                                      // 0x0832(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortReplaySpectatorAthena*             ReplayController;                                  // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_Athena_SnowSurface(int32 EntryPoint);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void OnLoopingStartNiagara(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UNiagaraComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void OnPlayerFootstep();
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Athena_SnowSurface_C">();
	}
	static class AGCNL_Athena_SnowSurface_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Athena_SnowSurface_C>();
	}
};
static_assert(alignof(AGCNL_Athena_SnowSurface_C) == 0x000008, "Wrong alignment on AGCNL_Athena_SnowSurface_C");
static_assert(sizeof(AGCNL_Athena_SnowSurface_C) == 0x000840, "Wrong size on AGCNL_Athena_SnowSurface_C");
static_assert(offsetof(AGCNL_Athena_SnowSurface_C, UberGraphFrame_GCNL_Athena_SnowSurface_C) == 0x000820, "Member 'AGCNL_Athena_SnowSurface_C::UberGraphFrame_GCNL_Athena_SnowSurface_C' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_SnowSurface_C, FootStepFX) == 0x000828, "Member 'AGCNL_Athena_SnowSurface_C::FootStepFX' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_SnowSurface_C, bNotValid) == 0x000830, "Member 'AGCNL_Athena_SnowSurface_C::bNotValid' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_SnowSurface_C, bReplayMode) == 0x000831, "Member 'AGCNL_Athena_SnowSurface_C::bReplayMode' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_SnowSurface_C, ReplayController) == 0x000838, "Member 'AGCNL_Athena_SnowSurface_C::ReplayController' has a wrong offset!");

}

