#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_ShieldGenerator_Heal

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Athena_ShieldGenerator_Heal.GCNL_Athena_ShieldGenerator_Heal_C
// 0x0040 (0x0848 - 0x0808)
class AGCNL_Athena_ShieldGenerator_Heal_C final : public AFortGameplayCueNotify_Loop
{
public:
	class UParticleSystemComponent*               BeamFX;                                            // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SourceActor;                                       // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_ShieldCap;                                     // 0x0820(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Athena_ShieldGenerator_Heal_C">();
	}
	static class AGCNL_Athena_ShieldGenerator_Heal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Athena_ShieldGenerator_Heal_C>();
	}
};
static_assert(alignof(AGCNL_Athena_ShieldGenerator_Heal_C) == 0x000008, "Wrong alignment on AGCNL_Athena_ShieldGenerator_Heal_C");
static_assert(sizeof(AGCNL_Athena_ShieldGenerator_Heal_C) == 0x000848, "Wrong size on AGCNL_Athena_ShieldGenerator_Heal_C");
static_assert(offsetof(AGCNL_Athena_ShieldGenerator_Heal_C, BeamFX) == 0x000808, "Member 'AGCNL_Athena_ShieldGenerator_Heal_C::BeamFX' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_ShieldGenerator_Heal_C, TargetActor) == 0x000810, "Member 'AGCNL_Athena_ShieldGenerator_Heal_C::TargetActor' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_ShieldGenerator_Heal_C, SourceActor) == 0x000818, "Member 'AGCNL_Athena_ShieldGenerator_Heal_C::SourceActor' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_ShieldGenerator_Heal_C, Row_ShieldCap) == 0x000820, "Member 'AGCNL_Athena_ShieldGenerator_Heal_C::Row_ShieldCap' has a wrong offset!");

}

