#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Vent_Enter

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Vent_Enter.GCNL_Vent_Enter_C.ExecuteUbergraph_GCNL_Vent_Enter
// 0x02F8 (0x02F8 - 0x0000)
struct GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0010(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_1;                 // 0x00D0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x00E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x00F8(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x01B8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x01C8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x01F0(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0208(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0210(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0218(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0238(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue_1;           // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatineeCameraShake*                    CallFunc_Conv_MatineeCameraShake_ReturnValue;      // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter) == 0x000008, "Wrong alignment on GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter");
static_assert(sizeof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter) == 0x0002F8, "Wrong size on GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, EntryPoint) == 0x000000, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, K2Node_Event_MyTarget_1) == 0x000008, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, K2Node_Event_Parameters_1) == 0x000010, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, K2Node_Event_ParticleComponents_1) == 0x0000D0, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, K2Node_Event_AudioComponents_1) == 0x0000E0, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, K2Node_Event_MyTarget) == 0x0000F0, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, K2Node_Event_Parameters) == 0x0000F8, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, K2Node_Event_ParticleComponents) == 0x0001B8, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, K2Node_Event_AudioComponents) == 0x0001C8, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, K2Node_Event_BurstCameraShakeInstance) == 0x0001D8, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, K2Node_Event_BurstDecalInstance) == 0x0001E0, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0001E8, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0001EC, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0001F0, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000208, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000210, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000218, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000238, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_Location) == 0x000258, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_Normal) == 0x000264, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000270, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000278, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000280, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000288, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000290, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x000294, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000298, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0002A0, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x0002A8, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, K2Node_DynamicCast_bSuccess) == 0x0002B0, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0002B1, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0002B8, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_IsLocallyControlled_ReturnValue) == 0x0002C0, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_GetController_ReturnValue) == 0x0002C8, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, K2Node_DynamicCast_AsPlayer_Controller) == 0x0002D0, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, K2Node_DynamicCast_bSuccess_1) == 0x0002D8, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_StartCameraShake_ReturnValue) == 0x0002E0, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_StartCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_StartCameraShake_ReturnValue_1) == 0x0002E8, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_StartCameraShake_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter, CallFunc_Conv_MatineeCameraShake_ReturnValue) == 0x0002F0, "Member 'GCNL_Vent_Enter_C_ExecuteUbergraph_GCNL_Vent_Enter::CallFunc_Conv_MatineeCameraShake_ReturnValue' has a wrong offset!");

// Function GCNL_Vent_Enter.GCNL_Vent_Enter_C.OnLoopingStart
// 0x00E8 (0x00E8 - 0x0000)
struct GCNL_Vent_Enter_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCNL_Vent_Enter_C_OnLoopingStart) == 0x000008, "Wrong alignment on GCNL_Vent_Enter_C_OnLoopingStart");
static_assert(sizeof(GCNL_Vent_Enter_C_OnLoopingStart) == 0x0000E8, "Wrong size on GCNL_Vent_Enter_C_OnLoopingStart");
static_assert(offsetof(GCNL_Vent_Enter_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GCNL_Vent_Enter_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GCNL_Vent_Enter_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_OnLoopingStart, ParticleComponents) == 0x0000C8, "Member 'GCNL_Vent_Enter_C_OnLoopingStart::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_OnLoopingStart, AudioComponents) == 0x0000D8, "Member 'GCNL_Vent_Enter_C_OnLoopingStart::AudioComponents' has a wrong offset!");

// Function GCNL_Vent_Enter.GCNL_Vent_Enter_C.OnRemoval
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_Vent_Enter_C_OnRemoval final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Vent_Enter_C_OnRemoval) == 0x000008, "Wrong alignment on GCNL_Vent_Enter_C_OnRemoval");
static_assert(sizeof(GCNL_Vent_Enter_C_OnRemoval) == 0x0000F8, "Wrong size on GCNL_Vent_Enter_C_OnRemoval");
static_assert(offsetof(GCNL_Vent_Enter_C_OnRemoval, MyTarget) == 0x000000, "Member 'GCNL_Vent_Enter_C_OnRemoval::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_OnRemoval, Parameters) == 0x000008, "Member 'GCNL_Vent_Enter_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_OnRemoval, ParticleComponents) == 0x0000C8, "Member 'GCNL_Vent_Enter_C_OnRemoval::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_OnRemoval, AudioComponents) == 0x0000D8, "Member 'GCNL_Vent_Enter_C_OnRemoval::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_OnRemoval, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCNL_Vent_Enter_C_OnRemoval::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Vent_Enter_C_OnRemoval, BurstDecalInstance) == 0x0000F0, "Member 'GCNL_Vent_Enter_C_OnRemoval::BurstDecalInstance' has a wrong offset!");

}

