#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_HidingProp_Teleporting_WilliePete

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Athena_HidingProp_Teleporting_WilliePete.GCNL_Athena_HidingProp_Teleporting_WilliePete_C.ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete
// 0x0240 (0x0240 - 0x0000)
struct GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0038(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_1;                 // 0x00F8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x0108(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0120(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x01E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x01F0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICameraLensEffectInterface> CallFunc_SpawnGenericCameraLensEffect_ReturnValue; // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_233[0x5];                                      // 0x0233(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete) == 0x000008, "Wrong alignment on GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete");
static_assert(sizeof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete) == 0x000240, "Wrong size on GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, EntryPoint) == 0x000000, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000018, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, K2Node_DynamicCast_AsActor) == 0x000020, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, K2Node_Event_MyTarget_1) == 0x000030, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, K2Node_Event_Parameters_1) == 0x000038, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, K2Node_Event_ParticleComponents_1) == 0x0000F8, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, K2Node_Event_AudioComponents_1) == 0x000108, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, K2Node_Event_MyTarget) == 0x000118, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, K2Node_Event_Parameters) == 0x000120, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, K2Node_Event_ParticleComponents) == 0x0001E0, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, K2Node_Event_AudioComponents) == 0x0001F0, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, K2Node_Event_BurstCameraShakeInstance) == 0x000200, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, K2Node_Event_BurstDecalInstance) == 0x000208, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000210, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, K2Node_DynamicCast_bSuccess_1) == 0x000218, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, CallFunc_SpawnGenericCameraLensEffect_ReturnValue) == 0x000220, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::CallFunc_SpawnGenericCameraLensEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, CallFunc_IsValid_ReturnValue_2) == 0x000230, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, CallFunc_IsLocallyControlled_ReturnValue) == 0x000231, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, CallFunc_IsValid_ReturnValue_3) == 0x000232, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete, CallFunc_SpawnSound2D_ReturnValue) == 0x000238, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");

// Function GCNL_Athena_HidingProp_Teleporting_WilliePete.GCNL_Athena_HidingProp_Teleporting_WilliePete_C.OnLoopingStart
// 0x00E8 (0x00E8 - 0x0000)
struct GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnLoopingStart) == 0x000008, "Wrong alignment on GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnLoopingStart");
static_assert(sizeof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnLoopingStart) == 0x0000E8, "Wrong size on GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnLoopingStart");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnLoopingStart, ParticleComponents) == 0x0000C8, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnLoopingStart::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnLoopingStart, AudioComponents) == 0x0000D8, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnLoopingStart::AudioComponents' has a wrong offset!");

// Function GCNL_Athena_HidingProp_Teleporting_WilliePete.GCNL_Athena_HidingProp_Teleporting_WilliePete_C.OnRemoval
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval) == 0x000008, "Wrong alignment on GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval");
static_assert(sizeof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval) == 0x0000F8, "Wrong size on GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval, MyTarget) == 0x000000, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval, Parameters) == 0x000008, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval, ParticleComponents) == 0x0000C8, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval, AudioComponents) == 0x0000D8, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval, BurstDecalInstance) == 0x0000F0, "Member 'GCNL_Athena_HidingProp_Teleporting_WilliePete_C_OnRemoval::BurstDecalInstance' has a wrong offset!");

}

