#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_RollingEffects_Parent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCNL_RollingEffects_Parent.GCNL_RollingEffects_Parent_C.ExecuteUbergraph_GCNL_RollingEffects_Parent
// 0x0210 (0x0210 - 0x0000)
struct GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents;                   // 0x00D0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x00E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0108(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents_1;                 // 0x01C8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x01D8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance_1;           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance_1;                 // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CallFunc_GetSoundAsset_Asset;                      // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent) == 0x000008, "Wrong alignment on GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent");
static_assert(sizeof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent) == 0x000210, "Wrong size on GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, EntryPoint) == 0x000000, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, K2Node_Event_MyTarget) == 0x000008, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, K2Node_Event_Parameters) == 0x000010, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, K2Node_Event_ParticleComponents) == 0x0000D0, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, K2Node_Event_AudioComponents) == 0x0000E0, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, K2Node_Event_BurstCameraShakeInstance) == 0x0000F0, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, K2Node_Event_BurstDecalInstance) == 0x0000F8, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, K2Node_Event_MyTarget_1) == 0x000100, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, K2Node_Event_Parameters_1) == 0x000108, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, K2Node_Event_ParticleComponents_1) == 0x0001C8, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, K2Node_Event_AudioComponents_1) == 0x0001D8, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, K2Node_Event_BurstCameraShakeInstance_1) == 0x0001E8, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::K2Node_Event_BurstCameraShakeInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, K2Node_Event_BurstDecalInstance_1) == 0x0001F0, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::K2Node_Event_BurstDecalInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, CallFunc_GetSoundAsset_Asset) == 0x0001F8, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::CallFunc_GetSoundAsset_Asset' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000200, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, CallFunc_IsValid_ReturnValue) == 0x000208, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000209, "Member 'GCNL_RollingEffects_Parent_C_ExecuteUbergraph_GCNL_RollingEffects_Parent::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function GCNL_RollingEffects_Parent.GCNL_RollingEffects_Parent_C.GetObjectSizeParam
// 0x0010 (0x0010 - 0x0000)
struct GCNL_RollingEffects_Parent_C_GetObjectSizeParam final
{
public:
	class AActor*                                 PhysicsObject_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Size;                                              // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesPhysicsObjectMeetSizeRequirement_ReturnValue; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesPhysicsObjectMeetSizeRequirement_ReturnValue_1; // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_RollingEffects_Parent_C_GetObjectSizeParam) == 0x000008, "Wrong alignment on GCNL_RollingEffects_Parent_C_GetObjectSizeParam");
static_assert(sizeof(GCNL_RollingEffects_Parent_C_GetObjectSizeParam) == 0x000010, "Wrong size on GCNL_RollingEffects_Parent_C_GetObjectSizeParam");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_GetObjectSizeParam, PhysicsObject_0) == 0x000000, "Member 'GCNL_RollingEffects_Parent_C_GetObjectSizeParam::PhysicsObject_0' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_GetObjectSizeParam, Size) == 0x000008, "Member 'GCNL_RollingEffects_Parent_C_GetObjectSizeParam::Size' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_GetObjectSizeParam, CallFunc_DoesPhysicsObjectMeetSizeRequirement_ReturnValue) == 0x00000C, "Member 'GCNL_RollingEffects_Parent_C_GetObjectSizeParam::CallFunc_DoesPhysicsObjectMeetSizeRequirement_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_GetObjectSizeParam, CallFunc_DoesPhysicsObjectMeetSizeRequirement_ReturnValue_1) == 0x00000D, "Member 'GCNL_RollingEffects_Parent_C_GetObjectSizeParam::CallFunc_DoesPhysicsObjectMeetSizeRequirement_ReturnValue_1' has a wrong offset!");

// Function GCNL_RollingEffects_Parent.GCNL_RollingEffects_Parent_C.GetSoundAsset
// 0x0038 (0x0038 - 0x0000)
struct GCNL_RollingEffects_Parent_C_GetSoundAsset final
{
public:
	class AActor*                                 PhysicsObject_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Asset;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetObjectSizeParam_Size;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_RollingEffects_Parent_C_GetSoundAsset) == 0x000008, "Wrong alignment on GCNL_RollingEffects_Parent_C_GetSoundAsset");
static_assert(sizeof(GCNL_RollingEffects_Parent_C_GetSoundAsset) == 0x000038, "Wrong size on GCNL_RollingEffects_Parent_C_GetSoundAsset");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_GetSoundAsset, PhysicsObject_0) == 0x000000, "Member 'GCNL_RollingEffects_Parent_C_GetSoundAsset::PhysicsObject_0' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_GetSoundAsset, Asset) == 0x000008, "Member 'GCNL_RollingEffects_Parent_C_GetSoundAsset::Asset' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_GetSoundAsset, Temp_int_Variable) == 0x000010, "Member 'GCNL_RollingEffects_Parent_C_GetSoundAsset::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_GetSoundAsset, CallFunc_GetObjectSizeParam_Size) == 0x000014, "Member 'GCNL_RollingEffects_Parent_C_GetSoundAsset::CallFunc_GetObjectSizeParam_Size' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_GetSoundAsset, Temp_bool_Variable) == 0x000018, "Member 'GCNL_RollingEffects_Parent_C_GetSoundAsset::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_GetSoundAsset, K2Node_Select_Default) == 0x000020, "Member 'GCNL_RollingEffects_Parent_C_GetSoundAsset::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_GetSoundAsset, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GCNL_RollingEffects_Parent_C_GetSoundAsset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_GetSoundAsset, K2Node_Select_Default_1) == 0x000030, "Member 'GCNL_RollingEffects_Parent_C_GetSoundAsset::K2Node_Select_Default_1' has a wrong offset!");

// Function GCNL_RollingEffects_Parent.GCNL_RollingEffects_Parent_C.OnApplicationGeneric
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_RollingEffects_Parent_C_OnApplicationGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_RollingEffects_Parent_C_OnApplicationGeneric) == 0x000008, "Wrong alignment on GCNL_RollingEffects_Parent_C_OnApplicationGeneric");
static_assert(sizeof(GCNL_RollingEffects_Parent_C_OnApplicationGeneric) == 0x0000F8, "Wrong size on GCNL_RollingEffects_Parent_C_OnApplicationGeneric");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_OnApplicationGeneric, MyTarget) == 0x000000, "Member 'GCNL_RollingEffects_Parent_C_OnApplicationGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_OnApplicationGeneric, Parameters) == 0x000008, "Member 'GCNL_RollingEffects_Parent_C_OnApplicationGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_OnApplicationGeneric, ParticleComponents) == 0x0000C8, "Member 'GCNL_RollingEffects_Parent_C_OnApplicationGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_OnApplicationGeneric, AudioComponents) == 0x0000D8, "Member 'GCNL_RollingEffects_Parent_C_OnApplicationGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_OnApplicationGeneric, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCNL_RollingEffects_Parent_C_OnApplicationGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_OnApplicationGeneric, BurstDecalInstance) == 0x0000F0, "Member 'GCNL_RollingEffects_Parent_C_OnApplicationGeneric::BurstDecalInstance' has a wrong offset!");

// Function GCNL_RollingEffects_Parent.GCNL_RollingEffects_Parent_C.OnRemovalGeneric
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_RollingEffects_Parent_C_OnRemovalGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_RollingEffects_Parent_C_OnRemovalGeneric) == 0x000008, "Wrong alignment on GCNL_RollingEffects_Parent_C_OnRemovalGeneric");
static_assert(sizeof(GCNL_RollingEffects_Parent_C_OnRemovalGeneric) == 0x0000F8, "Wrong size on GCNL_RollingEffects_Parent_C_OnRemovalGeneric");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_OnRemovalGeneric, MyTarget) == 0x000000, "Member 'GCNL_RollingEffects_Parent_C_OnRemovalGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_OnRemovalGeneric, Parameters) == 0x000008, "Member 'GCNL_RollingEffects_Parent_C_OnRemovalGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_OnRemovalGeneric, ParticleComponents) == 0x0000C8, "Member 'GCNL_RollingEffects_Parent_C_OnRemovalGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_OnRemovalGeneric, AudioComponents) == 0x0000D8, "Member 'GCNL_RollingEffects_Parent_C_OnRemovalGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_OnRemovalGeneric, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCNL_RollingEffects_Parent_C_OnRemovalGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_RollingEffects_Parent_C_OnRemovalGeneric, BurstDecalInstance) == 0x0000F0, "Member 'GCNL_RollingEffects_Parent_C_OnRemovalGeneric::BurstDecalInstance' has a wrong offset!");

}

