#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Zipline_Travel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Zipline_Travel.GCNL_Zipline_Travel_C
// 0x0020 (0x08F8 - 0x08D8)
class AGCNL_Zipline_Travel_C final : public AFortGameplayCueNotifyLoop_ZiplineTravel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AttachSoundAudioComp;                              // 0x08E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<bool>                                  NewVar_0;                                          // 0x08E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GCNL_Zipline_Travel(int32 EntryPoint);
	void OnApplicationGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnRemovalGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Zipline_Travel_C">();
	}
	static class AGCNL_Zipline_Travel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Zipline_Travel_C>();
	}
};
static_assert(alignof(AGCNL_Zipline_Travel_C) == 0x000008, "Wrong alignment on AGCNL_Zipline_Travel_C");
static_assert(sizeof(AGCNL_Zipline_Travel_C) == 0x0008F8, "Wrong size on AGCNL_Zipline_Travel_C");
static_assert(offsetof(AGCNL_Zipline_Travel_C, UberGraphFrame) == 0x0008D8, "Member 'AGCNL_Zipline_Travel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Zipline_Travel_C, AttachSoundAudioComp) == 0x0008E0, "Member 'AGCNL_Zipline_Travel_C::AttachSoundAudioComp' has a wrong offset!");
static_assert(offsetof(AGCNL_Zipline_Travel_C, NewVar_0) == 0x0008E8, "Member 'AGCNL_Zipline_Travel_C::NewVar_0' has a wrong offset!");

}

