#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Zipline_Downhill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Zipline_Downhill.GCNL_Zipline_Downhill_C
// 0x0028 (0x0830 - 0x0808)
class AGCNL_Zipline_Downhill_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0808(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatineeCameraShake*                    matineeCamShake;                                   // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinCamShakeAmp;                                    // 0x0820(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxCamShakeAmp;                                    // 0x0824(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinCamShakeFreq;                                   // 0x0828(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxCamShakeFreq;                                   // 0x082C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void cameraShakeTimer();
	void ExecuteUbergraph_GCNL_Zipline_Downhill(int32 EntryPoint);
	void OnApplicationGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnLoopingStartGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void OnRemovalGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Zipline_Downhill_C">();
	}
	static class AGCNL_Zipline_Downhill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Zipline_Downhill_C>();
	}
};
static_assert(alignof(AGCNL_Zipline_Downhill_C) == 0x000008, "Wrong alignment on AGCNL_Zipline_Downhill_C");
static_assert(sizeof(AGCNL_Zipline_Downhill_C) == 0x000830, "Wrong size on AGCNL_Zipline_Downhill_C");
static_assert(offsetof(AGCNL_Zipline_Downhill_C, UberGraphFrame) == 0x000808, "Member 'AGCNL_Zipline_Downhill_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Zipline_Downhill_C, PlayerPawn) == 0x000810, "Member 'AGCNL_Zipline_Downhill_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AGCNL_Zipline_Downhill_C, matineeCamShake) == 0x000818, "Member 'AGCNL_Zipline_Downhill_C::matineeCamShake' has a wrong offset!");
static_assert(offsetof(AGCNL_Zipline_Downhill_C, MinCamShakeAmp) == 0x000820, "Member 'AGCNL_Zipline_Downhill_C::MinCamShakeAmp' has a wrong offset!");
static_assert(offsetof(AGCNL_Zipline_Downhill_C, MaxCamShakeAmp) == 0x000824, "Member 'AGCNL_Zipline_Downhill_C::MaxCamShakeAmp' has a wrong offset!");
static_assert(offsetof(AGCNL_Zipline_Downhill_C, MinCamShakeFreq) == 0x000828, "Member 'AGCNL_Zipline_Downhill_C::MinCamShakeFreq' has a wrong offset!");
static_assert(offsetof(AGCNL_Zipline_Downhill_C, MaxCamShakeFreq) == 0x00082C, "Member 'AGCNL_Zipline_Downhill_C::MaxCamShakeFreq' has a wrong offset!");

}

