#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_CurieState_ElementAttached_Fire

#include "Basic.hpp"

#include "B_Enum_PlayerFireStates_structs.hpp"
#include "Curie_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCNL_CurieState_ElementAttached_Fire.GCNL_CurieState_ElementAttached_Fire_C.ActivateBodyFX
// 0x0018 (0x0018 - 0x0000)
struct GCNL_CurieState_ElementAttached_Fire_C_ActivateBodyFX final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_CurieState_ElementAttached_Fire_C_ActivateBodyFX) == 0x000008, "Wrong alignment on GCNL_CurieState_ElementAttached_Fire_C_ActivateBodyFX");
static_assert(sizeof(GCNL_CurieState_ElementAttached_Fire_C_ActivateBodyFX) == 0x000018, "Wrong size on GCNL_CurieState_ElementAttached_Fire_C_ActivateBodyFX");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ActivateBodyFX, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ActivateBodyFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ActivateBodyFX, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000008, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ActivateBodyFX::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ActivateBodyFX, CallFunc_IsActive_ReturnValue) == 0x000010, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ActivateBodyFX::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function GCNL_CurieState_ElementAttached_Fire.GCNL_CurieState_ElementAttached_Fire_C.DeactivateBodyFX
// 0x0001 (0x0001 - 0x0000)
struct GCNL_CurieState_ElementAttached_Fire_C_DeactivateBodyFX final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_CurieState_ElementAttached_Fire_C_DeactivateBodyFX) == 0x000001, "Wrong alignment on GCNL_CurieState_ElementAttached_Fire_C_DeactivateBodyFX");
static_assert(sizeof(GCNL_CurieState_ElementAttached_Fire_C_DeactivateBodyFX) == 0x000001, "Wrong size on GCNL_CurieState_ElementAttached_Fire_C_DeactivateBodyFX");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_DeactivateBodyFX, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GCNL_CurieState_ElementAttached_Fire_C_DeactivateBodyFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GCNL_CurieState_ElementAttached_Fire.GCNL_CurieState_ElementAttached_Fire_C.ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire
// 0x0278 (0x0278 - 0x0000)
struct GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0020(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_1;                 // 0x00E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x00F0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance_1;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance_1;                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0118(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x01D8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x01E8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCurieManager*                      CallFunc_GetCurieManager_ReturnValue;              // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& StateIdentifier)> K2Node_CreateDelegate_OutputDelegate;              // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& StateIdentifier)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0230(0x0010)(ZeroConstructor, NoDestructor)
	EB_Enum_PlayerFireStates                      CallFunc_GetPlayerFireState_Player_State;          // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCurieManager*                      CallFunc_GetCurieManager_ReturnValue_1;            // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& StateIdentifier)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& StateIdentifier)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0260(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire) == 0x000008, "Wrong alignment on GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire");
static_assert(sizeof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire) == 0x000278, "Wrong size on GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, EntryPoint) == 0x000000, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_Event_MyTarget_1) == 0x000018, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_Event_Parameters_1) == 0x000020, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_Event_ParticleComponents_1) == 0x0000E0, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_Event_AudioComponents_1) == 0x0000F0, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_Event_BurstCameraShakeInstance_1) == 0x000100, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_Event_BurstCameraShakeInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_Event_BurstDecalInstance_1) == 0x000108, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_Event_BurstDecalInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_Event_MyTarget) == 0x000110, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_Event_Parameters) == 0x000118, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_Event_ParticleComponents) == 0x0001D8, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_Event_AudioComponents) == 0x0001E8, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_Event_BurstCameraShakeInstance) == 0x0001F8, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_Event_BurstDecalInstance) == 0x000200, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000208, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_DynamicCast_bSuccess) == 0x000210, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, CallFunc_GetCurieManager_ReturnValue) == 0x000218, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::CallFunc_GetCurieManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_CreateDelegate_OutputDelegate) == 0x000220, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_CreateDelegate_OutputDelegate_1) == 0x000230, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, CallFunc_GetPlayerFireState_Player_State) == 0x000240, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::CallFunc_GetPlayerFireState_Player_State' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, CallFunc_GetCurieManager_ReturnValue_1) == 0x000248, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::CallFunc_GetCurieManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_CreateDelegate_OutputDelegate_2) == 0x000250, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, K2Node_CreateDelegate_OutputDelegate_3) == 0x000260, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000270, "Member 'GCNL_CurieState_ElementAttached_Fire_C_ExecuteUbergraph_GCNL_CurieState_ElementAttached_Fire::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");

// Function GCNL_CurieState_ElementAttached_Fire.GCNL_CurieState_ElementAttached_Fire_C.FadeOnFireAudioComponent
// 0x0001 (0x0001 - 0x0000)
struct GCNL_CurieState_ElementAttached_Fire_C_FadeOnFireAudioComponent final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_CurieState_ElementAttached_Fire_C_FadeOnFireAudioComponent) == 0x000001, "Wrong alignment on GCNL_CurieState_ElementAttached_Fire_C_FadeOnFireAudioComponent");
static_assert(sizeof(GCNL_CurieState_ElementAttached_Fire_C_FadeOnFireAudioComponent) == 0x000001, "Wrong size on GCNL_CurieState_ElementAttached_Fire_C_FadeOnFireAudioComponent");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_FadeOnFireAudioComponent, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GCNL_CurieState_ElementAttached_Fire_C_FadeOnFireAudioComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GCNL_CurieState_ElementAttached_Fire.GCNL_CurieState_ElementAttached_Fire_C.GetPlayerFireState
// 0x0003 (0x0003 - 0x0000)
struct GCNL_CurieState_ElementAttached_Fire_C_GetPlayerFireState final
{
public:
	EB_Enum_PlayerFireStates                      Player_State;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCurieStateAttached_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCurieStateAttached_ReturnValue_1;      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_CurieState_ElementAttached_Fire_C_GetPlayerFireState) == 0x000001, "Wrong alignment on GCNL_CurieState_ElementAttached_Fire_C_GetPlayerFireState");
static_assert(sizeof(GCNL_CurieState_ElementAttached_Fire_C_GetPlayerFireState) == 0x000003, "Wrong size on GCNL_CurieState_ElementAttached_Fire_C_GetPlayerFireState");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_GetPlayerFireState, Player_State) == 0x000000, "Member 'GCNL_CurieState_ElementAttached_Fire_C_GetPlayerFireState::Player_State' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_GetPlayerFireState, CallFunc_HasCurieStateAttached_ReturnValue) == 0x000001, "Member 'GCNL_CurieState_ElementAttached_Fire_C_GetPlayerFireState::CallFunc_HasCurieStateAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_GetPlayerFireState, CallFunc_HasCurieStateAttached_ReturnValue_1) == 0x000002, "Member 'GCNL_CurieState_ElementAttached_Fire_C_GetPlayerFireState::CallFunc_HasCurieStateAttached_ReturnValue_1' has a wrong offset!");

// Function GCNL_CurieState_ElementAttached_Fire.GCNL_CurieState_ElementAttached_Fire_C.OnApplication
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_CurieState_ElementAttached_Fire_C_OnApplication final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_CurieState_ElementAttached_Fire_C_OnApplication) == 0x000008, "Wrong alignment on GCNL_CurieState_ElementAttached_Fire_C_OnApplication");
static_assert(sizeof(GCNL_CurieState_ElementAttached_Fire_C_OnApplication) == 0x0000F8, "Wrong size on GCNL_CurieState_ElementAttached_Fire_C_OnApplication");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnApplication, MyTarget) == 0x000000, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnApplication::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnApplication, Parameters) == 0x000008, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnApplication, ParticleComponents) == 0x0000C8, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnApplication::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnApplication, AudioComponents) == 0x0000D8, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnApplication::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnApplication, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnApplication::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnApplication, BurstDecalInstance) == 0x0000F0, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnApplication::BurstDecalInstance' has a wrong offset!");

// Function GCNL_CurieState_ElementAttached_Fire.GCNL_CurieState_ElementAttached_Fire_C.OnCurieStateChanged
// 0x0018 (0x0018 - 0x0000)
struct GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged final
{
public:
	class UObject*                                Owner_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCurieContainerHandle                  ContainerHandle;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           StateIdentifier;                                   // 0x000C(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EB_Enum_PlayerFireStates                      CallFunc_GetPlayerFireState_Player_State;          // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged) == 0x000008, "Wrong alignment on GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged");
static_assert(sizeof(GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged) == 0x000018, "Wrong size on GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged, Owner_0) == 0x000000, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged::Owner_0' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged, ContainerHandle) == 0x000008, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged::ContainerHandle' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged, StateIdentifier) == 0x00000C, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged::StateIdentifier' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000014, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x000015, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged, CallFunc_GetPlayerFireState_Player_State) == 0x000016, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged::CallFunc_GetPlayerFireState_Player_State' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged, CallFunc_BooleanOR_ReturnValue) == 0x000017, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnCurieStateChanged::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GCNL_CurieState_ElementAttached_Fire.GCNL_CurieState_ElementAttached_Fire_C.OnRemoval
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_CurieState_ElementAttached_Fire_C_OnRemoval final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_CurieState_ElementAttached_Fire_C_OnRemoval) == 0x000008, "Wrong alignment on GCNL_CurieState_ElementAttached_Fire_C_OnRemoval");
static_assert(sizeof(GCNL_CurieState_ElementAttached_Fire_C_OnRemoval) == 0x0000F8, "Wrong size on GCNL_CurieState_ElementAttached_Fire_C_OnRemoval");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnRemoval, MyTarget) == 0x000000, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnRemoval::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnRemoval, Parameters) == 0x000008, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnRemoval, ParticleComponents) == 0x0000C8, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnRemoval::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnRemoval, AudioComponents) == 0x0000D8, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnRemoval::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnRemoval, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnRemoval::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_OnRemoval, BurstDecalInstance) == 0x0000F0, "Member 'GCNL_CurieState_ElementAttached_Fire_C_OnRemoval::BurstDecalInstance' has a wrong offset!");

// Function GCNL_CurieState_ElementAttached_Fire.GCNL_CurieState_ElementAttached_Fire_C.SetBodyFXParameters
// 0x0034 (0x0034 - 0x0000)
struct GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters final
{
public:
	EB_Enum_PlayerFireStates                      PreviousPlayerFireState_0;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EB_Enum_PlayerFireStates                      Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EB_Enum_PlayerFireStates                      Temp_byte_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters) == 0x000004, "Wrong alignment on GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters");
static_assert(sizeof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters) == 0x000034, "Wrong size on GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters, PreviousPlayerFireState_0) == 0x000000, "Member 'GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters::PreviousPlayerFireState_0' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters, Temp_byte_Variable) == 0x000001, "Member 'GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters, Temp_float_Variable) == 0x000004, "Member 'GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters, Temp_float_Variable_1) == 0x000008, "Member 'GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters, Temp_byte_Variable_1) == 0x00000C, "Member 'GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters, Temp_float_Variable_2) == 0x000010, "Member 'GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters, Temp_float_Variable_3) == 0x000014, "Member 'GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters, Temp_float_Variable_4) == 0x000018, "Member 'GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters, CallFunc_IsLocallyControlled_ReturnValue) == 0x00001D, "Member 'GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters, K2Node_Select_Default) == 0x000020, "Member 'GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000024, "Member 'GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters, K2Node_Select_Default_1) == 0x000028, "Member 'GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00002C, "Member 'GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters, CallFunc_Add_FloatFloat_ReturnValue) == 0x000030, "Member 'GCNL_CurieState_ElementAttached_Fire_C_SetBodyFXParameters::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function GCNL_CurieState_ElementAttached_Fire.GCNL_CurieState_ElementAttached_Fire_C.UpdatePlayerVisualsByState
// 0x0010 (0x0010 - 0x0000)
struct GCNL_CurieState_ElementAttached_Fire_C_UpdatePlayerVisualsByState final
{
public:
	EB_Enum_PlayerFireStates                      PlayerState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_CurieState_ElementAttached_Fire_C_UpdatePlayerVisualsByState) == 0x000008, "Wrong alignment on GCNL_CurieState_ElementAttached_Fire_C_UpdatePlayerVisualsByState");
static_assert(sizeof(GCNL_CurieState_ElementAttached_Fire_C_UpdatePlayerVisualsByState) == 0x000010, "Wrong size on GCNL_CurieState_ElementAttached_Fire_C_UpdatePlayerVisualsByState");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_UpdatePlayerVisualsByState, PlayerState) == 0x000000, "Member 'GCNL_CurieState_ElementAttached_Fire_C_UpdatePlayerVisualsByState::PlayerState' has a wrong offset!");
static_assert(offsetof(GCNL_CurieState_ElementAttached_Fire_C_UpdatePlayerVisualsByState, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'GCNL_CurieState_ElementAttached_Fire_C_UpdatePlayerVisualsByState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
