#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GiftingUI

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "SocialUMG_classes.hpp"
#include "GiftingUI_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class GiftingUI.AthenaGiftConfirmedPanel
// 0x0028 (0x0358 - 0x0330)
class UAthenaGiftConfirmedPanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0x18];                                     // 0x0330(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         Text_RecipientInfo;                                // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Back;                                       // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftConfirmedPanel">();
	}
	static class UAthenaGiftConfirmedPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftConfirmedPanel>();
	}
};
static_assert(alignof(UAthenaGiftConfirmedPanel) == 0x000008, "Wrong alignment on UAthenaGiftConfirmedPanel");
static_assert(sizeof(UAthenaGiftConfirmedPanel) == 0x000358, "Wrong size on UAthenaGiftConfirmedPanel");
static_assert(offsetof(UAthenaGiftConfirmedPanel, Text_RecipientInfo) == 0x000348, "Member 'UAthenaGiftConfirmedPanel::Text_RecipientInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftConfirmedPanel, Button_Back) == 0x000350, "Member 'UAthenaGiftConfirmedPanel::Button_Back' has a wrong offset!");

// Class GiftingUI.AthenaGiftingConfirmationScreen
// 0x0158 (0x0488 - 0x0330)
class UAthenaGiftingConfirmationScreen final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0x30];                                     // 0x0330(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               PresentedGiftableOfferInfo;                        // 0x0360(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStoreFrontOfferInfo*               PresentedOptionalTokenOfferInfo;                   // 0x0368(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_370[0xBC];                                     // 0x0370(0x00BC)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinGiftSubmissionDelay;                            // 0x042C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxGiftSubmissionDelay;                            // 0x0430(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_434[0x14];                                     // 0x0434(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    Button_WrapOptions;                                // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Back;                                       // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_MobileClose;                                // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_MtxWallet;                                  // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingPurchasePanel*            Panel_GiftingPurchase;                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingWrapOptionsPanel*         Panel_WrapOptions;                                 // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftConfirmedPanel*              Panel_GiftConfirmed;                               // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingErrorsPanel*              Panel_GiftingErrors;                               // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Dismiss();
	void HandleGiftSent(bool bSuccess, const TArray<class FString>& IneligibleAccounts, const TArray<class FString>& ErrorCodes);
	void HandleTokenOfferPurchaseComplete(bool bSuccess, const TArray<struct FPurchasedItemInfo>& PurchasedItems);
	void OnPresentationModeChanged(EGiftingPresentationMode NewMode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingConfirmationScreen">();
	}
	static class UAthenaGiftingConfirmationScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingConfirmationScreen>();
	}
};
static_assert(alignof(UAthenaGiftingConfirmationScreen) == 0x000008, "Wrong alignment on UAthenaGiftingConfirmationScreen");
static_assert(sizeof(UAthenaGiftingConfirmationScreen) == 0x000488, "Wrong size on UAthenaGiftingConfirmationScreen");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, PresentedGiftableOfferInfo) == 0x000360, "Member 'UAthenaGiftingConfirmationScreen::PresentedGiftableOfferInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, PresentedOptionalTokenOfferInfo) == 0x000368, "Member 'UAthenaGiftingConfirmationScreen::PresentedOptionalTokenOfferInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, MinGiftSubmissionDelay) == 0x00042C, "Member 'UAthenaGiftingConfirmationScreen::MinGiftSubmissionDelay' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, MaxGiftSubmissionDelay) == 0x000430, "Member 'UAthenaGiftingConfirmationScreen::MaxGiftSubmissionDelay' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Button_WrapOptions) == 0x000448, "Member 'UAthenaGiftingConfirmationScreen::Button_WrapOptions' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Button_Back) == 0x000450, "Member 'UAthenaGiftingConfirmationScreen::Button_Back' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Button_MobileClose) == 0x000458, "Member 'UAthenaGiftingConfirmationScreen::Button_MobileClose' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Button_MtxWallet) == 0x000460, "Member 'UAthenaGiftingConfirmationScreen::Button_MtxWallet' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Panel_GiftingPurchase) == 0x000468, "Member 'UAthenaGiftingConfirmationScreen::Panel_GiftingPurchase' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Panel_WrapOptions) == 0x000470, "Member 'UAthenaGiftingConfirmationScreen::Panel_WrapOptions' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Panel_GiftConfirmed) == 0x000478, "Member 'UAthenaGiftingConfirmationScreen::Panel_GiftConfirmed' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Panel_GiftingErrors) == 0x000480, "Member 'UAthenaGiftingConfirmationScreen::Panel_GiftingErrors' has a wrong offset!");

// Class GiftingUI.AthenaGiftingErrorsPanel
// 0x0060 (0x0390 - 0x0330)
class UAthenaGiftingErrorsPanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0x30];                                     // 0x0330(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         Text_RecipientInfo;                                // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_Title;                                        // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_MobileClose;                                // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Back;                                       // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Continue;                                   // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_Items;                                    // 0x0388(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void UpdateGiftEligibility(bool bStillGiftable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingErrorsPanel">();
	}
	static class UAthenaGiftingErrorsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingErrorsPanel>();
	}
};
static_assert(alignof(UAthenaGiftingErrorsPanel) == 0x000008, "Wrong alignment on UAthenaGiftingErrorsPanel");
static_assert(sizeof(UAthenaGiftingErrorsPanel) == 0x000390, "Wrong size on UAthenaGiftingErrorsPanel");
static_assert(offsetof(UAthenaGiftingErrorsPanel, Text_RecipientInfo) == 0x000360, "Member 'UAthenaGiftingErrorsPanel::Text_RecipientInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingErrorsPanel, Text_Title) == 0x000368, "Member 'UAthenaGiftingErrorsPanel::Text_Title' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingErrorsPanel, Button_MobileClose) == 0x000370, "Member 'UAthenaGiftingErrorsPanel::Button_MobileClose' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingErrorsPanel, Button_Back) == 0x000378, "Member 'UAthenaGiftingErrorsPanel::Button_Back' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingErrorsPanel, Button_Continue) == 0x000380, "Member 'UAthenaGiftingErrorsPanel::Button_Continue' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingErrorsPanel, TileView_Items) == 0x000388, "Member 'UAthenaGiftingErrorsPanel::TileView_Items' has a wrong offset!");

// Class GiftingUI.AthenaGiftingPriceWidget
// 0x0020 (0x0290 - 0x0270)
class UAthenaGiftingPriceWidget final : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       Text_RealMoneyPrice;                               // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_FinalPrice;                                   // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RegularPrice;                                 // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_SalePrice;                                 // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetPresentationMode(EGiftingPricePresentationMode Mode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingPriceWidget">();
	}
	static class UAthenaGiftingPriceWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingPriceWidget>();
	}
};
static_assert(alignof(UAthenaGiftingPriceWidget) == 0x000008, "Wrong alignment on UAthenaGiftingPriceWidget");
static_assert(sizeof(UAthenaGiftingPriceWidget) == 0x000290, "Wrong size on UAthenaGiftingPriceWidget");
static_assert(offsetof(UAthenaGiftingPriceWidget, Text_RealMoneyPrice) == 0x000270, "Member 'UAthenaGiftingPriceWidget::Text_RealMoneyPrice' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPriceWidget, Text_FinalPrice) == 0x000278, "Member 'UAthenaGiftingPriceWidget::Text_FinalPrice' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPriceWidget, Text_RegularPrice) == 0x000280, "Member 'UAthenaGiftingPriceWidget::Text_RegularPrice' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPriceWidget, Overlay_SalePrice) == 0x000288, "Member 'UAthenaGiftingPriceWidget::Overlay_SalePrice' has a wrong offset!");

// Class GiftingUI.AthenaGiftingPurchaseButton
// 0x0010 (0x0F10 - 0x0F00)
class UAthenaGiftingPurchaseButton final : public UCommonButtonLegacy
{
public:
	class UAthenaGiftingPriceWidget*              Widget_Price;                                      // 0x0EF8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0F00(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F08[0x8];                                      // 0x0F08(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingPurchaseButton">();
	}
	static class UAthenaGiftingPurchaseButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingPurchaseButton>();
	}
};
static_assert(alignof(UAthenaGiftingPurchaseButton) == 0x000010, "Wrong alignment on UAthenaGiftingPurchaseButton");
static_assert(sizeof(UAthenaGiftingPurchaseButton) == 0x000F10, "Wrong size on UAthenaGiftingPurchaseButton");
static_assert(offsetof(UAthenaGiftingPurchaseButton, Widget_Price) == 0x000EF8, "Member 'UAthenaGiftingPurchaseButton::Widget_Price' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchaseButton, Text_Title) == 0x000F00, "Member 'UAthenaGiftingPurchaseButton::Text_Title' has a wrong offset!");

// Class GiftingUI.AthenaGiftingPurchasePanel
// 0x0048 (0x0378 - 0x0330)
class UAthenaGiftingPurchasePanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0x18];                                     // 0x0330(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaGiftingPurchaseButton*           Button_PurchaseGift;                               // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSocialAvatarIcon*                  Avatar_MemberIcon;                                 // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_SocialNameInfo;                               // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemsCount;                                   // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_OfferName;                                    // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_Items;                                    // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void PlayIntroAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingPurchasePanel">();
	}
	static class UAthenaGiftingPurchasePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingPurchasePanel>();
	}
};
static_assert(alignof(UAthenaGiftingPurchasePanel) == 0x000008, "Wrong alignment on UAthenaGiftingPurchasePanel");
static_assert(sizeof(UAthenaGiftingPurchasePanel) == 0x000378, "Wrong size on UAthenaGiftingPurchasePanel");
static_assert(offsetof(UAthenaGiftingPurchasePanel, Button_PurchaseGift) == 0x000348, "Member 'UAthenaGiftingPurchasePanel::Button_PurchaseGift' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchasePanel, Avatar_MemberIcon) == 0x000350, "Member 'UAthenaGiftingPurchasePanel::Avatar_MemberIcon' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchasePanel, Text_SocialNameInfo) == 0x000358, "Member 'UAthenaGiftingPurchasePanel::Text_SocialNameInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchasePanel, Text_ItemsCount) == 0x000360, "Member 'UAthenaGiftingPurchasePanel::Text_ItemsCount' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchasePanel, Text_OfferName) == 0x000368, "Member 'UAthenaGiftingPurchasePanel::Text_OfferName' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchasePanel, TileView_Items) == 0x000370, "Member 'UAthenaGiftingPurchasePanel::TileView_Items' has a wrong offset!");

// Class GiftingUI.AthenaGiftingScreen
// 0x01E0 (0x07B8 - 0x05D8)
class UAthenaGiftingScreen final : public UFortItemPreviewScreen
{
public:
	uint8                                         Pad_5D8[0x8];                                      // 0x05D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGiftingUserSearchWidget*           SearchWidget_SocialSearchWidget;                   // 0x05E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortGiftingSocialUserListView*         ListView_Recipients;                               // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_Items;                                    // 0x05F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Back;                                       // 0x05F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MobileClose;                                // 0x0600(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_GiftingPolicy;                              // 0x0608(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CameraControl;                              // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_OfferName;                                    // 0x0618(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_VBucksOffCount;                               // 0x0620(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ShownItemIndex;                               // 0x0628(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_NoContent;                                    // 0x0630(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_OfferItemOwnedCount;                      // 0x0638(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Container_VBucksOffViolator;                       // 0x0640(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_GiftCount;                                // 0x0648(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingPriceWidget*              Widget_Price;                                      // 0x0650(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaLockerItemInfo*                  Widget_ItemInfo;                                   // 0x0658(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_FilterTabs;                               // 0x0660(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    ActionWidget_FilterTabsPrevious;                   // 0x0668(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    ActionWidget_FilterTabsNext;                       // 0x0670(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingConfirmationScreen*       ActivatableWidget_GiftingConfirmation;             // 0x0678(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ItemCyclingInterval;                               // 0x0680(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_684[0x4];                                      // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    FilterTabsPreviousAction;                          // 0x0688(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    FilterTabsNextAction;                              // 0x0698(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	class FText                                   RegularGiftingPolicy;                              // 0x06A8(0x0018)(Edit, NativeAccessSpecifierPrivate)
	class FText                                   BattlePassGiftingPolicy;                           // 0x06C0(0x0018)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6D8[0x60];                                     // 0x06D8(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UCommonButtonLegacy*, EFilterType> FilterMap;                                         // 0x0738(0x0050)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupLegacy*               FilterGroup;                                       // 0x0788(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortItemDefinition*>            ItemDefinitions;                                   // 0x0790(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UFortItemDefinition*                    PresentedItemDefinition;                           // 0x07A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStoreFrontOfferInfo*               GiftableOfferInfo;                                 // 0x07A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStoreFrontOfferInfo*               OptionalTokenOfferInfo;                            // 0x07B0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnFilterChanged(EFilterType FilterType);
	void OnFriendSelectionChanged();
	void OnPartyListUpdated(bool bEmpty);
	void OnPresentationModeChanged(EGiftingScreenPresentationMode Mode);
	void OnSetupFilterTabButton(class UCommonButtonLegacy* Button, EFilterType FilterType);
	void OnShownItemChanged();
	void OnShowSearchWarningText(bool bShow);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingScreen">();
	}
	static class UAthenaGiftingScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingScreen>();
	}
};
static_assert(alignof(UAthenaGiftingScreen) == 0x000008, "Wrong alignment on UAthenaGiftingScreen");
static_assert(sizeof(UAthenaGiftingScreen) == 0x0007B8, "Wrong size on UAthenaGiftingScreen");
static_assert(offsetof(UAthenaGiftingScreen, SearchWidget_SocialSearchWidget) == 0x0005E0, "Member 'UAthenaGiftingScreen::SearchWidget_SocialSearchWidget' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ListView_Recipients) == 0x0005E8, "Member 'UAthenaGiftingScreen::ListView_Recipients' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, TileView_Items) == 0x0005F0, "Member 'UAthenaGiftingScreen::TileView_Items' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Button_Back) == 0x0005F8, "Member 'UAthenaGiftingScreen::Button_Back' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Button_MobileClose) == 0x000600, "Member 'UAthenaGiftingScreen::Button_MobileClose' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Button_GiftingPolicy) == 0x000608, "Member 'UAthenaGiftingScreen::Button_GiftingPolicy' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Button_CameraControl) == 0x000610, "Member 'UAthenaGiftingScreen::Button_CameraControl' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Text_OfferName) == 0x000618, "Member 'UAthenaGiftingScreen::Text_OfferName' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Text_VBucksOffCount) == 0x000620, "Member 'UAthenaGiftingScreen::Text_VBucksOffCount' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Text_ShownItemIndex) == 0x000628, "Member 'UAthenaGiftingScreen::Text_ShownItemIndex' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Text_NoContent) == 0x000630, "Member 'UAthenaGiftingScreen::Text_NoContent' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, RichText_OfferItemOwnedCount) == 0x000638, "Member 'UAthenaGiftingScreen::RichText_OfferItemOwnedCount' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Container_VBucksOffViolator) == 0x000640, "Member 'UAthenaGiftingScreen::Container_VBucksOffViolator' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, RichText_GiftCount) == 0x000648, "Member 'UAthenaGiftingScreen::RichText_GiftCount' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Widget_Price) == 0x000650, "Member 'UAthenaGiftingScreen::Widget_Price' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Widget_ItemInfo) == 0x000658, "Member 'UAthenaGiftingScreen::Widget_ItemInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, EntryBox_FilterTabs) == 0x000660, "Member 'UAthenaGiftingScreen::EntryBox_FilterTabs' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ActionWidget_FilterTabsPrevious) == 0x000668, "Member 'UAthenaGiftingScreen::ActionWidget_FilterTabsPrevious' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ActionWidget_FilterTabsNext) == 0x000670, "Member 'UAthenaGiftingScreen::ActionWidget_FilterTabsNext' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ActivatableWidget_GiftingConfirmation) == 0x000678, "Member 'UAthenaGiftingScreen::ActivatableWidget_GiftingConfirmation' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ItemCyclingInterval) == 0x000680, "Member 'UAthenaGiftingScreen::ItemCyclingInterval' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, FilterTabsPreviousAction) == 0x000688, "Member 'UAthenaGiftingScreen::FilterTabsPreviousAction' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, FilterTabsNextAction) == 0x000698, "Member 'UAthenaGiftingScreen::FilterTabsNextAction' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, RegularGiftingPolicy) == 0x0006A8, "Member 'UAthenaGiftingScreen::RegularGiftingPolicy' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, BattlePassGiftingPolicy) == 0x0006C0, "Member 'UAthenaGiftingScreen::BattlePassGiftingPolicy' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, FilterMap) == 0x000738, "Member 'UAthenaGiftingScreen::FilterMap' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, FilterGroup) == 0x000788, "Member 'UAthenaGiftingScreen::FilterGroup' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ItemDefinitions) == 0x000790, "Member 'UAthenaGiftingScreen::ItemDefinitions' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, PresentedItemDefinition) == 0x0007A0, "Member 'UAthenaGiftingScreen::PresentedItemDefinition' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, GiftableOfferInfo) == 0x0007A8, "Member 'UAthenaGiftingScreen::GiftableOfferInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, OptionalTokenOfferInfo) == 0x0007B0, "Member 'UAthenaGiftingScreen::OptionalTokenOfferInfo' has a wrong offset!");

// Class GiftingUI.AthenaGiftingWrapOptionsPanel
// 0x0068 (0x0398 - 0x0330)
class UAthenaGiftingWrapOptionsPanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0x28];                                     // 0x0330(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UFortGiftBoxItemDefinition>> GiftBoxes;                                         // 0x0358(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UFortGiftBoxItemDefinition*>     GiftBoxItemDefs;                                   // 0x0368(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_378[0x10];                                     // 0x0378(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    Button_ConfirmWrap;                                // 0x0388(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_WrapOptions;                              // 0x0390(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingWrapOptionsPanel">();
	}
	static class UAthenaGiftingWrapOptionsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingWrapOptionsPanel>();
	}
};
static_assert(alignof(UAthenaGiftingWrapOptionsPanel) == 0x000008, "Wrong alignment on UAthenaGiftingWrapOptionsPanel");
static_assert(sizeof(UAthenaGiftingWrapOptionsPanel) == 0x000398, "Wrong size on UAthenaGiftingWrapOptionsPanel");
static_assert(offsetof(UAthenaGiftingWrapOptionsPanel, GiftBoxes) == 0x000358, "Member 'UAthenaGiftingWrapOptionsPanel::GiftBoxes' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingWrapOptionsPanel, GiftBoxItemDefs) == 0x000368, "Member 'UAthenaGiftingWrapOptionsPanel::GiftBoxItemDefs' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingWrapOptionsPanel, Button_ConfirmWrap) == 0x000388, "Member 'UAthenaGiftingWrapOptionsPanel::Button_ConfirmWrap' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingWrapOptionsPanel, TileView_WrapOptions) == 0x000390, "Member 'UAthenaGiftingWrapOptionsPanel::TileView_WrapOptions' has a wrong offset!");

// Class GiftingUI.FortGiftingSocialUserListEntry
// 0x00F0 (0x1000 - 0x0F10)
class UFortGiftingSocialUserListEntry final : public USocialListEntryBase
{
public:
	uint8                                         Pad_F10[0xC0];                                     // 0x0F10(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSocialAvatarIcon*                  Avatar_MemberIcon;                                 // 0x0FD0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USocialNameTextBlock*                   Text_SocialName;                                   // 0x0FD8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_EligibilityStatus;                        // 0x0FE0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_OwnedItems;                               // 0x0FE8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingPriceWidget*              Widget_Price;                                      // 0x0FF0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FF8[0x8];                                      // 0x0FF8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnHighlightedStateChanged(bool bInIsHighlighted, bool bPlayAnimation);
	void BP_OnTouchSelectionConfirmed();
	void OnRecipientStatusUpdated();
	void OnUserItemSet();
	void SetPresentationMode(ERecipientPresentationMode Mode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingSocialUserListEntry">();
	}
	static class UFortGiftingSocialUserListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingSocialUserListEntry>();
	}
};
static_assert(alignof(UFortGiftingSocialUserListEntry) == 0x000010, "Wrong alignment on UFortGiftingSocialUserListEntry");
static_assert(sizeof(UFortGiftingSocialUserListEntry) == 0x001000, "Wrong size on UFortGiftingSocialUserListEntry");
static_assert(offsetof(UFortGiftingSocialUserListEntry, Avatar_MemberIcon) == 0x000FD0, "Member 'UFortGiftingSocialUserListEntry::Avatar_MemberIcon' has a wrong offset!");
static_assert(offsetof(UFortGiftingSocialUserListEntry, Text_SocialName) == 0x000FD8, "Member 'UFortGiftingSocialUserListEntry::Text_SocialName' has a wrong offset!");
static_assert(offsetof(UFortGiftingSocialUserListEntry, RichText_EligibilityStatus) == 0x000FE0, "Member 'UFortGiftingSocialUserListEntry::RichText_EligibilityStatus' has a wrong offset!");
static_assert(offsetof(UFortGiftingSocialUserListEntry, RichText_OwnedItems) == 0x000FE8, "Member 'UFortGiftingSocialUserListEntry::RichText_OwnedItems' has a wrong offset!");
static_assert(offsetof(UFortGiftingSocialUserListEntry, Widget_Price) == 0x000FF0, "Member 'UFortGiftingSocialUserListEntry::Widget_Price' has a wrong offset!");

// Class GiftingUI.FortGiftingSocialUserListView
// 0x00F8 (0x03F8 - 0x0300)
class UFortGiftingSocialUserListView final : public USocialUserListViewBase
{
public:
	float                                         RefreshRecipientStatusDelay;                       // 0x0300(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_304[0xF4];                                     // 0x0304(0x00F4)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingSocialUserListView">();
	}
	static class UFortGiftingSocialUserListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingSocialUserListView>();
	}
};
static_assert(alignof(UFortGiftingSocialUserListView) == 0x000008, "Wrong alignment on UFortGiftingSocialUserListView");
static_assert(sizeof(UFortGiftingSocialUserListView) == 0x0003F8, "Wrong size on UFortGiftingSocialUserListView");
static_assert(offsetof(UFortGiftingSocialUserListView, RefreshRecipientStatusDelay) == 0x000300, "Member 'UFortGiftingSocialUserListView::RefreshRecipientStatusDelay' has a wrong offset!");

// Class GiftingUI.FortGiftingUserSearchWidget
// 0x0048 (0x02B8 - 0x0270)
class UFortGiftingUserSearchWidget final : public UCommonUserWidget
{
public:
	class UEditableText*                          EditableText_SearchFriends;                        // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ClearQuery;                                 // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_SubmitQuery;                                // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_288[0x30];                                     // 0x0288(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleSearchFriendsTextChanged(const class FText& Text);
	void HandleSearchFriendsTextEntered(const class FText& Text, ETextCommit CommitMethod);
	void OnSearchCommit(bool bSearchStringShort);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingUserSearchWidget">();
	}
	static class UFortGiftingUserSearchWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingUserSearchWidget>();
	}
};
static_assert(alignof(UFortGiftingUserSearchWidget) == 0x000008, "Wrong alignment on UFortGiftingUserSearchWidget");
static_assert(sizeof(UFortGiftingUserSearchWidget) == 0x0002B8, "Wrong size on UFortGiftingUserSearchWidget");
static_assert(offsetof(UFortGiftingUserSearchWidget, EditableText_SearchFriends) == 0x000270, "Member 'UFortGiftingUserSearchWidget::EditableText_SearchFriends' has a wrong offset!");
static_assert(offsetof(UFortGiftingUserSearchWidget, Button_ClearQuery) == 0x000278, "Member 'UFortGiftingUserSearchWidget::Button_ClearQuery' has a wrong offset!");
static_assert(offsetof(UFortGiftingUserSearchWidget, Button_SubmitQuery) == 0x000280, "Member 'UFortGiftingUserSearchWidget::Button_SubmitQuery' has a wrong offset!");

// Class GiftingUI.FortGiftingWrapOptionListEntry
// 0x0010 (0x0F10 - 0x0F00)
class UFortGiftingWrapOptionListEntry final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_EF8[0x8];                                      // 0x0EF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGiftBoxItemDefinition*             GiftBoxDefinition;                                 // 0x0F00(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLazyImage*                       Image_Gift;                                        // 0x0F08(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingWrapOptionListEntry">();
	}
	static class UFortGiftingWrapOptionListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingWrapOptionListEntry>();
	}
};
static_assert(alignof(UFortGiftingWrapOptionListEntry) == 0x000010, "Wrong alignment on UFortGiftingWrapOptionListEntry");
static_assert(sizeof(UFortGiftingWrapOptionListEntry) == 0x000F10, "Wrong size on UFortGiftingWrapOptionListEntry");
static_assert(offsetof(UFortGiftingWrapOptionListEntry, GiftBoxDefinition) == 0x000F00, "Member 'UFortGiftingWrapOptionListEntry::GiftBoxDefinition' has a wrong offset!");
static_assert(offsetof(UFortGiftingWrapOptionListEntry, Image_Gift) == 0x000F08, "Member 'UFortGiftingWrapOptionListEntry::Image_Gift' has a wrong offset!");

// Class GiftingUI.FortGiftingData
// 0x0028 (0x04F0 - 0x04C8)
class UFortGiftingData final : public UFortGameFeatureData
{
public:
	TSoftClassPtr<class UClass>                   GiftingScreenClass;                                // 0x04C8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingData">();
	}
	static class UFortGiftingData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingData>();
	}
};
static_assert(alignof(UFortGiftingData) == 0x000008, "Wrong alignment on UFortGiftingData");
static_assert(sizeof(UFortGiftingData) == 0x0004F0, "Wrong size on UFortGiftingData");
static_assert(offsetof(UFortGiftingData, GiftingScreenClass) == 0x0004C8, "Member 'UFortGiftingData::GiftingScreenClass' has a wrong offset!");

}

