#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GravityOverrideSettingStruct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct GravityOverrideSettingStruct.GravityOverrideSettingStruct
// 0x0038 (0x0038 - 0x0000)
struct FGravityOverrideSettingStruct final
{
public:
	struct FVector                                WindFrequency_28_9CBE863E417FC965C07809A2FE55ADFD; // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WindAmplitude_31_6A3DFE4A481AD4D7CB18D79F95CC88E8; // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WindOffset_32_C5F4D16F48D0BEDC3F0FA38B2648511B;    // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GravityOverride_15_9C3CF2B14934A1AC917C4C99F03AFC6E; // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   JointName_27_C74F3B2245EA319DE82A629FF3C17CCA;     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FGravityOverrideSettingStruct) == 0x000004, "Wrong alignment on FGravityOverrideSettingStruct");
static_assert(sizeof(FGravityOverrideSettingStruct) == 0x000038, "Wrong size on FGravityOverrideSettingStruct");
static_assert(offsetof(FGravityOverrideSettingStruct, WindFrequency_28_9CBE863E417FC965C07809A2FE55ADFD) == 0x000000, "Member 'FGravityOverrideSettingStruct::WindFrequency_28_9CBE863E417FC965C07809A2FE55ADFD' has a wrong offset!");
static_assert(offsetof(FGravityOverrideSettingStruct, WindAmplitude_31_6A3DFE4A481AD4D7CB18D79F95CC88E8) == 0x00000C, "Member 'FGravityOverrideSettingStruct::WindAmplitude_31_6A3DFE4A481AD4D7CB18D79F95CC88E8' has a wrong offset!");
static_assert(offsetof(FGravityOverrideSettingStruct, WindOffset_32_C5F4D16F48D0BEDC3F0FA38B2648511B) == 0x000018, "Member 'FGravityOverrideSettingStruct::WindOffset_32_C5F4D16F48D0BEDC3F0FA38B2648511B' has a wrong offset!");
static_assert(offsetof(FGravityOverrideSettingStruct, GravityOverride_15_9C3CF2B14934A1AC917C4C99F03AFC6E) == 0x000024, "Member 'FGravityOverrideSettingStruct::GravityOverride_15_9C3CF2B14934A1AC917C4C99F03AFC6E' has a wrong offset!");
static_assert(offsetof(FGravityOverrideSettingStruct, JointName_27_C74F3B2245EA319DE82A629FF3C17CCA) == 0x000030, "Member 'FGravityOverrideSettingStruct::JointName_27_C74F3B2245EA319DE82A629FF3C17CCA' has a wrong offset!");

}

