#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GravityOverrideParamsStruct

#include "Basic.hpp"

#include "GravityOverrideSettingStruct_structs.hpp"


namespace SDK
{

// UserDefinedStruct GravityOverrideParamsStruct.GravityOverrideParamsStruct
// 0x01F8 (0x01F8 - 0x0000)
struct FGravityOverrideParamsStruct final
{
public:
	struct FGravityOverrideSettingStruct          Skydive_GoingUp_28_C026BDA74BFBABA6672DFE8FFDAAFC1B; // 0x0000(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Skydive_FloatingDown_29_2CBF3D3F421785F8994502931454A81F; // 0x0038(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Skydive_DivingDown_30_EC7BEC4D406A8A98E60D7B9374C5E457; // 0x0070(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Skydive_Parachuting_31_A88C4A0A407F497561D31287CB20250F; // 0x00A8(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          OnGround_Standing_32_267DB1464D0D3A29D99E94ADFCB4AFEC; // 0x00E0(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          OnGround_Moving_33_807A66B64D7B3B2FCF080B833B8A6254; // 0x0118(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          EmoteOrMelee_34_CFCF66B5492987CBD638EC98EB34D572;  // 0x0150(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Swimming_35_33CE87CE4D4F712B1384E29115845962;      // 0x0188(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          Front_End_36_C7A4562A48E9BC9B4CD34D963CFC6490;     // 0x01C0(0x0038)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FGravityOverrideParamsStruct) == 0x000004, "Wrong alignment on FGravityOverrideParamsStruct");
static_assert(sizeof(FGravityOverrideParamsStruct) == 0x0001F8, "Wrong size on FGravityOverrideParamsStruct");
static_assert(offsetof(FGravityOverrideParamsStruct, Skydive_GoingUp_28_C026BDA74BFBABA6672DFE8FFDAAFC1B) == 0x000000, "Member 'FGravityOverrideParamsStruct::Skydive_GoingUp_28_C026BDA74BFBABA6672DFE8FFDAAFC1B' has a wrong offset!");
static_assert(offsetof(FGravityOverrideParamsStruct, Skydive_FloatingDown_29_2CBF3D3F421785F8994502931454A81F) == 0x000038, "Member 'FGravityOverrideParamsStruct::Skydive_FloatingDown_29_2CBF3D3F421785F8994502931454A81F' has a wrong offset!");
static_assert(offsetof(FGravityOverrideParamsStruct, Skydive_DivingDown_30_EC7BEC4D406A8A98E60D7B9374C5E457) == 0x000070, "Member 'FGravityOverrideParamsStruct::Skydive_DivingDown_30_EC7BEC4D406A8A98E60D7B9374C5E457' has a wrong offset!");
static_assert(offsetof(FGravityOverrideParamsStruct, Skydive_Parachuting_31_A88C4A0A407F497561D31287CB20250F) == 0x0000A8, "Member 'FGravityOverrideParamsStruct::Skydive_Parachuting_31_A88C4A0A407F497561D31287CB20250F' has a wrong offset!");
static_assert(offsetof(FGravityOverrideParamsStruct, OnGround_Standing_32_267DB1464D0D3A29D99E94ADFCB4AFEC) == 0x0000E0, "Member 'FGravityOverrideParamsStruct::OnGround_Standing_32_267DB1464D0D3A29D99E94ADFCB4AFEC' has a wrong offset!");
static_assert(offsetof(FGravityOverrideParamsStruct, OnGround_Moving_33_807A66B64D7B3B2FCF080B833B8A6254) == 0x000118, "Member 'FGravityOverrideParamsStruct::OnGround_Moving_33_807A66B64D7B3B2FCF080B833B8A6254' has a wrong offset!");
static_assert(offsetof(FGravityOverrideParamsStruct, EmoteOrMelee_34_CFCF66B5492987CBD638EC98EB34D572) == 0x000150, "Member 'FGravityOverrideParamsStruct::EmoteOrMelee_34_CFCF66B5492987CBD638EC98EB34D572' has a wrong offset!");
static_assert(offsetof(FGravityOverrideParamsStruct, Swimming_35_33CE87CE4D4F712B1384E29115845962) == 0x000188, "Member 'FGravityOverrideParamsStruct::Swimming_35_33CE87CE4D4F712B1384E29115845962' has a wrong offset!");
static_assert(offsetof(FGravityOverrideParamsStruct, Front_End_36_C7A4562A48E9BC9B4CD34D963CFC6490) == 0x0001C0, "Member 'FGravityOverrideParamsStruct::Front_End_36_C7A4562A48E9BC9B4CD34D963CFC6490' has a wrong offset!");

}

