#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HealthWarningScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HealthWarningScreen.HealthWarningScreen_C
// 0x0040 (0x04E0 - 0x04A0)
class UHealthWarningScreen_C final : public UHealthWarningScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FinishingAnim;                                     // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              HealthWarningCompleted;                            // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           ShowTimer;                                         // 0x04C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                IconPadding;                                       // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void HandleShowTimerComplete();
	void ExecuteUbergraph_HealthWarningScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HealthWarningScreen_C">();
	}
	static class UHealthWarningScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHealthWarningScreen_C>();
	}
};
static_assert(alignof(UHealthWarningScreen_C) == 0x000008, "Wrong alignment on UHealthWarningScreen_C");
static_assert(sizeof(UHealthWarningScreen_C) == 0x0004E0, "Wrong size on UHealthWarningScreen_C");
static_assert(offsetof(UHealthWarningScreen_C, UberGraphFrame) == 0x0004A0, "Member 'UHealthWarningScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHealthWarningScreen_C, FinishingAnim) == 0x0004A8, "Member 'UHealthWarningScreen_C::FinishingAnim' has a wrong offset!");
static_assert(offsetof(UHealthWarningScreen_C, SafeZone_0) == 0x0004B0, "Member 'UHealthWarningScreen_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UHealthWarningScreen_C, HealthWarningCompleted) == 0x0004B8, "Member 'UHealthWarningScreen_C::HealthWarningCompleted' has a wrong offset!");
static_assert(offsetof(UHealthWarningScreen_C, ShowTimer) == 0x0004C8, "Member 'UHealthWarningScreen_C::ShowTimer' has a wrong offset!");
static_assert(offsetof(UHealthWarningScreen_C, IconPadding) == 0x0004D0, "Member 'UHealthWarningScreen_C::IconPadding' has a wrong offset!");

}

