#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HighTower_Tapas_Axe_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "HighTower_Tapas_Axe_AnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HighTower_Tapas_Axe_AnimBP.HighTower_Tapas_Axe_AnimBP_C
// 0x1340 (0x18C0 - 0x0580)
class UHighTower_Tapas_Axe_AnimBP_C final : public UCustomCharacterPartAnimInstance_HightowerTapasAxe
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct HighTower_Tapas_Axe_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0588(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_58A[0x6];                                      // 0x058A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0590(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0598(0x0008)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x05A0(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x05C0(0x0188)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0748(0x0020)()
	uint8                                         Pad_768[0x8];                                      // 0x0768(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Trail                        AnimGraphNode_Trail;                               // 0x0770(0x0260)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x09D0(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0AD8(0x0088)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0B60(0x07F0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x1350(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x1370(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x1390(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1498(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x14C0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x14E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1508(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1530(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1638(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1658(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1678(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x16C0(0x0108)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x17C8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1890(0x0028)()

public:
	void ExecuteUbergraph_HighTower_Tapas_Axe_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HighTower_Tapas_Axe_AnimBP_C">();
	}
	static class UHighTower_Tapas_Axe_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHighTower_Tapas_Axe_AnimBP_C>();
	}
};
static_assert(alignof(UHighTower_Tapas_Axe_AnimBP_C) == 0x000010, "Wrong alignment on UHighTower_Tapas_Axe_AnimBP_C");
static_assert(sizeof(UHighTower_Tapas_Axe_AnimBP_C) == 0x0018C0, "Wrong size on UHighTower_Tapas_Axe_AnimBP_C");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, UberGraphFrame) == 0x000580, "Member 'UHighTower_Tapas_Axe_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, __AnimBlueprintMutables) == 0x000588, "Member 'UHighTower_Tapas_Axe_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000590, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimBlueprintExtension_Base) == 0x000598, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_LocalToComponentSpace_2) == 0x0005A0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0005C0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_Root) == 0x000748, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_Trail) == 0x000770, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_Trail' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0009D0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x000AD8, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_RigidBody) == 0x000B60, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x001350, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x001370, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x001390, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_UseCachedPose_3) == 0x001498, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x0014C0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x0014E0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x001508, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_ModifyBone) == 0x001530, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001638, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001658, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_Slot) == 0x001678, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x0016C0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_TwoWayBlend) == 0x0017C8, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x001890, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");

}

