#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HousepartyFOMOToast

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HousepartyFOMOToast.HousepartyFOMOToast_C
// 0x0018 (0x0298 - 0x0280)
class UHousepartyFOMOToast_C final : public UFortToastWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_97;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_138;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnSetToast(class UFortUINotification* ToastNotification);
	void ExecuteUbergraph_HousepartyFOMOToast(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HousepartyFOMOToast_C">();
	}
	static class UHousepartyFOMOToast_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHousepartyFOMOToast_C>();
	}
};
static_assert(alignof(UHousepartyFOMOToast_C) == 0x000008, "Wrong alignment on UHousepartyFOMOToast_C");
static_assert(sizeof(UHousepartyFOMOToast_C) == 0x000298, "Wrong size on UHousepartyFOMOToast_C");
static_assert(offsetof(UHousepartyFOMOToast_C, UberGraphFrame) == 0x000280, "Member 'UHousepartyFOMOToast_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHousepartyFOMOToast_C, Image_97) == 0x000288, "Member 'UHousepartyFOMOToast_C::Image_97' has a wrong offset!");
static_assert(offsetof(UHousepartyFOMOToast_C, Image_138) == 0x000290, "Member 'UHousepartyFOMOToast_C::Image_138' has a wrong offset!");

}

