#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ImportFriends

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ImportFriends.ImportFriends_C.BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ImportFriends_C_BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ImportFriends_C_BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ImportFriends_C_BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ImportFriends_C_BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ImportFriends_C_BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ImportFriends_C_BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ImportFriends_C_BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ImportFriends.ImportFriends_C.ExecuteUbergraph_ImportFriends
// 0x0118 (0x0118 - 0x0000)
struct ImportFriends_C_ExecuteUbergraph_ImportFriends final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESocialImportPanelPlatform                    Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	ESocialImportPanelPlatform                    Temp_byte_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESocialImportPanelPlatform                    Temp_byte_Variable_9;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_16;                             // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESocialImportPanelPlatform                    Temp_byte_Variable_17;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0050(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESocialImportPanelType                        K2Node_Event_NewType;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESocialImportPanelPlatform                    CallFunc_GetSocialPlatform_OutPlatform;            // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSocialPlatform_ReturnValue;            // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIncentivized;                        // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0070(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0088(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00A8(0x0018)()
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button_1;           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x0100(0x0018)()
};
static_assert(alignof(ImportFriends_C_ExecuteUbergraph_ImportFriends) == 0x000008, "Wrong alignment on ImportFriends_C_ExecuteUbergraph_ImportFriends");
static_assert(sizeof(ImportFriends_C_ExecuteUbergraph_ImportFriends) == 0x000118, "Wrong size on ImportFriends_C_ExecuteUbergraph_ImportFriends");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, EntryPoint) == 0x000000, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::EntryPoint' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable) == 0x000004, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_text_Variable) == 0x000008, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_text_Variable_1) == 0x000020, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_1) == 0x000038, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_2) == 0x000039, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_3) == 0x00003A, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_4) == 0x00003B, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_5) == 0x00003C, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_6) == 0x00003D, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_7) == 0x00003E, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_8) == 0x00003F, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_9) == 0x000040, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_10) == 0x000041, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_11) == 0x000042, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_12) == 0x000043, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_13) == 0x000044, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_14) == 0x000045, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_15) == 0x000046, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_16) == 0x000047, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable_17) == 0x000048, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable_17' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_text_Variable_2) == 0x000050, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Event_IsDesignTime) == 0x000068, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Event_NewType) == 0x000069, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Event_NewType' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, CallFunc_GetSocialPlatform_OutPlatform) == 0x00006A, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::CallFunc_GetSocialPlatform_OutPlatform' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, CallFunc_GetSocialPlatform_ReturnValue) == 0x00006B, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::CallFunc_GetSocialPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Event_bIncentivized) == 0x00006C, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Event_bIncentivized' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Select_Default) == 0x000070, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, CallFunc_MakeLiteralText_ReturnValue) == 0x000088, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Select_Default_1) == 0x0000A0, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, CallFunc_TextToUpper_ReturnValue) == 0x0000A8, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_ComponentBoundEvent_Button) == 0x0000C0, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, CallFunc_PlayAnimation_ReturnValue) == 0x0000C8, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, CallFunc_GetEndTime_ReturnValue) == 0x0000D0, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000D8, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_DynamicCast_AsIcon_Text_Button) == 0x0000E0, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_DynamicCast_AsIcon_Text_Button_1) == 0x0000F0, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_DynamicCast_AsIcon_Text_Button_1' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Select_Default_2) == 0x0000F9, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Select_Default_3) == 0x000100, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Select_Default_3' has a wrong offset!");

// Function ImportFriends.ImportFriends_C.OnIncentivizedSet
// 0x0001 (0x0001 - 0x0000)
struct ImportFriends_C_OnIncentivizedSet final
{
public:
	bool                                          bIncentivized;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ImportFriends_C_OnIncentivizedSet) == 0x000001, "Wrong alignment on ImportFriends_C_OnIncentivizedSet");
static_assert(sizeof(ImportFriends_C_OnIncentivizedSet) == 0x000001, "Wrong size on ImportFriends_C_OnIncentivizedSet");
static_assert(offsetof(ImportFriends_C_OnIncentivizedSet, bIncentivized) == 0x000000, "Member 'ImportFriends_C_OnIncentivizedSet::bIncentivized' has a wrong offset!");

// Function ImportFriends.ImportFriends_C.OnPanelTypeSet
// 0x0001 (0x0001 - 0x0000)
struct ImportFriends_C_OnPanelTypeSet final
{
public:
	ESocialImportPanelType                        NewType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ImportFriends_C_OnPanelTypeSet) == 0x000001, "Wrong alignment on ImportFriends_C_OnPanelTypeSet");
static_assert(sizeof(ImportFriends_C_OnPanelTypeSet) == 0x000001, "Wrong size on ImportFriends_C_OnPanelTypeSet");
static_assert(offsetof(ImportFriends_C_OnPanelTypeSet, NewType) == 0x000000, "Member 'ImportFriends_C_OnPanelTypeSet::NewType' has a wrong offset!");

// Function ImportFriends.ImportFriends_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ImportFriends_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ImportFriends_C_PreConstruct) == 0x000001, "Wrong alignment on ImportFriends_C_PreConstruct");
static_assert(sizeof(ImportFriends_C_PreConstruct) == 0x000001, "Wrong size on ImportFriends_C_PreConstruct");
static_assert(offsetof(ImportFriends_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ImportFriends_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ImportFriends.ImportFriends_C.ScaleTextboxWithWrappingWorkaround
// 0x0078 (0x0078 - 0x0000)
struct ImportFriends_C_ScaleTextboxWithWrappingWorkaround final
{
public:
	class UScaleBox*                              ContainingScalebox;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CharLimitThreshold;                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       TargetText;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WrapAtHorrizontal;                                 // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleCharThreshold;                                // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0028(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround) == 0x000008, "Wrong alignment on ImportFriends_C_ScaleTextboxWithWrappingWorkaround");
static_assert(sizeof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround) == 0x000078, "Wrong size on ImportFriends_C_ScaleTextboxWithWrappingWorkaround");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, ContainingScalebox) == 0x000000, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::ContainingScalebox' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CharLimitThreshold) == 0x000008, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CharLimitThreshold' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, TargetText) == 0x000010, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::TargetText' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, WrapAtHorrizontal) == 0x000018, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::WrapAtHorrizontal' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, ScaleCharThreshold) == 0x00001C, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::ScaleCharThreshold' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000020, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_GetText_ReturnValue) == 0x000028, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_Conv_TextToString_ReturnValue) == 0x000040, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000050, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_Len_ReturnValue) == 0x000054, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000058, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00005C, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_FMax_ReturnValue) == 0x000060, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000064, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_FClamp_ReturnValue) == 0x000068, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x00006C, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_FTrunc_ReturnValue) == 0x000070, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

// Function ImportFriends.ImportFriends_C.ScaleTextButton
// 0x0048 (0x0048 - 0x0000)
struct ImportFriends_C_ScaleTextButton final
{
public:
	int32                                         CharThreshold;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScaleBox*                              ContainingScalebox;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ImportFriends_C_ScaleTextButton) == 0x000008, "Wrong alignment on ImportFriends_C_ScaleTextButton");
static_assert(sizeof(ImportFriends_C_ScaleTextButton) == 0x000048, "Wrong size on ImportFriends_C_ScaleTextButton");
static_assert(offsetof(ImportFriends_C_ScaleTextButton, CharThreshold) == 0x000000, "Member 'ImportFriends_C_ScaleTextButton::CharThreshold' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextButton, ContainingScalebox) == 0x000008, "Member 'ImportFriends_C_ScaleTextButton::ContainingScalebox' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextButton, Button) == 0x000010, "Member 'ImportFriends_C_ScaleTextButton::Button' has a wrong offset!");
