#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IncomingFriendRequestToast

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IncomingFriendRequestToast.IncomingFriendRequestToast_C
// 0x0088 (0x0318 - 0x0290)
class UIncomingFriendRequestToast_C final : public UFortIncomingFriendRequestToast
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro_New;                                         // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          B_NotificationImage;                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          B_NotificationImageExtended;                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_MainWidget;                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Description;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         NotificationImage;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      OpenButton;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortUINotification*                    ToastNotification;                                 // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimationFinishedDelay;                            // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFinishedToast;                                   // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           AnimationDelayTimer;                               // 0x0308(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bActionTaken;                                      // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShowText(const class FText& Text, class UCommonTextBlock* TextBlock);
	void SetupAnimBindings(bool Unbind);
	void StartIntro();
	void SetToast(class UFortUINotification* Toast);
	void PlayOutro();
	void OnSetToast(class UFortUINotification* ToastNotification_0);
	void OnPlayOpenAnimation();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void HandleIntroFinished();
	ESlateVisibility GetOpenButtonVisibility();
	void HandleOutroFinished();
	void BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void ExecuteUbergraph_IncomingFriendRequestToast(int32 EntryPoint);
	void Destruct();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IncomingFriendRequestToast_C">();
	}
	static class UIncomingFriendRequestToast_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIncomingFriendRequestToast_C>();
	}
};
static_assert(alignof(UIncomingFriendRequestToast_C) == 0x000008, "Wrong alignment on UIncomingFriendRequestToast_C");
static_assert(sizeof(UIncomingFriendRequestToast_C) == 0x000318, "Wrong size on UIncomingFriendRequestToast_C");
static_assert(offsetof(UIncomingFriendRequestToast_C, UberGraphFrame) == 0x000290, "Member 'UIncomingFriendRequestToast_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIncomingFriendRequestToast_C, Outro_New) == 0x000298, "Member 'UIncomingFriendRequestToast_C::Outro_New' has a wrong offset!");
static_assert(offsetof(UIncomingFriendRequestToast_C, Intro) == 0x0002A0, "Member 'UIncomingFriendRequestToast_C::Intro' has a wrong offset!");
static_assert(offsetof(UIncomingFriendRequestToast_C, B_NotificationImage) == 0x0002A8, "Member 'UIncomingFriendRequestToast_C::B_NotificationImage' has a wrong offset!");
static_assert(offsetof(UIncomingFriendRequestToast_C, B_NotificationImageExtended) == 0x0002B0, "Member 'UIncomingFriendRequestToast_C::B_NotificationImageExtended' has a wrong offset!");
static_assert(offsetof(UIncomingFriendRequestToast_C, CommonBorder_MainWidget) == 0x0002B8, "Member 'UIncomingFriendRequestToast_C::CommonBorder_MainWidget' has a wrong offset!");
static_assert(offsetof(UIncomingFriendRequestToast_C, Description) == 0x0002C0, "Member 'UIncomingFriendRequestToast_C::Description' has a wrong offset!");
static_assert(offsetof(UIncomingFriendRequestToast_C, NotificationImage) == 0x0002C8, "Member 'UIncomingFriendRequestToast_C::NotificationImage' has a wrong offset!");
static_assert(offsetof(UIncomingFriendRequestToast_C, OpenButton) == 0x0002D0, "Member 'UIncomingFriendRequestToast_C::OpenButton' has a wrong offset!");
static_assert(offsetof(UIncomingFriendRequestToast_C, TextBlock_0) == 0x0002D8, "Member 'UIncomingFriendRequestToast_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UIncomingFriendRequestToast_C, Title) == 0x0002E0, "Member 'UIncomingFriendRequestToast_C::Title' has a wrong offset!");
static_assert(offsetof(UIncomingFriendRequestToast_C, ToastNotification) == 0x0002E8, "Member 'UIncomingFriendRequestToast_C::ToastNotification' has a wrong offset!");
static_assert(offsetof(UIncomingFriendRequestToast_C, AnimationFinishedDelay) == 0x0002F0, "Member 'UIncomingFriendRequestToast_C::AnimationFinishedDelay' has a wrong offset!");
static_assert(offsetof(UIncomingFriendRequestToast_C, OnFinishedToast) == 0x0002F8, "Member 'UIncomingFriendRequestToast_C::OnFinishedToast' has a wrong offset!");
static_assert(offsetof(UIncomingFriendRequestToast_C, AnimationDelayTimer) == 0x000308, "Member 'UIncomingFriendRequestToast_C::AnimationDelayTimer' has a wrong offset!");
static_assert(offsetof(UIncomingFriendRequestToast_C, bActionTaken) == 0x000310, "Member 'UIncomingFriendRequestToast_C::bActionTaken' has a wrong offset!");

}

