#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemShopRefreshTimerButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function ItemShopRefreshTimerButton.ItemShopRefreshTimerButton_C.ExecuteUbergraph_ItemShopRefreshTimerButton
// 0x0018 (0x0018 - 0x0000)
struct ItemShopRefreshTimerButton_C_ExecuteUbergraph_ItemShopRefreshTimerButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemShopRefreshTimerButton_C_ExecuteUbergraph_ItemShopRefreshTimerButton) == 0x000008, "Wrong alignment on ItemShopRefreshTimerButton_C_ExecuteUbergraph_ItemShopRefreshTimerButton");
static_assert(sizeof(ItemShopRefreshTimerButton_C_ExecuteUbergraph_ItemShopRefreshTimerButton) == 0x000018, "Wrong size on ItemShopRefreshTimerButton_C_ExecuteUbergraph_ItemShopRefreshTimerButton");
static_assert(offsetof(ItemShopRefreshTimerButton_C_ExecuteUbergraph_ItemShopRefreshTimerButton, EntryPoint) == 0x000000, "Member 'ItemShopRefreshTimerButton_C_ExecuteUbergraph_ItemShopRefreshTimerButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemShopRefreshTimerButton_C_ExecuteUbergraph_ItemShopRefreshTimerButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'ItemShopRefreshTimerButton_C_ExecuteUbergraph_ItemShopRefreshTimerButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopRefreshTimerButton_C_ExecuteUbergraph_ItemShopRefreshTimerButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'ItemShopRefreshTimerButton_C_ExecuteUbergraph_ItemShopRefreshTimerButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

