#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemPreviewSideSwap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ItemPreviewSideSwap.ItemPreviewSideSwap_C
// 0x0120 (0x0448 - 0x0328)
class AItemPreviewSideSwap_C final : public AItemPreviewSwapper
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess_Mobile;                                // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLightLowMobile;                                 // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight;                                          // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight_LOWPC;                                    // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PostProcess_LOWPC;                                 // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLight_LOWPC;                            // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLightMobile;                            // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DirectionalLights;                                 // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        GenericLighting;                                   // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_RotationOffsetLerp_F81FDC884C74C17EBF78B0B928138870; // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_F81FDC884C74C17EBF78B0B928138870; // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_ZoomLevel_F92CF88A423F8300F5A67CB744A0DA45; // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_F92CF88A423F8300F5A67CB744A0DA45; // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MoveOutRight_Location_89D9209D4024EFFF08326CBAE53949F1; // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MoveOutRight__Direction_89D9209D4024EFFF08326CBAE53949F1; // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AD[0x3];                                      // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MoveOutRight;                                      // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MoveInRight_Location_3FE1D8EB4B6BCBA0C3D120B521728FCE; // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MoveInRight__Direction_3FE1D8EB4B6BCBA0C3D120B521728FCE; // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MoveInRight;                                       // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MoveInLeft_Location_B344DA1A46B3CB2F19E2E0A1F7E36A47; // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MoveInLeft__Direction_B344DA1A46B3CB2F19E2E0A1F7E36A47; // 0x03DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DD[0x3];                                      // 0x03DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MoveInLeft;                                        // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MoveOutLeft_Location_6890893D4037128B5CB3B2AE9A4AE0A1; // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MoveOutLeft__Direction_6890893D4037128B5CB3B2AE9A4AE0A1; // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F5[0x3];                                      // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MoveOutLeft;                                       // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugMobile_Lighting;                              // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugLightingPC;                                   // 0x0401(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0402(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AlwaysOn;                                          // 0x0403(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugLighting_LOWDetailPC;                         // 0x0404(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool Should_Show_Floor)> On_New_Item_Spawned;                               // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         CurrentZoomLevel;                                  // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetZoomLevel;                                   // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TargetRotationOffset;                              // 0x0420(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               OrigRotationOffset;                                // 0x042C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UFortAccountItemDefinition*             Primary_Requested_Item;                            // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItemDefinition*             Previous_Requested_Item;                           // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateSettings();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void SwitchPCLighting_LOWDetail(bool Visibility);
	void SwitchPCLighting(bool Visibility);
	void SwitchMobileLighting(bool Visibility);
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void ReceiveBeginPlay();
	void PlaySwipeSound(class USoundBase* Sound);
	void OnTargetZoomLevelSet(float TargetZoomLevel_0);
	void OnReadyToSwap(const class UFortAccountItemDefinition* PrimaryRequestedItem, const struct FSceneTransitionOptions& Options);
	void OnNewSceneRequested(const class UFortAccountItemDefinition* PrimaryRequestedItem, const struct FSceneTransitionOptions& TransitionOptions);
	void MoveOutRight__UpdateFunc();
	void MoveOutRight__FinishedFunc();
	void MoveOutLeft__UpdateFunc();
	void MoveOutLeft__FinishedFunc();
	void MoveInRight__UpdateFunc();
	void MoveInRight__FinishedFunc();
	void OnTargetRotationOffsetSet(const struct FRotator& TargetRotationOffset_0);
	void MoveInLeft__UpdateFunc();
	void MoveInLeft__FinishedFunc();
	void LightControl(bool Active);
	void ExecuteUbergraph_ItemPreviewSideSwap(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemPreviewSideSwap_C">();
	}
	static class AItemPreviewSideSwap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AItemPreviewSideSwap_C>();
	}
};
static_assert(alignof(AItemPreviewSideSwap_C) == 0x000008, "Wrong alignment on AItemPreviewSideSwap_C");
static_assert(sizeof(AItemPreviewSideSwap_C) == 0x000448, "Wrong size on AItemPreviewSideSwap_C");
static_assert(offsetof(AItemPreviewSideSwap_C, UberGraphFrame) == 0x000328, "Member 'AItemPreviewSideSwap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, PostProcess_Mobile) == 0x000330, "Member 'AItemPreviewSideSwap_C::PostProcess_Mobile' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, SkyLightLowMobile) == 0x000338, "Member 'AItemPreviewSideSwap_C::SkyLightLowMobile' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, SkyLight) == 0x000340, "Member 'AItemPreviewSideSwap_C::SkyLight' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, SkyLight_LOWPC) == 0x000348, "Member 'AItemPreviewSideSwap_C::SkyLight_LOWPC' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, Arrow) == 0x000350, "Member 'AItemPreviewSideSwap_C::Arrow' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, PostProcess_LOWPC) == 0x000358, "Member 'AItemPreviewSideSwap_C::PostProcess_LOWPC' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, DirectionalLight_LOWPC) == 0x000360, "Member 'AItemPreviewSideSwap_C::DirectionalLight_LOWPC' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, DirectionalLightMobile) == 0x000368, "Member 'AItemPreviewSideSwap_C::DirectionalLightMobile' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, DirectionalLights) == 0x000370, "Member 'AItemPreviewSideSwap_C::DirectionalLights' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, GenericLighting) == 0x000378, "Member 'AItemPreviewSideSwap_C::GenericLighting' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, Timeline_1_RotationOffsetLerp_F81FDC884C74C17EBF78B0B928138870) == 0x000380, "Member 'AItemPreviewSideSwap_C::Timeline_1_RotationOffsetLerp_F81FDC884C74C17EBF78B0B928138870' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, Timeline_1__Direction_F81FDC884C74C17EBF78B0B928138870) == 0x000384, "Member 'AItemPreviewSideSwap_C::Timeline_1__Direction_F81FDC884C74C17EBF78B0B928138870' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, Timeline_1) == 0x000388, "Member 'AItemPreviewSideSwap_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, Timeline_0_ZoomLevel_F92CF88A423F8300F5A67CB744A0DA45) == 0x000390, "Member 'AItemPreviewSideSwap_C::Timeline_0_ZoomLevel_F92CF88A423F8300F5A67CB744A0DA45' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, Timeline_0__Direction_F92CF88A423F8300F5A67CB744A0DA45) == 0x000394, "Member 'AItemPreviewSideSwap_C::Timeline_0__Direction_F92CF88A423F8300F5A67CB744A0DA45' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, Timeline_0) == 0x000398, "Member 'AItemPreviewSideSwap_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, MoveOutRight_Location_89D9209D4024EFFF08326CBAE53949F1) == 0x0003A0, "Member 'AItemPreviewSideSwap_C::MoveOutRight_Location_89D9209D4024EFFF08326CBAE53949F1' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, MoveOutRight__Direction_89D9209D4024EFFF08326CBAE53949F1) == 0x0003AC, "Member 'AItemPreviewSideSwap_C::MoveOutRight__Direction_89D9209D4024EFFF08326CBAE53949F1' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, MoveOutRight) == 0x0003B0, "Member 'AItemPreviewSideSwap_C::MoveOutRight' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, MoveInRight_Location_3FE1D8EB4B6BCBA0C3D120B521728FCE) == 0x0003B8, "Member 'AItemPreviewSideSwap_C::MoveInRight_Location_3FE1D8EB4B6BCBA0C3D120B521728FCE' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, MoveInRight__Direction_3FE1D8EB4B6BCBA0C3D120B521728FCE) == 0x0003C4, "Member 'AItemPreviewSideSwap_C::MoveInRight__Direction_3FE1D8EB4B6BCBA0C3D120B521728FCE' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, MoveInRight) == 0x0003C8, "Member 'AItemPreviewSideSwap_C::MoveInRight' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, MoveInLeft_Location_B344DA1A46B3CB2F19E2E0A1F7E36A47) == 0x0003D0, "Member 'AItemPreviewSideSwap_C::MoveInLeft_Location_B344DA1A46B3CB2F19E2E0A1F7E36A47' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, MoveInLeft__Direction_B344DA1A46B3CB2F19E2E0A1F7E36A47) == 0x0003DC, "Member 'AItemPreviewSideSwap_C::MoveInLeft__Direction_B344DA1A46B3CB2F19E2E0A1F7E36A47' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, MoveInLeft) == 0x0003E0, "Member 'AItemPreviewSideSwap_C::MoveInLeft' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, MoveOutLeft_Location_6890893D4037128B5CB3B2AE9A4AE0A1) == 0x0003E8, "Member 'AItemPreviewSideSwap_C::MoveOutLeft_Location_6890893D4037128B5CB3B2AE9A4AE0A1' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, MoveOutLeft__Direction_6890893D4037128B5CB3B2AE9A4AE0A1) == 0x0003F4, "Member 'AItemPreviewSideSwap_C::MoveOutLeft__Direction_6890893D4037128B5CB3B2AE9A4AE0A1' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, MoveOutLeft) == 0x0003F8, "Member 'AItemPreviewSideSwap_C::MoveOutLeft' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, DebugMobile_Lighting) == 0x000400, "Member 'AItemPreviewSideSwap_C::DebugMobile_Lighting' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, DebugLightingPC) == 0x000401, "Member 'AItemPreviewSideSwap_C::DebugLightingPC' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, IsActive) == 0x000402, "Member 'AItemPreviewSideSwap_C::IsActive' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, AlwaysOn) == 0x000403, "Member 'AItemPreviewSideSwap_C::AlwaysOn' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, DebugLighting_LOWDetailPC) == 0x000404, "Member 'AItemPreviewSideSwap_C::DebugLighting_LOWDetailPC' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, On_New_Item_Spawned) == 0x000408, "Member 'AItemPreviewSideSwap_C::On_New_Item_Spawned' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, CurrentZoomLevel) == 0x000418, "Member 'AItemPreviewSideSwap_C::CurrentZoomLevel' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, TargetZoomLevel) == 0x00041C, "Member 'AItemPreviewSideSwap_C::TargetZoomLevel' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, TargetRotationOffset) == 0x000420, "Member 'AItemPreviewSideSwap_C::TargetRotationOffset' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, OrigRotationOffset) == 0x00042C, "Member 'AItemPreviewSideSwap_C::OrigRotationOffset' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, Primary_Requested_Item) == 0x000438, "Member 'AItemPreviewSideSwap_C::Primary_Requested_Item' has a wrong offset!");
static_assert(offsetof(AItemPreviewSideSwap_C, Previous_Requested_Item) == 0x000440, "Member 'AItemPreviewSideSwap_C::Previous_Requested_Item' has a wrong offset!");

}

