#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemShopScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function ItemShopScreen.ItemShopScreen_C.ExecuteUbergraph_ItemShopScreen
// 0x0088 (0x0088 - 0x0000)
struct ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTexture* BackgroundImage)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bEmpty;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsNavigationEnabled;           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture>                CallFunc_GetLoadedTexture_ReturnValue;             // 0x0018(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen) == 0x000008, "Wrong alignment on ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen");
static_assert(sizeof(ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen) == 0x000088, "Wrong size on ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen");
static_assert(offsetof(ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen, EntryPoint) == 0x000000, "Member 'ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen, K2Node_Event_bEmpty) == 0x000014, "Member 'ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen::K2Node_Event_bEmpty' has a wrong offset!");
static_assert(offsetof(ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen, K2Node_CustomEvent_bIsNavigationEnabled) == 0x000015, "Member 'ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen::K2Node_CustomEvent_bIsNavigationEnabled' has a wrong offset!");
static_assert(offsetof(ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen, CallFunc_GetLoadedTexture_ReturnValue) == 0x000018, "Member 'ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen::CallFunc_GetLoadedTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000040, "Member 'ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen, K2Node_DynamicCast_AsTexture) == 0x000050, "Member 'ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x00005C, "Member 'ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x00006C, "Member 'ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen, Temp_bool_Variable) == 0x00007C, "Member 'ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen, K2Node_Select_Default) == 0x000080, "Member 'ItemShopScreen_C_ExecuteUbergraph_ItemShopScreen::K2Node_Select_Default' has a wrong offset!");

// Function ItemShopScreen.ItemShopScreen_C.HandleDynamicBackgroundTextureChanged
// 0x0018 (0x0018 - 0x0000)
struct ItemShopScreen_C_HandleDynamicBackgroundTextureChanged final
{
public:
	class UTexture*                               BackgroundTexture;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemShopScreen_C_HandleDynamicBackgroundTextureChanged) == 0x000008, "Wrong alignment on ItemShopScreen_C_HandleDynamicBackgroundTextureChanged");
static_assert(sizeof(ItemShopScreen_C_HandleDynamicBackgroundTextureChanged) == 0x000018, "Wrong size on ItemShopScreen_C_HandleDynamicBackgroundTextureChanged");
static_assert(offsetof(ItemShopScreen_C_HandleDynamicBackgroundTextureChanged, BackgroundTexture) == 0x000000, "Member 'ItemShopScreen_C_HandleDynamicBackgroundTextureChanged::BackgroundTexture' has a wrong offset!");
static_assert(offsetof(ItemShopScreen_C_HandleDynamicBackgroundTextureChanged, K2Node_DynamicCast_AsTexture_2D) == 0x000008, "Member 'ItemShopScreen_C_HandleDynamicBackgroundTextureChanged::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(ItemShopScreen_C_HandleDynamicBackgroundTextureChanged, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ItemShopScreen_C_HandleDynamicBackgroundTextureChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ItemShopScreen.ItemShopScreen_C.OnSectionsEstablished
// 0x0001 (0x0001 - 0x0000)
struct ItemShopScreen_C_OnSectionsEstablished final
{
public:
	bool                                          bEmpty;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemShopScreen_C_OnSectionsEstablished) == 0x000001, "Wrong alignment on ItemShopScreen_C_OnSectionsEstablished");
static_assert(sizeof(ItemShopScreen_C_OnSectionsEstablished) == 0x000001, "Wrong size on ItemShopScreen_C_OnSectionsEstablished");
static_assert(offsetof(ItemShopScreen_C_OnSectionsEstablished, bEmpty) == 0x000000, "Member 'ItemShopScreen_C_OnSectionsEstablished::bEmpty' has a wrong offset!");

// Function ItemShopScreen.ItemShopScreen_C.SequencerEvent_EnableShopNavigate
// 0x0001 (0x0001 - 0x0000)
struct ItemShopScreen_C_SequencerEvent_EnableShopNavigate final
{
public:
	bool                                          bIsNavigationEnabled;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemShopScreen_C_SequencerEvent_EnableShopNavigate) == 0x000001, "Wrong alignment on ItemShopScreen_C_SequencerEvent_EnableShopNavigate");
static_assert(sizeof(ItemShopScreen_C_SequencerEvent_EnableShopNavigate) == 0x000001, "Wrong size on ItemShopScreen_C_SequencerEvent_EnableShopNavigate");
static_assert(offsetof(ItemShopScreen_C_SequencerEvent_EnableShopNavigate, bIsNavigationEnabled) == 0x000000, "Member 'ItemShopScreen_C_SequencerEvent_EnableShopNavigate::bIsNavigationEnabled' has a wrong offset!");

}

