#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemSeriesOrRarity

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemSeriesOrRarity.ItemSeriesOrRarity_C
// 0x0028 (0x0270 - 0x0248)
class UItemSeriesOrRarity_C final : public UUserWidget
{
public:
	class UWidgetSwitcher*                        RarityOrSeriesSwitcher;                            // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RarityTextBlock;                                   // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                SeriesBorder;                                      // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SeriesTextBlock;                                   // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          OnlyShowSeries;                                    // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateItemDefinition(class UFortItemDefinition* ItemDefinition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemSeriesOrRarity_C">();
	}
	static class UItemSeriesOrRarity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemSeriesOrRarity_C>();
	}
};
static_assert(alignof(UItemSeriesOrRarity_C) == 0x000008, "Wrong alignment on UItemSeriesOrRarity_C");
static_assert(sizeof(UItemSeriesOrRarity_C) == 0x000270, "Wrong size on UItemSeriesOrRarity_C");
static_assert(offsetof(UItemSeriesOrRarity_C, RarityOrSeriesSwitcher) == 0x000248, "Member 'UItemSeriesOrRarity_C::RarityOrSeriesSwitcher' has a wrong offset!");
static_assert(offsetof(UItemSeriesOrRarity_C, RarityTextBlock) == 0x000250, "Member 'UItemSeriesOrRarity_C::RarityTextBlock' has a wrong offset!");
static_assert(offsetof(UItemSeriesOrRarity_C, SeriesBorder) == 0x000258, "Member 'UItemSeriesOrRarity_C::SeriesBorder' has a wrong offset!");
static_assert(offsetof(UItemSeriesOrRarity_C, SeriesTextBlock) == 0x000260, "Member 'UItemSeriesOrRarity_C::SeriesTextBlock' has a wrong offset!");
static_assert(offsetof(UItemSeriesOrRarity_C, OnlyShowSeries) == 0x000268, "Member 'UItemSeriesOrRarity_C::OnlyShowSeries' has a wrong offset!");

}

