#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemShopRefreshTimerButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemShopRefreshTimerButton.ItemShopRefreshTimerButton_C
// 0x0020 (0x0FC0 - 0x0FA0)
class UItemShopRefreshTimerButton_C final : public UAthenaItemShopRefreshTimerButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0FA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 TimerImage;                                        // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_ItemShopRefreshTimerButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemShopRefreshTimerButton_C">();
	}
	static class UItemShopRefreshTimerButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemShopRefreshTimerButton_C>();
	}
};
static_assert(alignof(UItemShopRefreshTimerButton_C) == 0x000010, "Wrong alignment on UItemShopRefreshTimerButton_C");
static_assert(sizeof(UItemShopRefreshTimerButton_C) == 0x000FC0, "Wrong size on UItemShopRefreshTimerButton_C");
static_assert(offsetof(UItemShopRefreshTimerButton_C, UberGraphFrame) == 0x000FA0, "Member 'UItemShopRefreshTimerButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemShopRefreshTimerButton_C, Hover) == 0x000FA8, "Member 'UItemShopRefreshTimerButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UItemShopRefreshTimerButton_C, TimerImage) == 0x000FB0, "Member 'UItemShopRefreshTimerButton_C::TimerImage' has a wrong offset!");

}

