#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LabradorRuntime

#include "Basic.hpp"

#include "IrwinRuntime_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "LabradorRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class LabradorRuntime.FortAIFaunaAnimInstance_Labrador
// 0x0060 (0x0550 - 0x04F0)
class UFortAIFaunaAnimInstance_Labrador final : public UFortAIFaunaAnimInstance
{
public:
	bool                                          bHighVelocity;                                     // 0x04F0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInterruptible;                                  // 0x04F1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocoToIdle;                                       // 0x04F2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIdleToLoco;                                       // 0x04F3(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bJumpStartToJumpLoop;                              // 0x04F4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bJumpLandToMovement;                               // 0x04F5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRunning;                                        // 0x04F6(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIdleToFalling;                                    // 0x04F7(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bToppledOnGround;                                  // 0x04F8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransitionToLand;                                 // 0x04F9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4FA[0x2];                                      // 0x04FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TargetDistance;                                    // 0x04FC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTargetIsClose;                                    // 0x0500(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInTractorBeam;                                  // 0x0501(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFloating;                                       // 0x0502(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsToppled;                                        // 0x0503(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLeaking;                                        // 0x0504(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_505[0x3];                                      // 0x0505(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinHighVelocityMagnitude;                          // 0x0508(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxInterruptibleCurveValue;                        // 0x050C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocoIdleTransitionThreshold;                       // 0x0510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RunSpeedThreshold;                                 // 0x0514(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JumpLandToMovementInterruptibleThreshold;          // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinTargetIsCloseDistance;                          // 0x051C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CurveName_Interruptible;                           // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  TractorBeamStatusTags;                             // 0x0528(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_548[0x8];                                      // 0x0548(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIFaunaAnimInstance_Labrador">();
	}
	static class UFortAIFaunaAnimInstance_Labrador* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAIFaunaAnimInstance_Labrador>();
	}
};
static_assert(alignof(UFortAIFaunaAnimInstance_Labrador) == 0x000010, "Wrong alignment on UFortAIFaunaAnimInstance_Labrador");
static_assert(sizeof(UFortAIFaunaAnimInstance_Labrador) == 0x000550, "Wrong size on UFortAIFaunaAnimInstance_Labrador");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, bHighVelocity) == 0x0004F0, "Member 'UFortAIFaunaAnimInstance_Labrador::bHighVelocity' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, bIsInterruptible) == 0x0004F1, "Member 'UFortAIFaunaAnimInstance_Labrador::bIsInterruptible' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, bLocoToIdle) == 0x0004F2, "Member 'UFortAIFaunaAnimInstance_Labrador::bLocoToIdle' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, bIdleToLoco) == 0x0004F3, "Member 'UFortAIFaunaAnimInstance_Labrador::bIdleToLoco' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, bJumpStartToJumpLoop) == 0x0004F4, "Member 'UFortAIFaunaAnimInstance_Labrador::bJumpStartToJumpLoop' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, bJumpLandToMovement) == 0x0004F5, "Member 'UFortAIFaunaAnimInstance_Labrador::bJumpLandToMovement' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, bIsRunning) == 0x0004F6, "Member 'UFortAIFaunaAnimInstance_Labrador::bIsRunning' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, bIdleToFalling) == 0x0004F7, "Member 'UFortAIFaunaAnimInstance_Labrador::bIdleToFalling' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, bToppledOnGround) == 0x0004F8, "Member 'UFortAIFaunaAnimInstance_Labrador::bToppledOnGround' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, bTransitionToLand) == 0x0004F9, "Member 'UFortAIFaunaAnimInstance_Labrador::bTransitionToLand' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, TargetDistance) == 0x0004FC, "Member 'UFortAIFaunaAnimInstance_Labrador::TargetDistance' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, bTargetIsClose) == 0x000500, "Member 'UFortAIFaunaAnimInstance_Labrador::bTargetIsClose' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, bIsInTractorBeam) == 0x000501, "Member 'UFortAIFaunaAnimInstance_Labrador::bIsInTractorBeam' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, bIsFloating) == 0x000502, "Member 'UFortAIFaunaAnimInstance_Labrador::bIsFloating' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, bIsToppled) == 0x000503, "Member 'UFortAIFaunaAnimInstance_Labrador::bIsToppled' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, bIsLeaking) == 0x000504, "Member 'UFortAIFaunaAnimInstance_Labrador::bIsLeaking' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, MinHighVelocityMagnitude) == 0x000508, "Member 'UFortAIFaunaAnimInstance_Labrador::MinHighVelocityMagnitude' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, MaxInterruptibleCurveValue) == 0x00050C, "Member 'UFortAIFaunaAnimInstance_Labrador::MaxInterruptibleCurveValue' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, LocoIdleTransitionThreshold) == 0x000510, "Member 'UFortAIFaunaAnimInstance_Labrador::LocoIdleTransitionThreshold' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, RunSpeedThreshold) == 0x000514, "Member 'UFortAIFaunaAnimInstance_Labrador::RunSpeedThreshold' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, JumpLandToMovementInterruptibleThreshold) == 0x000518, "Member 'UFortAIFaunaAnimInstance_Labrador::JumpLandToMovementInterruptibleThreshold' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, MinTargetIsCloseDistance) == 0x00051C, "Member 'UFortAIFaunaAnimInstance_Labrador::MinTargetIsCloseDistance' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, CurveName_Interruptible) == 0x000520, "Member 'UFortAIFaunaAnimInstance_Labrador::CurveName_Interruptible' has a wrong offset!");
static_assert(offsetof(UFortAIFaunaAnimInstance_Labrador, TractorBeamStatusTags) == 0x000528, "Member 'UFortAIFaunaAnimInstance_Labrador::TractorBeamStatusTags' has a wrong offset!");

// Class LabradorRuntime.FortLabradorComponent_Telemetry
// 0x0020 (0x0128 - 0x0108)
class UFortLabradorComponent_Telemetry final : public UFortAIComponent_Telemetry
{
public:
	bool                                          bWasAwake;                                         // 0x0108(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InstigatorAwakeNetIDString;                        // 0x0110(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ELabradorDespawnReason                        DespawnReason;                                     // 0x0120(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DamageReceivedFromPlayers;                         // 0x0124(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnDamaged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnTeleport();
	void OnWakeUp(class AActor* GoalActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortLabradorComponent_Telemetry">();
	}
	static class UFortLabradorComponent_Telemetry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortLabradorComponent_Telemetry>();
	}
};
static_assert(alignof(UFortLabradorComponent_Telemetry) == 0x000008, "Wrong alignment on UFortLabradorComponent_Telemetry");
static_assert(sizeof(UFortLabradorComponent_Telemetry) == 0x000128, "Wrong size on UFortLabradorComponent_Telemetry");
static_assert(offsetof(UFortLabradorComponent_Telemetry, bWasAwake) == 0x000108, "Member 'UFortLabradorComponent_Telemetry::bWasAwake' has a wrong offset!");
static_assert(offsetof(UFortLabradorComponent_Telemetry, InstigatorAwakeNetIDString) == 0x000110, "Member 'UFortLabradorComponent_Telemetry::InstigatorAwakeNetIDString' has a wrong offset!");
static_assert(offsetof(UFortLabradorComponent_Telemetry, DespawnReason) == 0x000120, "Member 'UFortLabradorComponent_Telemetry::DespawnReason' has a wrong offset!");
static_assert(offsetof(UFortLabradorComponent_Telemetry, DamageReceivedFromPlayers) == 0x000124, "Member 'UFortLabradorComponent_Telemetry::DamageReceivedFromPlayers' has a wrong offset!");

}

