#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LauncherSocialTypes

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// ScriptStruct LauncherSocialTypes.SocialListMargins
// 0x0200 (0x0200 - 0x0000)
struct FSocialListMargins final
{
public:
	struct FVector2D                              UserPresenceImageSize;                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                HeaderButtonMargin;                                // 0x0008(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListMargin;                                 // 0x0018(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListNoFriendsMargin;                        // 0x0028(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListHeaderMargin;                           // 0x0038(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListHeaderCountMargin;                      // 0x0048(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                HeaderButtonContentMargin;                         // 0x0058(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemMargin;                                  // 0x0068(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemStatusMargin;                            // 0x0078(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipStatusMargin;                             // 0x0088(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemPresenceMargin;                          // 0x0098(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemPlatformMargin;                          // 0x00A8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemTextScrollerMargin;                      // 0x00B8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationBorderMargin;                          // 0x00C8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationButtonMargin;                          // 0x00D8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationButtonContentMargin;                   // 0x00E8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                NoneFriendContentMargin;                           // 0x00F8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         NoneFriendContentHeight;                           // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoneFriendIconWidth;                               // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuBackIconMargin;                             // 0x0110(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuPageIconMargin;                             // 0x0120(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                RadioSettingTitleMargin;                           // 0x0130(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSearchIconMargin;                           // 0x0140(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSearchTextMargin;                           // 0x0150(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuBackButtonMargin;                           // 0x0160(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSettingButtonMargin;                        // 0x0170(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuListMargin;                                 // 0x0180(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SubMenuSeperatorThickness;                         // 0x0190(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PresenceSeperatorThickness;                        // 0x0194(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipMargin;                                   // 0x0198(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipPresenceMargin;                           // 0x01A8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipSeperatorMargin;                          // 0x01B8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ToolTipMargin;                                     // 0x01C8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                TipStatusMargin;                                   // 0x01D8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                AddButtonMargin;                                   // 0x01E8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              AddButtonSpacing;                                  // 0x01F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSocialListMargins) == 0x000004, "Wrong alignment on FSocialListMargins");
static_assert(sizeof(FSocialListMargins) == 0x000200, "Wrong size on FSocialListMargins");
static_assert(offsetof(FSocialListMargins, UserPresenceImageSize) == 0x000000, "Member 'FSocialListMargins::UserPresenceImageSize' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, HeaderButtonMargin) == 0x000008, "Member 'FSocialListMargins::HeaderButtonMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, FriendsListMargin) == 0x000018, "Member 'FSocialListMargins::FriendsListMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, FriendsListNoFriendsMargin) == 0x000028, "Member 'FSocialListMargins::FriendsListNoFriendsMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, FriendsListHeaderMargin) == 0x000038, "Member 'FSocialListMargins::FriendsListHeaderMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, FriendsListHeaderCountMargin) == 0x000048, "Member 'FSocialListMargins::FriendsListHeaderCountMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, HeaderButtonContentMargin) == 0x000058, "Member 'FSocialListMargins::HeaderButtonContentMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, FriendItemMargin) == 0x000068, "Member 'FSocialListMargins::FriendItemMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, FriendItemStatusMargin) == 0x000078, "Member 'FSocialListMargins::FriendItemStatusMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, FriendTipStatusMargin) == 0x000088, "Member 'FSocialListMargins::FriendTipStatusMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, FriendItemPresenceMargin) == 0x000098, "Member 'FSocialListMargins::FriendItemPresenceMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, FriendItemPlatformMargin) == 0x0000A8, "Member 'FSocialListMargins::FriendItemPlatformMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, FriendItemTextScrollerMargin) == 0x0000B8, "Member 'FSocialListMargins::FriendItemTextScrollerMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, ConfirmationBorderMargin) == 0x0000C8, "Member 'FSocialListMargins::ConfirmationBorderMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, ConfirmationButtonMargin) == 0x0000D8, "Member 'FSocialListMargins::ConfirmationButtonMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, ConfirmationButtonContentMargin) == 0x0000E8, "Member 'FSocialListMargins::ConfirmationButtonContentMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, NoneFriendContentMargin) == 0x0000F8, "Member 'FSocialListMargins::NoneFriendContentMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, NoneFriendContentHeight) == 0x000108, "Member 'FSocialListMargins::NoneFriendContentHeight' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, NoneFriendIconWidth) == 0x00010C, "Member 'FSocialListMargins::NoneFriendIconWidth' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, SubMenuBackIconMargin) == 0x000110, "Member 'FSocialListMargins::SubMenuBackIconMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, SubMenuPageIconMargin) == 0x000120, "Member 'FSocialListMargins::SubMenuPageIconMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, RadioSettingTitleMargin) == 0x000130, "Member 'FSocialListMargins::RadioSettingTitleMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, SubMenuSearchIconMargin) == 0x000140, "Member 'FSocialListMargins::SubMenuSearchIconMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, SubMenuSearchTextMargin) == 0x000150, "Member 'FSocialListMargins::SubMenuSearchTextMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, SubMenuBackButtonMargin) == 0x000160, "Member 'FSocialListMargins::SubMenuBackButtonMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, SubMenuSettingButtonMargin) == 0x000170, "Member 'FSocialListMargins::SubMenuSettingButtonMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, SubMenuListMargin) == 0x000180, "Member 'FSocialListMargins::SubMenuListMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, SubMenuSeperatorThickness) == 0x000190, "Member 'FSocialListMargins::SubMenuSeperatorThickness' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, PresenceSeperatorThickness) == 0x000194, "Member 'FSocialListMargins::PresenceSeperatorThickness' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, FriendTipMargin) == 0x000198, "Member 'FSocialListMargins::FriendTipMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, FriendTipPresenceMargin) == 0x0001A8, "Member 'FSocialListMargins::FriendTipPresenceMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, FriendTipSeperatorMargin) == 0x0001B8, "Member 'FSocialListMargins::FriendTipSeperatorMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, ToolTipMargin) == 0x0001C8, "Member 'FSocialListMargins::ToolTipMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, TipStatusMargin) == 0x0001D8, "Member 'FSocialListMargins::TipStatusMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, AddButtonMargin) == 0x0001E8, "Member 'FSocialListMargins::AddButtonMargin' has a wrong offset!");
static_assert(offsetof(FSocialListMargins, AddButtonSpacing) == 0x0001F8, "Member 'FSocialListMargins::AddButtonSpacing' has a wrong offset!");

// ScriptStruct LauncherSocialTypes.ChatChromeColorScheme
// 0x0050 (0x0050 - 0x0000)
struct FChatChromeColorScheme final
{
public:
	struct FLinearColor                           ChatEntryBackgroundColor;                          // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NoneActiveTabColor;                                // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TabFontColor;                                      // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TabFontColorInverted;                              // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ChatBackgroundColor;                               // 0x0040(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatChromeColorScheme) == 0x000004, "Wrong alignment on FChatChromeColorScheme");
static_assert(sizeof(FChatChromeColorScheme) == 0x000050, "Wrong size on FChatChromeColorScheme");
static_assert(offsetof(FChatChromeColorScheme, ChatEntryBackgroundColor) == 0x000000, "Member 'FChatChromeColorScheme::ChatEntryBackgroundColor' has a wrong offset!");
static_assert(offsetof(FChatChromeColorScheme, NoneActiveTabColor) == 0x000010, "Member 'FChatChromeColorScheme::NoneActiveTabColor' has a wrong offset!");
static_assert(offsetof(FChatChromeColorScheme, TabFontColor) == 0x000020, "Member 'FChatChromeColorScheme::TabFontColor' has a wrong offset!");
static_assert(offsetof(FChatChromeColorScheme, TabFontColorInverted) == 0x000030, "Member 'FChatChromeColorScheme::TabFontColorInverted' has a wrong offset!");
static_assert(offsetof(FChatChromeColorScheme, ChatBackgroundColor) == 0x000040, "Member 'FChatChromeColorScheme::ChatBackgroundColor' has a wrong offset!");

// ScriptStruct LauncherSocialTypes.ChatChromeMargins
// 0x0064 (0x0064 - 0x0000)
struct FChatChromeMargins final
{
public:
	float                                         TabWidth;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                TabPadding;                                        // 0x0004(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ChatWindowPadding;                                 // 0x0014(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ChatWindowToEntryMargin;                           // 0x0024(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ChatChannelPadding;                                // 0x0034(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                UserListButtonPadding;                             // 0x0044(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                UserListIconPadding;                               // 0x0054(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatChromeMargins) == 0x000004, "Wrong alignment on FChatChromeMargins");
static_assert(sizeof(FChatChromeMargins) == 0x000064, "Wrong size on FChatChromeMargins");
static_assert(offsetof(FChatChromeMargins, TabWidth) == 0x000000, "Member 'FChatChromeMargins::TabWidth' has a wrong offset!");
static_assert(offsetof(FChatChromeMargins, TabPadding) == 0x000004, "Member 'FChatChromeMargins::TabPadding' has a wrong offset!");
static_assert(offsetof(FChatChromeMargins, ChatWindowPadding) == 0x000014, "Member 'FChatChromeMargins::ChatWindowPadding' has a wrong offset!");
static_assert(offsetof(FChatChromeMargins, ChatWindowToEntryMargin) == 0x000024, "Member 'FChatChromeMargins::ChatWindowToEntryMargin' has a wrong offset!");
static_assert(offsetof(FChatChromeMargins, ChatChannelPadding) == 0x000034, "Member 'FChatChromeMargins::ChatChannelPadding' has a wrong offset!");
static_assert(offsetof(FChatChromeMargins, UserListButtonPadding) == 0x000044, "Member 'FChatChromeMargins::UserListButtonPadding' has a wrong offset!");
static_assert(offsetof(FChatChromeMargins, UserListIconPadding) == 0x000054, "Member 'FChatChromeMargins::UserListIconPadding' has a wrong offset!");

// ScriptStruct LauncherSocialTypes.ChatChromeStyle
// 0x0A80 (0x0A80 - 0x0000)
struct FChatChromeStyle final
{
public:
	struct FSlateBrush                            UserListBrush;                                     // 0x0000(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChatBackgroundBrush;                               // 0x00B0(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChatEntryBackgroundBrush;                          // 0x0160(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChannelBackgroundBrush;                            // 0x0210(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            TabBackgroundBrush;                                // 0x02C0(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           TabSelectorButtonStyle;                            // 0x0370(0x0370)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                TabOptionPadding;                                  // 0x06E0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                TabContentPadding;                                 // 0x06F0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                TabClosePadding;                                   // 0x0700(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FButtonStyle                           UserListButtonStyle;                               // 0x0710(0x0370)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatChromeStyle) == 0x000010, "Wrong alignment on FChatChromeStyle");
static_assert(sizeof(FChatChromeStyle) == 0x000A80, "Wrong size on FChatChromeStyle");
static_assert(offsetof(FChatChromeStyle, UserListBrush) == 0x000000, "Member 'FChatChromeStyle::UserListBrush' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, ChatBackgroundBrush) == 0x0000B0, "Member 'FChatChromeStyle::ChatBackgroundBrush' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, ChatEntryBackgroundBrush) == 0x000160, "Member 'FChatChromeStyle::ChatEntryBackgroundBrush' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, ChannelBackgroundBrush) == 0x000210, "Member 'FChatChromeStyle::ChannelBackgroundBrush' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, TabBackgroundBrush) == 0x0002C0, "Member 'FChatChromeStyle::TabBackgroundBrush' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, TabSelectorButtonStyle) == 0x000370, "Member 'FChatChromeStyle::TabSelectorButtonStyle' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, TabOptionPadding) == 0x0006E0, "Member 'FChatChromeStyle::TabOptionPadding' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, TabContentPadding) == 0x0006F0, "Member 'FChatChromeStyle::TabContentPadding' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, TabClosePadding) == 0x000700, "Member 'FChatChromeStyle::TabClosePadding' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, UserListButtonStyle) == 0x000710, "Member 'FChatChromeStyle::UserListButtonStyle' has a wrong offset!");

// ScriptStruct LauncherSocialTypes.ChatColorScheme
// 0x0120 (0x0120 - 0x0000)
struct FChatColorScheme final
{
public:
	struct FLinearColor                           TimeStampColor;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultChatColor;                                  // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           WhisperChatColor;                                  // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GlobalChatColor;                                   // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FounderChatColor;                                  // 0x0040(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameChatColor;                                     // 0x0050(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TeamChatColor;                                     // 0x0060(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           PartyChatColor;                                    // 0x0070(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           AdminChatColor;                                    // 0x0080(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameAdminChatColor;                                // 0x0090(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           WhisperHyperlinkChatColor;                         // 0x00A0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GlobalHyperlinkChatColor;                          // 0x00B0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FounderHyperlinkChatColor;                         // 0x00C0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameHyperlinkChatColor;                            // 0x00D0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TeamHyperlinkChatColor;                            // 0x00E0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           PartyHyperlinkChatColor;                           // 0x00F0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           EnemyColor;                                        // 0x0100(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FriendlyColor;                                     // 0x0110(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatColorScheme) == 0x000004, "Wrong alignment on FChatColorScheme");
static_assert(sizeof(FChatColorScheme) == 0x000120, "Wrong size on FChatColorScheme");
static_assert(offsetof(FChatColorScheme, TimeStampColor) == 0x000000, "Member 'FChatColorScheme::TimeStampColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, DefaultChatColor) == 0x000010, "Member 'FChatColorScheme::DefaultChatColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, WhisperChatColor) == 0x000020, "Member 'FChatColorScheme::WhisperChatColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, GlobalChatColor) == 0x000030, "Member 'FChatColorScheme::GlobalChatColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, FounderChatColor) == 0x000040, "Member 'FChatColorScheme::FounderChatColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, GameChatColor) == 0x000050, "Member 'FChatColorScheme::GameChatColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, TeamChatColor) == 0x000060, "Member 'FChatColorScheme::TeamChatColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, PartyChatColor) == 0x000070, "Member 'FChatColorScheme::PartyChatColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, AdminChatColor) == 0x000080, "Member 'FChatColorScheme::AdminChatColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, GameAdminChatColor) == 0x000090, "Member 'FChatColorScheme::GameAdminChatColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, WhisperHyperlinkChatColor) == 0x0000A0, "Member 'FChatColorScheme::WhisperHyperlinkChatColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, GlobalHyperlinkChatColor) == 0x0000B0, "Member 'FChatColorScheme::GlobalHyperlinkChatColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, FounderHyperlinkChatColor) == 0x0000C0, "Member 'FChatColorScheme::FounderHyperlinkChatColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, GameHyperlinkChatColor) == 0x0000D0, "Member 'FChatColorScheme::GameHyperlinkChatColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, TeamHyperlinkChatColor) == 0x0000E0, "Member 'FChatColorScheme::TeamHyperlinkChatColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, PartyHyperlinkChatColor) == 0x0000F0, "Member 'FChatColorScheme::PartyHyperlinkChatColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, EnemyColor) == 0x000100, "Member 'FChatColorScheme::EnemyColor' has a wrong offset!");
static_assert(offsetof(FChatColorScheme, FriendlyColor) == 0x000110, "Member 'FChatColorScheme::FriendlyColor' has a wrong offset!");

// ScriptStruct LauncherSocialTypes.ChatMarkupStyle
// 0x0820 (0x0820 - 0x0000)
struct FChatMarkupStyle final
{
public:
	struct FButtonStyle                           MarkupButtonStyle;                                 // 0x0000(0x0370)(Edit, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        MarkupTextStyle;                                   // 0x0370(0x02E0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MarkupBackground;                                  // 0x0650(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonColor;                                       // 0x0700(0x0014)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonHoverColor;                                  // 0x0714(0x0014)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            TipColor;                                          // 0x0728(0x0014)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_73C[0x4];                                      // 0x073C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SeperatorBrush;                                    // 0x0740(0x00B0)(Edit, NativeAccessSpecifierPublic)
	float                                         SeperatorThickness;                                // 0x07F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                MarkupPadding;                                     // 0x07F4(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ButtonPadding;                                     // 0x0804(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_814[0xC];                                      // 0x0814(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChatMarkupStyle) == 0x000010, "Wrong alignment on FChatMarkupStyle");
static_assert(sizeof(FChatMarkupStyle) == 0x000820, "Wrong size on FChatMarkupStyle");
static_assert(offsetof(FChatMarkupStyle, MarkupButtonStyle) == 0x000000, "Member 'FChatMarkupStyle::MarkupButtonStyle' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, MarkupTextStyle) == 0x000370, "Member 'FChatMarkupStyle::MarkupTextStyle' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, MarkupBackground) == 0x000650, "Member 'FChatMarkupStyle::MarkupBackground' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, ButtonColor) == 0x000700, "Member 'FChatMarkupStyle::ButtonColor' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, ButtonHoverColor) == 0x000714, "Member 'FChatMarkupStyle::ButtonHoverColor' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, TipColor) == 0x000728, "Member 'FChatMarkupStyle::TipColor' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, SeperatorBrush) == 0x000740, "Member 'FChatMarkupStyle::SeperatorBrush' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, SeperatorThickness) == 0x0007F0, "Member 'FChatMarkupStyle::SeperatorThickness' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, MarkupPadding) == 0x0007F4, "Member 'FChatMarkupStyle::MarkupPadding' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, ButtonPadding) == 0x000804, "Member 'FChatMarkupStyle::ButtonPadding' has a wrong offset!");

// ScriptStruct LauncherSocialTypes.ChatStyle
// 0x1880 (0x1880 - 0x0000)
struct FChatStyle final
{
public:
	struct FEditableTextBoxStyle                  ChatEntryTextStyle;                                // 0x0000(0x0A00)(Edit, NativeAccessSpecifierPublic)
	struct FEditableTextBoxStyle                  ChatDisplayTextStyle;                              // 0x0A00(0x0A00)(Edit, NativeAccessSpecifierPublic)
	struct FScrollBoxStyle                        ScrollBorderStyle;                                 // 0x1400(0x02D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MessageNotificationBrush;                          // 0x16D0(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ChatEntryPadding;                                  // 0x1780(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ChatEntryHeight;                                   // 0x1790(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1794[0xC];                                     // 0x1794(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ChatMenuBackgroundBrush;                           // 0x17A0(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionPadding;                               // 0x1850(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionHeaderPadding;                         // 0x1860(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionStatusMargin;                          // 0x1870(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatStyle) == 0x000010, "Wrong alignment on FChatStyle");
static_assert(sizeof(FChatStyle) == 0x001880, "Wrong size on FChatStyle");
static_assert(offsetof(FChatStyle, ChatEntryTextStyle) == 0x000000, "Member 'FChatStyle::ChatEntryTextStyle' has a wrong offset!");
static_assert(offsetof(FChatStyle, ChatDisplayTextStyle) == 0x000A00, "Member 'FChatStyle::ChatDisplayTextStyle' has a wrong offset!");
static_assert(offsetof(FChatStyle, ScrollBorderStyle) == 0x001400, "Member 'FChatStyle::ScrollBorderStyle' has a wrong offset!");
static_assert(offsetof(FChatStyle, MessageNotificationBrush) == 0x0016D0, "Member 'FChatStyle::MessageNotificationBrush' has a wrong offset!");
static_assert(offsetof(FChatStyle, ChatEntryPadding) == 0x001780, "Member 'FChatStyle::ChatEntryPadding' has a wrong offset!");
static_assert(offsetof(FChatStyle, ChatEntryHeight) == 0x001790, "Member 'FChatStyle::ChatEntryHeight' has a wrong offset!");
static_assert(offsetof(FChatStyle, ChatMenuBackgroundBrush) == 0x0017A0, "Member 'FChatStyle::ChatMenuBackgroundBrush' has a wrong offset!");
static_assert(offsetof(FChatStyle, FriendActionPadding) == 0x001850, "Member 'FChatStyle::FriendActionPadding' has a wrong offset!");
static_assert(offsetof(FChatStyle, FriendActionHeaderPadding) == 0x001860, "Member 'FChatStyle::FriendActionHeaderPadding' has a wrong offset!");
static_assert(offsetof(FChatStyle, FriendActionStatusMargin) == 0x001870, "Member 'FChatStyle::FriendActionStatusMargin' has a wrong offset!");

// ScriptStruct LauncherSocialTypes.SocialFontStyle
// 0x0240 (0x0240 - 0x0000)
struct FSocialFontStyle final
{
public:
	struct FSlateFontInfo                         FontSmall;                                         // 0x0000(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontSmallBold;                                     // 0x0058(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontNormal;                                        // 0x00B0(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontNormalBold;                                    // 0x0108(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontLarge;                                         // 0x0160(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontLargeBold;                                     // 0x01B8(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultFontColor;                                  // 0x0210(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InvertedFontColor;                                 // 0x0220(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultDullFontColor;                              // 0x0230(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSocialFontStyle) == 0x000008, "Wrong alignment on FSocialFontStyle");
static_assert(sizeof(FSocialFontStyle) == 0x000240, "Wrong size on FSocialFontStyle");
static_assert(offsetof(FSocialFontStyle, FontSmall) == 0x000000, "Member 'FSocialFontStyle::FontSmall' has a wrong offset!");
static_assert(offsetof(FSocialFontStyle, FontSmallBold) == 0x000058, "Member 'FSocialFontStyle::FontSmallBold' has a wrong offset!");
static_assert(offsetof(FSocialFontStyle, FontNormal) == 0x0000B0, "Member 'FSocialFontStyle::FontNormal' has a wrong offset!");
static_assert(offsetof(FSocialFontStyle, FontNormalBold) == 0x000108, "Member 'FSocialFontStyle::FontNormalBold' has a wrong offset!");
static_assert(offsetof(FSocialFontStyle, FontLarge) == 0x000160, "Member 'FSocialFontStyle::FontLarge' has a wrong offset!");
static_assert(offsetof(FSocialFontStyle, FontLargeBold) == 0x0001B8, "Member 'FSocialFontStyle::FontLargeBold' has a wrong offset!");
static_assert(offsetof(FSocialFontStyle, DefaultFontColor) == 0x000210, "Member 'FSocialFontStyle::DefaultFontColor' has a wrong offset!");
static_assert(offsetof(FSocialFontStyle, InvertedFontColor) == 0x000220, "Member 'FSocialFontStyle::InvertedFontColor' has a wrong offset!");
static_assert(offsetof(FSocialFontStyle, DefaultDullFontColor) == 0x000230, "Member 'FSocialFontStyle::DefaultDullFontColor' has a wrong offset!");

// ScriptStruct LauncherSocialTypes.SocialListStyle
// 0x3390 (0x3390 - 0x0000)
struct FSocialListStyle final
{
public:
	struct FButtonStyle                           GlobalChatButtonStyle;                             // 0x0000(0x0370)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            GlobalChatIcon;                                    // 0x0370(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           FriendItemButtonStyle;                             // 0x0420(0x0370)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           ConfirmButtonStyle;                                // 0x0790(0x0370)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           CancelButtonStyle;                                 // 0x0B00(0x0370)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonContentColor;                                // 0x0E70(0x0014)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonHoverContentColor;                           // 0x0E84(0x0014)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_E98[0x8];                                      // 0x0E98(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ActionMenuArrowBrush;                              // 0x0EA0(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ActionMenuArrowRightBrush;                         // 0x0F50(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ActionMenuBackgroundColor;                         // 0x1000(0x0014)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_1014[0xC];                                     // 0x1014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ToolTipArrowBrush;                                 // 0x1020(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           BackButtonStyle;                                   // 0x10D0(0x0370)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           HeaderButtonStyle;                                 // 0x1440(0x0370)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           FriendListActionButtonStyle;                       // 0x17B0(0x0370)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            AddFriendButtonContentBrush;                       // 0x1B20(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            StatusIconBrush;                                   // 0x1BD0(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            PCIconBrush;                                       // 0x1C80(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ConsoleIconBrush;                                  // 0x1D30(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MobileIconBrush;                                   // 0x1DE0(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FacebookIconBrush;                                 // 0x1E90(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            EpicIconBrush;                                     // 0x1F40(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendImageBrush;                                  // 0x1FF0(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OfflineBrush;                                      // 0x20A0(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OnlineBrush;                                       // 0x2150(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            AwayBrush;                                         // 0x2200(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SpectateBrush;                                     // 0x22B0(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendsContainerBackground;                        // 0x2360(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendsListBackground;                             // 0x2410(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FEditableTextBoxStyle                  AddFriendEditableTextStyle;                        // 0x24C0(0x0A00)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackBrush;                                         // 0x2EC0(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SelectedOptionBrush;                               // 0x2F70(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SettingsBrush;                                     // 0x3020(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SeperatorBrush;                                    // 0x30D0(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            PresenceSeperatorBrush;                            // 0x3180(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FontSizeBrush;                                     // 0x3230(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SearchBrush;                                       // 0x32E0(0x00B0)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSocialListStyle) == 0x000010, "Wrong alignment on FSocialListStyle");
static_assert(sizeof(FSocialListStyle) == 0x003390, "Wrong size on FSocialListStyle");
static_assert(offsetof(FSocialListStyle, GlobalChatButtonStyle) == 0x000000, "Member 'FSocialListStyle::GlobalChatButtonStyle' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, GlobalChatIcon) == 0x000370, "Member 'FSocialListStyle::GlobalChatIcon' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendItemButtonStyle) == 0x000420, "Member 'FSocialListStyle::FriendItemButtonStyle' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ConfirmButtonStyle) == 0x000790, "Member 'FSocialListStyle::ConfirmButtonStyle' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, CancelButtonStyle) == 0x000B00, "Member 'FSocialListStyle::CancelButtonStyle' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ButtonContentColor) == 0x000E70, "Member 'FSocialListStyle::ButtonContentColor' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ButtonHoverContentColor) == 0x000E84, "Member 'FSocialListStyle::ButtonHoverContentColor' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ActionMenuArrowBrush) == 0x000EA0, "Member 'FSocialListStyle::ActionMenuArrowBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ActionMenuArrowRightBrush) == 0x000F50, "Member 'FSocialListStyle::ActionMenuArrowRightBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ActionMenuBackgroundColor) == 0x001000, "Member 'FSocialListStyle::ActionMenuBackgroundColor' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ToolTipArrowBrush) == 0x001020, "Member 'FSocialListStyle::ToolTipArrowBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, BackButtonStyle) == 0x0010D0, "Member 'FSocialListStyle::BackButtonStyle' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, HeaderButtonStyle) == 0x001440, "Member 'FSocialListStyle::HeaderButtonStyle' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendListActionButtonStyle) == 0x0017B0, "Member 'FSocialListStyle::FriendListActionButtonStyle' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, AddFriendButtonContentBrush) == 0x001B20, "Member 'FSocialListStyle::AddFriendButtonContentBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, StatusIconBrush) == 0x001BD0, "Member 'FSocialListStyle::StatusIconBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, PCIconBrush) == 0x001C80, "Member 'FSocialListStyle::PCIconBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ConsoleIconBrush) == 0x001D30, "Member 'FSocialListStyle::ConsoleIconBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, MobileIconBrush) == 0x001DE0, "Member 'FSocialListStyle::MobileIconBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FacebookIconBrush) == 0x001E90, "Member 'FSocialListStyle::FacebookIconBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, EpicIconBrush) == 0x001F40, "Member 'FSocialListStyle::EpicIconBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendImageBrush) == 0x001FF0, "Member 'FSocialListStyle::FriendImageBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, OfflineBrush) == 0x0020A0, "Member 'FSocialListStyle::OfflineBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, OnlineBrush) == 0x002150, "Member 'FSocialListStyle::OnlineBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, AwayBrush) == 0x002200, "Member 'FSocialListStyle::AwayBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SpectateBrush) == 0x0022B0, "Member 'FSocialListStyle::SpectateBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendsContainerBackground) == 0x002360, "Member 'FSocialListStyle::FriendsContainerBackground' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendsListBackground) == 0x002410, "Member 'FSocialListStyle::FriendsListBackground' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, AddFriendEditableTextStyle) == 0x0024C0, "Member 'FSocialListStyle::AddFriendEditableTextStyle' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, BackBrush) == 0x002EC0, "Member 'FSocialListStyle::BackBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SelectedOptionBrush) == 0x002F70, "Member 'FSocialListStyle::SelectedOptionBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SettingsBrush) == 0x003020, "Member 'FSocialListStyle::SettingsBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SeperatorBrush) == 0x0030D0, "Member 'FSocialListStyle::SeperatorBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, PresenceSeperatorBrush) == 0x003180, "Member 'FSocialListStyle::PresenceSeperatorBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FontSizeBrush) == 0x003230, "Member 'FSocialListStyle::FontSizeBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SearchBrush) == 0x0032E0, "Member 'FSocialListStyle::SearchBrush' has a wrong offset!");

// ScriptStruct LauncherSocialTypes.ProfanityData
// 0x0038 (0x0038 - 0x0000)
struct FProfanityData final
{
public:
	class FString                                 CountryCode;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProfanityList;                                     // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WhiteList;                                         // 0x0020(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoAdd;                                          // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FProfanityData) == 0x000008, "Wrong alignment on FProfanityData");
static_assert(sizeof(FProfanityData) == 0x000038, "Wrong size on FProfanityData");
static_assert(offsetof(FProfanityData, CountryCode) == 0x000000, "Member 'FProfanityData::CountryCode' has a wrong offset!");
static_assert(offsetof(FProfanityData, ProfanityList) == 0x000010, "Member 'FProfanityData::ProfanityList' has a wrong offset!");
static_assert(offsetof(FProfanityData, WhiteList) == 0x000020, "Member 'FProfanityData::WhiteList' has a wrong offset!");
static_assert(offsetof(FProfanityData, bAutoAdd) == 0x000030, "Member 'FProfanityData::bAutoAdd' has a wrong offset!");

// ScriptStruct LauncherSocialTypes.SocialSoundSchema
// 0x0048 (0x0048 - 0x0000)
struct FSocialSoundSchema final
{
public:
	struct FSlateSound                            MessageReceivedSound;                              // 0x0000(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            PartyInviteReceivedSound;                          // 0x0018(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            FriendInviteReceivedSound;                         // 0x0030(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSocialSoundSchema) == 0x000008, "Wrong alignment on FSocialSoundSchema");
static_assert(sizeof(FSocialSoundSchema) == 0x000048, "Wrong size on FSocialSoundSchema");
static_assert(offsetof(FSocialSoundSchema, MessageReceivedSound) == 0x000000, "Member 'FSocialSoundSchema::MessageReceivedSound' has a wrong offset!");
static_assert(offsetof(FSocialSoundSchema, PartyInviteReceivedSound) == 0x000018, "Member 'FSocialSoundSchema::PartyInviteReceivedSound' has a wrong offset!");
static_assert(offsetof(FSocialSoundSchema, FriendInviteReceivedSound) == 0x000030, "Member 'FSocialSoundSchema::FriendInviteReceivedSound' has a wrong offset!");

// ScriptStruct LauncherSocialTypes.SocialStyle
// 0x8840 (0x8840 - 0x0000)
struct FSocialStyle final
{
public:
	struct FScrollBarStyle                        ScrollBarStyle;                                    // 0x0000(0x0650)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           ActionButtonStyle;                                 // 0x0650(0x0370)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       SmallFontStyle;                                    // 0x09C0(0x0240)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       NormalFontStyle;                                   // 0x0C00(0x0240)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       LargeFontStyle;                                    // 0x0E40(0x0240)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       ChatFontStyle;                                     // 0x1080(0x0240)(Edit, NativeAccessSpecifierPublic)
	struct FCheckBoxStyle                         CheckBoxStyle;                                     // 0x12C0(0x0950)(Edit, NativeAccessSpecifierPublic)
	struct FCheckBoxStyle                         RadioBoxStyle;                                     // 0x1C10(0x0950)(Edit, NativeAccessSpecifierPublic)
	struct FSocialListStyle                       SocialListStyle;                                   // 0x2560(0x3390)(Edit, NativeAccessSpecifierPublic)
	struct FSocialListMargins                     SocialListMargins;                                 // 0x58F0(0x0200)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FChatStyle                             ChatStyle;                                         // 0x5AF0(0x1880)(Edit, NativeAccessSpecifierPublic)
	struct FChatColorScheme                       ChatColorScheme;                                   // 0x7370(0x0120)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FChatChromeStyle                       ChatChromeStyle;                                   // 0x7490(0x0A80)(Edit, NativeAccessSpecifierPublic)
	struct FChatChromeMargins                     ChatChromeMargins;                                 // 0x7F10(0x0064)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FChatChromeColorScheme                 ChatChromeColorScheme;                             // 0x7F74(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_7FC4[0xC];                                     // 0x7FC4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChatMarkupStyle                       ChatMarkupStyle;                                   // 0x7FD0(0x0820)(Edit, NativeAccessSpecifierPublic)
	struct FSocialSoundSchema                     SoundSchema;                                       // 0x87F0(0x0048)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8838[0x8];                                     // 0x8838(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSocialStyle) == 0x000010, "Wrong alignment on FSocialStyle");
static_assert(sizeof(FSocialStyle) == 0x008840, "Wrong size on FSocialStyle");
static_assert(offsetof(FSocialStyle, ScrollBarStyle) == 0x000000, "Member 'FSocialStyle::ScrollBarStyle' has a wrong offset!");
static_assert(offsetof(FSocialStyle, ActionButtonStyle) == 0x000650, "Member 'FSocialStyle::ActionButtonStyle' has a wrong offset!");
static_assert(offsetof(FSocialStyle, SmallFontStyle) == 0x0009C0, "Member 'FSocialStyle::SmallFontStyle' has a wrong offset!");
static_assert(offsetof(FSocialStyle, NormalFontStyle) == 0x000C00, "Member 'FSocialStyle::NormalFontStyle' has a wrong offset!");
static_assert(offsetof(FSocialStyle, LargeFontStyle) == 0x000E40, "Member 'FSocialStyle::LargeFontStyle' has a wrong offset!");
