#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaderboardListViewWrapper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LeaderboardListViewWrapper.LeaderboardListViewWrapper_C
// 0x0210 (0x0550 - 0x0340)
class ULeaderboardListViewWrapper_C final : public UFortLeaderboardListViewWrapper
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEventsSimpleButton_C*                  Button_Filter;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventsSimpleButton_C*                  Button_Position;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_OptionsBarBG;                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_FliterOptions;                // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardPlayerPerformance_C*   EventLeaderboardPlayerPerformance;                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortTournamentDisplayInfo             DisplayInfo;                                       // 0x0380(0x01D0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_LeaderboardListViewWrapper(int32 EntryPoint);
	void OnLeaderboardDisplayTypeChanged(ELeaderboardDisplayType NewDisplayType);
	void Set_Display_Info(const struct FFortTournamentDisplayInfo& DisplayInfo_0);
	void Set_Event(const class FString& EventId, const class FString& EventWindowId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LeaderboardListViewWrapper_C">();
	}
	static class ULeaderboardListViewWrapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaderboardListViewWrapper_C>();
	}
};
static_assert(alignof(ULeaderboardListViewWrapper_C) == 0x000008, "Wrong alignment on ULeaderboardListViewWrapper_C");
static_assert(sizeof(ULeaderboardListViewWrapper_C) == 0x000550, "Wrong size on ULeaderboardListViewWrapper_C");
static_assert(offsetof(ULeaderboardListViewWrapper_C, UberGraphFrame) == 0x000340, "Member 'ULeaderboardListViewWrapper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULeaderboardListViewWrapper_C, Button_Filter) == 0x000348, "Member 'ULeaderboardListViewWrapper_C::Button_Filter' has a wrong offset!");
static_assert(offsetof(ULeaderboardListViewWrapper_C, Button_Position) == 0x000350, "Member 'ULeaderboardListViewWrapper_C::Button_Position' has a wrong offset!");
static_assert(offsetof(ULeaderboardListViewWrapper_C, CommonBorder_OptionsBarBG) == 0x000358, "Member 'ULeaderboardListViewWrapper_C::CommonBorder_OptionsBarBG' has a wrong offset!");
static_assert(offsetof(ULeaderboardListViewWrapper_C, CommonWidgetSwitcher_FliterOptions) == 0x000360, "Member 'ULeaderboardListViewWrapper_C::CommonWidgetSwitcher_FliterOptions' has a wrong offset!");
static_assert(offsetof(ULeaderboardListViewWrapper_C, EventLeaderboardPlayerPerformance) == 0x000368, "Member 'ULeaderboardListViewWrapper_C::EventLeaderboardPlayerPerformance' has a wrong offset!");
static_assert(offsetof(ULeaderboardListViewWrapper_C, Image_0) == 0x000370, "Member 'ULeaderboardListViewWrapper_C::Image_0' has a wrong offset!");
static_assert(offsetof(ULeaderboardListViewWrapper_C, VerticalBox) == 0x000378, "Member 'ULeaderboardListViewWrapper_C::VerticalBox' has a wrong offset!");
static_assert(offsetof(ULeaderboardListViewWrapper_C, DisplayInfo) == 0x000380, "Member 'ULeaderboardListViewWrapper_C::DisplayInfo' has a wrong offset!");

}

