#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadoutSaveConfirmation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadoutSaveConfirmation.LoadoutSaveConfirmation_C
// 0x0070 (0x0560 - 0x04F0)
class ULoadoutSaveConfirmation_C final : public UFortLoadoutSaveConfirmation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_66;                                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator_Down;                              // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator_Up;                                // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_145;                                      // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SwitcherExplanation;                               // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SwitcherTitle;                                     // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlockCREATE;                                   // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   TextBlockExplanation;                              // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   TextBlockExplanation_SaveOnly;                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlockOR;                                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlockTitle;                                    // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlockTitle_SaveOnly;                           // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LoadoutSaveConfirmation(int32 EntryPoint);
	void OnCanSaveAsNew(bool bCanSaveAsNew);
	void Toggle_Save_as_New_Visibility(bool CanSaveAsNew);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadoutSaveConfirmation_C">();
	}
	static class ULoadoutSaveConfirmation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadoutSaveConfirmation_C>();
	}
};
static_assert(alignof(ULoadoutSaveConfirmation_C) == 0x000008, "Wrong alignment on ULoadoutSaveConfirmation_C");
static_assert(sizeof(ULoadoutSaveConfirmation_C) == 0x000560, "Wrong size on ULoadoutSaveConfirmation_C");
static_assert(offsetof(ULoadoutSaveConfirmation_C, UberGraphFrame) == 0x0004F0, "Member 'ULoadoutSaveConfirmation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, Image_66) == 0x0004F8, "Member 'ULoadoutSaveConfirmation_C::Image_66' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, Image_Separator_Down) == 0x000500, "Member 'ULoadoutSaveConfirmation_C::Image_Separator_Down' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, Image_Separator_Up) == 0x000508, "Member 'ULoadoutSaveConfirmation_C::Image_Separator_Up' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, Lightbox) == 0x000510, "Member 'ULoadoutSaveConfirmation_C::Lightbox' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, SafeZone_145) == 0x000518, "Member 'ULoadoutSaveConfirmation_C::SafeZone_145' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, SwitcherExplanation) == 0x000520, "Member 'ULoadoutSaveConfirmation_C::SwitcherExplanation' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, SwitcherTitle) == 0x000528, "Member 'ULoadoutSaveConfirmation_C::SwitcherTitle' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, TextBlockCREATE) == 0x000530, "Member 'ULoadoutSaveConfirmation_C::TextBlockCREATE' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, TextBlockExplanation) == 0x000538, "Member 'ULoadoutSaveConfirmation_C::TextBlockExplanation' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, TextBlockExplanation_SaveOnly) == 0x000540, "Member 'ULoadoutSaveConfirmation_C::TextBlockExplanation_SaveOnly' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, TextBlockOR) == 0x000548, "Member 'ULoadoutSaveConfirmation_C::TextBlockOR' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, TextBlockTitle) == 0x000550, "Member 'ULoadoutSaveConfirmation_C::TextBlockTitle' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, TextBlockTitle_SaveOnly) == 0x000558, "Member 'ULoadoutSaveConfirmation_C::TextBlockTitle_SaveOnly' has a wrong offset!");

}

