#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyPlayerAddPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C
// 0x0030 (0x0F80 - 0x0F50)
class ULobbyPlayerAddPlayer_C final : public UFortLobbyAddPlayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowPartyFinderText;                               // 0x0F58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHovered;                                         // 0x0F60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_76;                                // 0x0F68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayInputAction;                                // 0x0F70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_ControlLegend;                                  // 0x0F78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_LobbyPlayerAddPlayer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyPlayerAddPlayer_C">();
	}
	static class ULobbyPlayerAddPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULobbyPlayerAddPlayer_C>();
	}
};
static_assert(alignof(ULobbyPlayerAddPlayer_C) == 0x000010, "Wrong alignment on ULobbyPlayerAddPlayer_C");
static_assert(sizeof(ULobbyPlayerAddPlayer_C) == 0x000F80, "Wrong size on ULobbyPlayerAddPlayer_C");
static_assert(offsetof(ULobbyPlayerAddPlayer_C, UberGraphFrame) == 0x000F50, "Member 'ULobbyPlayerAddPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerAddPlayer_C, ShowPartyFinderText) == 0x000F58, "Member 'ULobbyPlayerAddPlayer_C::ShowPartyFinderText' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerAddPlayer_C, OnHovered) == 0x000F60, "Member 'ULobbyPlayerAddPlayer_C::OnHovered' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerAddPlayer_C, CommonTextBlock_76) == 0x000F68, "Member 'ULobbyPlayerAddPlayer_C::CommonTextBlock_76' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerAddPlayer_C, OverlayInputAction) == 0x000F70, "Member 'ULobbyPlayerAddPlayer_C::OverlayInputAction' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerAddPlayer_C, VB_ControlLegend) == 0x000F78, "Member 'ULobbyPlayerAddPlayer_C::VB_ControlLegend' has a wrong offset!");

}

