#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyPlayerPadGadgets

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LobbyPlayerPadGadgets.LobbyPlayerPadGadgets_C
// 0x0040 (0x02B0 - 0x0270)
class ULobbyPlayerPadGadgets_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULobbyGadgetButton_C*                   Gadget1;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULobbyGadgetButton_C*                   Gadget2;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnGadgetsMouseEntered;                             // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnGadgetsMouseLeft;                                // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_LobbyPlayerPadGadgets(int32 EntryPoint);
	void Initialize(int32 PlayerIndex_0);
	void OnInputClicked();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void Refresh(const struct FFortTeamMemberInfo& TeamMemberInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyPlayerPadGadgets_C">();
	}
	static class ULobbyPlayerPadGadgets_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULobbyPlayerPadGadgets_C>();
	}
};
static_assert(alignof(ULobbyPlayerPadGadgets_C) == 0x000008, "Wrong alignment on ULobbyPlayerPadGadgets_C");
static_assert(sizeof(ULobbyPlayerPadGadgets_C) == 0x0002B0, "Wrong size on ULobbyPlayerPadGadgets_C");
static_assert(offsetof(ULobbyPlayerPadGadgets_C, UberGraphFrame) == 0x000270, "Member 'ULobbyPlayerPadGadgets_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadGadgets_C, Gadget1) == 0x000278, "Member 'ULobbyPlayerPadGadgets_C::Gadget1' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadGadgets_C, Gadget2) == 0x000280, "Member 'ULobbyPlayerPadGadgets_C::Gadget2' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadGadgets_C, PlayerIndex) == 0x000288, "Member 'ULobbyPlayerPadGadgets_C::PlayerIndex' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadGadgets_C, OnGadgetsMouseEntered) == 0x000290, "Member 'ULobbyPlayerPadGadgets_C::OnGadgetsMouseEntered' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadGadgets_C, OnGadgetsMouseLeft) == 0x0002A0, "Member 'ULobbyPlayerPadGadgets_C::OnGadgetsMouseLeft' has a wrong offset!");

}

