#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocalUserSettingTitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LocalUserSettingTitle.LocalUserSettingTitle_C
// 0x0030 (0x0F30 - 0x0F00)
class ULocalUserSettingTitle_C final : public UFortLocalUserSettingTitleButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnExpansion;                                       // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0F10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ExpandDirectionTick;                               // 0x0F18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_EntryContent;                                   // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_LocalUserSettingTitle(int32 EntryPoint);
	void OnExpansionChanged(bool bIsExpanded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LocalUserSettingTitle_C">();
	}
	static class ULocalUserSettingTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalUserSettingTitle_C>();
	}
};
static_assert(alignof(ULocalUserSettingTitle_C) == 0x000010, "Wrong alignment on ULocalUserSettingTitle_C");
static_assert(sizeof(ULocalUserSettingTitle_C) == 0x000F30, "Wrong size on ULocalUserSettingTitle_C");
static_assert(offsetof(ULocalUserSettingTitle_C, UberGraphFrame) == 0x000F00, "Member 'ULocalUserSettingTitle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULocalUserSettingTitle_C, OnExpansion) == 0x000F08, "Member 'ULocalUserSettingTitle_C::OnExpansion' has a wrong offset!");
static_assert(offsetof(ULocalUserSettingTitle_C, OnHover) == 0x000F10, "Member 'ULocalUserSettingTitle_C::OnHover' has a wrong offset!");
static_assert(offsetof(ULocalUserSettingTitle_C, ExpandDirectionTick) == 0x000F18, "Member 'ULocalUserSettingTitle_C::ExpandDirectionTick' has a wrong offset!");
static_assert(offsetof(ULocalUserSettingTitle_C, SB_EntryContent) == 0x000F20, "Member 'ULocalUserSettingTitle_C::SB_EntryContent' has a wrong offset!");

}

