#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocalUserSettingButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LocalUserSettingButton.LocalUserSettingButton_C
// 0x0020 (0x0F30 - 0x0F10)
class ULocalUserSettingButton_C final : public UFortLocalUserSettingButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0F18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_InteractionIndicator;                       // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_AnimatedArrow;                               // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_LocalUserSettingButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LocalUserSettingButton_C">();
	}
	static class ULocalUserSettingButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalUserSettingButton_C>();
	}
};
static_assert(alignof(ULocalUserSettingButton_C) == 0x000010, "Wrong alignment on ULocalUserSettingButton_C");
static_assert(sizeof(ULocalUserSettingButton_C) == 0x000F30, "Wrong size on ULocalUserSettingButton_C");
static_assert(offsetof(ULocalUserSettingButton_C, UberGraphFrame) == 0x000F10, "Member 'ULocalUserSettingButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULocalUserSettingButton_C, OnHover) == 0x000F18, "Member 'ULocalUserSettingButton_C::OnHover' has a wrong offset!");
static_assert(offsetof(ULocalUserSettingButton_C, Border_InteractionIndicator) == 0x000F20, "Member 'ULocalUserSettingButton_C::Border_InteractionIndicator' has a wrong offset!");
static_assert(offsetof(ULocalUserSettingButton_C, Image_AnimatedArrow) == 0x000F28, "Member 'ULocalUserSettingButton_C::Image_AnimatedArrow' has a wrong offset!");

}

