#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LockerBuiltInEmoteWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function LockerBuiltInEmoteWidget.LockerBuiltInEmoteWidget_C.ExecuteUbergraph_LockerBuiltInEmoteWidget
// 0x000C (0x000C - 0x0000)
struct LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bLocked;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget) == 0x000004, "Wrong alignment on LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget");
static_assert(sizeof(LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget) == 0x00000C, "Wrong size on LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget");
static_assert(offsetof(LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget, EntryPoint) == 0x000000, "Member 'LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget, Temp_bool_Variable) == 0x000004, "Member 'LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget, Temp_byte_Variable) == 0x000005, "Member 'LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget, Temp_byte_Variable_1) == 0x000006, "Member 'LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget, K2Node_Event_bLocked) == 0x000007, "Member 'LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget::K2Node_Event_bLocked' has a wrong offset!");
static_assert(offsetof(LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget, K2Node_Select_Default) == 0x000008, "Member 'LockerBuiltInEmoteWidget_C_ExecuteUbergraph_LockerBuiltInEmoteWidget::K2Node_Select_Default' has a wrong offset!");

// Function LockerBuiltInEmoteWidget.LockerBuiltInEmoteWidget_C.OnUpdateLocked
// 0x0001 (0x0001 - 0x0000)
struct LockerBuiltInEmoteWidget_C_OnUpdateLocked final
{
public:
	bool                                          bLocked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LockerBuiltInEmoteWidget_C_OnUpdateLocked) == 0x000001, "Wrong alignment on LockerBuiltInEmoteWidget_C_OnUpdateLocked");
static_assert(sizeof(LockerBuiltInEmoteWidget_C_OnUpdateLocked) == 0x000001, "Wrong size on LockerBuiltInEmoteWidget_C_OnUpdateLocked");
static_assert(offsetof(LockerBuiltInEmoteWidget_C_OnUpdateLocked, bLocked) == 0x000000, "Member 'LockerBuiltInEmoteWidget_C_OnUpdateLocked::bLocked' has a wrong offset!");

}

