#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_HamburgerButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MainMenu_HamburgerButton.MainMenu_HamburgerButton_C.ExecuteUbergraph_MainMenu_HamburgerButton
// 0x0078 (0x0078 - 0x0000)
struct MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_1;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_SelectMaterialInstance_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_2;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton) == 0x000008, "Wrong alignment on MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton");
static_assert(sizeof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton) == 0x000078, "Wrong size on MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, EntryPoint) == 0x000000, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, Temp_bool_Variable) == 0x000004, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, Temp_float_Variable) == 0x000008, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, Temp_bool_Variable_1) == 0x00000C, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, Temp_float_Variable_1) == 0x000010, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, Temp_float_Variable_2) == 0x000014, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_IsMobileGame_ReturnValue) == 0x000018, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000020, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, Temp_float_Variable_3) == 0x000028, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_BooleanAND_ReturnValue) == 0x00002C, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_IsMobileGame_ReturnValue_1) == 0x00002D, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000030, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000038, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_GetRuntimeOptions_ReturnValue_1) == 0x000040, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_GetRuntimeOptions_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_BooleanAND_ReturnValue_1) == 0x000048, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_SelectMaterialInstance_ReturnValue) == 0x000050, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_SelectMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_SelectColor_ReturnValue) == 0x000058, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_IsMobileGame_ReturnValue_2) == 0x000068, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_IsMobileGame_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, K2Node_Select_Default) == 0x00006C, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, K2Node_Select_Default_1) == 0x000070, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::K2Node_Select_Default_1' has a wrong offset!");

}

