#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_HamburgerButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_HamburgerButton.MainMenu_HamburgerButton_C
// 0x0040 (0x0F40 - 0x0F00)
class UMainMenu_HamburgerButton_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_EF8[0x8];                                      // 0x0EF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover_Grow;                                        // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Bounce;                                      // 0x0F10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0F18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Icon;                                              // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                IconColor;                                         // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               VariableSize;                                      // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_MainMenu_HamburgerButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_HamburgerButton_C">();
	}
	static class UMainMenu_HamburgerButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_HamburgerButton_C>();
	}
};
static_assert(alignof(UMainMenu_HamburgerButton_C) == 0x000010, "Wrong alignment on UMainMenu_HamburgerButton_C");
static_assert(sizeof(UMainMenu_HamburgerButton_C) == 0x000F40, "Wrong size on UMainMenu_HamburgerButton_C");
static_assert(offsetof(UMainMenu_HamburgerButton_C, UberGraphFrame) == 0x000F00, "Member 'UMainMenu_HamburgerButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, Hover_Grow) == 0x000F08, "Member 'UMainMenu_HamburgerButton_C::Hover_Grow' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, Hover_Bounce) == 0x000F10, "Member 'UMainMenu_HamburgerButton_C::Hover_Bounce' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, Hover) == 0x000F18, "Member 'UMainMenu_HamburgerButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, ButtonBacking) == 0x000F20, "Member 'UMainMenu_HamburgerButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, Icon) == 0x000F28, "Member 'UMainMenu_HamburgerButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, IconColor) == 0x000F30, "Member 'UMainMenu_HamburgerButton_C::IconColor' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, VariableSize) == 0x000F38, "Member 'UMainMenu_HamburgerButton_C::VariableSize' has a wrong offset!");

}

