#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchmakingRegionAndPool

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function MatchmakingRegionAndPool.MatchmakingRegionAndPool_C.ExecuteUbergraph_MatchmakingRegionAndPool
// 0x00C0 (0x00C0 - 0x0000)
struct MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue_1;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputBasedMatchmakingEnabled_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLegacyNonInputBasedPlayAgainstText_ReturnValue; // 0x0028(0x0018)()
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowInputKeys_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x004C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue_2;                 // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputBasedMatchmakingEnabled_ReturnValue_1; // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue_3;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetMCPRegionText_ReturnValue;             // 0x00A8(0x0018)()
};
static_assert(alignof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool) == 0x000008, "Wrong alignment on MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool");
static_assert(sizeof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool) == 0x0000C0, "Wrong size on MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, EntryPoint) == 0x000000, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::EntryPoint' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, Temp_int_Variable) == 0x000004, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, Temp_int_Variable_1) == 0x000008, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, CallFunc_GetContext_ReturnValue_1) == 0x000018, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, CallFunc_IsInputBasedMatchmakingEnabled_ReturnValue) == 0x000020, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::CallFunc_IsInputBasedMatchmakingEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, CallFunc_GetLegacyNonInputBasedPlayAgainstText_ReturnValue) == 0x000028, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::CallFunc_GetLegacyNonInputBasedPlayAgainstText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000040, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, Temp_bool_Variable) == 0x000048, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, CallFunc_ShouldShowInputKeys_ReturnValue) == 0x000049, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::CallFunc_ShouldShowInputKeys_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, Temp_byte_Variable) == 0x00004A, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, Temp_byte_Variable_1) == 0x00004B, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, K2Node_Event_MyGeometry) == 0x00004C, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, K2Node_Event_InDeltaTime) == 0x000084, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, K2Node_Select_Default) == 0x000088, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, Temp_bool_Variable_1) == 0x000089, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, CallFunc_GetContext_ReturnValue_2) == 0x000090, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, CallFunc_IsInputBasedMatchmakingEnabled_ReturnValue_1) == 0x000098, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::CallFunc_IsInputBasedMatchmakingEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, K2Node_Select_Default_1) == 0x00009C, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, CallFunc_GetContext_ReturnValue_3) == 0x0000A0, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::CallFunc_GetContext_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool, CallFunc_GetMCPRegionText_ReturnValue) == 0x0000A8, "Member 'MatchmakingRegionAndPool_C_ExecuteUbergraph_MatchmakingRegionAndPool::CallFunc_GetMCPRegionText_ReturnValue' has a wrong offset!");

// Function MatchmakingRegionAndPool.MatchmakingRegionAndPool_C.Tick
// 0x003C (0x003C - 0x0000)
struct MatchmakingRegionAndPool_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchmakingRegionAndPool_C_Tick) == 0x000004, "Wrong alignment on MatchmakingRegionAndPool_C_Tick");
static_assert(sizeof(MatchmakingRegionAndPool_C_Tick) == 0x00003C, "Wrong size on MatchmakingRegionAndPool_C_Tick");
static_assert(offsetof(MatchmakingRegionAndPool_C_Tick, MyGeometry) == 0x000000, "Member 'MatchmakingRegionAndPool_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(MatchmakingRegionAndPool_C_Tick, InDeltaTime) == 0x000038, "Member 'MatchmakingRegionAndPool_C_Tick::InDeltaTime' has a wrong offset!");

}

