#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mechanical_Engineer_Female_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Mechanical_Engineer_Female_AnimBP.Mechanical_Engineer_Female_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00CF (0x00D0 - 0x0001)
struct Mechanical_Engineer_Female_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_19;                                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_20;                                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   StructProperty_21;                                 // 0x0018(0x0020)(NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0038(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00B8(0x0018)()
};
static_assert(alignof(Mechanical_Engineer_Female_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Mechanical_Engineer_Female_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Mechanical_Engineer_Female_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000D0, "Wrong size on Mechanical_Engineer_Female_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Mechanical_Engineer_Female_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_19) == 0x000004, "Member 'Mechanical_Engineer_Female_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_19' has a wrong offset!");
static_assert(offsetof(Mechanical_Engineer_Female_AnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_20) == 0x00000C, "Member 'Mechanical_Engineer_Female_AnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_20' has a wrong offset!");
static_assert(offsetof(Mechanical_Engineer_Female_AnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_21) == 0x000018, "Member 'Mechanical_Engineer_Female_AnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_21' has a wrong offset!");
static_assert(offsetof(Mechanical_Engineer_Female_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000038, "Member 'Mechanical_Engineer_Female_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Mechanical_Engineer_Female_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000B8, "Member 'Mechanical_Engineer_Female_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

