#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mechanical_Engineer_Female_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Mechanical_Engineer_Female_AnimBP.Mechanical_Engineer_Female_AnimBP_C
// 0x0E90 (0x1410 - 0x0580)
class UMechanical_Engineer_Female_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0588(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0590(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0598(0x00C8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0660(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0680(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A0(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x06C0(0x0440)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0B00(0x07F0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x12F0(0x0108)()
	struct FRotator                               gear_rot;                                          // 0x13F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1404[0x4];                                     // 0x1404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 skel_mesh;                                         // 0x1408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mechanical_Engineer_Female_AnimBP_C">();
	}
	static class UMechanical_Engineer_Female_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMechanical_Engineer_Female_AnimBP_C>();
	}
};
static_assert(alignof(UMechanical_Engineer_Female_AnimBP_C) == 0x000010, "Wrong alignment on UMechanical_Engineer_Female_AnimBP_C");
static_assert(sizeof(UMechanical_Engineer_Female_AnimBP_C) == 0x001410, "Wrong size on UMechanical_Engineer_Female_AnimBP_C");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, UberGraphFrame) == 0x000580, "Member 'UMechanical_Engineer_Female_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000588, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimBlueprintExtension_Base) == 0x000590, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_LinkedInputPose) == 0x000598, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000660, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000680, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_Root) == 0x0006A0, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x0006C0, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_RigidBody) == 0x000B00, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_ModifyBone) == 0x0012F0, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, gear_rot) == 0x0013F8, "Member 'UMechanical_Engineer_Female_AnimBP_C::gear_rot' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, skel_mesh) == 0x001408, "Member 'UMechanical_Engineer_Female_AnimBP_C::skel_mesh' has a wrong offset!");

}

