#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeltUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function MeltUI.MeltWidgetBase.CacheAndGetSeaLevel
// 0x0004 (0x0004 - 0x0000)
struct MeltWidgetBase_CacheAndGetSeaLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MeltWidgetBase_CacheAndGetSeaLevel) == 0x000004, "Wrong alignment on MeltWidgetBase_CacheAndGetSeaLevel");
static_assert(sizeof(MeltWidgetBase_CacheAndGetSeaLevel) == 0x000004, "Wrong size on MeltWidgetBase_CacheAndGetSeaLevel");
static_assert(offsetof(MeltWidgetBase_CacheAndGetSeaLevel, ReturnValue) == 0x000000, "Member 'MeltWidgetBase_CacheAndGetSeaLevel::ReturnValue' has a wrong offset!");

// Function MeltUI.MeltWidgetBase.MutatorReady
// 0x0008 (0x0008 - 0x0000)
struct MeltWidgetBase_MutatorReady final
{
public:
	const class AFortAthenaMutator_Fill*          MutatorActor;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MeltWidgetBase_MutatorReady) == 0x000008, "Wrong alignment on MeltWidgetBase_MutatorReady");
static_assert(sizeof(MeltWidgetBase_MutatorReady) == 0x000008, "Wrong size on MeltWidgetBase_MutatorReady");
static_assert(offsetof(MeltWidgetBase_MutatorReady, MutatorActor) == 0x000000, "Member 'MeltWidgetBase_MutatorReady::MutatorActor' has a wrong offset!");

// Function MeltUI.MeltWidgetBase.GetFillMutator
// 0x0008 (0x0008 - 0x0000)
struct MeltWidgetBase_GetFillMutator final
{
public:
	class AFortAthenaMutator_Fill*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MeltWidgetBase_GetFillMutator) == 0x000008, "Wrong alignment on MeltWidgetBase_GetFillMutator");
static_assert(sizeof(MeltWidgetBase_GetFillMutator) == 0x000008, "Wrong size on MeltWidgetBase_GetFillMutator");
static_assert(offsetof(MeltWidgetBase_GetFillMutator, ReturnValue) == 0x000000, "Member 'MeltWidgetBase_GetFillMutator::ReturnValue' has a wrong offset!");

}

