#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MilitaryBase_Door_01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MilitaryBase_Door_01.MilitaryBase_Door_01_C.BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00C0 (0x00C0 - 0x0000)
struct MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x009C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000C0, "Wrong size on MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function MilitaryBase_Door_01.MilitaryBase_Door_01_C.BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'MilitaryBase_Door_01_C_BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function MilitaryBase_Door_01.MilitaryBase_Door_01_C.Close
// 0x0008 (0x0008 - 0x0000)
struct MilitaryBase_Door_01_C_Close final
{
public:
	class AController*                            ControllerInstigator;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MilitaryBase_Door_01_C_Close) == 0x000008, "Wrong alignment on MilitaryBase_Door_01_C_Close");
static_assert(sizeof(MilitaryBase_Door_01_C_Close) == 0x000008, "Wrong size on MilitaryBase_Door_01_C_Close");
static_assert(offsetof(MilitaryBase_Door_01_C_Close, ControllerInstigator) == 0x000000, "Member 'MilitaryBase_Door_01_C_Close::ControllerInstigator' has a wrong offset!");

// Function MilitaryBase_Door_01.MilitaryBase_Door_01_C.ExecuteUbergraph_MilitaryBase_Door_01
// 0x0178 (0x0178 - 0x0000)
struct MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle_1;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x013C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14E[0x2];                                      // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_ControllerInstigator_1;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_ControllerInstigator;                 // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01) == 0x000008, "Wrong alignment on MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01");
static_assert(sizeof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01) == 0x000178, "Wrong size on MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, EntryPoint) == 0x000000, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000006, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000008, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000010, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000018, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000020, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_DynamicCast_AsFort_Athena_Vehicle) == 0x0000C8, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_DynamicCast_AsFort_Athena_Vehicle' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000D8, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, CallFunc_HasAuthority_ReturnValue_1) == 0x0000E1, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000E8, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_ComponentBoundEvent_OtherActor) == 0x0000F0, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_ComponentBoundEvent_OtherComp) == 0x0000F8, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000100, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_DynamicCast_AsFort_Athena_Vehicle_1) == 0x000108, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_DynamicCast_AsFort_Athena_Vehicle_1' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_DynamicCast_bSuccess_2) == 0x000110, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000118, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_DynamicCast_bSuccess_3) == 0x000120, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, Temp_int_Variable) == 0x000124, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000128, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, CallFunc_Add_IntInt_ReturnValue) == 0x00012C, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, CallFunc_Subtract_IntInt_ReturnValue) == 0x000130, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, CallFunc_Max_ReturnValue) == 0x000134, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, CallFunc_IsValid_ReturnValue) == 0x000138, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, CallFunc_LinearColorLerp_ReturnValue) == 0x00013C, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_SwitchEnum_CmpSuccess) == 0x00014C, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_SwitchEnum_CmpSuccess_1) == 0x00014D, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000150, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00015C, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_Event_ControllerInstigator_1) == 0x000168, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_Event_ControllerInstigator_1' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01, K2Node_Event_ControllerInstigator) == 0x000170, "Member 'MilitaryBase_Door_01_C_ExecuteUbergraph_MilitaryBase_Door_01::K2Node_Event_ControllerInstigator' has a wrong offset!");

// Function MilitaryBase_Door_01.MilitaryBase_Door_01_C.GetComponentToLock
// 0x0020 (0x0020 - 0x0000)
struct MilitaryBase_Door_01_C_GetComponentToLock final
{
public:
	TArray<class UPrimitiveComponent*>            ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UPrimitiveComponent*>            K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(MilitaryBase_Door_01_C_GetComponentToLock) == 0x000008, "Wrong alignment on MilitaryBase_Door_01_C_GetComponentToLock");
static_assert(sizeof(MilitaryBase_Door_01_C_GetComponentToLock) == 0x000020, "Wrong size on MilitaryBase_Door_01_C_GetComponentToLock");
static_assert(offsetof(MilitaryBase_Door_01_C_GetComponentToLock, ReturnValue) == 0x000000, "Member 'MilitaryBase_Door_01_C_GetComponentToLock::ReturnValue' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_GetComponentToLock, K2Node_MakeArray_Array) == 0x000010, "Member 'MilitaryBase_Door_01_C_GetComponentToLock::K2Node_MakeArray_Array' has a wrong offset!");

// Function MilitaryBase_Door_01.MilitaryBase_Door_01_C.GetDoorMID
// 0x0020 (0x0020 - 0x0000)
struct MilitaryBase_Door_01_C_GetDoorMID final
{
public:
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MilitaryBase_Door_01_C_GetDoorMID) == 0x000008, "Wrong alignment on MilitaryBase_Door_01_C_GetDoorMID");
static_assert(sizeof(MilitaryBase_Door_01_C_GetDoorMID) == 0x000020, "Wrong size on MilitaryBase_Door_01_C_GetDoorMID");
static_assert(offsetof(MilitaryBase_Door_01_C_GetDoorMID, CallFunc_GetMaterial_ReturnValue) == 0x000000, "Member 'MilitaryBase_Door_01_C_GetDoorMID::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_GetDoorMID, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'MilitaryBase_Door_01_C_GetDoorMID::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_GetDoorMID, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000010, "Member 'MilitaryBase_Door_01_C_GetDoorMID::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_GetDoorMID, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'MilitaryBase_Door_01_C_GetDoorMID::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function MilitaryBase_Door_01.MilitaryBase_Door_01_C.Open
// 0x0008 (0x0008 - 0x0000)
struct MilitaryBase_Door_01_C_Open final
{
public:
	class AController*                            ControllerInstigator;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MilitaryBase_Door_01_C_Open) == 0x000008, "Wrong alignment on MilitaryBase_Door_01_C_Open");
static_assert(sizeof(MilitaryBase_Door_01_C_Open) == 0x000008, "Wrong size on MilitaryBase_Door_01_C_Open");
static_assert(offsetof(MilitaryBase_Door_01_C_Open, ControllerInstigator) == 0x000000, "Member 'MilitaryBase_Door_01_C_Open::ControllerInstigator' has a wrong offset!");

// Function MilitaryBase_Door_01.MilitaryBase_Door_01_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct MilitaryBase_Door_01_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceConstant*              K2Node_DynamicCast_AsMaterial_Instance_Constant;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MilitaryBase_Door_01_C_UserConstructionScript) == 0x000008, "Wrong alignment on MilitaryBase_Door_01_C_UserConstructionScript");
static_assert(sizeof(MilitaryBase_Door_01_C_UserConstructionScript) == 0x000030, "Wrong size on MilitaryBase_Door_01_C_UserConstructionScript");
static_assert(offsetof(MilitaryBase_Door_01_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'MilitaryBase_Door_01_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue) == 0x000008, "Member 'MilitaryBase_Door_01_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_UserConstructionScript, K2Node_DynamicCast_AsMaterial_Instance_Constant) == 0x000010, "Member 'MilitaryBase_Door_01_C_UserConstructionScript::K2Node_DynamicCast_AsMaterial_Instance_Constant' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'MilitaryBase_Door_01_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MilitaryBase_Door_01_C_UserConstructionScript, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x00001C, "Member 'MilitaryBase_Door_01_C_UserConstructionScript::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");

// Function MilitaryBase_Door_01.MilitaryBase_Door_01_C.IsOpen
// 0x0001 (0x0001 - 0x0000)
struct MilitaryBase_Door_01_C_IsOpen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MilitaryBase_Door_01_C_IsOpen) == 0x000001, "Wrong alignment on MilitaryBase_Door_01_C_IsOpen");
static_assert(sizeof(MilitaryBase_Door_01_C_IsOpen) == 0x000001, "Wrong size on MilitaryBase_Door_01_C_IsOpen");
static_assert(offsetof(MilitaryBase_Door_01_C_IsOpen, ReturnValue) == 0x000000, "Member 'MilitaryBase_Door_01_C_IsOpen::ReturnValue' has a wrong offset!");

}

