#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinigameStat_PlayerLivesLeft

#include "Basic.hpp"


namespace SDK::Params
{

// Function MinigameStat_PlayerLivesLeft.MinigameStat_PlayerLivesLeft_C.Compare
// 0x0010 (0x0010 - 0x0000)
struct MinigameStat_PlayerLivesLeft_C_Compare final
{
public:
	int32                                         FirstScore;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SecondScore;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MinigameStat_PlayerLivesLeft_C_Compare) == 0x000004, "Wrong alignment on MinigameStat_PlayerLivesLeft_C_Compare");
static_assert(sizeof(MinigameStat_PlayerLivesLeft_C_Compare) == 0x000010, "Wrong size on MinigameStat_PlayerLivesLeft_C_Compare");
static_assert(offsetof(MinigameStat_PlayerLivesLeft_C_Compare, FirstScore) == 0x000000, "Member 'MinigameStat_PlayerLivesLeft_C_Compare::FirstScore' has a wrong offset!");
static_assert(offsetof(MinigameStat_PlayerLivesLeft_C_Compare, SecondScore) == 0x000004, "Member 'MinigameStat_PlayerLivesLeft_C_Compare::SecondScore' has a wrong offset!");
static_assert(offsetof(MinigameStat_PlayerLivesLeft_C_Compare, ReturnValue) == 0x000008, "Member 'MinigameStat_PlayerLivesLeft_C_Compare::ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameStat_PlayerLivesLeft_C_Compare, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'MinigameStat_PlayerLivesLeft_C_Compare::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

}

