#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinigameScoringPreset

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct MinigameScoringPreset.MinigameScoringPreset
// 0x0038 (0x0038 - 0x0000)
struct FMinigameScoringPreset final
{
public:
	bool                                          SortScoreboard_6_AFC328DB4172CCE4E5742A9504D0C087; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         ScoreboardStats_7_279A843F4D5A831E0CAFE5AB87E85FB6; // 0x0008(0x0010)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  UIExtensions_17_755F8B1C4DB6C595F20783A14B316AEC;  // 0x0018(0x0020)(Edit, BlueprintVisible)
};
static_assert(alignof(FMinigameScoringPreset) == 0x000008, "Wrong alignment on FMinigameScoringPreset");
static_assert(sizeof(FMinigameScoringPreset) == 0x000038, "Wrong size on FMinigameScoringPreset");
static_assert(offsetof(FMinigameScoringPreset, SortScoreboard_6_AFC328DB4172CCE4E5742A9504D0C087) == 0x000000, "Member 'FMinigameScoringPreset::SortScoreboard_6_AFC328DB4172CCE4E5742A9504D0C087' has a wrong offset!");
static_assert(offsetof(FMinigameScoringPreset, ScoreboardStats_7_279A843F4D5A831E0CAFE5AB87E85FB6) == 0x000008, "Member 'FMinigameScoringPreset::ScoreboardStats_7_279A843F4D5A831E0CAFE5AB87E85FB6' has a wrong offset!");
static_assert(offsetof(FMinigameScoringPreset, UIExtensions_17_755F8B1C4DB6C595F20783A14B316AEC) == 0x000018, "Member 'FMinigameScoringPreset::UIExtensions_17_755F8B1C4DB6C595F20783A14B316AEC' has a wrong offset!");

}

