#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinimalSquadMember

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MinimalSquadMember.MinimalSquadMember_C
// 0x0050 (0x0F80 - 0x0F30)
class UMinimalSquadMember_C final : public UAthenaMinimalSquadMemberEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StyleNotReady;                                     // 0x0F38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StyleSitOut;                                       // 0x0F40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StyleEmpty;                                        // 0x0F48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnReady;                                           // 0x0F50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Meeple;                                      // 0x0F58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LocalUserIndicator;                                // 0x0F60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MeepleContainer;                                   // 0x0F68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReadyFlash;                                        // 0x0F70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnTeamMemberEstablished(bool bHasValidMember);
	void ExecuteUbergraph_MinimalSquadMember(int32 EntryPoint);
	void OnMemberGameReadinessChanged(EGameReadiness ReadyStatus);
	void SetEmptyVisuals();
	void SetNotReadyVisuals();
	void SetReadyVisuals();
	void SetSitOutVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MinimalSquadMember_C">();
	}
	static class UMinimalSquadMember_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMinimalSquadMember_C>();
	}
};
static_assert(alignof(UMinimalSquadMember_C) == 0x000010, "Wrong alignment on UMinimalSquadMember_C");
static_assert(sizeof(UMinimalSquadMember_C) == 0x000F80, "Wrong size on UMinimalSquadMember_C");
static_assert(offsetof(UMinimalSquadMember_C, UberGraphFrame) == 0x000F30, "Member 'UMinimalSquadMember_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMinimalSquadMember_C, StyleNotReady) == 0x000F38, "Member 'UMinimalSquadMember_C::StyleNotReady' has a wrong offset!");
static_assert(offsetof(UMinimalSquadMember_C, StyleSitOut) == 0x000F40, "Member 'UMinimalSquadMember_C::StyleSitOut' has a wrong offset!");
static_assert(offsetof(UMinimalSquadMember_C, StyleEmpty) == 0x000F48, "Member 'UMinimalSquadMember_C::StyleEmpty' has a wrong offset!");
static_assert(offsetof(UMinimalSquadMember_C, OnReady) == 0x000F50, "Member 'UMinimalSquadMember_C::OnReady' has a wrong offset!");
static_assert(offsetof(UMinimalSquadMember_C, Image_Meeple) == 0x000F58, "Member 'UMinimalSquadMember_C::Image_Meeple' has a wrong offset!");
static_assert(offsetof(UMinimalSquadMember_C, LocalUserIndicator) == 0x000F60, "Member 'UMinimalSquadMember_C::LocalUserIndicator' has a wrong offset!");
static_assert(offsetof(UMinimalSquadMember_C, MeepleContainer) == 0x000F68, "Member 'UMinimalSquadMember_C::MeepleContainer' has a wrong offset!");
static_assert(offsetof(UMinimalSquadMember_C, ReadyFlash) == 0x000F70, "Member 'UMinimalSquadMember_C::ReadyFlash' has a wrong offset!");

}

