#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissedInvitesEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MissedInvitesEntry.MissedInvitesEntry_C
// 0x0050 (0x0F70 - 0x0F20)
class UMissedInvitesEntry_C final : public UFortMissedInvitesListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0F28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0F30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                AnimatedInputBorder;                               // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x0F48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Exclamation;                                       // 0x0F58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_MissedInvitesText;                            // 0x0F60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x0F68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_MissedInvitesEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MissedInvitesEntry_C">();
	}
	static class UMissedInvitesEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissedInvitesEntry_C>();
	}
};
static_assert(alignof(UMissedInvitesEntry_C) == 0x000010, "Wrong alignment on UMissedInvitesEntry_C");
static_assert(sizeof(UMissedInvitesEntry_C) == 0x000F70, "Wrong size on UMissedInvitesEntry_C");
static_assert(offsetof(UMissedInvitesEntry_C, UberGraphFrame) == 0x000F20, "Member 'UMissedInvitesEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, Selected) == 0x000F28, "Member 'UMissedInvitesEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, Hovered) == 0x000F30, "Member 'UMissedInvitesEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, AnimatedInputBorder) == 0x000F38, "Member 'UMissedInvitesEntry_C::AnimatedInputBorder' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, Arrow) == 0x000F40, "Member 'UMissedInvitesEntry_C::Arrow' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x000F48, "Member 'UMissedInvitesEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, EntryBorder) == 0x000F50, "Member 'UMissedInvitesEntry_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, Exclamation) == 0x000F58, "Member 'UMissedInvitesEntry_C::Exclamation' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, Text_MissedInvitesText) == 0x000F60, "Member 'UMissedInvitesEntry_C::Text_MissedInvitesText' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, UserActionMenuInputButton) == 0x000F68, "Member 'UMissedInvitesEntry_C::UserActionMenuInputButton' has a wrong offset!");

}

