#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoleUI

#include "Basic.hpp"

#include "MoleGameRuntime_structs.hpp"
#include "MoleGameRuntime_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_classes.hpp"
#include "InputCore_structs.hpp"
#include "CommonUILegacy_structs.hpp"
#include "MoleUI_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "GameplayMessages_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "DynamicUI_classes.hpp"


namespace SDK
{

// Class MoleUI.MoleEnemyAbilityItem
// 0x0158 (0x0180 - 0x0028)
class UMoleEnemyAbilityItem final : public UObject
{
public:
	uint8                                         Pad_28[0xE8];                                      // 0x0028(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMoleAbilityUIData                     EnemyAbilityUIData;                                // 0x0110(0x0058)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x18];                                     // 0x0168(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetIndex() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleEnemyAbilityItem">();
	}
	static class UMoleEnemyAbilityItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleEnemyAbilityItem>();
	}
};
static_assert(alignof(UMoleEnemyAbilityItem) == 0x000008, "Wrong alignment on UMoleEnemyAbilityItem");
static_assert(sizeof(UMoleEnemyAbilityItem) == 0x000180, "Wrong size on UMoleEnemyAbilityItem");
static_assert(offsetof(UMoleEnemyAbilityItem, EnemyAbilityUIData) == 0x000110, "Member 'UMoleEnemyAbilityItem::EnemyAbilityUIData' has a wrong offset!");

// Class MoleUI.FortMobileButtonBehaviorComponent_MoleRoleVisibility
// 0x0050 (0x0080 - 0x0030)
class UFortMobileButtonBehaviorComponent_MoleRoleVisibility final : public UFortMobileButtonBehaviorComponent_Visibility
{
public:
	TMap<EMoleRole, ESlateVisibility>             RoleVisibility;                                    // 0x0030(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileButtonBehaviorComponent_MoleRoleVisibility">();
	}
	static class UFortMobileButtonBehaviorComponent_MoleRoleVisibility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileButtonBehaviorComponent_MoleRoleVisibility>();
	}
};
static_assert(alignof(UFortMobileButtonBehaviorComponent_MoleRoleVisibility) == 0x000008, "Wrong alignment on UFortMobileButtonBehaviorComponent_MoleRoleVisibility");
static_assert(sizeof(UFortMobileButtonBehaviorComponent_MoleRoleVisibility) == 0x000080, "Wrong size on UFortMobileButtonBehaviorComponent_MoleRoleVisibility");
static_assert(offsetof(UFortMobileButtonBehaviorComponent_MoleRoleVisibility, RoleVisibility) == 0x000030, "Member 'UFortMobileButtonBehaviorComponent_MoleRoleVisibility::RoleVisibility' has a wrong offset!");

// Class MoleUI.MoleActiveTaskContextBarHUDWidget
// 0x0008 (0x0250 - 0x0248)
class UMoleActiveTaskContextBarHUDWidget final : public UUserWidget
{
public:
	class UMolePlayerTaskManagementComponent*     CachedOwningTaskComponent;                         // 0x0248(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleActiveTaskContextBarHUDWidget">();
	}
	static class UMoleActiveTaskContextBarHUDWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleActiveTaskContextBarHUDWidget>();
	}
};
static_assert(alignof(UMoleActiveTaskContextBarHUDWidget) == 0x000008, "Wrong alignment on UMoleActiveTaskContextBarHUDWidget");
static_assert(sizeof(UMoleActiveTaskContextBarHUDWidget) == 0x000250, "Wrong size on UMoleActiveTaskContextBarHUDWidget");
static_assert(offsetof(UMoleActiveTaskContextBarHUDWidget, CachedOwningTaskComponent) == 0x000248, "Member 'UMoleActiveTaskContextBarHUDWidget::CachedOwningTaskComponent' has a wrong offset!");

// Class MoleUI.MoleVoteTally
// 0x0028 (0x0270 - 0x0248)
class UMoleVoteTally final : public UUserWidget
{
public:
	TArray<class APlayerState*>                   VoteList;                                          // 0x0248(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_258[0x10];                                     // 0x0258(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTileView*                        TileView_Votes;                                    // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnVoteTallyStarted(bool bIsSkipTally);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleVoteTally">();
	}
	static class UMoleVoteTally* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleVoteTally>();
	}
};
static_assert(alignof(UMoleVoteTally) == 0x000008, "Wrong alignment on UMoleVoteTally");
static_assert(sizeof(UMoleVoteTally) == 0x000270, "Wrong size on UMoleVoteTally");
static_assert(offsetof(UMoleVoteTally, VoteList) == 0x000248, "Member 'UMoleVoteTally::VoteList' has a wrong offset!");
static_assert(offsetof(UMoleVoteTally, TileView_Votes) == 0x000268, "Member 'UMoleVoteTally::TileView_Votes' has a wrong offset!");

// Class MoleUI.MoleAssignedTaskContainerWidget
// 0x0010 (0x0258 - 0x0248)
class UMoleAssignedTaskContainerWidget final : public UUserWidget
{
public:
	class UDynamicEntryBox*                       TaskWidgetEntryBox;                                // 0x0248(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMolePlayerTaskManagementComponent*     CachedOwningTaskComponent;                         // 0x0250(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnActiveTasksChanged(bool bFrameDefer);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleAssignedTaskContainerWidget">();
	}
	static class UMoleAssignedTaskContainerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleAssignedTaskContainerWidget>();
	}
};
static_assert(alignof(UMoleAssignedTaskContainerWidget) == 0x000008, "Wrong alignment on UMoleAssignedTaskContainerWidget");
static_assert(sizeof(UMoleAssignedTaskContainerWidget) == 0x000258, "Wrong size on UMoleAssignedTaskContainerWidget");
static_assert(offsetof(UMoleAssignedTaskContainerWidget, TaskWidgetEntryBox) == 0x000248, "Member 'UMoleAssignedTaskContainerWidget::TaskWidgetEntryBox' has a wrong offset!");
static_assert(offsetof(UMoleAssignedTaskContainerWidget, CachedOwningTaskComponent) == 0x000250, "Member 'UMoleAssignedTaskContainerWidget::CachedOwningTaskComponent' has a wrong offset!");

// Class MoleUI.MoleControllerBinding
// 0x0020 (0x0268 - 0x0248)
class UMoleControllerBinding final : public UUserWidget
{
public:
	struct FKey                                   RepresentedKey;                                    // 0x0248(0x0018)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                     KeyBind_RepresentedAction;                         // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnBindingInfoSet(const class FText& BindingLabel, bool bIsSaboteurBinding);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleControllerBinding">();
	}
	static class UMoleControllerBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleControllerBinding>();
	}
};
static_assert(alignof(UMoleControllerBinding) == 0x000008, "Wrong alignment on UMoleControllerBinding");
static_assert(sizeof(UMoleControllerBinding) == 0x000268, "Wrong size on UMoleControllerBinding");
static_assert(offsetof(UMoleControllerBinding, RepresentedKey) == 0x000248, "Member 'UMoleControllerBinding::RepresentedKey' has a wrong offset!");
static_assert(offsetof(UMoleControllerBinding, KeyBind_RepresentedAction) == 0x000260, "Member 'UMoleControllerBinding::KeyBind_RepresentedAction' has a wrong offset!");

// Class MoleUI.MoleQuickChatPlayersWidget
// 0x0080 (0x03B0 - 0x0330)
class UMoleQuickChatPlayersWidget final : public UCommonActivatableWidget
{
public:
	bool                                          bIsSkipButtonEnabled;                              // 0x0330(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlay*                               Overlay_Players;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Skip;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_348[0x48];                                     // 0x0348(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        PlayersInputComponent;                             // 0x0390(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UMoleQuickChatPlayerEntry*>      PlayerButtons;                                     // 0x0398(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnFilterChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleQuickChatPlayersWidget">();
	}
	static class UMoleQuickChatPlayersWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatPlayersWidget>();
	}
};
static_assert(alignof(UMoleQuickChatPlayersWidget) == 0x000008, "Wrong alignment on UMoleQuickChatPlayersWidget");
static_assert(sizeof(UMoleQuickChatPlayersWidget) == 0x0003B0, "Wrong size on UMoleQuickChatPlayersWidget");
static_assert(offsetof(UMoleQuickChatPlayersWidget, bIsSkipButtonEnabled) == 0x000330, "Member 'UMoleQuickChatPlayersWidget::bIsSkipButtonEnabled' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatPlayersWidget, Overlay_Players) == 0x000338, "Member 'UMoleQuickChatPlayersWidget::Overlay_Players' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatPlayersWidget, Button_Skip) == 0x000340, "Member 'UMoleQuickChatPlayersWidget::Button_Skip' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatPlayersWidget, PlayersInputComponent) == 0x000390, "Member 'UMoleQuickChatPlayersWidget::PlayersInputComponent' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatPlayersWidget, PlayerButtons) == 0x000398, "Member 'UMoleQuickChatPlayersWidget::PlayerButtons' has a wrong offset!");

// Class MoleUI.MoleControllerBindingsScreen
// 0x0058 (0x03C0 - 0x0368)
class UMoleControllerBindingsScreen final : public UFortOptionsTab
{
public:
	TMap<ECommonGamepadType, TSoftObjectPtr<class UObject>> ControllerImages;                                  // 0x0368(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UCommonLazyImage*                       Image_Controller;                                  // 0x03B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleControllerBindingsScreen">();
	}
	static class UMoleControllerBindingsScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleControllerBindingsScreen>();
	}
};
static_assert(alignof(UMoleControllerBindingsScreen) == 0x000008, "Wrong alignment on UMoleControllerBindingsScreen");
static_assert(sizeof(UMoleControllerBindingsScreen) == 0x0003C0, "Wrong size on UMoleControllerBindingsScreen");
static_assert(offsetof(UMoleControllerBindingsScreen, ControllerImages) == 0x000368, "Member 'UMoleControllerBindingsScreen::ControllerImages' has a wrong offset!");
static_assert(offsetof(UMoleControllerBindingsScreen, Image_Controller) == 0x0003B8, "Member 'UMoleControllerBindingsScreen::Image_Controller' has a wrong offset!");

// Class MoleUI.MoleEnemyAbilityContainer
// 0x0018 (0x0260 - 0x0248)
class UMoleEnemyAbilityContainer final : public UUserWidget
{
public:
	class UDataTable*                             AbilityUIDataTable;                                // 0x0248(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonListView*                        Listview_EnemyTasks;                               // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMoleEnemyAbilityWidgetComponent*       OwnerWidgetComponent;                              // 0x0258(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnVisibilityChangeRequested(bool bNewVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleEnemyAbilityContainer">();
	}
	static class UMoleEnemyAbilityContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleEnemyAbilityContainer>();
	}
};
static_assert(alignof(UMoleEnemyAbilityContainer) == 0x000008, "Wrong alignment on UMoleEnemyAbilityContainer");
static_assert(sizeof(UMoleEnemyAbilityContainer) == 0x000260, "Wrong size on UMoleEnemyAbilityContainer");
static_assert(offsetof(UMoleEnemyAbilityContainer, AbilityUIDataTable) == 0x000248, "Member 'UMoleEnemyAbilityContainer::AbilityUIDataTable' has a wrong offset!");
static_assert(offsetof(UMoleEnemyAbilityContainer, Listview_EnemyTasks) == 0x000250, "Member 'UMoleEnemyAbilityContainer::Listview_EnemyTasks' has a wrong offset!");
static_assert(offsetof(UMoleEnemyAbilityContainer, OwnerWidgetComponent) == 0x000258, "Member 'UMoleEnemyAbilityContainer::OwnerWidgetComponent' has a wrong offset!");

// Class MoleUI.MoleEnemyAbilityEntry
// 0x0020 (0x0ED0 - 0x0EB0)
class UMoleEnemyAbilityEntry final : public UCommonButtonBase
{
public:
	uint8                                         Pad_EA8[0x18];                                     // 0x0EA8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsInteractable;                                   // 0x0EC0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EC1[0x7];                                      // 0x0EC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMoleEnemyAbilityOverlay*               Overlay_EnemyAbilities;                            // 0x0EC8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnAbilityDataReceived(class UMoleEnemyAbilityItem* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleEnemyAbilityEntry">();
	}
	static class UMoleEnemyAbilityEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleEnemyAbilityEntry>();
	}
};
static_assert(alignof(UMoleEnemyAbilityEntry) == 0x000010, "Wrong alignment on UMoleEnemyAbilityEntry");
static_assert(sizeof(UMoleEnemyAbilityEntry) == 0x000ED0, "Wrong size on UMoleEnemyAbilityEntry");
static_assert(offsetof(UMoleEnemyAbilityEntry, bIsInteractable) == 0x000EC0, "Member 'UMoleEnemyAbilityEntry::bIsInteractable' has a wrong offset!");
static_assert(offsetof(UMoleEnemyAbilityEntry, Overlay_EnemyAbilities) == 0x000EC8, "Member 'UMoleEnemyAbilityEntry::Overlay_EnemyAbilities' has a wrong offset!");

// Class MoleUI.MoleQuickChatRadialSlot
// 0x0040 (0x0F90 - 0x0F50)
class UMoleQuickChatRadialSlot : public UFortRadialSlot
{
public:
	struct FLinearColor                           CategoryColor;                                     // 0x0F48(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>              CategoryImage;                                     // 0x0F58(0x0028)(BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   RichText_Main;                                     // 0x0F80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F88[0x8];                                      // 0x0F88(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnUpdated();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleQuickChatRadialSlot">();
	}
	static class UMoleQuickChatRadialSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatRadialSlot>();
	}
};
static_assert(alignof(UMoleQuickChatRadialSlot) == 0x000010, "Wrong alignment on UMoleQuickChatRadialSlot");
static_assert(sizeof(UMoleQuickChatRadialSlot) == 0x000F90, "Wrong size on UMoleQuickChatRadialSlot");
static_assert(offsetof(UMoleQuickChatRadialSlot, CategoryColor) == 0x000F48, "Member 'UMoleQuickChatRadialSlot::CategoryColor' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatRadialSlot, CategoryImage) == 0x000F58, "Member 'UMoleQuickChatRadialSlot::CategoryImage' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatRadialSlot, RichText_Main) == 0x000F80, "Member 'UMoleQuickChatRadialSlot::RichText_Main' has a wrong offset!");

// Class MoleUI.MoleQuickChatCategorySlot
// 0x0000 (0x0F90 - 0x0F90)
class UMoleQuickChatCategorySlot final : public UMoleQuickChatRadialSlot
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleQuickChatCategorySlot">();
	}
	static class UMoleQuickChatCategorySlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatCategorySlot>();
	}
};
static_assert(alignof(UMoleQuickChatCategorySlot) == 0x000010, "Wrong alignment on UMoleQuickChatCategorySlot");
static_assert(sizeof(UMoleQuickChatCategorySlot) == 0x000F90, "Wrong size on UMoleQuickChatCategorySlot");

// Class MoleUI.MoleEnemyAbilityOverlay
// 0x0020 (0x0268 - 0x0248)
class UMoleEnemyAbilityOverlay final : public UUserWidget
{
public:
	uint8                                         Pad_248[0x10];                                     // 0x0248(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMoleEnemyAbilityItem*                  EnemyAbilityItem;                                  // 0x0258(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_260[0x8];                                      // 0x0260(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAbilityDataReceived(const struct FMoleAbilityUIData& InAbilityUIData);
	void OnCooldownFinished();
	void OnCooldownStarted(int32 TimeLeft);
	void OnCooldownUpdated(int32 TimeLeft);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleEnemyAbilityOverlay">();
	}
	static class UMoleEnemyAbilityOverlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleEnemyAbilityOverlay>();
	}
};
static_assert(alignof(UMoleEnemyAbilityOverlay) == 0x000008, "Wrong alignment on UMoleEnemyAbilityOverlay");
static_assert(sizeof(UMoleEnemyAbilityOverlay) == 0x000268, "Wrong size on UMoleEnemyAbilityOverlay");
static_assert(offsetof(UMoleEnemyAbilityOverlay, EnemyAbilityItem) == 0x000258, "Member 'UMoleEnemyAbilityOverlay::EnemyAbilityItem' has a wrong offset!");

// Class MoleUI.MoleEnemyAbilityWidgetComponent
// 0x0040 (0x05E0 - 0x05A0)
class UMoleEnemyAbilityWidgetComponent final : public UWidgetComponent
{
public:
	class UInputComponent*                        EnemyMenuInputComponent;                           // 0x05A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputComponent*                        InternalBindingsInputComponent;                    // 0x05A8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                WidgetRelativeLocation;                            // 0x05B0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                WidgetRelativeScale;                               // 0x05BC(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               WidgetRelativeRotation;                            // 0x05C8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D4[0xC];                                      // 0x05D4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool AreSabotageShortcutsEnabled();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleEnemyAbilityWidgetComponent">();
	}
	static class UMoleEnemyAbilityWidgetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleEnemyAbilityWidgetComponent>();
	}
};
static_assert(alignof(UMoleEnemyAbilityWidgetComponent) == 0x000010, "Wrong alignment on UMoleEnemyAbilityWidgetComponent");
static_assert(sizeof(UMoleEnemyAbilityWidgetComponent) == 0x0005E0, "Wrong size on UMoleEnemyAbilityWidgetComponent");
static_assert(offsetof(UMoleEnemyAbilityWidgetComponent, EnemyMenuInputComponent) == 0x0005A0, "Member 'UMoleEnemyAbilityWidgetComponent::EnemyMenuInputComponent' has a wrong offset!");
static_assert(offsetof(UMoleEnemyAbilityWidgetComponent, InternalBindingsInputComponent) == 0x0005A8, "Member 'UMoleEnemyAbilityWidgetComponent::InternalBindingsInputComponent' has a wrong offset!");
static_assert(offsetof(UMoleEnemyAbilityWidgetComponent, WidgetRelativeLocation) == 0x0005B0, "Member 'UMoleEnemyAbilityWidgetComponent::WidgetRelativeLocation' has a wrong offset!");
static_assert(offsetof(UMoleEnemyAbilityWidgetComponent, WidgetRelativeScale) == 0x0005BC, "Member 'UMoleEnemyAbilityWidgetComponent::WidgetRelativeScale' has a wrong offset!");
static_assert(offsetof(UMoleEnemyAbilityWidgetComponent, WidgetRelativeRotation) == 0x0005C8, "Member 'UMoleEnemyAbilityWidgetComponent::WidgetRelativeRotation' has a wrong offset!");

// Class MoleUI.MoleLocationWidget
// 0x0008 (0x0250 - 0x0248)
class UMoleLocationWidget final : public UUserWidget
{
public:
	class UFortControllerComponent_MapDiscoverability* DiscoverabilityComponent;                          // 0x0248(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnVisited(const class FText& LocalizedLocationName, bool bIsNamedLocation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleLocationWidget">();
	}
	static class UMoleLocationWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleLocationWidget>();
	}
};
static_assert(alignof(UMoleLocationWidget) == 0x000008, "Wrong alignment on UMoleLocationWidget");
static_assert(sizeof(UMoleLocationWidget) == 0x000250, "Wrong size on UMoleLocationWidget");
static_assert(offsetof(UMoleLocationWidget, DiscoverabilityComponent) == 0x000248, "Member 'UMoleLocationWidget::DiscoverabilityComponent' has a wrong offset!");

// Class MoleUI.MoleQuickChatWidgetProxy
// 0x0050 (0x0298 - 0x0248)
class UMoleQuickChatWidgetProxy final : public UUserWidget
{
public:
	TSubclassOf<class UMoleQuickChatUIComponent>  QuickChatUIComponentClass;                         // 0x0248(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   ActiveClass;                                       // 0x0250(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_278[0x20];                                     // 0x0278(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEnter();
	void OnQuickChatClosed();
	void OnQuickChatOpened();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleQuickChatWidgetProxy">();
	}
	static class UMoleQuickChatWidgetProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatWidgetProxy>();
	}
};
static_assert(alignof(UMoleQuickChatWidgetProxy) == 0x000008, "Wrong alignment on UMoleQuickChatWidgetProxy");
static_assert(sizeof(UMoleQuickChatWidgetProxy) == 0x000298, "Wrong size on UMoleQuickChatWidgetProxy");
static_assert(offsetof(UMoleQuickChatWidgetProxy, QuickChatUIComponentClass) == 0x000248, "Member 'UMoleQuickChatWidgetProxy::QuickChatUIComponentClass' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatWidgetProxy, ActiveClass) == 0x000250, "Member 'UMoleQuickChatWidgetProxy::ActiveClass' has a wrong offset!");

// Class MoleUI.MoleMinimap
// 0x00D0 (0x01D0 - 0x0100)
class UMoleMinimap final : public UWidget
{
public:
	struct FSlateBrush                            MolePlayerIcon;                                    // 0x0100(0x00B0)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                              DesiredSize;                                       // 0x01B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                MapCenterOffset;                                   // 0x01B8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          ShowMapBackground;                                 // 0x01C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ZoomLevel;                                         // 0x01C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinimapIndicatorZoomLevel;                         // 0x01CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleMinimap">();
	}
	static class UMoleMinimap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleMinimap>();
	}
};
static_assert(alignof(UMoleMinimap) == 0x000010, "Wrong alignment on UMoleMinimap");
static_assert(sizeof(UMoleMinimap) == 0x0001D0, "Wrong size on UMoleMinimap");
static_assert(offsetof(UMoleMinimap, MolePlayerIcon) == 0x000100, "Member 'UMoleMinimap::MolePlayerIcon' has a wrong offset!");
static_assert(offsetof(UMoleMinimap, DesiredSize) == 0x0001B0, "Member 'UMoleMinimap::DesiredSize' has a wrong offset!");
static_assert(offsetof(UMoleMinimap, MapCenterOffset) == 0x0001B8, "Member 'UMoleMinimap::MapCenterOffset' has a wrong offset!");
static_assert(offsetof(UMoleMinimap, ShowMapBackground) == 0x0001C4, "Member 'UMoleMinimap::ShowMapBackground' has a wrong offset!");
static_assert(offsetof(UMoleMinimap, ZoomLevel) == 0x0001C8, "Member 'UMoleMinimap::ZoomLevel' has a wrong offset!");
static_assert(offsetof(UMoleMinimap, MinimapIndicatorZoomLevel) == 0x0001CC, "Member 'UMoleMinimap::MinimapIndicatorZoomLevel' has a wrong offset!");

// Class MoleUI.MoleMobileLoaderWidget
// 0x0020 (0x0268 - 0x0248)
class UMoleMobileLoaderWidget final : public UUserWidget
{
public:
	uint8                                         Pad_248[0x20];                                     // 0x0248(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleMobileLoaderWidget">();
	}
	static class UMoleMobileLoaderWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleMobileLoaderWidget>();
	}
};
static_assert(alignof(UMoleMobileLoaderWidget) == 0x000008, "Wrong alignment on UMoleMobileLoaderWidget");
static_assert(sizeof(UMoleMobileLoaderWidget) == 0x000268, "Wrong size on UMoleMobileLoaderWidget");

// Class MoleUI.MoleNameplate
// 0x0008 (0x0250 - 0x0248)
class UMoleNameplate final : public UUserWidget
{
public:
	class UFortVoiceChatStatusIcon*               VoiceIcon_Status;                                  // 0x0248(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetupNameplateFor(class APlayerState* OwningPlayer);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleNameplate">();
	}
	static class UMoleNameplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleNameplate>();
	}
};
static_assert(alignof(UMoleNameplate) == 0x000008, "Wrong alignment on UMoleNameplate");
static_assert(sizeof(UMoleNameplate) == 0x000250, "Wrong size on UMoleNameplate");
static_assert(offsetof(UMoleNameplate, VoiceIcon_Status) == 0x000248, "Member 'UMoleNameplate::VoiceIcon_Status' has a wrong offset!");

// Class MoleUI.MoleQuickChatActionSlot
// 0x0000 (0x0F90 - 0x0F90)
class UMoleQuickChatActionSlot final : public UMoleQuickChatRadialSlot
{
public:
	void OnIsAvailableChanged(const bool bIsAvailable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleQuickChatActionSlot">();
	}
	static class UMoleQuickChatActionSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatActionSlot>();
	}
};
static_assert(alignof(UMoleQuickChatActionSlot) == 0x000010, "Wrong alignment on UMoleQuickChatActionSlot");
static_assert(sizeof(UMoleQuickChatActionSlot) == 0x000F90, "Wrong size on UMoleQuickChatActionSlot");

// Class MoleUI.MolePostGameScreen
// 0x0048 (0x0290 - 0x0248)
class UMolePostGameScreen final : public UUserWidget
{
public:
	class UInputComponent*                        PostGameInputComponent;                            // 0x0248(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMoleHoldBinding                       BackToMenuBinding;                                 // 0x0250(0x0020)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         MobileAutoGoBackToMenuTime;                        // 0x0270(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_274[0x14];                                     // 0x0274(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaAccoladeListWidget*              Listview_Accolades;                                // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnXPCalculated(int32 XPValue);
	void StartMobileAutoGoBackToMenu();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MolePostGameScreen">();
	}
	static class UMolePostGameScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMolePostGameScreen>();
	}
};
static_assert(alignof(UMolePostGameScreen) == 0x000008, "Wrong alignment on UMolePostGameScreen");
static_assert(sizeof(UMolePostGameScreen) == 0x000290, "Wrong size on UMolePostGameScreen");
static_assert(offsetof(UMolePostGameScreen, PostGameInputComponent) == 0x000248, "Member 'UMolePostGameScreen::PostGameInputComponent' has a wrong offset!");
static_assert(offsetof(UMolePostGameScreen, BackToMenuBinding) == 0x000250, "Member 'UMolePostGameScreen::BackToMenuBinding' has a wrong offset!");
static_assert(offsetof(UMolePostGameScreen, MobileAutoGoBackToMenuTime) == 0x000270, "Member 'UMolePostGameScreen::MobileAutoGoBackToMenuTime' has a wrong offset!");
static_assert(offsetof(UMolePostGameScreen, Listview_Accolades) == 0x000288, "Member 'UMolePostGameScreen::Listview_Accolades' has a wrong offset!");

// Class MoleUI.MolePrimaryActiveTaskHUDWidget
// 0x0010 (0x0258 - 0x0248)
class UMolePrimaryActiveTaskHUDWidget final : public UUserWidget
{
public:
	class UMolePlayerTaskManagementComponent*     CachedOwningTaskComponent;                         // 0x0248(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMoleTaskHUDWidget*                     MoleTaskHUDWidget;                                 // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MolePrimaryActiveTaskHUDWidget">();
	}
	static class UMolePrimaryActiveTaskHUDWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMolePrimaryActiveTaskHUDWidget>();
	}
};
static_assert(alignof(UMolePrimaryActiveTaskHUDWidget) == 0x000008, "Wrong alignment on UMolePrimaryActiveTaskHUDWidget");
static_assert(sizeof(UMolePrimaryActiveTaskHUDWidget) == 0x000258, "Wrong size on UMolePrimaryActiveTaskHUDWidget");
static_assert(offsetof(UMolePrimaryActiveTaskHUDWidget, CachedOwningTaskComponent) == 0x000248, "Member 'UMolePrimaryActiveTaskHUDWidget::CachedOwningTaskComponent' has a wrong offset!");
static_assert(offsetof(UMolePrimaryActiveTaskHUDWidget, MoleTaskHUDWidget) == 0x000250, "Member 'UMolePrimaryActiveTaskHUDWidget::MoleTaskHUDWidget' has a wrong offset!");

// Class MoleUI.MoleQuickChatLogWidget
// 0x0050 (0x0380 - 0x0330)
class UMoleQuickChatLogWidget final : public UCommonActivatableWidget
{
public:
	class FText                                   SelfMessageLogTitle;                               // 0x0330(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   SelectedTokenFormat;                               // 0x0348(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class UListView*                              ListView_MessageLog;                               // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UMoleQuickChatMessageItem*>      MessageLog;                                        // 0x0368(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnFirstMessageReceived();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleQuickChatLogWidget">();
	}
	static class UMoleQuickChatLogWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatLogWidget>();
	}
};
static_assert(alignof(UMoleQuickChatLogWidget) == 0x000008, "Wrong alignment on UMoleQuickChatLogWidget");
static_assert(sizeof(UMoleQuickChatLogWidget) == 0x000380, "Wrong size on UMoleQuickChatLogWidget");
static_assert(offsetof(UMoleQuickChatLogWidget, SelfMessageLogTitle) == 0x000330, "Member 'UMoleQuickChatLogWidget::SelfMessageLogTitle' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatLogWidget, SelectedTokenFormat) == 0x000348, "Member 'UMoleQuickChatLogWidget::SelectedTokenFormat' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatLogWidget, ListView_MessageLog) == 0x000360, "Member 'UMoleQuickChatLogWidget::ListView_MessageLog' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatLogWidget, MessageLog) == 0x000368, "Member 'UMoleQuickChatLogWidget::MessageLog' has a wrong offset!");

// Class MoleUI.MoleQuickChatMap
// 0x0060 (0x0390 - 0x0330)
class UMoleQuickChatMap final : public UCommonActivatableWidget
{
public:
	class UMoleQuickChatMapEntry*                 DefaultRoomWidgetToFocus;                          // 0x0330(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                           Panel_Locations;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_SkipLocation;                               // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_348[0x48];                                     // 0x0348(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleQuickChatMap">();
	}
	static class UMoleQuickChatMap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatMap>();
	}
};
static_assert(alignof(UMoleQuickChatMap) == 0x000008, "Wrong alignment on UMoleQuickChatMap");
static_assert(sizeof(UMoleQuickChatMap) == 0x000390, "Wrong size on UMoleQuickChatMap");
static_assert(offsetof(UMoleQuickChatMap, DefaultRoomWidgetToFocus) == 0x000330, "Member 'UMoleQuickChatMap::DefaultRoomWidgetToFocus' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatMap, Panel_Locations) == 0x000338, "Member 'UMoleQuickChatMap::Panel_Locations' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatMap, Button_SkipLocation) == 0x000340, "Member 'UMoleQuickChatMap::Button_SkipLocation' has a wrong offset!");

// Class MoleUI.MoleQuickChatMapEntry
// 0x0040 (0x0EF0 - 0x0EB0)
class UMoleQuickChatMapEntry final : public UCommonButtonBase
{
public:
	struct FGameplayTag                           LocationTag;                                       // 0x0EA8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EB0[0x38];                                     // 0x0EB0(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBox*                         HBox_HerePin;                                      // 0x0EE8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnMapDataRetrieved(const struct FMoleLocationData& LocationData);
	void ResetCosmetics();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleQuickChatMapEntry">();
	}
	static class UMoleQuickChatMapEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatMapEntry>();
	}
};
static_assert(alignof(UMoleQuickChatMapEntry) == 0x000010, "Wrong alignment on UMoleQuickChatMapEntry");
static_assert(sizeof(UMoleQuickChatMapEntry) == 0x000EF0, "Wrong size on UMoleQuickChatMapEntry");
static_assert(offsetof(UMoleQuickChatMapEntry, LocationTag) == 0x000EA8, "Member 'UMoleQuickChatMapEntry::LocationTag' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatMapEntry, HBox_HerePin) == 0x000EE8, "Member 'UMoleQuickChatMapEntry::HBox_HerePin' has a wrong offset!");

// Class MoleUI.MoleQuickChatPlayerEntry
// 0x0050 (0x0F00 - 0x0EB0)
class UMoleQuickChatPlayerEntry final : public UCommonButtonBase
{
public:
	class FName                                   PlayerPortraitColorAMaterialParameterName;         // 0x0EA8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PlayerPortraitColorBMaterialParameterName;         // 0x0EB0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsOnLowerRow;                                     // 0x0EB8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EB9[0x7];                                      // 0x0EB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           PlayerState;                                       // 0x0EC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 PlayerName;                                        // 0x0EC8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsLocalPlayer;                                    // 0x0ED8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsGhost;                                          // 0x0ED9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsFilteredOut;                                    // 0x0EDA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EDB[0x5];                                      // 0x0EDB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonLazyImage*                       LazyImage_PlayerPortrait;                          // 0x0EE0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                               Size_Ghost;                                        // 0x0EE8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_PlayerNumber;                                 // 0x0EF0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_EF8[0x8];                                      // 0x0EF8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDataChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleQuickChatPlayerEntry">();
	}
	static class UMoleQuickChatPlayerEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatPlayerEntry>();
	}
};
static_assert(alignof(UMoleQuickChatPlayerEntry) == 0x000010, "Wrong alignment on UMoleQuickChatPlayerEntry");
static_assert(sizeof(UMoleQuickChatPlayerEntry) == 0x000F00, "Wrong size on UMoleQuickChatPlayerEntry");
static_assert(offsetof(UMoleQuickChatPlayerEntry, PlayerPortraitColorAMaterialParameterName) == 0x000EA8, "Member 'UMoleQuickChatPlayerEntry::PlayerPortraitColorAMaterialParameterName' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatPlayerEntry, PlayerPortraitColorBMaterialParameterName) == 0x000EB0, "Member 'UMoleQuickChatPlayerEntry::PlayerPortraitColorBMaterialParameterName' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatPlayerEntry, bIsOnLowerRow) == 0x000EB8, "Member 'UMoleQuickChatPlayerEntry::bIsOnLowerRow' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatPlayerEntry, PlayerState) == 0x000EC0, "Member 'UMoleQuickChatPlayerEntry::PlayerState' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatPlayerEntry, PlayerName) == 0x000EC8, "Member 'UMoleQuickChatPlayerEntry::PlayerName' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatPlayerEntry, bIsLocalPlayer) == 0x000ED8, "Member 'UMoleQuickChatPlayerEntry::bIsLocalPlayer' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatPlayerEntry, bIsGhost) == 0x000ED9, "Member 'UMoleQuickChatPlayerEntry::bIsGhost' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatPlayerEntry, bIsFilteredOut) == 0x000EDA, "Member 'UMoleQuickChatPlayerEntry::bIsFilteredOut' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatPlayerEntry, LazyImage_PlayerPortrait) == 0x000EE0, "Member 'UMoleQuickChatPlayerEntry::LazyImage_PlayerPortrait' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatPlayerEntry, Size_Ghost) == 0x000EE8, "Member 'UMoleQuickChatPlayerEntry::Size_Ghost' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatPlayerEntry, Text_PlayerNumber) == 0x000EF0, "Member 'UMoleQuickChatPlayerEntry::Text_PlayerNumber' has a wrong offset!");

// Class MoleUI.MoleQuickChatMessageItem
// 0x0040 (0x0068 - 0x0028)
class UMoleQuickChatMessageItem final : public UObject
{
public:
	uint8                                         Pad_28[0x38];                                      // 0x0028(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           PlayerState;                                       // 0x0060(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleQuickChatMessageItem">();
	}
	static class UMoleQuickChatMessageItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatMessageItem>();
	}
};
static_assert(alignof(UMoleQuickChatMessageItem) == 0x000008, "Wrong alignment on UMoleQuickChatMessageItem");
static_assert(sizeof(UMoleQuickChatMessageItem) == 0x000068, "Wrong size on UMoleQuickChatMessageItem");
static_assert(offsetof(UMoleQuickChatMessageItem, PlayerState) == 0x000060, "Member 'UMoleQuickChatMessageItem::PlayerState' has a wrong offset!");

// Class MoleUI.MoleQuickChatMessageEntry
// 0x0030 (0x0278 - 0x0248)
class UMoleQuickChatMessageEntry final : public UUserWidget
{
public:
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         Text_Sender;                                       // 0x0250(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URichTextBlock*                         Text_Message;                                      // 0x0258(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFromSelf;                                       // 0x0260(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFromPreviousSender;                             // 0x0261(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           PlayerState;                                       // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                    PlayerItemDefinition;                              // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnDataChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleQuickChatMessageEntry">();
	}
	static class UMoleQuickChatMessageEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatMessageEntry>();
	}
};
static_assert(alignof(UMoleQuickChatMessageEntry) == 0x000008, "Wrong alignment on UMoleQuickChatMessageEntry");
static_assert(sizeof(UMoleQuickChatMessageEntry) == 0x000278, "Wrong size on UMoleQuickChatMessageEntry");
static_assert(offsetof(UMoleQuickChatMessageEntry, Text_Sender) == 0x000250, "Member 'UMoleQuickChatMessageEntry::Text_Sender' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatMessageEntry, Text_Message) == 0x000258, "Member 'UMoleQuickChatMessageEntry::Text_Message' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatMessageEntry, bIsFromSelf) == 0x000260, "Member 'UMoleQuickChatMessageEntry::bIsFromSelf' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatMessageEntry, bIsFromPreviousSender) == 0x000261, "Member 'UMoleQuickChatMessageEntry::bIsFromPreviousSender' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatMessageEntry, PlayerState) == 0x000268, "Member 'UMoleQuickChatMessageEntry::PlayerState' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatMessageEntry, PlayerItemDefinition) == 0x000270, "Member 'UMoleQuickChatMessageEntry::PlayerItemDefinition' has a wrong offset!");

// Class MoleUI.MoleQuickChatUIComponent
// 0x00B8 (0x0168 - 0x00B0)
class UMoleQuickChatUIComponent final : public UPlayerStateComponent
{
public:
	TSoftObjectPtr<class UDataTable>              MessagesTable;                                     // 0x00B0(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FMoleQuickChatMessageInfo, float> MessageSpamMap;                                    // 0x00D8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FMoleQuickChatMessageSummary           MessagesSummary;                                   // 0x0128(0x0018)(Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FMoleQuickChatRawMessage>       MessageLog;                                        // 0x0140(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	float                                         MinimumTimeBetweenSameMessageSend;                 // 0x0150(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             LoadedMessagesTable;                               // 0x0158(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_160[0x8];                                      // 0x0160(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleQuickChatUIComponent">();
	}
	static class UMoleQuickChatUIComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatUIComponent>();
	}
};
static_assert(alignof(UMoleQuickChatUIComponent) == 0x000008, "Wrong alignment on UMoleQuickChatUIComponent");
static_assert(sizeof(UMoleQuickChatUIComponent) == 0x000168, "Wrong size on UMoleQuickChatUIComponent");
static_assert(offsetof(UMoleQuickChatUIComponent, MessagesTable) == 0x0000B0, "Member 'UMoleQuickChatUIComponent::MessagesTable' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatUIComponent, MessageSpamMap) == 0x0000D8, "Member 'UMoleQuickChatUIComponent::MessageSpamMap' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatUIComponent, MessagesSummary) == 0x000128, "Member 'UMoleQuickChatUIComponent::MessagesSummary' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatUIComponent, MessageLog) == 0x000140, "Member 'UMoleQuickChatUIComponent::MessageLog' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatUIComponent, MinimumTimeBetweenSameMessageSend) == 0x000150, "Member 'UMoleQuickChatUIComponent::MinimumTimeBetweenSameMessageSend' has a wrong offset!");
static_assert(offsetof(UMoleQuickChatUIComponent, LoadedMessagesTable) == 0x000158, "Member 'UMoleQuickChatUIComponent::LoadedMessagesTable' has a wrong offset!");

// Class MoleUI.MoleQuickChatWidget
// 0x0220 (0x0550 - 0x0330)
class UMoleQuickChatWidget final : public UCommonActivatableWidget
{
public:
	class FText                                   LeftBracketToken;                                  // 0x0330(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   RightBracketToken;                                 // 0x0348(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddPlayerToken;                                    // 0x0360(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddPlayerOptionalToken;                            // 0x0378(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddPlayerTitleToken;                               // 0x0390(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddGhostToken;                                     // 0x03A8(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddGhostOptionalToken;                             // 0x03C0(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddGhostTitleToken;                                // 0x03D8(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddLocationToken;                                  // 0x03F0(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddLocationOptionalToken;                          // 0x0408(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddLocationTitleToken;                             // 0x0420(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   SelectedTokenFormat;                               // 0x0438(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UMoleQuickChatRadialSlot>   CategoryWidgetClass;                               // 0x0450(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UMoleQuickChatRadialSlot>   ActionWidgetClass;                                 // 0x0458(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FMoleBlockedInput>              InputActionsToBlock;                               // 0x0460(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FMoleHoldBinding                       BackBinding;                                       // 0x0470(0x0020)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UOverlay*                               Overlay_Selections;                                // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              Switcher_SelectionMethods;                         // 0x0498(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_Radial;                                    // 0x04A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_Players;                                   // 0x04A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_Map;                                       // 0x04B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMoleSlottedRadialMenu*                 Radial_Selections;                                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMoleQuickChatPlayersWidget*            MolePlayers_PlayerSelection;                       // 0x04C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
