#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotherGameplayRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "MotherGameplayRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MotherGameplayRuntime.FortGameplayCueNotifyLoop_Goop
// 0x0038 (0x0840 - 0x0808)
class AFortGameplayCueNotifyLoop_Goop final : public AFortGameplayCueNotify_Loop
{
public:
	class FName                                   SpeedParamName;                                    // 0x0808(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsFallingParamName;                                // 0x0810(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGoopAudioMapRangeClamped              SpeedMapRangeClamped;                              // 0x0818(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         InterpSpeed;                                       // 0x0828(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_82C[0x4];                                      // 0x082C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        LoopingAudioComponent;                             // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_838[0x8];                                      // 0x0838(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayCueNotifyLoop_Goop">();
	}
	static class AFortGameplayCueNotifyLoop_Goop* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortGameplayCueNotifyLoop_Goop>();
	}
};
static_assert(alignof(AFortGameplayCueNotifyLoop_Goop) == 0x000008, "Wrong alignment on AFortGameplayCueNotifyLoop_Goop");
static_assert(sizeof(AFortGameplayCueNotifyLoop_Goop) == 0x000840, "Wrong size on AFortGameplayCueNotifyLoop_Goop");
static_assert(offsetof(AFortGameplayCueNotifyLoop_Goop, SpeedParamName) == 0x000808, "Member 'AFortGameplayCueNotifyLoop_Goop::SpeedParamName' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_Goop, IsFallingParamName) == 0x000810, "Member 'AFortGameplayCueNotifyLoop_Goop::IsFallingParamName' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_Goop, SpeedMapRangeClamped) == 0x000818, "Member 'AFortGameplayCueNotifyLoop_Goop::SpeedMapRangeClamped' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_Goop, InterpSpeed) == 0x000828, "Member 'AFortGameplayCueNotifyLoop_Goop::InterpSpeed' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_Goop, LoopingAudioComponent) == 0x000830, "Member 'AFortGameplayCueNotifyLoop_Goop::LoopingAudioComponent' has a wrong offset!");

// Class MotherGameplayRuntime.FortBaseAnimInstance_CageSaddle
// 0x0100 (0x04B0 - 0x03B0)
class UFortBaseAnimInstance_CageSaddle final : public UFortBaseAnimInstance
{
public:
	class AFortSphericalVehicle*                  AsFortSphericalVehicle;                            // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOnGround;                                       // 0x03B8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RemappedPitch;                                     // 0x03BC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentRoll;                                       // 0x03C0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LockedRoll;                                        // 0x03C4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHeadShouldBend;                                   // 0x03C8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFootShouldBend;                                   // 0x03C9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3CA[0x2];                                      // 0x03CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BodyGroundOffset;                                  // 0x03CC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MinClampPitchInRange;                              // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MinClampPitchOutRange;                             // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MaxClampPitchInRange;                              // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MaxClampPitchOutRange;                             // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeadAlphaInterpSpeed;                              // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3FC[0xB4];                                     // 0x03FC(0x00B4)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBaseAnimInstance_CageSaddle">();
	}
	static class UFortBaseAnimInstance_CageSaddle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBaseAnimInstance_CageSaddle>();
	}
};
static_assert(alignof(UFortBaseAnimInstance_CageSaddle) == 0x000010, "Wrong alignment on UFortBaseAnimInstance_CageSaddle");
static_assert(sizeof(UFortBaseAnimInstance_CageSaddle) == 0x0004B0, "Wrong size on UFortBaseAnimInstance_CageSaddle");
static_assert(offsetof(UFortBaseAnimInstance_CageSaddle, AsFortSphericalVehicle) == 0x0003B0, "Member 'UFortBaseAnimInstance_CageSaddle::AsFortSphericalVehicle' has a wrong offset!");
static_assert(offsetof(UFortBaseAnimInstance_CageSaddle, bIsOnGround) == 0x0003B8, "Member 'UFortBaseAnimInstance_CageSaddle::bIsOnGround' has a wrong offset!");
static_assert(offsetof(UFortBaseAnimInstance_CageSaddle, RemappedPitch) == 0x0003BC, "Member 'UFortBaseAnimInstance_CageSaddle::RemappedPitch' has a wrong offset!");
static_assert(offsetof(UFortBaseAnimInstance_CageSaddle, CurrentRoll) == 0x0003C0, "Member 'UFortBaseAnimInstance_CageSaddle::CurrentRoll' has a wrong offset!");
static_assert(offsetof(UFortBaseAnimInstance_CageSaddle, LockedRoll) == 0x0003C4, "Member 'UFortBaseAnimInstance_CageSaddle::LockedRoll' has a wrong offset!");
static_assert(offsetof(UFortBaseAnimInstance_CageSaddle, bHeadShouldBend) == 0x0003C8, "Member 'UFortBaseAnimInstance_CageSaddle::bHeadShouldBend' has a wrong offset!");
static_assert(offsetof(UFortBaseAnimInstance_CageSaddle, bFootShouldBend) == 0x0003C9, "Member 'UFortBaseAnimInstance_CageSaddle::bFootShouldBend' has a wrong offset!");
static_assert(offsetof(UFortBaseAnimInstance_CageSaddle, BodyGroundOffset) == 0x0003CC, "Member 'UFortBaseAnimInstance_CageSaddle::BodyGroundOffset' has a wrong offset!");
static_assert(offsetof(UFortBaseAnimInstance_CageSaddle, MinClampPitchInRange) == 0x0003D8, "Member 'UFortBaseAnimInstance_CageSaddle::MinClampPitchInRange' has a wrong offset!");
static_assert(offsetof(UFortBaseAnimInstance_CageSaddle, MinClampPitchOutRange) == 0x0003E0, "Member 'UFortBaseAnimInstance_CageSaddle::MinClampPitchOutRange' has a wrong offset!");
static_assert(offsetof(UFortBaseAnimInstance_CageSaddle, MaxClampPitchInRange) == 0x0003E8, "Member 'UFortBaseAnimInstance_CageSaddle::MaxClampPitchInRange' has a wrong offset!");
static_assert(offsetof(UFortBaseAnimInstance_CageSaddle, MaxClampPitchOutRange) == 0x0003F0, "Member 'UFortBaseAnimInstance_CageSaddle::MaxClampPitchOutRange' has a wrong offset!");
static_assert(offsetof(UFortBaseAnimInstance_CageSaddle, HeadAlphaInterpSpeed) == 0x0003F8, "Member 'UFortBaseAnimInstance_CageSaddle::HeadAlphaInterpSpeed' has a wrong offset!");

// Class MotherGameplayRuntime.FortCabbageIglooVehicle
// 0x0000 (0x1EE0 - 0x1EE0)
class AFortCabbageIglooVehicle final : public AFortOctopusVehicle
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCabbageIglooVehicle">();
	}
	static class AFortCabbageIglooVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortCabbageIglooVehicle>();
	}
};
static_assert(alignof(AFortCabbageIglooVehicle) == 0x000010, "Wrong alignment on AFortCabbageIglooVehicle");
static_assert(sizeof(AFortCabbageIglooVehicle) == 0x001EE0, "Wrong size on AFortCabbageIglooVehicle");

// Class MotherGameplayRuntime.GravityGunTargetTrackingComponent
// 0x01C8 (0x0278 - 0x00B0)
class UGravityGunTargetTrackingComponent final : public UActorComponent
{
public:
	struct FScalableFloat                         AllowLargeObjects;                                 // 0x00B0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowMultipleGrabbers;                             // 0x00D8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowVehicles;                                     // 0x0100(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowPickups;                                      // 0x0128(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowProjectiles;                                  // 0x0150(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowForay;                                        // 0x0178(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowWhileInVehicle;                               // 0x01A0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   GrabbedByGravityGunTagName;                        // 0x01C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  InvalidTargetTags;                                 // 0x01D0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetIsPlayerTag;                                 // 0x01F0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetIsAlreadyGrabbedTag;                         // 0x0210(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetIsOwnVehicleTag;                             // 0x0230(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class AActor* NewTarget)> FoundTargetDelegate;                               // 0x0250(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              DeactivateReticleDelegate;                         // 0x0260(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_270[0x8];                                      // 0x0270(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FindTargetActor(class AActor* OwningPlayer, const struct FVector& TraceStart, const struct FVector& TraceEnd);
	bool FindTargetProjectile(class AActor* OwningPlayer, const struct FVector& TraceStart, const struct FVector& TraceEnd, float TargetingRadius);
	bool IsValidTarget(class AActor* OwningPlayer, class AActor* PotentialTarget, struct FGameplayTagContainer* ReasonForFailure);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GravityGunTargetTrackingComponent">();
	}
	static class UGravityGunTargetTrackingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGravityGunTargetTrackingComponent>();
	}
};
static_assert(alignof(UGravityGunTargetTrackingComponent) == 0x000008, "Wrong alignment on UGravityGunTargetTrackingComponent");
static_assert(sizeof(UGravityGunTargetTrackingComponent) == 0x000278, "Wrong size on UGravityGunTargetTrackingComponent");
static_assert(offsetof(UGravityGunTargetTrackingComponent, AllowLargeObjects) == 0x0000B0, "Member 'UGravityGunTargetTrackingComponent::AllowLargeObjects' has a wrong offset!");
static_assert(offsetof(UGravityGunTargetTrackingComponent, AllowMultipleGrabbers) == 0x0000D8, "Member 'UGravityGunTargetTrackingComponent::AllowMultipleGrabbers' has a wrong offset!");
static_assert(offsetof(UGravityGunTargetTrackingComponent, AllowVehicles) == 0x000100, "Member 'UGravityGunTargetTrackingComponent::AllowVehicles' has a wrong offset!");
static_assert(offsetof(UGravityGunTargetTrackingComponent, AllowPickups) == 0x000128, "Member 'UGravityGunTargetTrackingComponent::AllowPickups' has a wrong offset!");
static_assert(offsetof(UGravityGunTargetTrackingComponent, AllowProjectiles) == 0x000150, "Member 'UGravityGunTargetTrackingComponent::AllowProjectiles' has a wrong offset!");
static_assert(offsetof(UGravityGunTargetTrackingComponent, AllowForay) == 0x000178, "Member 'UGravityGunTargetTrackingComponent::AllowForay' has a wrong offset!");
static_assert(offsetof(UGravityGunTargetTrackingComponent, AllowWhileInVehicle) == 0x0001A0, "Member 'UGravityGunTargetTrackingComponent::AllowWhileInVehicle' has a wrong offset!");
static_assert(offsetof(UGravityGunTargetTrackingComponent, GrabbedByGravityGunTagName) == 0x0001C8, "Member 'UGravityGunTargetTrackingComponent::GrabbedByGravityGunTagName' has a wrong offset!");
static_assert(offsetof(UGravityGunTargetTrackingComponent, InvalidTargetTags) == 0x0001D0, "Member 'UGravityGunTargetTrackingComponent::InvalidTargetTags' has a wrong offset!");
static_assert(offsetof(UGravityGunTargetTrackingComponent, TargetIsPlayerTag) == 0x0001F0, "Member 'UGravityGunTargetTrackingComponent::TargetIsPlayerTag' has a wrong offset!");
static_assert(offsetof(UGravityGunTargetTrackingComponent, TargetIsAlreadyGrabbedTag) == 0x000210, "Member 'UGravityGunTargetTrackingComponent::TargetIsAlreadyGrabbedTag' has a wrong offset!");
static_assert(offsetof(UGravityGunTargetTrackingComponent, TargetIsOwnVehicleTag) == 0x000230, "Member 'UGravityGunTargetTrackingComponent::TargetIsOwnVehicleTag' has a wrong offset!");
static_assert(offsetof(UGravityGunTargetTrackingComponent, FoundTargetDelegate) == 0x000250, "Member 'UGravityGunTargetTrackingComponent::FoundTargetDelegate' has a wrong offset!");
static_assert(offsetof(UGravityGunTargetTrackingComponent, DeactivateReticleDelegate) == 0x000260, "Member 'UGravityGunTargetTrackingComponent::DeactivateReticleDelegate' has a wrong offset!");

// Class MotherGameplayRuntime.PropGunFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UPropGunFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void UpdatePropPreviewPosition(class USceneComponent* PropPreviewComponent, const float DeltaTime, const class AFortPawn* AttachPawn, const class FName AttachSocket, const class USkeletalMeshComponent* WeaponMesh, const struct FVector& DesiredRelativeTransform, const float MinimumZOffset, const struct FRotator& RelativeRotation, const struct FVector& CachedScale, const float InterpSpeed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropGunFunctionLibrary">();
	}
	static class UPropGunFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropGunFunctionLibrary>();
	}
};
static_assert(alignof(UPropGunFunctionLibrary) == 0x000008, "Wrong alignment on UPropGunFunctionLibrary");
static_assert(sizeof(UPropGunFunctionLibrary) == 0x000028, "Wrong size on UPropGunFunctionLibrary");

// Class MotherGameplayRuntime.ReactorGradeGameplayCue_ChargeUp
// 0x0078 (0x0880 - 0x0808)
class AReactorGradeGameplayCue_ChargeUp final : public AFortGameplayCueNotify_Loop
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                FoundEndPoint;                                     // 0x0810(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_81C[0x4];                                      // 0x081C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MinHitDistance;                                    // 0x0820(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HitObjectsLimit;                                   // 0x0848(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_870[0x4];                                      // 0x0870(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	ECollisionChannel                             TraceChannel;                                      // 0x0874(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_875[0xB];                                      // 0x0875(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEndPointFound(const struct FVector& FoundPoint);
	void UpdateAimEndPoint();

	const struct FVector GetFoundEndPoint() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReactorGradeGameplayCue_ChargeUp">();
	}
	static class AReactorGradeGameplayCue_ChargeUp* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReactorGradeGameplayCue_ChargeUp>();
	}
};
static_assert(alignof(AReactorGradeGameplayCue_ChargeUp) == 0x000008, "Wrong alignment on AReactorGradeGameplayCue_ChargeUp");
static_assert(sizeof(AReactorGradeGameplayCue_ChargeUp) == 0x000880, "Wrong size on AReactorGradeGameplayCue_ChargeUp");
static_assert(offsetof(AReactorGradeGameplayCue_ChargeUp, Pawn) == 0x000808, "Member 'AReactorGradeGameplayCue_ChargeUp::Pawn' has a wrong offset!");
static_assert(offsetof(AReactorGradeGameplayCue_ChargeUp, FoundEndPoint) == 0x000810, "Member 'AReactorGradeGameplayCue_ChargeUp::FoundEndPoint' has a wrong offset!");
static_assert(offsetof(AReactorGradeGameplayCue_ChargeUp, MinHitDistance) == 0x000820, "Member 'AReactorGradeGameplayCue_ChargeUp::MinHitDistance' has a wrong offset!");
static_assert(offsetof(AReactorGradeGameplayCue_ChargeUp, HitObjectsLimit) == 0x000848, "Member 'AReactorGradeGameplayCue_ChargeUp::HitObjectsLimit' has a wrong offset!");
static_assert(offsetof(AReactorGradeGameplayCue_ChargeUp, TraceChannel) == 0x000874, "Member 'AReactorGradeGameplayCue_ChargeUp::TraceChannel' has a wrong offset!");

}

