#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MTXButton_PurchaseScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MTXButton_PurchaseScreen.MTXButton_PurchaseScreen_C
// 0x0030 (0x0F30 - 0x0F00)
class UMTXButton_PurchaseScreen_C final : public UFortMTXButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0F10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Vbucks;                                      // 0x0F18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               VariableSize;                                      // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_MTXButton_PurchaseScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MTXButton_PurchaseScreen_C">();
	}
	static class UMTXButton_PurchaseScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMTXButton_PurchaseScreen_C>();
	}
};
static_assert(alignof(UMTXButton_PurchaseScreen_C) == 0x000010, "Wrong alignment on UMTXButton_PurchaseScreen_C");
static_assert(sizeof(UMTXButton_PurchaseScreen_C) == 0x000F30, "Wrong size on UMTXButton_PurchaseScreen_C");
static_assert(offsetof(UMTXButton_PurchaseScreen_C, UberGraphFrame) == 0x000F00, "Member 'UMTXButton_PurchaseScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMTXButton_PurchaseScreen_C, Hover) == 0x000F08, "Member 'UMTXButton_PurchaseScreen_C::Hover' has a wrong offset!");
static_assert(offsetof(UMTXButton_PurchaseScreen_C, ButtonBacking) == 0x000F10, "Member 'UMTXButton_PurchaseScreen_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(UMTXButton_PurchaseScreen_C, Image_Vbucks) == 0x000F18, "Member 'UMTXButton_PurchaseScreen_C::Image_Vbucks' has a wrong offset!");
static_assert(offsetof(UMTXButton_PurchaseScreen_C, VariableSize) == 0x000F20, "Member 'UMTXButton_PurchaseScreen_C::VariableSize' has a wrong offset!");

}

