#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MultiInteractActorComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function MultiInteractActorComponent.MultiInteractActorComponent_C.AddGCNL
// 0x00E8 (0x00E8 - 0x0000)
struct MultiInteractActorComponent_C_AddGCNL final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0028(0x00C0)(ContainsInstancedReference)
};
static_assert(alignof(MultiInteractActorComponent_C_AddGCNL) == 0x000008, "Wrong alignment on MultiInteractActorComponent_C_AddGCNL");
static_assert(sizeof(MultiInteractActorComponent_C_AddGCNL) == 0x0000E8, "Wrong size on MultiInteractActorComponent_C_AddGCNL");
static_assert(offsetof(MultiInteractActorComponent_C_AddGCNL, PlayerPawn) == 0x000000, "Member 'MultiInteractActorComponent_C_AddGCNL::PlayerPawn' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_AddGCNL, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'MultiInteractActorComponent_C_AddGCNL::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_AddGCNL, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'MultiInteractActorComponent_C_AddGCNL::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_AddGCNL, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000020, "Member 'MultiInteractActorComponent_C_AddGCNL::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_AddGCNL, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000028, "Member 'MultiInteractActorComponent_C_AddGCNL::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

// Function MultiInteractActorComponent.MultiInteractActorComponent_C.ExecuteGCNFromTag
// 0x00F8 (0x00F8 - 0x0000)
struct MultiInteractActorComponent_C_ExecuteGCNFromTag final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InteractTag;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousInteractPlayerCount;                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInteractionDuration_ReturnValue;       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0038(0x00C0)(ContainsInstancedReference)
};
static_assert(alignof(MultiInteractActorComponent_C_ExecuteGCNFromTag) == 0x000008, "Wrong alignment on MultiInteractActorComponent_C_ExecuteGCNFromTag");
static_assert(sizeof(MultiInteractActorComponent_C_ExecuteGCNFromTag) == 0x0000F8, "Wrong size on MultiInteractActorComponent_C_ExecuteGCNFromTag");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteGCNFromTag, PlayerPawn) == 0x000000, "Member 'MultiInteractActorComponent_C_ExecuteGCNFromTag::PlayerPawn' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteGCNFromTag, InteractTag) == 0x000008, "Member 'MultiInteractActorComponent_C_ExecuteGCNFromTag::InteractTag' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteGCNFromTag, PreviousInteractPlayerCount) == 0x000010, "Member 'MultiInteractActorComponent_C_ExecuteGCNFromTag::PreviousInteractPlayerCount' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteGCNFromTag, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'MultiInteractActorComponent_C_ExecuteGCNFromTag::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteGCNFromTag, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000020, "Member 'MultiInteractActorComponent_C_ExecuteGCNFromTag::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteGCNFromTag, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'MultiInteractActorComponent_C_ExecuteGCNFromTag::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteGCNFromTag, CallFunc_GetInteractionDuration_ReturnValue) == 0x000030, "Member 'MultiInteractActorComponent_C_ExecuteGCNFromTag::CallFunc_GetInteractionDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteGCNFromTag, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000034, "Member 'MultiInteractActorComponent_C_ExecuteGCNFromTag::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteGCNFromTag, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000038, "Member 'MultiInteractActorComponent_C_ExecuteGCNFromTag::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

// Function MultiInteractActorComponent.MultiInteractActorComponent_C.ExecuteUbergraph_MultiInteractActorComponent
// 0x0048 (0x0048 - 0x0000)
struct MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bLocalPlayerInteracting;              // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bLocalPlayerJustLeft;                 // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent) == 0x000008, "Wrong alignment on MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent");
static_assert(sizeof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent) == 0x000048, "Wrong size on MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent, EntryPoint) == 0x000000, "Member 'MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent, K2Node_Event_bLocalPlayerInteracting) == 0x000004, "Member 'MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent::K2Node_Event_bLocalPlayerInteracting' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent, K2Node_Event_bLocalPlayerJustLeft) == 0x000005, "Member 'MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent::K2Node_Event_bLocalPlayerJustLeft' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000018, "Member 'MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000020, "Member 'MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000030, "Member 'MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000040, "Member 'MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent, CallFunc_BooleanOR_ReturnValue) == 0x000041, "Member 'MultiInteractActorComponent_C_ExecuteUbergraph_MultiInteractActorComponent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function MultiInteractActorComponent.MultiInteractActorComponent_C.RemoveGCNL
// 0x00D8 (0x00D8 - 0x0000)
struct MultiInteractActorComponent_C_RemoveGCNL final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0018(0x00C0)(ContainsInstancedReference)
};
static_assert(alignof(MultiInteractActorComponent_C_RemoveGCNL) == 0x000008, "Wrong alignment on MultiInteractActorComponent_C_RemoveGCNL");
static_assert(sizeof(MultiInteractActorComponent_C_RemoveGCNL) == 0x0000D8, "Wrong size on MultiInteractActorComponent_C_RemoveGCNL");
static_assert(offsetof(MultiInteractActorComponent_C_RemoveGCNL, PlayerPawn) == 0x000000, "Member 'MultiInteractActorComponent_C_RemoveGCNL::PlayerPawn' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_RemoveGCNL, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'MultiInteractActorComponent_C_RemoveGCNL::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_RemoveGCNL, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000018, "Member 'MultiInteractActorComponent_C_RemoveGCNL::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

// Function MultiInteractActorComponent.MultiInteractActorComponent_C.SetRequiredDuration
// 0x0004 (0x0004 - 0x0000)
struct MultiInteractActorComponent_C_SetRequiredDuration final
{
public:
	float                                         NewRequiredDuration;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MultiInteractActorComponent_C_SetRequiredDuration) == 0x000004, "Wrong alignment on MultiInteractActorComponent_C_SetRequiredDuration");
static_assert(sizeof(MultiInteractActorComponent_C_SetRequiredDuration) == 0x000004, "Wrong size on MultiInteractActorComponent_C_SetRequiredDuration");
static_assert(offsetof(MultiInteractActorComponent_C_SetRequiredDuration, NewRequiredDuration) == 0x000000, "Member 'MultiInteractActorComponent_C_SetRequiredDuration::NewRequiredDuration' has a wrong offset!");

// Function MultiInteractActorComponent.MultiInteractActorComponent_C.UpdateForPlayerJustLeftInteraction
// 0x0002 (0x0002 - 0x0000)
struct MultiInteractActorComponent_C_UpdateForPlayerJustLeftInteraction final
{
public:
	bool                                          bLocalPlayerInteracting;                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLocalPlayerJustLeft;                              // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MultiInteractActorComponent_C_UpdateForPlayerJustLeftInteraction) == 0x000001, "Wrong alignment on MultiInteractActorComponent_C_UpdateForPlayerJustLeftInteraction");
static_assert(sizeof(MultiInteractActorComponent_C_UpdateForPlayerJustLeftInteraction) == 0x000002, "Wrong size on MultiInteractActorComponent_C_UpdateForPlayerJustLeftInteraction");
static_assert(offsetof(MultiInteractActorComponent_C_UpdateForPlayerJustLeftInteraction, bLocalPlayerInteracting) == 0x000000, "Member 'MultiInteractActorComponent_C_UpdateForPlayerJustLeftInteraction::bLocalPlayerInteracting' has a wrong offset!");
static_assert(offsetof(MultiInteractActorComponent_C_UpdateForPlayerJustLeftInteraction, bLocalPlayerJustLeft) == 0x000001, "Member 'MultiInteractActorComponent_C_UpdateForPlayerJustLeftInteraction::bLocalPlayerJustLeft' has a wrong offset!");

}

