#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NetUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class NetUI.BadNetworkIndicator
// 0x0030 (0x02E0 - 0x02B0)
class UBadNetworkIndicator final : public UFortHUDElementWidget
{
public:
	bool                                          bEnabled;                                          // 0x02B0(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumDisplayTime;                                // 0x02B4(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         UpdateTime;                                        // 0x02B8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         InitialDelay;                                      // 0x02BC(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C0[0x20];                                     // 0x02C0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateDisplay();

	float GetPacketLoss() const;
	float GetPing() const;
	bool HasBadPacketLoss() const;
	bool HasBadPing() const;
	bool HasSeverePacketLoss() const;
	bool HasSeverePing() const;
	bool ShouldDisplay() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BadNetworkIndicator">();
	}
	static class UBadNetworkIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBadNetworkIndicator>();
	}
};
static_assert(alignof(UBadNetworkIndicator) == 0x000008, "Wrong alignment on UBadNetworkIndicator");
static_assert(sizeof(UBadNetworkIndicator) == 0x0002E0, "Wrong size on UBadNetworkIndicator");
static_assert(offsetof(UBadNetworkIndicator, bEnabled) == 0x0002B0, "Member 'UBadNetworkIndicator::bEnabled' has a wrong offset!");
static_assert(offsetof(UBadNetworkIndicator, MinimumDisplayTime) == 0x0002B4, "Member 'UBadNetworkIndicator::MinimumDisplayTime' has a wrong offset!");
static_assert(offsetof(UBadNetworkIndicator, UpdateTime) == 0x0002B8, "Member 'UBadNetworkIndicator::UpdateTime' has a wrong offset!");
static_assert(offsetof(UBadNetworkIndicator, InitialDelay) == 0x0002BC, "Member 'UBadNetworkIndicator::InitialDelay' has a wrong offset!");

// Class NetUI.NetDebugWidget
// 0x00E8 (0x0330 - 0x0248)
class UNetDebugWidget final : public UUserWidget
{
public:
	class UCommonTextBlock*                       PingUI;                                            // 0x0248(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       PacketInRateUI;                                    // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       PacketOutRateUI;                                   // 0x0258(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       PacketInLossUI;                                    // 0x0260(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       PacketOutLossUI;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       UpBandwidthUI;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       DownBandwidthUI;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_280[0xB0];                                     // 0x0280(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void StartTimer();
	void StopTimer();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetDebugWidget">();
	}
	static class UNetDebugWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetDebugWidget>();
	}
};
static_assert(alignof(UNetDebugWidget) == 0x000008, "Wrong alignment on UNetDebugWidget");
static_assert(sizeof(UNetDebugWidget) == 0x000330, "Wrong size on UNetDebugWidget");
static_assert(offsetof(UNetDebugWidget, PingUI) == 0x000248, "Member 'UNetDebugWidget::PingUI' has a wrong offset!");
static_assert(offsetof(UNetDebugWidget, PacketInRateUI) == 0x000250, "Member 'UNetDebugWidget::PacketInRateUI' has a wrong offset!");
static_assert(offsetof(UNetDebugWidget, PacketOutRateUI) == 0x000258, "Member 'UNetDebugWidget::PacketOutRateUI' has a wrong offset!");
static_assert(offsetof(UNetDebugWidget, PacketInLossUI) == 0x000260, "Member 'UNetDebugWidget::PacketInLossUI' has a wrong offset!");
static_assert(offsetof(UNetDebugWidget, PacketOutLossUI) == 0x000268, "Member 'UNetDebugWidget::PacketOutLossUI' has a wrong offset!");
static_assert(offsetof(UNetDebugWidget, UpBandwidthUI) == 0x000270, "Member 'UNetDebugWidget::UpBandwidthUI' has a wrong offset!");
static_assert(offsetof(UNetDebugWidget, DownBandwidthUI) == 0x000278, "Member 'UNetDebugWidget::DownBandwidthUI' has a wrong offset!");

// Class NetUI.NetGraph
// 0x0030 (0x0278 - 0x0248)
class UNetGraph final : public UUserWidget
{
public:
	struct FColor                                 BackgroundColor;                                   // 0x0248(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 PingLineColor;                                     // 0x024C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 QueuedBunchesLineColor;                            // 0x0250(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 PacketLossLineColor;                               // 0x0254(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              DesiredSize;                                       // 0x0258(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxPingToGraph;                                    // 0x0260(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_264[0x14];                                     // 0x0264(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetGraph">();
	}
	static class UNetGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetGraph>();
	}
};
static_assert(alignof(UNetGraph) == 0x000008, "Wrong alignment on UNetGraph");
static_assert(sizeof(UNetGraph) == 0x000278, "Wrong size on UNetGraph");
static_assert(offsetof(UNetGraph, BackgroundColor) == 0x000248, "Member 'UNetGraph::BackgroundColor' has a wrong offset!");
static_assert(offsetof(UNetGraph, PingLineColor) == 0x00024C, "Member 'UNetGraph::PingLineColor' has a wrong offset!");
static_assert(offsetof(UNetGraph, QueuedBunchesLineColor) == 0x000250, "Member 'UNetGraph::QueuedBunchesLineColor' has a wrong offset!");
static_assert(offsetof(UNetGraph, PacketLossLineColor) == 0x000254, "Member 'UNetGraph::PacketLossLineColor' has a wrong offset!");
static_assert(offsetof(UNetGraph, DesiredSize) == 0x000258, "Member 'UNetGraph::DesiredSize' has a wrong offset!");
static_assert(offsetof(UNetGraph, MaxPingToGraph) == 0x000260, "Member 'UNetGraph::MaxPingToGraph' has a wrong offset!");

}

