#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NevadaUI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "NevadaRuntime_structs.hpp"


namespace SDK
{

// Class NevadaUI.FortNevadaVehicleReticle
// 0x00A8 (0x03E8 - 0x0340)
class UFortNevadaVehicleReticle final : public UFortAthenaVehicleDashboardWidget
{
public:
	TSubclassOf<class UNevadaTargetIndicator>     NevadaTargetIndicatorClass;                        // 0x0340(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNevadaTargetIndicator*                 TargetIndicator;                                   // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortNevadaVehicle*                     OwningNevadaVehicle;                               // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserWidgetPool                        IndicatorPool;                                     // 0x0360(0x0088)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void OnBatteryChanged(float BatteryLevel);
	void OnEnergyCannonEnabledChanged(const bool bEnabled);
	void OnEnergyCanonFired(const float Cooldown);
	void OnTractorBeamActivated();
	void OnTractorBeamAttached();
	void OnTractorBeamChargeStarted();
	void OnTractorBeamDeactivated(const float Cooldown);
	void OnTractorBeamDetached();
	void OnTractorBeamEnabledChanged(const bool bEnabled);
	void OnVehicleStateChanged(const ENevadaFlightStates VehicleState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNevadaVehicleReticle">();
	}
	static class UFortNevadaVehicleReticle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNevadaVehicleReticle>();
	}
};
static_assert(alignof(UFortNevadaVehicleReticle) == 0x000008, "Wrong alignment on UFortNevadaVehicleReticle");
static_assert(sizeof(UFortNevadaVehicleReticle) == 0x0003E8, "Wrong size on UFortNevadaVehicleReticle");
static_assert(offsetof(UFortNevadaVehicleReticle, NevadaTargetIndicatorClass) == 0x000340, "Member 'UFortNevadaVehicleReticle::NevadaTargetIndicatorClass' has a wrong offset!");
static_assert(offsetof(UFortNevadaVehicleReticle, TargetIndicator) == 0x000348, "Member 'UFortNevadaVehicleReticle::TargetIndicator' has a wrong offset!");
static_assert(offsetof(UFortNevadaVehicleReticle, OwningNevadaVehicle) == 0x000350, "Member 'UFortNevadaVehicleReticle::OwningNevadaVehicle' has a wrong offset!");
static_assert(offsetof(UFortNevadaVehicleReticle, IndicatorPool) == 0x000360, "Member 'UFortNevadaVehicleReticle::IndicatorPool' has a wrong offset!");

// Class NevadaUI.NevadaTargetIndicator
// 0x0010 (0x02F8 - 0x02E8)
class UNevadaTargetIndicator final : public UFortActorIndicatorWidget
{
public:
	uint8                                         Pad_2E8[0x10];                                     // 0x02E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTargetActorChanged(class AActor* TargetedActor);
	void OnTractorBeamActivated(const bool bActivated);
	void OnTractorBeamAttached(const bool bAttached);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NevadaTargetIndicator">();
	}
	static class UNevadaTargetIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNevadaTargetIndicator>();
	}
};
static_assert(alignof(UNevadaTargetIndicator) == 0x000008, "Wrong alignment on UNevadaTargetIndicator");
static_assert(sizeof(UNevadaTargetIndicator) == 0x0002F8, "Wrong size on UNevadaTargetIndicator");

}

