#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NevadaRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Enum NevadaRuntime.ETractorBeamState
// NumValues: 0x0003
enum class ETractorBeamState : uint8
{
	TBS_Inactive                             = 0,
	TBS_Charging                             = 1,
	TBS_Active                               = 2,
};

// Enum NevadaRuntime.ENevadaFlightStates
// NumValues: 0x0008
enum class ENevadaFlightStates : uint8
{
	FLIGHT                                   = 0,
	CRASHING                                 = 1,
	CRASHED                                  = 2,
	REBOOTING                                = 3,
	LANDING                                  = 4,
	LANDED                                   = 5,
	IDLE                                     = 6,
	NONE                                     = 7,
};

// ScriptStruct NevadaRuntime.NevadaAudioUpdateContext
// 0x0001 (0x0001 - 0x0000)
struct FNevadaAudioUpdateContext final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNevadaAudioUpdateContext) == 0x000001, "Wrong alignment on FNevadaAudioUpdateContext");
static_assert(sizeof(FNevadaAudioUpdateContext) == 0x000001, "Wrong size on FNevadaAudioUpdateContext");

// ScriptStruct NevadaRuntime.NevadaOutContinuous
// 0x0008 (0x0030 - 0x0028)
struct FNevadaOutContinuous final : public FFortVehicleOutContinuous
{
public:
	float                                         AltimeterTraceHitDistance;                         // 0x0028(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TractorBeamAppliedForceMagnitude;                  // 0x002C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNevadaOutContinuous) == 0x000008, "Wrong alignment on FNevadaOutContinuous");
static_assert(sizeof(FNevadaOutContinuous) == 0x000030, "Wrong size on FNevadaOutContinuous");
static_assert(offsetof(FNevadaOutContinuous, AltimeterTraceHitDistance) == 0x000028, "Member 'FNevadaOutContinuous::AltimeterTraceHitDistance' has a wrong offset!");
static_assert(offsetof(FNevadaOutContinuous, TractorBeamAppliedForceMagnitude) == 0x00002C, "Member 'FNevadaOutContinuous::TractorBeamAppliedForceMagnitude' has a wrong offset!");

// ScriptStruct NevadaRuntime.NevadaOutPersistent
// 0x0370 (0x0380 - 0x0010)
struct FNevadaOutPersistent final : public FFortVehicleOutPersistent
{
public:
	uint8                                         Pad_10[0x370];                                     // 0x0010(0x0370)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNevadaOutPersistent) == 0x000008, "Wrong alignment on FNevadaOutPersistent");
static_assert(sizeof(FNevadaOutPersistent) == 0x000380, "Wrong size on FNevadaOutPersistent");

// ScriptStruct NevadaRuntime.NevadaState
// 0x0014 (0x0014 - 0x0000)
struct FNevadaState final
{
public:
	ENevadaFlightStates                           CurrentStatus;                                     // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LivesRemaining;                                    // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHijackingActive;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPilotBubbleCollisionEnabled;                      // 0x0009(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentBatteryCharge;                              // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCannonEnabled;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeamEnabled;                               // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNevadaState) == 0x000004, "Wrong alignment on FNevadaState");
static_assert(sizeof(FNevadaState) == 0x000014, "Wrong size on FNevadaState");
static_assert(offsetof(FNevadaState, CurrentStatus) == 0x000000, "Member 'FNevadaState::CurrentStatus' has a wrong offset!");
static_assert(offsetof(FNevadaState, LivesRemaining) == 0x000004, "Member 'FNevadaState::LivesRemaining' has a wrong offset!");
static_assert(offsetof(FNevadaState, bHijackingActive) == 0x000008, "Member 'FNevadaState::bHijackingActive' has a wrong offset!");
static_assert(offsetof(FNevadaState, bPilotBubbleCollisionEnabled) == 0x000009, "Member 'FNevadaState::bPilotBubbleCollisionEnabled' has a wrong offset!");
static_assert(offsetof(FNevadaState, CurrentBatteryCharge) == 0x00000C, "Member 'FNevadaState::CurrentBatteryCharge' has a wrong offset!");
static_assert(offsetof(FNevadaState, bCannonEnabled) == 0x000010, "Member 'FNevadaState::bCannonEnabled' has a wrong offset!");
static_assert(offsetof(FNevadaState, bTractorBeamEnabled) == 0x000011, "Member 'FNevadaState::bTractorBeamEnabled' has a wrong offset!");

// ScriptStruct NevadaRuntime.NevadaMoveModeConfig
// 0x0014 (0x0014 - 0x0000)
struct FNevadaMoveModeConfig final
{
public:
	float                                         ThrustForce;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LiftForce;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxHorizontalSpeed;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxVerticalSpeed;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DragForceMultiplier;                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNevadaMoveModeConfig) == 0x000004, "Wrong alignment on FNevadaMoveModeConfig");
static_assert(sizeof(FNevadaMoveModeConfig) == 0x000014, "Wrong size on FNevadaMoveModeConfig");
static_assert(offsetof(FNevadaMoveModeConfig, ThrustForce) == 0x000000, "Member 'FNevadaMoveModeConfig::ThrustForce' has a wrong offset!");
static_assert(offsetof(FNevadaMoveModeConfig, LiftForce) == 0x000004, "Member 'FNevadaMoveModeConfig::LiftForce' has a wrong offset!");
static_assert(offsetof(FNevadaMoveModeConfig, MaxHorizontalSpeed) == 0x000008, "Member 'FNevadaMoveModeConfig::MaxHorizontalSpeed' has a wrong offset!");
static_assert(offsetof(FNevadaMoveModeConfig, MaxVerticalSpeed) == 0x00000C, "Member 'FNevadaMoveModeConfig::MaxVerticalSpeed' has a wrong offset!");
static_assert(offsetof(FNevadaMoveModeConfig, DragForceMultiplier) == 0x000010, "Member 'FNevadaMoveModeConfig::DragForceMultiplier' has a wrong offset!");

// ScriptStruct NevadaRuntime.NevadaInPersistent
// 0x0100 (0x0248 - 0x0148)
struct FNevadaInPersistent final : public FFortVehicleInPersistent
{
public:
	class UFortNevadaVehicleConfigs*              FortNevadaVehicleConfigs;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBoostThrust;                                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBoostDrag;                                        // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TractorBeamExtraLengthForExtents;                  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseTractorBeamUprightForce;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CrashingDesiredUp;                                 // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENevadaFlightStates                           CurrentVehicleState;                               // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0xDF];                                     // 0x0169(0x00DF)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNevadaInPersistent) == 0x000008, "Wrong alignment on FNevadaInPersistent");
static_assert(sizeof(FNevadaInPersistent) == 0x000248, "Wrong size on FNevadaInPersistent");
static_assert(offsetof(FNevadaInPersistent, FortNevadaVehicleConfigs) == 0x000148, "Member 'FNevadaInPersistent::FortNevadaVehicleConfigs' has a wrong offset!");
static_assert(offsetof(FNevadaInPersistent, bBoostThrust) == 0x000150, "Member 'FNevadaInPersistent::bBoostThrust' has a wrong offset!");
static_assert(offsetof(FNevadaInPersistent, bBoostDrag) == 0x000151, "Member 'FNevadaInPersistent::bBoostDrag' has a wrong offset!");
static_assert(offsetof(FNevadaInPersistent, TractorBeamExtraLengthForExtents) == 0x000154, "Member 'FNevadaInPersistent::TractorBeamExtraLengthForExtents' has a wrong offset!");
static_assert(offsetof(FNevadaInPersistent, bUseTractorBeamUprightForce) == 0x000158, "Member 'FNevadaInPersistent::bUseTractorBeamUprightForce' has a wrong offset!");
static_assert(offsetof(FNevadaInPersistent, CrashingDesiredUp) == 0x00015C, "Member 'FNevadaInPersistent::CrashingDesiredUp' has a wrong offset!");
static_assert(offsetof(FNevadaInPersistent, CurrentVehicleState) == 0x000168, "Member 'FNevadaInPersistent::CurrentVehicleState' has a wrong offset!");

}

