#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_VoiceComponent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function NPC_VoiceComponent.NPC_VoiceComponent_C.Deprecated Set Sound Bank
// 0x0008 (0x0008 - 0x0000)
struct NPC_VoiceComponent_C_Deprecated_Set_Sound_Bank final
{
public:
	class UFortTaggedSoundBank*                   SoundBank;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_VoiceComponent_C_Deprecated_Set_Sound_Bank) == 0x000008, "Wrong alignment on NPC_VoiceComponent_C_Deprecated_Set_Sound_Bank");
static_assert(sizeof(NPC_VoiceComponent_C_Deprecated_Set_Sound_Bank) == 0x000008, "Wrong size on NPC_VoiceComponent_C_Deprecated_Set_Sound_Bank");
static_assert(offsetof(NPC_VoiceComponent_C_Deprecated_Set_Sound_Bank, SoundBank) == 0x000000, "Member 'NPC_VoiceComponent_C_Deprecated_Set_Sound_Bank::SoundBank' has a wrong offset!");

// Function NPC_VoiceComponent.NPC_VoiceComponent_C.Internal Get Voice Sound Bank
// 0x0018 (0x0018 - 0x0000)
struct NPC_VoiceComponent_C_Internal_Get_Voice_Sound_Bank final
{
public:
	class UFortTaggedSoundBank*                   Sound_Bank;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTaggedSoundBank*                   CallFunc_GetVoiceSoundBank_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_VoiceComponent_C_Internal_Get_Voice_Sound_Bank) == 0x000008, "Wrong alignment on NPC_VoiceComponent_C_Internal_Get_Voice_Sound_Bank");
static_assert(sizeof(NPC_VoiceComponent_C_Internal_Get_Voice_Sound_Bank) == 0x000018, "Wrong size on NPC_VoiceComponent_C_Internal_Get_Voice_Sound_Bank");
static_assert(offsetof(NPC_VoiceComponent_C_Internal_Get_Voice_Sound_Bank, Sound_Bank) == 0x000000, "Member 'NPC_VoiceComponent_C_Internal_Get_Voice_Sound_Bank::Sound_Bank' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_Internal_Get_Voice_Sound_Bank, CallFunc_GetVoiceSoundBank_ReturnValue) == 0x000008, "Member 'NPC_VoiceComponent_C_Internal_Get_Voice_Sound_Bank::CallFunc_GetVoiceSoundBank_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_Internal_Get_Voice_Sound_Bank, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'NPC_VoiceComponent_C_Internal_Get_Voice_Sound_Bank::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function NPC_VoiceComponent.NPC_VoiceComponent_C.PlayVoiceLine
// 0x0090 (0x0090 - 0x0000)
struct NPC_VoiceComponent_C_PlayVoiceLine final
{
public:
	struct FGameplayTag                           Gameplay_Tag;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioComponent;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundToPlay;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CurrentVOTag;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class UFortTaggedSoundBank*                   SoundBankToUse;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTaggedSoundBank*                   CallFunc_Internal_Get_Voice_Sound_Bank_Sound_Bank; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0060(0x0020)()
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CallFunc_GetSoundToPlay_ReturnValue;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_VoiceComponent_C_PlayVoiceLine) == 0x000008, "Wrong alignment on NPC_VoiceComponent_C_PlayVoiceLine");
static_assert(sizeof(NPC_VoiceComponent_C_PlayVoiceLine) == 0x000090, "Wrong size on NPC_VoiceComponent_C_PlayVoiceLine");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, Gameplay_Tag) == 0x000000, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::Gameplay_Tag' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, AudioComponent) == 0x000008, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::AudioComponent' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, Success) == 0x000010, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::Success' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, SoundToPlay) == 0x000018, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::SoundToPlay' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, CurrentVOTag) == 0x000020, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::CurrentVOTag' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, SoundBankToUse) == 0x000028, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::SoundBankToUse' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, CallFunc_IsValid_ReturnValue_1) == 0x000045, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, CallFunc_Internal_Get_Voice_Sound_Bank_Sound_Bank) == 0x000048, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::CallFunc_Internal_Get_Voice_Sound_Bank_Sound_Bank' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, CallFunc_IsValid_ReturnValue_2) == 0x000050, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000051, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, CallFunc_GetTimeSeconds_ReturnValue) == 0x000054, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000058, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00005C, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, CallFunc_BooleanAND_ReturnValue) == 0x00005D, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000060, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000080, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_VoiceComponent_C_PlayVoiceLine, CallFunc_GetSoundToPlay_ReturnValue) == 0x000088, "Member 'NPC_VoiceComponent_C_PlayVoiceLine::CallFunc_GetSoundToPlay_ReturnValue' has a wrong offset!");

// Function NPC_VoiceComponent.NPC_VoiceComponent_C.SetSourceEffectChainToApply
// 0x0008 (0x0008 - 0x0000)
struct NPC_VoiceComponent_C_SetSourceEffectChainToApply final
{
public:
	class USoundEffectSourcePresetChain*          SourceEffectChain;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_VoiceComponent_C_SetSourceEffectChainToApply) == 0x000008, "Wrong alignment on NPC_VoiceComponent_C_SetSourceEffectChainToApply");
static_assert(sizeof(NPC_VoiceComponent_C_SetSourceEffectChainToApply) == 0x000008, "Wrong size on NPC_VoiceComponent_C_SetSourceEffectChainToApply");
static_assert(offsetof(NPC_VoiceComponent_C_SetSourceEffectChainToApply, SourceEffectChain) == 0x000000, "Member 'NPC_VoiceComponent_C_SetSourceEffectChainToApply::SourceEffectChain' has a wrong offset!");

}

