#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCStatusWidgetBar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NPCStatusWidgetBar.NPCStatusWidgetBar_C
// 0x0070 (0x02B8 - 0x0248)
class UNPCStatusWidgetBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               BarSizeBox;                                        // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BarBG;                                       // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CastShadow;                                  // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleMaterialProgressBar_C*           ProgressBarDelta;                                  // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleMaterialProgressBar_C*           ProgressBarFill;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           FillColor1;                                        // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FillColor2;                                        // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Delta1;                                            // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Delta2;                                            // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NPCStatusWidgetBar(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetPercent(float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPCStatusWidgetBar_C">();
	}
	static class UNPCStatusWidgetBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPCStatusWidgetBar_C>();
	}
};
static_assert(alignof(UNPCStatusWidgetBar_C) == 0x000008, "Wrong alignment on UNPCStatusWidgetBar_C");
static_assert(sizeof(UNPCStatusWidgetBar_C) == 0x0002B8, "Wrong size on UNPCStatusWidgetBar_C");
static_assert(offsetof(UNPCStatusWidgetBar_C, UberGraphFrame) == 0x000248, "Member 'UNPCStatusWidgetBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, BarSizeBox) == 0x000250, "Member 'UNPCStatusWidgetBar_C::BarSizeBox' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, Image_BarBG) == 0x000258, "Member 'UNPCStatusWidgetBar_C::Image_BarBG' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, Image_CastShadow) == 0x000260, "Member 'UNPCStatusWidgetBar_C::Image_CastShadow' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, ProgressBarDelta) == 0x000268, "Member 'UNPCStatusWidgetBar_C::ProgressBarDelta' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, ProgressBarFill) == 0x000270, "Member 'UNPCStatusWidgetBar_C::ProgressBarFill' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, FillColor1) == 0x000278, "Member 'UNPCStatusWidgetBar_C::FillColor1' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, FillColor2) == 0x000288, "Member 'UNPCStatusWidgetBar_C::FillColor2' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, Delta1) == 0x000298, "Member 'UNPCStatusWidgetBar_C::Delta1' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, Delta2) == 0x0002A8, "Member 'UNPCStatusWidgetBar_C::Delta2' has a wrong offset!");

}

