#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCStatusWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NPCStatusWidget.NPCStatusWidget_C
// 0x0040 (0x0288 - 0x0248)
class UNPCStatusWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNPCStatusWidgetBar_C*                  Bar_Health;                                        // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNPCStatusWidgetBar_C*                  Bar_Shield;                                        // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           VisibiltyTimer;                                    // 0x0260(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool bVisible)> VisibilityChanged;                                 // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         StatusWidgetVisibleDuration;                       // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentHealthPercent;                              // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentShieldPercent;                              // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeWidgetVisibleDuration(float StatusWidgetVisibleDuration_0);
	void Construct();
	void EventHideStatus();
	void EventUpdateStatus(float Health, float Shield, bool ShowShield);
	void ExecuteUbergraph_NPCStatusWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPCStatusWidget_C">();
	}
	static class UNPCStatusWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPCStatusWidget_C>();
	}
};
static_assert(alignof(UNPCStatusWidget_C) == 0x000008, "Wrong alignment on UNPCStatusWidget_C");
static_assert(sizeof(UNPCStatusWidget_C) == 0x000288, "Wrong size on UNPCStatusWidget_C");
static_assert(offsetof(UNPCStatusWidget_C, UberGraphFrame) == 0x000248, "Member 'UNPCStatusWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidget_C, Bar_Health) == 0x000250, "Member 'UNPCStatusWidget_C::Bar_Health' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidget_C, Bar_Shield) == 0x000258, "Member 'UNPCStatusWidget_C::Bar_Shield' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidget_C, VisibiltyTimer) == 0x000260, "Member 'UNPCStatusWidget_C::VisibiltyTimer' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidget_C, VisibilityChanged) == 0x000268, "Member 'UNPCStatusWidget_C::VisibilityChanged' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidget_C, StatusWidgetVisibleDuration) == 0x000278, "Member 'UNPCStatusWidget_C::StatusWidgetVisibleDuration' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidget_C, CurrentHealthPercent) == 0x00027C, "Member 'UNPCStatusWidget_C::CurrentHealthPercent' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidget_C, CurrentShieldPercent) == 0x000280, "Member 'UNPCStatusWidget_C::CurrentShieldPercent' has a wrong offset!");

}

