#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PageNavigator

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PageNavigator.PageNavigator_C
// 0x0068 (0x0438 - 0x03D0)
class UPageNavigator_C final : public UFortPageNavigator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_4;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Color1;                                            // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           Color2;                                            // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           Color3;                                            // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           Color4;                                            // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           Color5;                                            // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PageNavigator(int32 EntryPoint);
	void OnPipButtonCreated(class UFortTextButton* NewPipButton);
	void play_intro();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PageNavigator_C">();
	}
	static class UPageNavigator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPageNavigator_C>();
	}
};
static_assert(alignof(UPageNavigator_C) == 0x000008, "Wrong alignment on UPageNavigator_C");
static_assert(sizeof(UPageNavigator_C) == 0x000438, "Wrong size on UPageNavigator_C");
static_assert(offsetof(UPageNavigator_C, UberGraphFrame) == 0x0003D0, "Member 'UPageNavigator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPageNavigator_C, Intro) == 0x0003D8, "Member 'UPageNavigator_C::Intro' has a wrong offset!");
static_assert(offsetof(UPageNavigator_C, SafeZone_4) == 0x0003E0, "Member 'UPageNavigator_C::SafeZone_4' has a wrong offset!");
static_assert(offsetof(UPageNavigator_C, Color1) == 0x0003E8, "Member 'UPageNavigator_C::Color1' has a wrong offset!");
static_assert(offsetof(UPageNavigator_C, Color2) == 0x0003F8, "Member 'UPageNavigator_C::Color2' has a wrong offset!");
static_assert(offsetof(UPageNavigator_C, Color3) == 0x000408, "Member 'UPageNavigator_C::Color3' has a wrong offset!");
static_assert(offsetof(UPageNavigator_C, Color4) == 0x000418, "Member 'UPageNavigator_C::Color4' has a wrong offset!");
static_assert(offsetof(UPageNavigator_C, Color5) == 0x000428, "Member 'UPageNavigator_C::Color5' has a wrong offset!");

}

