#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PageNavigatorPipButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PageNavigatorPipButton.PageNavigatorPipButton_C
// 0x0040 (0x0FD0 - 0x0F90)
class UPageNavigatorPipButton_C final : public UFortTextButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0F98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0FA0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BacchusMobileShadow;                               // 0x0FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_RightStick;                     // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PIP;                                               // 0x0FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RSContainer;                                       // 0x0FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnSelected();
	void Construct();
	void ExecuteUbergraph_PageNavigatorPipButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Pip_Colors(const struct FLinearColor& Base_Color, const struct FLinearColor& Hover_Color, const struct FLinearColor& Select_Color);
	void SetRightStickIconAllowed(bool Allowed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PageNavigatorPipButton_C">();
	}
	static class UPageNavigatorPipButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPageNavigatorPipButton_C>();
	}
};
static_assert(alignof(UPageNavigatorPipButton_C) == 0x000010, "Wrong alignment on UPageNavigatorPipButton_C");
static_assert(sizeof(UPageNavigatorPipButton_C) == 0x000FD0, "Wrong size on UPageNavigatorPipButton_C");
static_assert(offsetof(UPageNavigatorPipButton_C, UberGraphFrame) == 0x000F90, "Member 'UPageNavigatorPipButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPageNavigatorPipButton_C, Hover) == 0x000F98, "Member 'UPageNavigatorPipButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UPageNavigatorPipButton_C, Selected) == 0x000FA0, "Member 'UPageNavigatorPipButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UPageNavigatorPipButton_C, BacchusMobileShadow) == 0x000FA8, "Member 'UPageNavigatorPipButton_C::BacchusMobileShadow' has a wrong offset!");
static_assert(offsetof(UPageNavigatorPipButton_C, CommonActionWidget_RightStick) == 0x000FB0, "Member 'UPageNavigatorPipButton_C::CommonActionWidget_RightStick' has a wrong offset!");
static_assert(offsetof(UPageNavigatorPipButton_C, PIP) == 0x000FB8, "Member 'UPageNavigatorPipButton_C::PIP' has a wrong offset!");
static_assert(offsetof(UPageNavigatorPipButton_C, RSContainer) == 0x000FC0, "Member 'UPageNavigatorPipButton_C::RSContainer' has a wrong offset!");

}

