#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PapayaTimedEvents

#include "Basic.hpp"

#include "PapayaTimedEvents_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class PapayaTimedEvents.PapayaTimedEvents
// 0x01D8 (0x03F8 - 0x0220)
class APapayaTimedEvents final : public AActor
{
public:
	TMap<class FString, class UMediaPlayer*>      MediaPlayerMap;                                    // 0x0220(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UPapayaTimedEventsResponderComponent*   MeshEventResponder;                                // 0x0270(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         TimedEventActorTargets;                            // 0x0278(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMediaTimeEventArray                   TimedEventsArray;                                  // 0x0290(0x0118)(Net, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A8[0x18];                                     // 0x03A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ScreenName;                                        // 0x03C0(0x0010)(Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D0[0x28];                                     // 0x03D0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddTimedEvent_Native(const class FString& EventName, int64 Time, const class FString& EventParam);
	void OnRep_ScreenName(const class FString& PreviousValue);
	void OnRep_TimedEventsArray(const struct FMediaTimeEventArray& PreviousValue);
	void ResetTimedEvents_Native();
	void SetupTimedEvents_Native(const class FString& ScreenName_0);
	void ShutdownTimedEvents_Native();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PapayaTimedEvents">();
	}
	static class APapayaTimedEvents* GetDefaultObj()
	{
		return GetDefaultObjImpl<APapayaTimedEvents>();
	}
};
static_assert(alignof(APapayaTimedEvents) == 0x000008, "Wrong alignment on APapayaTimedEvents");
static_assert(sizeof(APapayaTimedEvents) == 0x0003F8, "Wrong size on APapayaTimedEvents");
static_assert(offsetof(APapayaTimedEvents, MediaPlayerMap) == 0x000220, "Member 'APapayaTimedEvents::MediaPlayerMap' has a wrong offset!");
static_assert(offsetof(APapayaTimedEvents, MeshEventResponder) == 0x000270, "Member 'APapayaTimedEvents::MeshEventResponder' has a wrong offset!");
static_assert(offsetof(APapayaTimedEvents, TimedEventActorTargets) == 0x000278, "Member 'APapayaTimedEvents::TimedEventActorTargets' has a wrong offset!");
static_assert(offsetof(APapayaTimedEvents, TimedEventsArray) == 0x000290, "Member 'APapayaTimedEvents::TimedEventsArray' has a wrong offset!");
static_assert(offsetof(APapayaTimedEvents, ScreenName) == 0x0003C0, "Member 'APapayaTimedEvents::ScreenName' has a wrong offset!");

// Class PapayaTimedEvents.PapayaTimedEventsResponderComponent
// 0x0078 (0x0170 - 0x00F8)
class UPapayaTimedEventsResponderComponent final : public UFortEventResponderComponent
{
public:
	uint8                                         Pad_F8[0x78];                                      // 0x00F8(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PapayaTimedEventsResponderComponent">();
	}
	static class UPapayaTimedEventsResponderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPapayaTimedEventsResponderComponent>();
	}
};
static_assert(alignof(UPapayaTimedEventsResponderComponent) == 0x000008, "Wrong alignment on UPapayaTimedEventsResponderComponent");
static_assert(sizeof(UPapayaTimedEventsResponderComponent) == 0x000170, "Wrong size on UPapayaTimedEventsResponderComponent");

}

