#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Parent_Tree_Apollo

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Tree_Color_options_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Parent_Tree_Apollo.Parent_Tree_Apollo_C
// 0x0060 (0x0DA8 - 0x0D48)
class AParent_Tree_Apollo_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Has_Bugs;                                          // 0x0D50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D51[0x3];                                      // 0x0D51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Use_Lightning_Bug;                                 // 0x0D54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BugOffset;                                         // 0x0D58(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Falling_Leaves;                                // 0x0D64(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D65[0x3];                                      // 0x0D65(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LeavesOffset;                                      // 0x0D68(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Priority;                                          // 0x0D74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETree_Color_options                           Tree_Color_Option;                                 // 0x0D78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D79[0x3];                                      // 0x0D79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0D7C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HueVariation;                                      // 0x0D8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ValueVariation;                                    // 0x0D90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PrioritySetbyVolume;                               // 0x0D94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTreeSeasonColor_Data_C*                TreeSeasonColor_Data;                              // 0x0D98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameStateComponent_SurfaceOverride* SurfaceOverrideComponent;                          // 0x0DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Parent_Tree_Apollo(int32 EntryPoint);
	bool IsSubmergedByWater();
	void OnWaterLevelSetOffline();
	void RemoveUnderwaterTrees();
	void SetSeasonPresetColors();
	void UpdateColor();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Parent_Tree_Apollo_C">();
	}
	static class AParent_Tree_Apollo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AParent_Tree_Apollo_C>();
	}
};
static_assert(alignof(AParent_Tree_Apollo_C) == 0x000008, "Wrong alignment on AParent_Tree_Apollo_C");
static_assert(sizeof(AParent_Tree_Apollo_C) == 0x000DA8, "Wrong size on AParent_Tree_Apollo_C");
static_assert(offsetof(AParent_Tree_Apollo_C, UberGraphFrame) == 0x000D48, "Member 'AParent_Tree_Apollo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, Has_Bugs) == 0x000D50, "Member 'AParent_Tree_Apollo_C::Has_Bugs' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, Use_Lightning_Bug) == 0x000D54, "Member 'AParent_Tree_Apollo_C::Use_Lightning_Bug' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, BugOffset) == 0x000D58, "Member 'AParent_Tree_Apollo_C::BugOffset' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, Has_Falling_Leaves) == 0x000D64, "Member 'AParent_Tree_Apollo_C::Has_Falling_Leaves' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, LeavesOffset) == 0x000D68, "Member 'AParent_Tree_Apollo_C::LeavesOffset' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, Priority) == 0x000D74, "Member 'AParent_Tree_Apollo_C::Priority' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, Tree_Color_Option) == 0x000D78, "Member 'AParent_Tree_Apollo_C::Tree_Color_Option' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, Color) == 0x000D7C, "Member 'AParent_Tree_Apollo_C::Color' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, HueVariation) == 0x000D8C, "Member 'AParent_Tree_Apollo_C::HueVariation' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, ValueVariation) == 0x000D90, "Member 'AParent_Tree_Apollo_C::ValueVariation' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, PrioritySetbyVolume) == 0x000D94, "Member 'AParent_Tree_Apollo_C::PrioritySetbyVolume' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, TreeSeasonColor_Data) == 0x000D98, "Member 'AParent_Tree_Apollo_C::TreeSeasonColor_Data' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, SurfaceOverrideComponent) == 0x000DA0, "Member 'AParent_Tree_Apollo_C::SurfaceOverrideComponent' has a wrong offset!");

}

