#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartySuggestionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PartySuggestionButton.PartySuggestionButton_C
// 0x0120 (0x1050 - 0x0F30)
class UPartySuggestionButton_C final : public UFortPartySuggestionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RequestAccepted;                                   // 0x0F38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MouseHovered;                                      // 0x0F40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x0F48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0F50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0F58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0F60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderOfDarkenedText;                              // 0x0F68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_ActionPrompt;                                   // 0x0F70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 I_SquiglyTail;                                     // 0x0F78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SparklyTraingles;                                  // 0x0F80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_MainBorder_Normal;                             // 0x0F88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_MainBorder_Normal_Tail;                        // 0x0F90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatSpringState                      SpringState_ShapeChange;                           // 0x0F98(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         SS_0_Stiffness;                                    // 0x0FA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SS_0_Damping;                                      // 0x0FA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SS_0_Mass;                                         // 0x0FAC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spring_ShapeChange_NewVal;                         // 0x0FB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spring_ShapeChange_Target;                         // 0x0FB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_ShapeParam;                                    // 0x0FB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_MainBorder_Normal;                               // 0x0FC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_MainBorder_Normal_Tail;                          // 0x0FC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_MainBorder_Highlight;                            // 0x0FD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_MainBorder_Highlight_Tail;                       // 0x0FD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_HighlightBorder;                               // 0x0FE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_HighlightBorder_Tail;                          // 0x0FE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Cur_Border;                                    // 0x0FF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Cur_Tail;                                      // 0x0FF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_SparkleTraingles;                              // 0x1000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_SparkleTriangles;                                // 0x1008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Color_R_Param;                                 // 0x1010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Sparkles_InnerColorParam;                      // 0x1018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Sparkles_OuterColorParam;                      // 0x1020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Color_L_Param;                                 // 0x1028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Sparkles_TriangleColor_A;                      // 0x1030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatSpringState                      SpringState_Scale;                                 // 0x1038(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Spring_Scale_Target;                               // 0x1044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseSpringInterpAnims;                             // 0x1048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInvited;                                         // 0x1049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNewSuggestionInQueue;                             // 0x104A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_PartySuggestionButton(int32 EntryPoint);
	void HandleOutroAnimationFinished();
	void InitMIDs();
	void InitPhysAnim();
	void OnDismissSuggestion();
	void OnDisplayInfoUpdated(bool bIsInvited, bool bIsPlaying);
	void OnInitialized();
	void OnNewSuggestionAdded();
	void OnSuggestionAccepted();
	void OnSuggestionChanged();
	void PlayIntro();
	void PlayOutro();
	void SetMainMIDs(class UMaterialInstanceDynamic* BorderMID, class UMaterialInstanceDynamic* TailMID, class UMaterialInstanceDynamic* SparklesMID);
	void SetupMIDReferences();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PartySuggestionButton_C">();
	}
	static class UPartySuggestionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartySuggestionButton_C>();
	}
};
static_assert(alignof(UPartySuggestionButton_C) == 0x000010, "Wrong alignment on UPartySuggestionButton_C");
static_assert(sizeof(UPartySuggestionButton_C) == 0x001050, "Wrong size on UPartySuggestionButton_C");
static_assert(offsetof(UPartySuggestionButton_C, UberGraphFrame) == 0x000F30, "Member 'UPartySuggestionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, RequestAccepted) == 0x000F38, "Member 'UPartySuggestionButton_C::RequestAccepted' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MouseHovered) == 0x000F40, "Member 'UPartySuggestionButton_C::MouseHovered' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Outro) == 0x000F48, "Member 'UPartySuggestionButton_C::Outro' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Hovered) == 0x000F50, "Member 'UPartySuggestionButton_C::Hovered' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Intro) == 0x000F58, "Member 'UPartySuggestionButton_C::Intro' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Border_0) == 0x000F60, "Member 'UPartySuggestionButton_C::Border_0' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, BorderOfDarkenedText) == 0x000F68, "Member 'UPartySuggestionButton_C::BorderOfDarkenedText' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, HB_ActionPrompt) == 0x000F70, "Member 'UPartySuggestionButton_C::HB_ActionPrompt' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, I_SquiglyTail) == 0x000F78, "Member 'UPartySuggestionButton_C::I_SquiglyTail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SparklyTraingles) == 0x000F80, "Member 'UPartySuggestionButton_C::SparklyTraingles' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_MainBorder_Normal) == 0x000F88, "Member 'UPartySuggestionButton_C::MID_MainBorder_Normal' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_MainBorder_Normal_Tail) == 0x000F90, "Member 'UPartySuggestionButton_C::MID_MainBorder_Normal_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SpringState_ShapeChange) == 0x000F98, "Member 'UPartySuggestionButton_C::SpringState_ShapeChange' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SS_0_Stiffness) == 0x000FA4, "Member 'UPartySuggestionButton_C::SS_0_Stiffness' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SS_0_Damping) == 0x000FA8, "Member 'UPartySuggestionButton_C::SS_0_Damping' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SS_0_Mass) == 0x000FAC, "Member 'UPartySuggestionButton_C::SS_0_Mass' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Spring_ShapeChange_NewVal) == 0x000FB0, "Member 'UPartySuggestionButton_C::Spring_ShapeChange_NewVal' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Spring_ShapeChange_Target) == 0x000FB4, "Member 'UPartySuggestionButton_C::Spring_ShapeChange_Target' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_ShapeParam) == 0x000FB8, "Member 'UPartySuggestionButton_C::MID_ShapeParam' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_MainBorder_Normal) == 0x000FC0, "Member 'UPartySuggestionButton_C::M_MainBorder_Normal' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_MainBorder_Normal_Tail) == 0x000FC8, "Member 'UPartySuggestionButton_C::M_MainBorder_Normal_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_MainBorder_Highlight) == 0x000FD0, "Member 'UPartySuggestionButton_C::M_MainBorder_Highlight' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_MainBorder_Highlight_Tail) == 0x000FD8, "Member 'UPartySuggestionButton_C::M_MainBorder_Highlight_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_HighlightBorder) == 0x000FE0, "Member 'UPartySuggestionButton_C::MID_HighlightBorder' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_HighlightBorder_Tail) == 0x000FE8, "Member 'UPartySuggestionButton_C::MID_HighlightBorder_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Cur_Border) == 0x000FF0, "Member 'UPartySuggestionButton_C::MID_Cur_Border' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Cur_Tail) == 0x000FF8, "Member 'UPartySuggestionButton_C::MID_Cur_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_SparkleTraingles) == 0x001000, "Member 'UPartySuggestionButton_C::MID_SparkleTraingles' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_SparkleTriangles) == 0x001008, "Member 'UPartySuggestionButton_C::M_SparkleTriangles' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Color_R_Param) == 0x001010, "Member 'UPartySuggestionButton_C::MID_Color_R_Param' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Sparkles_InnerColorParam) == 0x001018, "Member 'UPartySuggestionButton_C::MID_Sparkles_InnerColorParam' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Sparkles_OuterColorParam) == 0x001020, "Member 'UPartySuggestionButton_C::MID_Sparkles_OuterColorParam' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Color_L_Param) == 0x001028, "Member 'UPartySuggestionButton_C::MID_Color_L_Param' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Sparkles_TriangleColor_A) == 0x001030, "Member 'UPartySuggestionButton_C::MID_Sparkles_TriangleColor_A' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SpringState_Scale) == 0x001038, "Member 'UPartySuggestionButton_C::SpringState_Scale' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Spring_Scale_Target) == 0x001044, "Member 'UPartySuggestionButton_C::Spring_Scale_Target' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, bUseSpringInterpAnims) == 0x001048, "Member 'UPartySuggestionButton_C::bUseSpringInterpAnims' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, IsInvited) == 0x001049, "Member 'UPartySuggestionButton_C::IsInvited' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, bNewSuggestionInQueue) == 0x00104A, "Member 'UPartySuggestionButton_C::bNewSuggestionInQueue' has a wrong offset!");

}

