#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassSelectionPurchaseScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PassSelectionPurchaseScreen.PassSelectionPurchaseScreen_C.BattlepassMusic
// 0x0001 (0x0001 - 0x0000)
struct PassSelectionPurchaseScreen_C_BattlepassMusic final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassSelectionPurchaseScreen_C_BattlepassMusic) == 0x000001, "Wrong alignment on PassSelectionPurchaseScreen_C_BattlepassMusic");
static_assert(sizeof(PassSelectionPurchaseScreen_C_BattlepassMusic) == 0x000001, "Wrong size on PassSelectionPurchaseScreen_C_BattlepassMusic");
static_assert(offsetof(PassSelectionPurchaseScreen_C_BattlepassMusic, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'PassSelectionPurchaseScreen_C_BattlepassMusic::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PassSelectionPurchaseScreen.PassSelectionPurchaseScreen_C.ExecuteUbergraph_PassSelectionPurchaseScreen
// 0x01C0 (0x01C0 - 0x0000)
struct PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlayForward;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bBuyBattleBundle;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USubscriptionDetailsWidget_C*           K2Node_DynamicCast_AsSubscription_Details_Widget;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USubscriptionDetailsWidget_C*           K2Node_DynamicCast_AsSubscription_Details_Widget_1; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USubscriptionDetailsWidget_C*           K2Node_DynamicCast_AsSubscription_Details_Widget_2; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USubscriptionDetailsWidget_C*           K2Node_DynamicCast_AsSubscription_Details_Widget_3; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_2;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattlepass_MusicController_Quartz_C*   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldApplyEUText_ReturnValue;            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue_3;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_4;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_8;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_5;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_6;                 // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_9;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_10;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_7;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_8;                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_11;             // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_12;             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen) == 0x000010, "Wrong alignment on PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen");
static_assert(sizeof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen) == 0x0001C0, "Wrong size on PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, EntryPoint) == 0x000000, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, K2Node_Event_bPlayForward) == 0x000020, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::K2Node_Event_bPlayForward' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, K2Node_Event_bBuyBattleBundle) == 0x000021, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::K2Node_Event_bBuyBattleBundle' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_3) == 0x000028, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, K2Node_DynamicCast_AsSubscription_Details_Widget) == 0x000030, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::K2Node_DynamicCast_AsSubscription_Details_Widget' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimationForward_ReturnValue) == 0x000040, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, K2Node_DynamicCast_AsSubscription_Details_Widget_1) == 0x000048, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::K2Node_DynamicCast_AsSubscription_Details_Widget_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, K2Node_DynamicCast_AsSubscription_Details_Widget_2) == 0x000058, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::K2Node_DynamicCast_AsSubscription_Details_Widget_2' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000068, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000070, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000088, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000090, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x000098, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000A8, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x0000B0, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, K2Node_DynamicCast_AsSubscription_Details_Widget_3) == 0x0000B8, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::K2Node_DynamicCast_AsSubscription_Details_Widget_3' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, K2Node_DynamicCast_bSuccess_3) == 0x0000C0, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_GetEndTime_ReturnValue) == 0x0000C4, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_4) == 0x0000C8, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_GetEndTime_ReturnValue_1) == 0x0000D0, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_5) == 0x0000D8, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_GetEndTime_ReturnValue_2) == 0x0000E0, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_GetEndTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_6) == 0x0000E8, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x0000F0, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_SpawnSound2D_ReturnValue) == 0x0000F8, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000100, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_IsValid_ReturnValue_1) == 0x000109, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_IsPlaying_ReturnValue) == 0x00010A, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_IsPlaying_ReturnValue_1) == 0x00010B, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_IsPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_IsMobileGame_ReturnValue) == 0x00010C, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000110, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_BooleanAND_ReturnValue) == 0x000118, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_MakeTransform_ReturnValue) == 0x000120, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000150, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_GetContext_ReturnValue) == 0x000158, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_FinishSpawningActor_ReturnValue) == 0x000160, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_ShouldApplyEUText_ReturnValue) == 0x000168, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_ShouldApplyEUText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_GetEndTime_ReturnValue_3) == 0x00016C, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_GetEndTime_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_GetEndTime_ReturnValue_4) == 0x000170, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_GetEndTime_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_7) == 0x000178, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_8) == 0x000180, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_GetEndTime_ReturnValue_5) == 0x000188, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_GetEndTime_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_GetEndTime_ReturnValue_6) == 0x00018C, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_GetEndTime_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_9) == 0x000190, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_10) == 0x000198, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_GetEndTime_ReturnValue_7) == 0x0001A0, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_GetEndTime_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_GetEndTime_ReturnValue_8) == 0x0001A4, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_GetEndTime_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_11) == 0x0001A8, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_12) == 0x0001B0, "Member 'PassSelectionPurchaseScreen_C_ExecuteUbergraph_PassSelectionPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_12' has a wrong offset!");

// Function PassSelectionPurchaseScreen.PassSelectionPurchaseScreen_C.HandlePurchasButtonColorShiftBattlePass
// 0x0048 (0x0048 - 0x0000)
struct PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass final
{
public:
	bool                                          Instant;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPassSelectionButton_C*                 K2Node_DynamicCast_AsPass_Selection_Button;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPassSelectionButton_C*                 K2Node_DynamicCast_AsPass_Selection_Button_1;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass) == 0x000008, "Wrong alignment on PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass");
static_assert(sizeof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass) == 0x000048, "Wrong size on PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass, Instant) == 0x000000, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass::Instant' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass, K2Node_DynamicCast_AsPass_Selection_Button) == 0x000008, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass::K2Node_DynamicCast_AsPass_Selection_Button' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass, K2Node_DynamicCast_AsPass_Selection_Button_1) == 0x000018, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass::K2Node_DynamicCast_AsPass_Selection_Button_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass, CallFunc_GetEndTime_ReturnValue) == 0x000024, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass, CallFunc_GetEndTime_ReturnValue_1) == 0x000028, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass, CallFunc_SelectFloat_ReturnValue) == 0x00002C, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass, CallFunc_SelectFloat_ReturnValue_1) == 0x000030, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftBattlePass::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function PassSelectionPurchaseScreen.PassSelectionPurchaseScreen_C.HandlePurchasButtonColorShiftSubscriptions
// 0x0030 (0x0030 - 0x0000)
struct PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions final
{
public:
	class UPassSelectionButton_C*                 K2Node_DynamicCast_AsPass_Selection_Button;        // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPassSelectionButton_C*                 K2Node_DynamicCast_AsPass_Selection_Button_1;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions) == 0x000008, "Wrong alignment on PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions");
static_assert(sizeof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions) == 0x000030, "Wrong size on PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions, K2Node_DynamicCast_AsPass_Selection_Button) == 0x000000, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions::K2Node_DynamicCast_AsPass_Selection_Button' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions, K2Node_DynamicCast_AsPass_Selection_Button_1) == 0x000010, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions::K2Node_DynamicCast_AsPass_Selection_Button_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions, K2Node_DynamicCast_bSuccess_1) == 0x000018, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000028, "Member 'PassSelectionPurchaseScreen_C_HandlePurchasButtonColorShiftSubscriptions::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

// Function PassSelectionPurchaseScreen.PassSelectionPurchaseScreen_C.HandlePurchaseButtonHoverStateBattlePass
// 0x0060 (0x0060 - 0x0000)
struct PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass final
{
public:
	class UPassSelectionButton_C*                 K2Node_DynamicCast_AsPass_Selection_Button;        // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPassSelectionButton_C*                 K2Node_DynamicCast_AsPass_Selection_Button_1;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPassSelectionButton_C*                 K2Node_DynamicCast_AsPass_Selection_Button_2;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPassSelectionButton_C*                 K2Node_DynamicCast_AsPass_Selection_Button_3;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass) == 0x000008, "Wrong alignment on PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass");
static_assert(sizeof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass) == 0x000060, "Wrong size on PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass, K2Node_DynamicCast_AsPass_Selection_Button) == 0x000000, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass::K2Node_DynamicCast_AsPass_Selection_Button' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass, K2Node_DynamicCast_AsPass_Selection_Button_1) == 0x000010, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass::K2Node_DynamicCast_AsPass_Selection_Button_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass, K2Node_DynamicCast_bSuccess_1) == 0x000018, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000020, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass, K2Node_DynamicCast_AsPass_Selection_Button_2) == 0x000030, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass::K2Node_DynamicCast_AsPass_Selection_Button_2' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass, K2Node_DynamicCast_bSuccess_2) == 0x000038, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass, K2Node_DynamicCast_AsPass_Selection_Button_3) == 0x000040, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass::K2Node_DynamicCast_AsPass_Selection_Button_3' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass, K2Node_DynamicCast_bSuccess_3) == 0x000048, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000050, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000058, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateBattlePass::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");

// Function PassSelectionPurchaseScreen.PassSelectionPurchaseScreen_C.HandlePurchaseButtonHoverStateSubscriptions
// 0x0060 (0x0060 - 0x0000)
struct PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions final
{
public:
	class UPassSelectionButton_C*                 K2Node_DynamicCast_AsPass_Selection_Button;        // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPassSelectionButton_C*                 K2Node_DynamicCast_AsPass_Selection_Button_1;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPassSelectionButton_C*                 K2Node_DynamicCast_AsPass_Selection_Button_2;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPassSelectionButton_C*                 K2Node_DynamicCast_AsPass_Selection_Button_3;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions) == 0x000008, "Wrong alignment on PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions");
static_assert(sizeof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions) == 0x000060, "Wrong size on PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions, K2Node_DynamicCast_AsPass_Selection_Button) == 0x000000, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions::K2Node_DynamicCast_AsPass_Selection_Button' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions, K2Node_DynamicCast_AsPass_Selection_Button_1) == 0x000010, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions::K2Node_DynamicCast_AsPass_Selection_Button_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions, K2Node_DynamicCast_bSuccess_1) == 0x000018, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000028, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions, K2Node_DynamicCast_AsPass_Selection_Button_2) == 0x000030, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions::K2Node_DynamicCast_AsPass_Selection_Button_2' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions, K2Node_DynamicCast_bSuccess_2) == 0x000038, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions, K2Node_DynamicCast_AsPass_Selection_Button_3) == 0x000040, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions::K2Node_DynamicCast_AsPass_Selection_Button_3' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions, K2Node_DynamicCast_bSuccess_3) == 0x000048, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000050, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000058, "Member 'PassSelectionPurchaseScreen_C_HandlePurchaseButtonHoverStateSubscriptions::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

// Function PassSelectionPurchaseScreen.PassSelectionPurchaseScreen_C.OnPurchaseClicked
// 0x0002 (0x0002 - 0x0000)
struct PassSelectionPurchaseScreen_C_OnPurchaseClicked final
{
public:
	bool                                          bPlayForward;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBuyBattleBundle;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassSelectionPurchaseScreen_C_OnPurchaseClicked) == 0x000001, "Wrong alignment on PassSelectionPurchaseScreen_C_OnPurchaseClicked");
static_assert(sizeof(PassSelectionPurchaseScreen_C_OnPurchaseClicked) == 0x000002, "Wrong size on PassSelectionPurchaseScreen_C_OnPurchaseClicked");
static_assert(offsetof(PassSelectionPurchaseScreen_C_OnPurchaseClicked, bPlayForward) == 0x000000, "Member 'PassSelectionPurchaseScreen_C_OnPurchaseClicked::bPlayForward' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_OnPurchaseClicked, bBuyBattleBundle) == 0x000001, "Member 'PassSelectionPurchaseScreen_C_OnPurchaseClicked::bBuyBattleBundle' has a wrong offset!");

// Function PassSelectionPurchaseScreen.PassSelectionPurchaseScreen_C.ResetAnimationStates
// 0x0018 (0x0018 - 0x0000)
struct PassSelectionPurchaseScreen_C_ResetAnimationStates final
{
public:
	class USubscriptionDetailsWidget_C*           K2Node_DynamicCast_AsSubscription_Details_Widget;  // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassSelectionPurchaseScreen_C_ResetAnimationStates) == 0x000008, "Wrong alignment on PassSelectionPurchaseScreen_C_ResetAnimationStates");
static_assert(sizeof(PassSelectionPurchaseScreen_C_ResetAnimationStates) == 0x000018, "Wrong size on PassSelectionPurchaseScreen_C_ResetAnimationStates");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ResetAnimationStates, K2Node_DynamicCast_AsSubscription_Details_Widget) == 0x000000, "Member 'PassSelectionPurchaseScreen_C_ResetAnimationStates::K2Node_DynamicCast_AsSubscription_Details_Widget' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ResetAnimationStates, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'PassSelectionPurchaseScreen_C_ResetAnimationStates::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ResetAnimationStates, CallFunc_GetEndTime_ReturnValue) == 0x00000C, "Member 'PassSelectionPurchaseScreen_C_ResetAnimationStates::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassSelectionPurchaseScreen_C_ResetAnimationStates, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'PassSelectionPurchaseScreen_C_ResetAnimationStates::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function PassSelectionPurchaseScreen.PassSelectionPurchaseScreen_C.StopAllBattlePassMusic
// 0x0006 (0x0006 - 0x0000)
struct PassSelectionPurchaseScreen_C_StopAllBattlePassMusic final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
