#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassSelectionPurchaseScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PassSelectionPurchaseScreen.PassSelectionPurchaseScreen_C
// 0x00E0 (0x0670 - 0x0590)
class UPassSelectionPurchaseScreen_C final : public UAthenaPassPurchaseScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOnSubsButtons;                                 // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeBetweenMainScreens;                            // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOffBPButtons;                                  // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ReverseShowPurchaseConfirmation;                   // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnShowPurchaseConfirmation_Final;                  // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowConfirmationButtons;                           // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnIntro;                                           // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               BattleBundle_text_wrap;                            // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBattlePassPurchaseDetailsScreen_C*     BattlePassPurchaseDetailsScreen;                   // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ConfirmationButtons;                               // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MainButtonsPadding;                                // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_BattleBundleRedirect;                      // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Overlay_SubDisclaimer;                             // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_2;                                        // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_3;                                        // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             BattlePass_Stinger;                                // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        BPMusic;                                           // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DidTransitionHappen;                               // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   JoinText;                                          // 0x0630(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAudioComponent*                        CrewSplashAudio;                                   // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        BattlepassSplashAudio;                             // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattlepass_MusicController_Quartz_C*   MusicController_Quartz;                            // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           MusicControllerHandle;                             // 0x0660(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              BattlePassMix;                                     // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BattlepassMusic();
	void BP_OnActivated();
	void BP_OnDeactivated();
	void CallMusicController();
	void Construct();
	void ExecuteUbergraph_PassSelectionPurchaseScreen(int32 EntryPoint);
	void HandlePurchasButtonColorShiftBattlePass(bool Instant);
	void HandlePurchasButtonColorShiftSubscriptions();
	void HandlePurchaseButtonHoverStateBattlePass();
	void HandlePurchaseButtonHoverStateSubscriptions();
	void OnBattlePassSelected();
	void OnFinalPurchaseConfirmed();
	void OnLeaveScreen();
	void OnPurchaseClicked(bool bPlayForward, bool bBuyBattleBundle);
	void OnSubscriptionSelected();
	void PlayBattlepassSplashAudio();
	void PlaySubscriptionSplashAudio();
	void ResetAnimations();
	void ResetAnimationStates();
	void ShowBattlePassIntro();
	void StopAllBattlePassMusic();
	void SubscriptionMusic();
	void TriggerSubsTransition();
	void UpSellMusic();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PassSelectionPurchaseScreen_C">();
	}
	static class UPassSelectionPurchaseScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPassSelectionPurchaseScreen_C>();
	}
};
static_assert(alignof(UPassSelectionPurchaseScreen_C) == 0x000008, "Wrong alignment on UPassSelectionPurchaseScreen_C");
static_assert(sizeof(UPassSelectionPurchaseScreen_C) == 0x000670, "Wrong size on UPassSelectionPurchaseScreen_C");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, UberGraphFrame) == 0x000590, "Member 'UPassSelectionPurchaseScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, FadeOnSubsButtons) == 0x000598, "Member 'UPassSelectionPurchaseScreen_C::FadeOnSubsButtons' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, FadeBetweenMainScreens) == 0x0005A0, "Member 'UPassSelectionPurchaseScreen_C::FadeBetweenMainScreens' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, FadeOffBPButtons) == 0x0005A8, "Member 'UPassSelectionPurchaseScreen_C::FadeOffBPButtons' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, ReverseShowPurchaseConfirmation) == 0x0005B0, "Member 'UPassSelectionPurchaseScreen_C::ReverseShowPurchaseConfirmation' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, OnShowPurchaseConfirmation_Final) == 0x0005B8, "Member 'UPassSelectionPurchaseScreen_C::OnShowPurchaseConfirmation_Final' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, ShowConfirmationButtons) == 0x0005C0, "Member 'UPassSelectionPurchaseScreen_C::ShowConfirmationButtons' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, OnIntro) == 0x0005C8, "Member 'UPassSelectionPurchaseScreen_C::OnIntro' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, BattleBundle_text_wrap) == 0x0005D0, "Member 'UPassSelectionPurchaseScreen_C::BattleBundle_text_wrap' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, BattlePassPurchaseDetailsScreen) == 0x0005D8, "Member 'UPassSelectionPurchaseScreen_C::BattlePassPurchaseDetailsScreen' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, ConfirmationButtons) == 0x0005E0, "Member 'UPassSelectionPurchaseScreen_C::ConfirmationButtons' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, MainButtonsPadding) == 0x0005E8, "Member 'UPassSelectionPurchaseScreen_C::MainButtonsPadding' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, Overlay_BattleBundleRedirect) == 0x0005F0, "Member 'UPassSelectionPurchaseScreen_C::Overlay_BattleBundleRedirect' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, Overlay_SubDisclaimer) == 0x0005F8, "Member 'UPassSelectionPurchaseScreen_C::Overlay_SubDisclaimer' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, SafeZone_1) == 0x000600, "Member 'UPassSelectionPurchaseScreen_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, SafeZone_2) == 0x000608, "Member 'UPassSelectionPurchaseScreen_C::SafeZone_2' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, SafeZone_3) == 0x000610, "Member 'UPassSelectionPurchaseScreen_C::SafeZone_3' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, BattlePass_Stinger) == 0x000618, "Member 'UPassSelectionPurchaseScreen_C::BattlePass_Stinger' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, BPMusic) == 0x000620, "Member 'UPassSelectionPurchaseScreen_C::BPMusic' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, DidTransitionHappen) == 0x000628, "Member 'UPassSelectionPurchaseScreen_C::DidTransitionHappen' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, JoinText) == 0x000630, "Member 'UPassSelectionPurchaseScreen_C::JoinText' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, CrewSplashAudio) == 0x000648, "Member 'UPassSelectionPurchaseScreen_C::CrewSplashAudio' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, BattlepassSplashAudio) == 0x000650, "Member 'UPassSelectionPurchaseScreen_C::BattlepassSplashAudio' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, MusicController_Quartz) == 0x000658, "Member 'UPassSelectionPurchaseScreen_C::MusicController_Quartz' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, MusicControllerHandle) == 0x000660, "Member 'UPassSelectionPurchaseScreen_C::MusicControllerHandle' has a wrong offset!");
static_assert(offsetof(UPassSelectionPurchaseScreen_C, BattlePassMix) == 0x000668, "Member 'UPassSelectionPurchaseScreen_C::BattlePassMix' has a wrong offset!");

}

