#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassSelectionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PassSelectionButton.PassSelectionButton_C
// 0x0070 (0x0FE0 - 0x0F70)
class UPassSelectionButton_C final : public UAthenaPassSelectionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MobileHovered;                                     // 0x0F78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ValuePulse;                                        // 0x0F80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShiftSize;                                         // 0x0F88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShiftColor;                                        // 0x0F90(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ValueBounce;                                       // 0x0F98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0FA0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x0FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverBar;                                          // 0x0FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayStationStoreLogo;                              // 0x0FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VBuck;                                             // 0x0FD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DelayShineSwipe;                                   // 0x0FD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ColorShift;                                        // 0x0FD9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHoverStateChanged(bool bInHoverState, bool bIsUsingTouch);
	void ExecuteUbergraph_PassSelectionButton(int32 EntryPoint);
	void OnButtonDataSet();
	void PreConstruct(bool IsDesignTime);
	void ResetAnimations();
	void SetMaterialColors();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PassSelectionButton_C">();
	}
	static class UPassSelectionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPassSelectionButton_C>();
	}
};
static_assert(alignof(UPassSelectionButton_C) == 0x000010, "Wrong alignment on UPassSelectionButton_C");
static_assert(sizeof(UPassSelectionButton_C) == 0x000FE0, "Wrong size on UPassSelectionButton_C");
static_assert(offsetof(UPassSelectionButton_C, UberGraphFrame) == 0x000F70, "Member 'UPassSelectionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPassSelectionButton_C, MobileHovered) == 0x000F78, "Member 'UPassSelectionButton_C::MobileHovered' has a wrong offset!");
static_assert(offsetof(UPassSelectionButton_C, ValuePulse) == 0x000F80, "Member 'UPassSelectionButton_C::ValuePulse' has a wrong offset!");
static_assert(offsetof(UPassSelectionButton_C, ShiftSize) == 0x000F88, "Member 'UPassSelectionButton_C::ShiftSize' has a wrong offset!");
static_assert(offsetof(UPassSelectionButton_C, ShiftColor) == 0x000F90, "Member 'UPassSelectionButton_C::ShiftColor' has a wrong offset!");
static_assert(offsetof(UPassSelectionButton_C, ValueBounce) == 0x000F98, "Member 'UPassSelectionButton_C::ValueBounce' has a wrong offset!");
static_assert(offsetof(UPassSelectionButton_C, Hovered) == 0x000FA0, "Member 'UPassSelectionButton_C::Hovered' has a wrong offset!");
static_assert(offsetof(UPassSelectionButton_C, Backing) == 0x000FA8, "Member 'UPassSelectionButton_C::Backing' has a wrong offset!");
static_assert(offsetof(UPassSelectionButton_C, ButtonBacking) == 0x000FB0, "Member 'UPassSelectionButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(UPassSelectionButton_C, Glow) == 0x000FB8, "Member 'UPassSelectionButton_C::Glow' has a wrong offset!");
static_assert(offsetof(UPassSelectionButton_C, HoverBar) == 0x000FC0, "Member 'UPassSelectionButton_C::HoverBar' has a wrong offset!");
static_assert(offsetof(UPassSelectionButton_C, PlayStationStoreLogo) == 0x000FC8, "Member 'UPassSelectionButton_C::PlayStationStoreLogo' has a wrong offset!");
static_assert(offsetof(UPassSelectionButton_C, VBuck) == 0x000FD0, "Member 'UPassSelectionButton_C::VBuck' has a wrong offset!");
static_assert(offsetof(UPassSelectionButton_C, DelayShineSwipe) == 0x000FD8, "Member 'UPassSelectionButton_C::DelayShineSwipe' has a wrong offset!");
static_assert(offsetof(UPassSelectionButton_C, ColorShift) == 0x000FD9, "Member 'UPassSelectionButton_C::ColorShift' has a wrong offset!");

}

