#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PendingAccountMergeNotification

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function PendingAccountMergeNotification.PendingAccountMergeNotification_C.ExecuteUbergraph_PendingAccountMergeNotification
// 0x0170 (0x0170 - 0x0000)
struct PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_IsPendingAccountTransfer_EstimatedCompletionMax; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPendingAccountTransfer_ReturnValue;     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0080(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0098(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_3;                              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_4;                              // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTimespanAsText_ReturnValue;            // 0x00F0(0x0018)()
	bool                                          K2Node_CustomEvent_IsHovered;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x010C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x012C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0140(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  K2Node_Select_Default_3;                           // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x016E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x016F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification) == 0x000008, "Wrong alignment on PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification");
static_assert(sizeof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification) == 0x000170, "Wrong size on PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, EntryPoint) == 0x000000, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, CallFunc_IsPendingAccountTransfer_EstimatedCompletionMax) == 0x000018, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::CallFunc_IsPendingAccountTransfer_EstimatedCompletionMax' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, CallFunc_IsPendingAccountTransfer_ReturnValue) == 0x000020, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::CallFunc_IsPendingAccountTransfer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000030, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000038, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000040, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_byte_Variable) == 0x000048, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, CallFunc_GetCurrentInputType_ReturnValue) == 0x000049, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_text_Variable) == 0x000050, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_text_Variable_1) == 0x000068, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_text_Variable_2) == 0x000080, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_text_Variable_3) == 0x000098, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_bool_Variable) == 0x0000B0, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_byte_Variable_1) == 0x0000B1, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_byte_Variable_2) == 0x0000B2, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_bool_Variable_1) == 0x0000B3, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_byte_Variable_3) == 0x0000B4, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_byte_Variable_4) == 0x0000B5, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_bool_Variable_2) == 0x0000B6, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_struct_Variable) == 0x0000B8, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_struct_Variable_1) == 0x0000C8, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, CallFunc_Now_ReturnValue) == 0x0000D8, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_byte_Variable_5) == 0x0000E0, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x0000E8, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, CallFunc_GetTimespanAsText_ReturnValue) == 0x0000F0, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::CallFunc_GetTimespanAsText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, K2Node_CustomEvent_IsHovered) == 0x000108, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::K2Node_CustomEvent_IsHovered' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, K2Node_Select_Default) == 0x00010C, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000120, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_byte_Variable_6) == 0x000128, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, K2Node_CustomEvent_bNewInputType) == 0x000129, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, K2Node_CreateDelegate_OutputDelegate) == 0x00012C, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, K2Node_Select_Default_1) == 0x000140, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000158, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, K2Node_CreateDelegate_OutputDelegate_1) == 0x00015C, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, K2Node_Select_Default_2) == 0x00016C, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, K2Node_Select_Default_3) == 0x00016D, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, Temp_bool_Variable_3) == 0x00016E, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification, K2Node_Select_Default_4) == 0x00016F, "Member 'PendingAccountMergeNotification_C_ExecuteUbergraph_PendingAccountMergeNotification::K2Node_Select_Default_4' has a wrong offset!");

// Function PendingAccountMergeNotification.PendingAccountMergeNotification_C.Hovered
// 0x0001 (0x0001 - 0x0000)
struct PendingAccountMergeNotification_C_Hovered final
{
public:
	bool                                          IsHovered_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PendingAccountMergeNotification_C_Hovered) == 0x000001, "Wrong alignment on PendingAccountMergeNotification_C_Hovered");
static_assert(sizeof(PendingAccountMergeNotification_C_Hovered) == 0x000001, "Wrong size on PendingAccountMergeNotification_C_Hovered");
static_assert(offsetof(PendingAccountMergeNotification_C_Hovered, IsHovered_0) == 0x000000, "Member 'PendingAccountMergeNotification_C_Hovered::IsHovered_0' has a wrong offset!");

// Function PendingAccountMergeNotification.PendingAccountMergeNotification_C.OnInputChanged
// 0x0001 (0x0001 - 0x0000)
struct PendingAccountMergeNotification_C_OnInputChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PendingAccountMergeNotification_C_OnInputChanged) == 0x000001, "Wrong alignment on PendingAccountMergeNotification_C_OnInputChanged");
static_assert(sizeof(PendingAccountMergeNotification_C_OnInputChanged) == 0x000001, "Wrong size on PendingAccountMergeNotification_C_OnInputChanged");
static_assert(offsetof(PendingAccountMergeNotification_C_OnInputChanged, bNewInputType) == 0x000000, "Member 'PendingAccountMergeNotification_C_OnInputChanged::bNewInputType' has a wrong offset!");

}

