#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhosphorusWipeoutRuntime

#include "Basic.hpp"

#include "PhosphorusWipeoutRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "PhosphorusRuntime_classes.hpp"


namespace SDK
{

// Class PhosphorusWipeoutRuntime.FortAthenaMutator_ModifyIncomingPawnDamage
// 0x0010 (0x02D8 - 0x02C8)
class AFortAthenaMutator_ModifyIncomingPawnDamage final : public AFortAthenaMutator
{
public:
	TArray<struct FModifyIncomingPawnDamageDefinition> DamageDefinitions;                                 // 0x02C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_ModifyIncomingPawnDamage">();
	}
	static class AFortAthenaMutator_ModifyIncomingPawnDamage* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_ModifyIncomingPawnDamage>();
	}
};
static_assert(alignof(AFortAthenaMutator_ModifyIncomingPawnDamage) == 0x000008, "Wrong alignment on AFortAthenaMutator_ModifyIncomingPawnDamage");
static_assert(sizeof(AFortAthenaMutator_ModifyIncomingPawnDamage) == 0x0002D8, "Wrong size on AFortAthenaMutator_ModifyIncomingPawnDamage");
static_assert(offsetof(AFortAthenaMutator_ModifyIncomingPawnDamage, DamageDefinitions) == 0x0002C8, "Member 'AFortAthenaMutator_ModifyIncomingPawnDamage::DamageDefinitions' has a wrong offset!");

// Class PhosphorusWipeoutRuntime.FortAthenaMutator_PhosphorusWipeout
// 0x0018 (0x0780 - 0x0768)
class AFortAthenaMutator_PhosphorusWipeout final : public AFortAthenaMutator_Phosphorus
{
public:
	class FText                                   OutsideSafeZoneEliminatedOverlayText;              // 0x0768(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_PhosphorusWipeout">();
	}
	static class AFortAthenaMutator_PhosphorusWipeout* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_PhosphorusWipeout>();
	}
};
static_assert(alignof(AFortAthenaMutator_PhosphorusWipeout) == 0x000008, "Wrong alignment on AFortAthenaMutator_PhosphorusWipeout");
static_assert(sizeof(AFortAthenaMutator_PhosphorusWipeout) == 0x000780, "Wrong size on AFortAthenaMutator_PhosphorusWipeout");
static_assert(offsetof(AFortAthenaMutator_PhosphorusWipeout, OutsideSafeZoneEliminatedOverlayText) == 0x000768, "Member 'AFortAthenaMutator_PhosphorusWipeout::OutsideSafeZoneEliminatedOverlayText' has a wrong offset!");

}

