#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhosphorusUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "PhosphorusRuntime_structs.hpp"


namespace SDK
{

// Class PhosphorusUI.PhosphorusWidgetBase
// 0x0008 (0x0310 - 0x0308)
class UPhosphorusWidgetBase : public ULTMWidgetBase
{
public:
	class AFortAthenaMutator_Phosphorus*          CachedPhosphorusMutator;                           // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void MutatorReady();
	void OnMutatorAvailable(class AFortGameplayMutator* MutatorActor);
	void SetAvatarImageFromPlayerState(const class AFortPlayerStateAthena* PlayerState, class UFortLazyImage* AvatarImage);

	class AFortAthenaMutator_Phosphorus* GetPhosphorusMutator() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhosphorusWidgetBase">();
	}
	static class UPhosphorusWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhosphorusWidgetBase>();
	}
};
static_assert(alignof(UPhosphorusWidgetBase) == 0x000008, "Wrong alignment on UPhosphorusWidgetBase");
static_assert(sizeof(UPhosphorusWidgetBase) == 0x000310, "Wrong size on UPhosphorusWidgetBase");
static_assert(offsetof(UPhosphorusWidgetBase, CachedPhosphorusMutator) == 0x000308, "Member 'UPhosphorusWidgetBase::CachedPhosphorusMutator' has a wrong offset!");

// Class PhosphorusUI.PhosphorusEndOfRoundWidget
// 0x0030 (0x0340 - 0x0310)
class UPhosphorusEndOfRoundWidget final : public UPhosphorusWidgetBase
{
public:
	struct FScalableFloat                         PostRoundFadeOutDuration;                          // 0x0310(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	int32                                         CurrentRound;                                      // 0x0338(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FadeOutScreen();
	void OnNewRoundStarted();
	void OnPhosphorusPhaseChanged(class AFortAthenaMutator_Phosphorus* PhosphorusMutator, EPhosphorusPhase NewPhase);
	void SetWidgetVisibility(bool bNewVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhosphorusEndOfRoundWidget">();
	}
	static class UPhosphorusEndOfRoundWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhosphorusEndOfRoundWidget>();
	}
};
static_assert(alignof(UPhosphorusEndOfRoundWidget) == 0x000008, "Wrong alignment on UPhosphorusEndOfRoundWidget");
static_assert(sizeof(UPhosphorusEndOfRoundWidget) == 0x000340, "Wrong size on UPhosphorusEndOfRoundWidget");
static_assert(offsetof(UPhosphorusEndOfRoundWidget, PostRoundFadeOutDuration) == 0x000310, "Member 'UPhosphorusEndOfRoundWidget::PostRoundFadeOutDuration' has a wrong offset!");
static_assert(offsetof(UPhosphorusEndOfRoundWidget, CurrentRound) == 0x000338, "Member 'UPhosphorusEndOfRoundWidget::CurrentRound' has a wrong offset!");

// Class PhosphorusUI.PhosphorusHUDWidget
// 0x0000 (0x0310 - 0x0310)
class UPhosphorusHUDWidget final : public UPhosphorusWidgetBase
{
public:
	void OnPhosphorusEnemySquadWiped_BP();
	void OnPhosphorusLocalSquadWiped_BP();
	void OnPhosphorusPlayerEliminated_BP(class AFortPlayerStateAthena* PlayerEliminated);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhosphorusHUDWidget">();
	}
	static class UPhosphorusHUDWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhosphorusHUDWidget>();
	}
};
static_assert(alignof(UPhosphorusHUDWidget) == 0x000008, "Wrong alignment on UPhosphorusHUDWidget");
static_assert(sizeof(UPhosphorusHUDWidget) == 0x000310, "Wrong size on UPhosphorusHUDWidget");

// Class PhosphorusUI.PhosphorusSquadWipedWidget
// 0x0000 (0x0310 - 0x0310)
class UPhosphorusSquadWipedWidget final : public UPhosphorusWidgetBase
{
public:
	void HandleSquadWipedVisibilityChanged(bool bNewVisibility);
	void OnLocalPlayerSquadWiped();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhosphorusSquadWipedWidget">();
	}
	static class UPhosphorusSquadWipedWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhosphorusSquadWipedWidget>();
	}
};
static_assert(alignof(UPhosphorusSquadWipedWidget) == 0x000008, "Wrong alignment on UPhosphorusSquadWipedWidget");
static_assert(sizeof(UPhosphorusSquadWipedWidget) == 0x000310, "Wrong size on UPhosphorusSquadWipedWidget");

}

