#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhosphorusRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum PhosphorusRuntime.EPhosphorusPhase
// NumValues: 0x0009
enum class EPhosphorusPhase : uint8
{
	PreMatch                                 = 0,
	RoundSetup                               = 1,
	PrePodLaunch                             = 2,
	PodsLaunched                             = 3,
	RoundInProgress                          = 4,
	RoundEnd                                 = 5,
	RoundEndUI                               = 6,
	MatchEnd                                 = 7,
	MatchEndUI                               = 8,
};

// Enum PhosphorusRuntime.EPlayerSpawnPodState
// NumValues: 0x0005
enum class EPlayerSpawnPodState : uint8
{
	Setup                                    = 0,
	PreLaunch                                = 1,
	Moving                                   = 2,
	Landed                                   = 3,
	Ejected                                  = 4,
};

// Enum PhosphorusRuntime.EPhosphorusClientEventId
// NumValues: 0x0003
enum class EPhosphorusClientEventId : uint8
{
	ShowLocalPlayerSquadWipedUI              = 0,
	ShowEnemySquadWipedUI                    = 1,
	MAX                                      = 2,
};

// Enum PhosphorusRuntime.EPlayerSpawnPodSpawnState
// NumValues: 0x0002
enum class EPlayerSpawnPodSpawnState : uint8
{
	FirstSpawn                               = 0,
	Respawn                                  = 1,
};

// ScriptStruct PhosphorusRuntime.PlayerSpawnPodData
// 0x00B8 (0x00B8 - 0x0000)
struct FPlayerSpawnPodData final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndLocation;                                       // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AFortPlayerStateAthena*>         PlayerStates;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AFortPlayerPawnAthena*>          EnteredPawns;                                      // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AFortPlayerPawnAthena*>          EjectedPawns;                                      // 0x0030(0x0010)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	EPlayerSpawnPodState                          State;                                             // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                StartLocation;                                     // 0x0044(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 PodActor;                                          // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class AFortPlayerControllerAthena*, class AActor*> ViewTargetsByPlayerController;                     // 0x0058(0x0050)(BlueprintVisible, BlueprintReadOnly, RepSkip, NativeAccessSpecifierPublic)
	float                                         LandTime;                                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NextEjectYaw;                                      // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EjectYawIncrement;                                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPlayerSpawnPodData) == 0x000008, "Wrong alignment on FPlayerSpawnPodData");
static_assert(sizeof(FPlayerSpawnPodData) == 0x0000B8, "Wrong size on FPlayerSpawnPodData");
static_assert(offsetof(FPlayerSpawnPodData, ID) == 0x000000, "Member 'FPlayerSpawnPodData::ID' has a wrong offset!");
static_assert(offsetof(FPlayerSpawnPodData, EndLocation) == 0x000004, "Member 'FPlayerSpawnPodData::EndLocation' has a wrong offset!");
static_assert(offsetof(FPlayerSpawnPodData, PlayerStates) == 0x000010, "Member 'FPlayerSpawnPodData::PlayerStates' has a wrong offset!");
static_assert(offsetof(FPlayerSpawnPodData, EnteredPawns) == 0x000020, "Member 'FPlayerSpawnPodData::EnteredPawns' has a wrong offset!");
static_assert(offsetof(FPlayerSpawnPodData, EjectedPawns) == 0x000030, "Member 'FPlayerSpawnPodData::EjectedPawns' has a wrong offset!");
static_assert(offsetof(FPlayerSpawnPodData, State) == 0x000040, "Member 'FPlayerSpawnPodData::State' has a wrong offset!");
static_assert(offsetof(FPlayerSpawnPodData, StartLocation) == 0x000044, "Member 'FPlayerSpawnPodData::StartLocation' has a wrong offset!");
static_assert(offsetof(FPlayerSpawnPodData, PodActor) == 0x000050, "Member 'FPlayerSpawnPodData::PodActor' has a wrong offset!");
static_assert(offsetof(FPlayerSpawnPodData, ViewTargetsByPlayerController) == 0x000058, "Member 'FPlayerSpawnPodData::ViewTargetsByPlayerController' has a wrong offset!");
static_assert(offsetof(FPlayerSpawnPodData, LandTime) == 0x0000A8, "Member 'FPlayerSpawnPodData::LandTime' has a wrong offset!");
static_assert(offsetof(FPlayerSpawnPodData, NextEjectYaw) == 0x0000AC, "Member 'FPlayerSpawnPodData::NextEjectYaw' has a wrong offset!");
static_assert(offsetof(FPlayerSpawnPodData, EjectYawIncrement) == 0x0000B0, "Member 'FPlayerSpawnPodData::EjectYawIncrement' has a wrong offset!");

// ScriptStruct PhosphorusRuntime.PhosphorusTeamData
// 0x0010 (0x0010 - 0x0000)
struct FPhosphorusTeamData final
{
public:
	uint8                                         TeamNum;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NumRoundsWon;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 CurrentMVP;                                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPhosphorusTeamData) == 0x000008, "Wrong alignment on FPhosphorusTeamData");
static_assert(sizeof(FPhosphorusTeamData) == 0x000010, "Wrong size on FPhosphorusTeamData");
static_assert(offsetof(FPhosphorusTeamData, TeamNum) == 0x000000, "Member 'FPhosphorusTeamData::TeamNum' has a wrong offset!");
static_assert(offsetof(FPhosphorusTeamData, NumRoundsWon) == 0x000001, "Member 'FPhosphorusTeamData::NumRoundsWon' has a wrong offset!");
static_assert(offsetof(FPhosphorusTeamData, CurrentMVP) == 0x000008, "Member 'FPhosphorusTeamData::CurrentMVP' has a wrong offset!");

}

