#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhosphorusUI

#include "Basic.hpp"

#include "PhosphorusRuntime_structs.hpp"


namespace SDK::Params
{

// Function PhosphorusUI.PhosphorusWidgetBase.OnMutatorAvailable
// 0x0008 (0x0008 - 0x0000)
struct PhosphorusWidgetBase_OnMutatorAvailable final
{
public:
	class AFortGameplayMutator*                   MutatorActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PhosphorusWidgetBase_OnMutatorAvailable) == 0x000008, "Wrong alignment on PhosphorusWidgetBase_OnMutatorAvailable");
static_assert(sizeof(PhosphorusWidgetBase_OnMutatorAvailable) == 0x000008, "Wrong size on PhosphorusWidgetBase_OnMutatorAvailable");
static_assert(offsetof(PhosphorusWidgetBase_OnMutatorAvailable, MutatorActor) == 0x000000, "Member 'PhosphorusWidgetBase_OnMutatorAvailable::MutatorActor' has a wrong offset!");

// Function PhosphorusUI.PhosphorusWidgetBase.SetAvatarImageFromPlayerState
// 0x0010 (0x0010 - 0x0000)
struct PhosphorusWidgetBase_SetAvatarImageFromPlayerState final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortLazyImage*                         AvatarImage;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PhosphorusWidgetBase_SetAvatarImageFromPlayerState) == 0x000008, "Wrong alignment on PhosphorusWidgetBase_SetAvatarImageFromPlayerState");
static_assert(sizeof(PhosphorusWidgetBase_SetAvatarImageFromPlayerState) == 0x000010, "Wrong size on PhosphorusWidgetBase_SetAvatarImageFromPlayerState");
static_assert(offsetof(PhosphorusWidgetBase_SetAvatarImageFromPlayerState, PlayerState) == 0x000000, "Member 'PhosphorusWidgetBase_SetAvatarImageFromPlayerState::PlayerState' has a wrong offset!");
static_assert(offsetof(PhosphorusWidgetBase_SetAvatarImageFromPlayerState, AvatarImage) == 0x000008, "Member 'PhosphorusWidgetBase_SetAvatarImageFromPlayerState::AvatarImage' has a wrong offset!");

// Function PhosphorusUI.PhosphorusWidgetBase.GetPhosphorusMutator
// 0x0008 (0x0008 - 0x0000)
struct PhosphorusWidgetBase_GetPhosphorusMutator final
{
public:
	class AFortAthenaMutator_Phosphorus*          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PhosphorusWidgetBase_GetPhosphorusMutator) == 0x000008, "Wrong alignment on PhosphorusWidgetBase_GetPhosphorusMutator");
static_assert(sizeof(PhosphorusWidgetBase_GetPhosphorusMutator) == 0x000008, "Wrong size on PhosphorusWidgetBase_GetPhosphorusMutator");
static_assert(offsetof(PhosphorusWidgetBase_GetPhosphorusMutator, ReturnValue) == 0x000000, "Member 'PhosphorusWidgetBase_GetPhosphorusMutator::ReturnValue' has a wrong offset!");

// Function PhosphorusUI.PhosphorusEndOfRoundWidget.OnPhosphorusPhaseChanged
// 0x0010 (0x0010 - 0x0000)
struct PhosphorusEndOfRoundWidget_OnPhosphorusPhaseChanged final
{
public:
	class AFortAthenaMutator_Phosphorus*          PhosphorusMutator;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhosphorusPhase                              NewPhase;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PhosphorusEndOfRoundWidget_OnPhosphorusPhaseChanged) == 0x000008, "Wrong alignment on PhosphorusEndOfRoundWidget_OnPhosphorusPhaseChanged");
static_assert(sizeof(PhosphorusEndOfRoundWidget_OnPhosphorusPhaseChanged) == 0x000010, "Wrong size on PhosphorusEndOfRoundWidget_OnPhosphorusPhaseChanged");
static_assert(offsetof(PhosphorusEndOfRoundWidget_OnPhosphorusPhaseChanged, PhosphorusMutator) == 0x000000, "Member 'PhosphorusEndOfRoundWidget_OnPhosphorusPhaseChanged::PhosphorusMutator' has a wrong offset!");
static_assert(offsetof(PhosphorusEndOfRoundWidget_OnPhosphorusPhaseChanged, NewPhase) == 0x000008, "Member 'PhosphorusEndOfRoundWidget_OnPhosphorusPhaseChanged::NewPhase' has a wrong offset!");

// Function PhosphorusUI.PhosphorusEndOfRoundWidget.SetWidgetVisibility
// 0x0001 (0x0001 - 0x0000)
struct PhosphorusEndOfRoundWidget_SetWidgetVisibility final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PhosphorusEndOfRoundWidget_SetWidgetVisibility) == 0x000001, "Wrong alignment on PhosphorusEndOfRoundWidget_SetWidgetVisibility");
static_assert(sizeof(PhosphorusEndOfRoundWidget_SetWidgetVisibility) == 0x000001, "Wrong size on PhosphorusEndOfRoundWidget_SetWidgetVisibility");
static_assert(offsetof(PhosphorusEndOfRoundWidget_SetWidgetVisibility, bNewVisibility) == 0x000000, "Member 'PhosphorusEndOfRoundWidget_SetWidgetVisibility::bNewVisibility' has a wrong offset!");

// Function PhosphorusUI.PhosphorusHUDWidget.OnPhosphorusPlayerEliminated_BP
// 0x0008 (0x0008 - 0x0000)
struct PhosphorusHUDWidget_OnPhosphorusPlayerEliminated_BP final
{
public:
	class AFortPlayerStateAthena*                 PlayerEliminated;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PhosphorusHUDWidget_OnPhosphorusPlayerEliminated_BP) == 0x000008, "Wrong alignment on PhosphorusHUDWidget_OnPhosphorusPlayerEliminated_BP");
static_assert(sizeof(PhosphorusHUDWidget_OnPhosphorusPlayerEliminated_BP) == 0x000008, "Wrong size on PhosphorusHUDWidget_OnPhosphorusPlayerEliminated_BP");
static_assert(offsetof(PhosphorusHUDWidget_OnPhosphorusPlayerEliminated_BP, PlayerEliminated) == 0x000000, "Member 'PhosphorusHUDWidget_OnPhosphorusPlayerEliminated_BP::PlayerEliminated' has a wrong offset!");

// Function PhosphorusUI.PhosphorusSquadWipedWidget.HandleSquadWipedVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct PhosphorusSquadWipedWidget_HandleSquadWipedVisibilityChanged final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PhosphorusSquadWipedWidget_HandleSquadWipedVisibilityChanged) == 0x000001, "Wrong alignment on PhosphorusSquadWipedWidget_HandleSquadWipedVisibilityChanged");
static_assert(sizeof(PhosphorusSquadWipedWidget_HandleSquadWipedVisibilityChanged) == 0x000001, "Wrong size on PhosphorusSquadWipedWidget_HandleSquadWipedVisibilityChanged");
static_assert(offsetof(PhosphorusSquadWipedWidget_HandleSquadWipedVisibilityChanged, bNewVisibility) == 0x000000, "Member 'PhosphorusSquadWipedWidget_HandleSquadWipedVisibilityChanged::bNewVisibility' has a wrong offset!");

}

