#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PictureInPictureFNEventsOverlay

#include "Basic.hpp"

#include "PictureInPictureUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "PictureInPictureDescriptors_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PictureInPictureFNEventsOverlay.PictureInPictureFNEventsOverlay_C
// 0x01F8 (0x0700 - 0x0508)
class UPictureInPictureFNEventsOverlay_C final : public UPictureInPicturePanelWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SlideVidDown;                                      // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SlideVidUp;                                        // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                ErrorMessage;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HideInstructions;                                  // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Highlight;                                         // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Keybind_Overlay;                                   // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Main;                                      // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_ErrorInstructions;                            // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_HideInstructions;                             // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 LoginState;                                        // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ShowForPiPTags;                                    // 0x0578(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  HideForPiPTags;                                    // 0x0598(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FMargin                                FrontendPadding;                                   // 0x05B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FPiPPartnerSource                      ErrorSource;                                       // 0x05C8(0x0118)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FText                                   Text_BaseErrorMessage;                             // 0x06E0(0x0018)(Edit, BlueprintVisible)
	bool                                          InstructionsShown;                                 // 0x06F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void ExecuteUbergraph_PictureInPictureFNEventsOverlay(int32 EntryPoint);
	void OnInitialized();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void ShowError(int32 ErrorNumber, const class FString& ErrorMessage_0);
	void ShowHideInstructions();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PictureInPictureFNEventsOverlay_C">();
	}
	static class UPictureInPictureFNEventsOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureFNEventsOverlay_C>();
	}
};
static_assert(alignof(UPictureInPictureFNEventsOverlay_C) == 0x000008, "Wrong alignment on UPictureInPictureFNEventsOverlay_C");
static_assert(sizeof(UPictureInPictureFNEventsOverlay_C) == 0x000700, "Wrong size on UPictureInPictureFNEventsOverlay_C");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, UberGraphFrame) == 0x000508, "Member 'UPictureInPictureFNEventsOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, SlideVidDown) == 0x000510, "Member 'UPictureInPictureFNEventsOverlay_C::SlideVidDown' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, SlideVidUp) == 0x000518, "Member 'UPictureInPictureFNEventsOverlay_C::SlideVidUp' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, Intro) == 0x000520, "Member 'UPictureInPictureFNEventsOverlay_C::Intro' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, ErrorMessage) == 0x000528, "Member 'UPictureInPictureFNEventsOverlay_C::ErrorMessage' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, HideInstructions) == 0x000530, "Member 'UPictureInPictureFNEventsOverlay_C::HideInstructions' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, Highlight) == 0x000538, "Member 'UPictureInPictureFNEventsOverlay_C::Highlight' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, Keybind_Overlay) == 0x000540, "Member 'UPictureInPictureFNEventsOverlay_C::Keybind_Overlay' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, Overlay_Main) == 0x000548, "Member 'UPictureInPictureFNEventsOverlay_C::Overlay_Main' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, Shadow) == 0x000550, "Member 'UPictureInPictureFNEventsOverlay_C::Shadow' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, Text_ErrorInstructions) == 0x000558, "Member 'UPictureInPictureFNEventsOverlay_C::Text_ErrorInstructions' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, Text_HideInstructions) == 0x000560, "Member 'UPictureInPictureFNEventsOverlay_C::Text_HideInstructions' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, LoginState) == 0x000568, "Member 'UPictureInPictureFNEventsOverlay_C::LoginState' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, ShowForPiPTags) == 0x000578, "Member 'UPictureInPictureFNEventsOverlay_C::ShowForPiPTags' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, HideForPiPTags) == 0x000598, "Member 'UPictureInPictureFNEventsOverlay_C::HideForPiPTags' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, FrontendPadding) == 0x0005B8, "Member 'UPictureInPictureFNEventsOverlay_C::FrontendPadding' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, ErrorSource) == 0x0005C8, "Member 'UPictureInPictureFNEventsOverlay_C::ErrorSource' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, Text_BaseErrorMessage) == 0x0006E0, "Member 'UPictureInPictureFNEventsOverlay_C::Text_BaseErrorMessage' has a wrong offset!");
static_assert(offsetof(UPictureInPictureFNEventsOverlay_C, InstructionsShown) == 0x0006F8, "Member 'UPictureInPictureFNEventsOverlay_C::InstructionsShown' has a wrong offset!");

}

