#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PiPBladeMenuButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function PiPBladeMenuButton.PiPBladeMenuButton_C.ExecuteUbergraph_PiPBladeMenuButton
// 0x0018 (0x0018 - 0x0000)
struct PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_LoggedIn;                             // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enabled;                              // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ParentalControlsEnabled;              // 0x0006(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton) == 0x000008, "Wrong alignment on PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton");
static_assert(sizeof(PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton) == 0x000018, "Wrong size on PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton");
static_assert(offsetof(PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton, EntryPoint) == 0x000000, "Member 'PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton, K2Node_Event_LoggedIn) == 0x000004, "Member 'PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton::K2Node_Event_LoggedIn' has a wrong offset!");
static_assert(offsetof(PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton, K2Node_Event_Enabled) == 0x000005, "Member 'PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton::K2Node_Event_Enabled' has a wrong offset!");
static_assert(offsetof(PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton, K2Node_Event_ParentalControlsEnabled) == 0x000006, "Member 'PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton::K2Node_Event_ParentalControlsEnabled' has a wrong offset!");
static_assert(offsetof(PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function PiPBladeMenuButton.PiPBladeMenuButton_C.UpdatePiPStatusBP
// 0x0003 (0x0003 - 0x0000)
struct PiPBladeMenuButton_C_UpdatePiPStatusBP final
{
public:
	bool                                          LoggedIn;                                          // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enabled;                                           // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ParentalControlsEnabled;                           // 0x0002(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PiPBladeMenuButton_C_UpdatePiPStatusBP) == 0x000001, "Wrong alignment on PiPBladeMenuButton_C_UpdatePiPStatusBP");
static_assert(sizeof(PiPBladeMenuButton_C_UpdatePiPStatusBP) == 0x000003, "Wrong size on PiPBladeMenuButton_C_UpdatePiPStatusBP");
static_assert(offsetof(PiPBladeMenuButton_C_UpdatePiPStatusBP, LoggedIn) == 0x000000, "Member 'PiPBladeMenuButton_C_UpdatePiPStatusBP::LoggedIn' has a wrong offset!");
static_assert(offsetof(PiPBladeMenuButton_C_UpdatePiPStatusBP, Enabled) == 0x000001, "Member 'PiPBladeMenuButton_C_UpdatePiPStatusBP::Enabled' has a wrong offset!");
static_assert(offsetof(PiPBladeMenuButton_C_UpdatePiPStatusBP, ParentalControlsEnabled) == 0x000002, "Member 'PiPBladeMenuButton_C_UpdatePiPStatusBP::ParentalControlsEnabled' has a wrong offset!");

// Function PiPBladeMenuButton.PiPBladeMenuButton_C.UpdateStatus
// 0x0098 (0x0098 - 0x0000)
struct PiPBladeMenuButton_C_UpdateStatus final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoggedIn;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsParentalControlsEnabled;                         // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OffStatusText;                                     // 0x0008(0x0018)(Edit, BlueprintVisible)
	class FText                                   OnStatusText;                                      // 0x0020(0x0018)(Edit, BlueprintVisible)
	class FText                                   DisabledText;                                      // 0x0038(0x0018)(Edit, BlueprintVisible)
	class FText                                   TurnOffText;                                       // 0x0050(0x0018)(Edit, BlueprintVisible)
	class FText                                   TurnOnText;                                        // 0x0068(0x0018)(Edit, BlueprintVisible)
	class FText                                   LogInText;                                         // 0x0080(0x0018)(Edit, BlueprintVisible)
};
static_assert(alignof(PiPBladeMenuButton_C_UpdateStatus) == 0x000008, "Wrong alignment on PiPBladeMenuButton_C_UpdateStatus");
static_assert(sizeof(PiPBladeMenuButton_C_UpdateStatus) == 0x000098, "Wrong size on PiPBladeMenuButton_C_UpdateStatus");
static_assert(offsetof(PiPBladeMenuButton_C_UpdateStatus, IsEnabled) == 0x000000, "Member 'PiPBladeMenuButton_C_UpdateStatus::IsEnabled' has a wrong offset!");
static_assert(offsetof(PiPBladeMenuButton_C_UpdateStatus, IsLoggedIn) == 0x000001, "Member 'PiPBladeMenuButton_C_UpdateStatus::IsLoggedIn' has a wrong offset!");
static_assert(offsetof(PiPBladeMenuButton_C_UpdateStatus, IsParentalControlsEnabled) == 0x000002, "Member 'PiPBladeMenuButton_C_UpdateStatus::IsParentalControlsEnabled' has a wrong offset!");
static_assert(offsetof(PiPBladeMenuButton_C_UpdateStatus, OffStatusText) == 0x000008, "Member 'PiPBladeMenuButton_C_UpdateStatus::OffStatusText' has a wrong offset!");
static_assert(offsetof(PiPBladeMenuButton_C_UpdateStatus, OnStatusText) == 0x000020, "Member 'PiPBladeMenuButton_C_UpdateStatus::OnStatusText' has a wrong offset!");
static_assert(offsetof(PiPBladeMenuButton_C_UpdateStatus, DisabledText) == 0x000038, "Member 'PiPBladeMenuButton_C_UpdateStatus::DisabledText' has a wrong offset!");
static_assert(offsetof(PiPBladeMenuButton_C_UpdateStatus, TurnOffText) == 0x000050, "Member 'PiPBladeMenuButton_C_UpdateStatus::TurnOffText' has a wrong offset!");
static_assert(offsetof(PiPBladeMenuButton_C_UpdateStatus, TurnOnText) == 0x000068, "Member 'PiPBladeMenuButton_C_UpdateStatus::TurnOnText' has a wrong offset!");
static_assert(offsetof(PiPBladeMenuButton_C_UpdateStatus, LogInText) == 0x000080, "Member 'PiPBladeMenuButton_C_UpdateStatus::LogInText' has a wrong offset!");

}

