#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PiPBladeMenuButton

#include "Basic.hpp"

#include "PictureInPictureUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PiPBladeMenuButton.PiPBladeMenuButton_C
// 0x0060 (0x0F60 - 0x0F00)
class UPiPBladeMenuButton_C final : public UPictureInPictureBladeMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StatusGrow;                                        // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0F10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonText;                                        // 0x0F18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconOff;                                           // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconOn;                                            // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        IconSwitcher;                                      // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       IconTextOff;                                       // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       IconTextOn;                                        // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RightSideIconTextContent;                          // 0x0F48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Feedback;                                     // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        TextSwitcher;                                      // 0x0F58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_PiPBladeMenuButton(int32 EntryPoint);
	void UpdatePiPStatusBP(const bool LoggedIn, const bool Enabled, const bool ParentalControlsEnabled);
	void UpdateStatus(bool IsEnabled, bool IsLoggedIn, bool IsParentalControlsEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PiPBladeMenuButton_C">();
	}
	static class UPiPBladeMenuButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPiPBladeMenuButton_C>();
	}
};
static_assert(alignof(UPiPBladeMenuButton_C) == 0x000010, "Wrong alignment on UPiPBladeMenuButton_C");
static_assert(sizeof(UPiPBladeMenuButton_C) == 0x000F60, "Wrong size on UPiPBladeMenuButton_C");
static_assert(offsetof(UPiPBladeMenuButton_C, UberGraphFrame) == 0x000F00, "Member 'UPiPBladeMenuButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, StatusGrow) == 0x000F08, "Member 'UPiPBladeMenuButton_C::StatusGrow' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, Hover) == 0x000F10, "Member 'UPiPBladeMenuButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, ButtonText) == 0x000F18, "Member 'UPiPBladeMenuButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, IconOff) == 0x000F20, "Member 'UPiPBladeMenuButton_C::IconOff' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, IconOn) == 0x000F28, "Member 'UPiPBladeMenuButton_C::IconOn' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, IconSwitcher) == 0x000F30, "Member 'UPiPBladeMenuButton_C::IconSwitcher' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, IconTextOff) == 0x000F38, "Member 'UPiPBladeMenuButton_C::IconTextOff' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, IconTextOn) == 0x000F40, "Member 'UPiPBladeMenuButton_C::IconTextOn' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, RightSideIconTextContent) == 0x000F48, "Member 'UPiPBladeMenuButton_C::RightSideIconTextContent' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, Text_Feedback) == 0x000F50, "Member 'UPiPBladeMenuButton_C::Text_Feedback' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, TextSwitcher) == 0x000F58, "Member 'UPiPBladeMenuButton_C::TextSwitcher' has a wrong offset!");

}

