#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PiPPickerOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PiPPickerOverlay.PiPPickerOverlay_C
// 0x0038 (0x0468 - 0x0430)
class UPiPPickerOverlay_C final : public UFortPickerOverlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectionSet;                                      // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AlignmentDesignViewOnlyu;                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Backplate_Shadow;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPictureInPictureClient*                PictureInPictureClient;                            // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPictureInPictureMediaController*       PiPMediaController;                                // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void BP_OnItemChosen();
	void Construct();
	void ExecuteUbergraph_PiPPickerOverlay(int32 EntryPoint);
	void PlaySelectionAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PiPPickerOverlay_C">();
	}
	static class UPiPPickerOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPiPPickerOverlay_C>();
	}
};
static_assert(alignof(UPiPPickerOverlay_C) == 0x000008, "Wrong alignment on UPiPPickerOverlay_C");
static_assert(sizeof(UPiPPickerOverlay_C) == 0x000468, "Wrong size on UPiPPickerOverlay_C");
static_assert(offsetof(UPiPPickerOverlay_C, UberGraphFrame) == 0x000430, "Member 'UPiPPickerOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPiPPickerOverlay_C, Intro) == 0x000438, "Member 'UPiPPickerOverlay_C::Intro' has a wrong offset!");
static_assert(offsetof(UPiPPickerOverlay_C, SelectionSet) == 0x000440, "Member 'UPiPPickerOverlay_C::SelectionSet' has a wrong offset!");
static_assert(offsetof(UPiPPickerOverlay_C, AlignmentDesignViewOnlyu) == 0x000448, "Member 'UPiPPickerOverlay_C::AlignmentDesignViewOnlyu' has a wrong offset!");
static_assert(offsetof(UPiPPickerOverlay_C, Backplate_Shadow) == 0x000450, "Member 'UPiPPickerOverlay_C::Backplate_Shadow' has a wrong offset!");
static_assert(offsetof(UPiPPickerOverlay_C, PictureInPictureClient) == 0x000458, "Member 'UPiPPickerOverlay_C::PictureInPictureClient' has a wrong offset!");
static_assert(offsetof(UPiPPickerOverlay_C, PiPMediaController) == 0x000460, "Member 'UPiPPickerOverlay_C::PiPMediaController' has a wrong offset!");

}

