#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PiPSelectableRadialEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function PiPSelectableRadialEntry.PiPSelectableRadialEntry_C.BP_UpdateSelectionColor
// 0x0028 (0x0028 - 0x0000)
struct PiPSelectableRadialEntry_C_BP_UpdateSelectionColor final
{
public:
	bool                                          Selected_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0014(0x0014)()
};
static_assert(alignof(PiPSelectableRadialEntry_C_BP_UpdateSelectionColor) == 0x000004, "Wrong alignment on PiPSelectableRadialEntry_C_BP_UpdateSelectionColor");
static_assert(sizeof(PiPSelectableRadialEntry_C_BP_UpdateSelectionColor) == 0x000028, "Wrong size on PiPSelectableRadialEntry_C_BP_UpdateSelectionColor");
static_assert(offsetof(PiPSelectableRadialEntry_C_BP_UpdateSelectionColor, Selected_0) == 0x000000, "Member 'PiPSelectableRadialEntry_C_BP_UpdateSelectionColor::Selected_0' has a wrong offset!");
static_assert(offsetof(PiPSelectableRadialEntry_C_BP_UpdateSelectionColor, Temp_bool_Variable) == 0x000001, "Member 'PiPSelectableRadialEntry_C_BP_UpdateSelectionColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PiPSelectableRadialEntry_C_BP_UpdateSelectionColor, CallFunc_GetIsEnabled_ReturnValue) == 0x000002, "Member 'PiPSelectableRadialEntry_C_BP_UpdateSelectionColor::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(PiPSelectableRadialEntry_C_BP_UpdateSelectionColor, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'PiPSelectableRadialEntry_C_BP_UpdateSelectionColor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PiPSelectableRadialEntry_C_BP_UpdateSelectionColor, K2Node_Select_Default) == 0x000004, "Member 'PiPSelectableRadialEntry_C_BP_UpdateSelectionColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PiPSelectableRadialEntry_C_BP_UpdateSelectionColor, K2Node_MakeStruct_SlateColor) == 0x000014, "Member 'PiPSelectableRadialEntry_C_BP_UpdateSelectionColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function PiPSelectableRadialEntry.PiPSelectableRadialEntry_C.ExecuteUbergraph_PiPSelectableRadialEntry
// 0x0020 (0x0020 - 0x0000)
struct PiPSelectableRadialEntry_C_ExecuteUbergraph_PiPSelectableRadialEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsAvailable;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PiPSelectableRadialEntry_C_ExecuteUbergraph_PiPSelectableRadialEntry) == 0x000008, "Wrong alignment on PiPSelectableRadialEntry_C_ExecuteUbergraph_PiPSelectableRadialEntry");
static_assert(sizeof(PiPSelectableRadialEntry_C_ExecuteUbergraph_PiPSelectableRadialEntry) == 0x000020, "Wrong size on PiPSelectableRadialEntry_C_ExecuteUbergraph_PiPSelectableRadialEntry");
static_assert(offsetof(PiPSelectableRadialEntry_C_ExecuteUbergraph_PiPSelectableRadialEntry, EntryPoint) == 0x000000, "Member 'PiPSelectableRadialEntry_C_ExecuteUbergraph_PiPSelectableRadialEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(PiPSelectableRadialEntry_C_ExecuteUbergraph_PiPSelectableRadialEntry, K2Node_Event_bIsAvailable) == 0x000004, "Member 'PiPSelectableRadialEntry_C_ExecuteUbergraph_PiPSelectableRadialEntry::K2Node_Event_bIsAvailable' has a wrong offset!");
static_assert(offsetof(PiPSelectableRadialEntry_C_ExecuteUbergraph_PiPSelectableRadialEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'PiPSelectableRadialEntry_C_ExecuteUbergraph_PiPSelectableRadialEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PiPSelectableRadialEntry_C_ExecuteUbergraph_PiPSelectableRadialEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'PiPSelectableRadialEntry_C_ExecuteUbergraph_PiPSelectableRadialEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PiPSelectableRadialEntry_C_ExecuteUbergraph_PiPSelectableRadialEntry, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'PiPSelectableRadialEntry_C_ExecuteUbergraph_PiPSelectableRadialEntry::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");

// Function PiPSelectableRadialEntry.PiPSelectableRadialEntry_C.OnAvailabilityChanged
// 0x0001 (0x0001 - 0x0000)
struct PiPSelectableRadialEntry_C_OnAvailabilityChanged final
{
public:
	bool                                          bIsAvailable;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PiPSelectableRadialEntry_C_OnAvailabilityChanged) == 0x000001, "Wrong alignment on PiPSelectableRadialEntry_C_OnAvailabilityChanged");
static_assert(sizeof(PiPSelectableRadialEntry_C_OnAvailabilityChanged) == 0x000001, "Wrong size on PiPSelectableRadialEntry_C_OnAvailabilityChanged");
static_assert(offsetof(PiPSelectableRadialEntry_C_OnAvailabilityChanged, bIsAvailable) == 0x000000, "Member 'PiPSelectableRadialEntry_C_OnAvailabilityChanged::bIsAvailable' has a wrong offset!");

}

