#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerClearPersistenceIslandDataPromptWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerClearPersistenceIslandDataPromptWidget.PlayerClearPersistenceIslandDataPromptWidget_C
// 0x0038 (0x04D8 - 0x04A0)
class UPlayerClearPersistenceIslandDataPromptWidget_C final : public UFortActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      ApplyButton;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CancelButton;                                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CurrentDescription;                           // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__ApplyButton_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void ExecuteUbergraph_PlayerClearPersistenceIslandDataPromptWidget(int32 EntryPoint);
	void SetDescription(const class FText& InDescription);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerClearPersistenceIslandDataPromptWidget_C">();
	}
	static class UPlayerClearPersistenceIslandDataPromptWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerClearPersistenceIslandDataPromptWidget_C>();
	}
};
static_assert(alignof(UPlayerClearPersistenceIslandDataPromptWidget_C) == 0x000008, "Wrong alignment on UPlayerClearPersistenceIslandDataPromptWidget_C");
static_assert(sizeof(UPlayerClearPersistenceIslandDataPromptWidget_C) == 0x0004D8, "Wrong size on UPlayerClearPersistenceIslandDataPromptWidget_C");
static_assert(offsetof(UPlayerClearPersistenceIslandDataPromptWidget_C, UberGraphFrame) == 0x0004A0, "Member 'UPlayerClearPersistenceIslandDataPromptWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerClearPersistenceIslandDataPromptWidget_C, ApplyButton) == 0x0004A8, "Member 'UPlayerClearPersistenceIslandDataPromptWidget_C::ApplyButton' has a wrong offset!");
static_assert(offsetof(UPlayerClearPersistenceIslandDataPromptWidget_C, CancelButton) == 0x0004B0, "Member 'UPlayerClearPersistenceIslandDataPromptWidget_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UPlayerClearPersistenceIslandDataPromptWidget_C, CloseButton) == 0x0004B8, "Member 'UPlayerClearPersistenceIslandDataPromptWidget_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UPlayerClearPersistenceIslandDataPromptWidget_C, Lightbox) == 0x0004C0, "Member 'UPlayerClearPersistenceIslandDataPromptWidget_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UPlayerClearPersistenceIslandDataPromptWidget_C, Text_CurrentDescription) == 0x0004C8, "Member 'UPlayerClearPersistenceIslandDataPromptWidget_C::Text_CurrentDescription' has a wrong offset!");
static_assert(offsetof(UPlayerClearPersistenceIslandDataPromptWidget_C, Title) == 0x0004D0, "Member 'UPlayerClearPersistenceIslandDataPromptWidget_C::Title' has a wrong offset!");

}

