#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveySingleChoiceResponse

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerSurveySingleChoiceResponse.PlayerSurveySingleChoiceResponse_C
// 0x0038 (0x03B8 - 0x0380)
class UPlayerSurveySingleChoiceResponse_C final : public UFortPlayerSurveySingleChoiceResponseBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               Overlay_OrthogonalIndicator;                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_VerticalIndicator;                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerSurveyOrthogonalIndicator_C*     PlayerSurveyOrthogonalIndicator;                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerSurveyVerticalIndicator_C*       PlayerSurveyVerticalIndicator;                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Responses;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         BaseColumnWidth;                                   // 0x03B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdditionalColumnWidth;                             // 0x03B4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerSurveySingleChoiceResponse(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void SetNumberOfResponses(int32 NumberOfResponses);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerSurveySingleChoiceResponse_C">();
	}
	static class UPlayerSurveySingleChoiceResponse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerSurveySingleChoiceResponse_C>();
	}
};
static_assert(alignof(UPlayerSurveySingleChoiceResponse_C) == 0x000008, "Wrong alignment on UPlayerSurveySingleChoiceResponse_C");
static_assert(sizeof(UPlayerSurveySingleChoiceResponse_C) == 0x0003B8, "Wrong size on UPlayerSurveySingleChoiceResponse_C");
static_assert(offsetof(UPlayerSurveySingleChoiceResponse_C, UberGraphFrame) == 0x000380, "Member 'UPlayerSurveySingleChoiceResponse_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerSurveySingleChoiceResponse_C, Overlay_OrthogonalIndicator) == 0x000388, "Member 'UPlayerSurveySingleChoiceResponse_C::Overlay_OrthogonalIndicator' has a wrong offset!");
static_assert(offsetof(UPlayerSurveySingleChoiceResponse_C, Overlay_VerticalIndicator) == 0x000390, "Member 'UPlayerSurveySingleChoiceResponse_C::Overlay_VerticalIndicator' has a wrong offset!");
static_assert(offsetof(UPlayerSurveySingleChoiceResponse_C, PlayerSurveyOrthogonalIndicator) == 0x000398, "Member 'UPlayerSurveySingleChoiceResponse_C::PlayerSurveyOrthogonalIndicator' has a wrong offset!");
static_assert(offsetof(UPlayerSurveySingleChoiceResponse_C, PlayerSurveyVerticalIndicator) == 0x0003A0, "Member 'UPlayerSurveySingleChoiceResponse_C::PlayerSurveyVerticalIndicator' has a wrong offset!");
static_assert(offsetof(UPlayerSurveySingleChoiceResponse_C, SizeBox_Responses) == 0x0003A8, "Member 'UPlayerSurveySingleChoiceResponse_C::SizeBox_Responses' has a wrong offset!");
static_assert(offsetof(UPlayerSurveySingleChoiceResponse_C, BaseColumnWidth) == 0x0003B0, "Member 'UPlayerSurveySingleChoiceResponse_C::BaseColumnWidth' has a wrong offset!");
static_assert(offsetof(UPlayerSurveySingleChoiceResponse_C, AdditionalColumnWidth) == 0x0003B4, "Member 'UPlayerSurveySingleChoiceResponse_C::AdditionalColumnWidth' has a wrong offset!");

}

