#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyRatingChoice

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PlayerSurveyRatingChoice.PlayerSurveyRatingChoice_C.ExecuteUbergraph_PlayerSurveyRatingChoice
// 0x0004 (0x0004 - 0x0000)
struct PlayerSurveyRatingChoice_C_ExecuteUbergraph_PlayerSurveyRatingChoice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyRatingChoice_C_ExecuteUbergraph_PlayerSurveyRatingChoice) == 0x000004, "Wrong alignment on PlayerSurveyRatingChoice_C_ExecuteUbergraph_PlayerSurveyRatingChoice");
static_assert(sizeof(PlayerSurveyRatingChoice_C_ExecuteUbergraph_PlayerSurveyRatingChoice) == 0x000004, "Wrong size on PlayerSurveyRatingChoice_C_ExecuteUbergraph_PlayerSurveyRatingChoice");
static_assert(offsetof(PlayerSurveyRatingChoice_C_ExecuteUbergraph_PlayerSurveyRatingChoice, EntryPoint) == 0x000000, "Member 'PlayerSurveyRatingChoice_C_ExecuteUbergraph_PlayerSurveyRatingChoice::EntryPoint' has a wrong offset!");

// Function PlayerSurveyRatingChoice.PlayerSurveyRatingChoice_C.GetCurrentButtonBrush
// 0x09C0 (0x09C0 - 0x0000)
struct PlayerSurveyRatingChoice_C_GetCurrentButtonBrush final
{
public:
	struct FSlateBrush                            CurrentBrush;                                      // 0x0000(0x00B0)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPressed_ReturnValue;                    // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPressed_ReturnValue_1;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_1;                  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonStyle*                     CallFunc_GetStyle_ReturnValue;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetDisabledBrush_Brush;                   // 0x00D0(0x00B0)()
	struct FSlateBrush                            CallFunc_GetNormalBaseBrush_Brush;                 // 0x0180(0x00B0)()
	struct FSlateBrush                            CallFunc_GetNormalHoveredBrush_Brush;              // 0x0230(0x00B0)()
	struct FSlateBrush                            CallFunc_GetNormalPressedBrush_Brush;              // 0x02E0(0x00B0)()
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x0390(0x00B0)()
	struct FSlateBrush                            CallFunc_GetSelectedPressedBrush_Brush;            // 0x0440(0x00B0)()
	struct FSlateBrush                            K2Node_Select_Default_1;                           // 0x04F0(0x00B0)()
	struct FSlateBrush                            CallFunc_GetSelectedBaseBrush_Brush;               // 0x05A0(0x00B0)()
	struct FSlateBrush                            CallFunc_GetSelectedHoveredBrush_Brush;            // 0x0650(0x00B0)()
	struct FSlateBrush                            K2Node_Select_Default_2;                           // 0x0700(0x00B0)()
	struct FSlateBrush                            K2Node_Select_Default_3;                           // 0x07B0(0x00B0)()
	struct FSlateBrush                            K2Node_Select_Default_4;                           // 0x0860(0x00B0)()
	struct FSlateBrush                            K2Node_Select_Default_5;                           // 0x0910(0x00B0)()
};
static_assert(alignof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush) == 0x000010, "Wrong alignment on PlayerSurveyRatingChoice_C_GetCurrentButtonBrush");
static_assert(sizeof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush) == 0x0009C0, "Wrong size on PlayerSurveyRatingChoice_C_GetCurrentButtonBrush");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CurrentBrush) == 0x000000, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CurrentBrush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, Temp_bool_Variable) == 0x0000B0, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, Temp_bool_Variable_1) == 0x0000B1, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, Temp_bool_Variable_2) == 0x0000B2, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, Temp_bool_Variable_3) == 0x0000B3, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, Temp_bool_Variable_4) == 0x0000B4, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, Temp_bool_Variable_5) == 0x0000B5, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_IsHovered_ReturnValue) == 0x0000B6, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_IsPressed_ReturnValue) == 0x0000B7, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_IsPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_IsPressed_ReturnValue_1) == 0x0000B8, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_IsPressed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_IsHovered_ReturnValue_1) == 0x0000B9, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_IsHovered_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetSelected_ReturnValue) == 0x0000BA, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetIsEnabled_ReturnValue) == 0x0000BB, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetStyle_ReturnValue) == 0x0000C0, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetDisabledBrush_Brush) == 0x0000D0, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetDisabledBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetNormalBaseBrush_Brush) == 0x000180, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetNormalBaseBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetNormalHoveredBrush_Brush) == 0x000230, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetNormalHoveredBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetNormalPressedBrush_Brush) == 0x0002E0, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetNormalPressedBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, K2Node_Select_Default) == 0x000390, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetSelectedPressedBrush_Brush) == 0x000440, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetSelectedPressedBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, K2Node_Select_Default_1) == 0x0004F0, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetSelectedBaseBrush_Brush) == 0x0005A0, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetSelectedBaseBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetSelectedHoveredBrush_Brush) == 0x000650, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetSelectedHoveredBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, K2Node_Select_Default_2) == 0x000700, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, K2Node_Select_Default_3) == 0x0007B0, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, K2Node_Select_Default_4) == 0x000860, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, K2Node_Select_Default_5) == 0x000910, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::K2Node_Select_Default_5' has a wrong offset!");

// Function PlayerSurveyRatingChoice.PlayerSurveyRatingChoice_C.UpdateInputActionRenderOpacity
// 0x0014 (0x0014 - 0x0000)
struct PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity) == 0x000004, "Wrong alignment on PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity");
static_assert(sizeof(PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity) == 0x000014, "Wrong size on PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity");
static_assert(offsetof(PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity, Temp_bool_Variable) == 0x000000, "Member 'PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity, Temp_float_Variable) == 0x000004, "Member 'PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity, Temp_float_Variable_1) == 0x000008, "Member 'PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity, CallFunc_IsHovered_ReturnValue) == 0x00000C, "Member 'PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity, K2Node_Select_Default) == 0x000010, "Member 'PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity::K2Node_Select_Default' has a wrong offset!");

// Function PlayerSurveyRatingChoice.PlayerSurveyRatingChoice_C.UpdateTextStyle
// 0x0030 (0x0030 - 0x0000)
struct PlayerSurveyRatingChoice_C_UpdateTextStyle final
{
public:
	class UCommonTextStyle*                       CallFunc_GetCurrentTextStyle_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColor_OutColor;                        // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0014)()
};
static_assert(alignof(PlayerSurveyRatingChoice_C_UpdateTextStyle) == 0x000008, "Wrong alignment on PlayerSurveyRatingChoice_C_UpdateTextStyle");
static_assert(sizeof(PlayerSurveyRatingChoice_C_UpdateTextStyle) == 0x000030, "Wrong size on PlayerSurveyRatingChoice_C_UpdateTextStyle");
static_assert(offsetof(PlayerSurveyRatingChoice_C_UpdateTextStyle, CallFunc_GetCurrentTextStyle_ReturnValue) == 0x000000, "Member 'PlayerSurveyRatingChoice_C_UpdateTextStyle::CallFunc_GetCurrentTextStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_UpdateTextStyle, CallFunc_GetColor_OutColor) == 0x000008, "Member 'PlayerSurveyRatingChoice_C_UpdateTextStyle::CallFunc_GetColor_OutColor' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_UpdateTextStyle, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'PlayerSurveyRatingChoice_C_UpdateTextStyle::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

