#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerDiscovered

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerDiscovered.PlayerDiscovered_C
// 0x0078 (0x0380 - 0x0308)
class UPlayerDiscovered_C final : public UAthenaDiscoveredAreaOverlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BriefShow;                                         // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_LandmarkName;                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BulletLeft;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BulletRight;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MainBox;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MainBox_Landmark;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MainLocationText;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MainLocationText_1;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Container;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_LandmarkOrPOI;                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTagContainer                  RelevantPlaylistTags;                              // 0x0360(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Brief_Show_Finished();
	void Construct();
	void EndOfShow();
	void ExecuteUbergraph_PlayerDiscovered(int32 EntryPoint);
	void K2_OnBecomeActive();
	void OnNewDiscovery(const class FText& LocalizedLocationName, bool bIsNamedLocation);
	void OnStompedByOtherWidget();
	void OnStompFailed();
	void Play_Brief_Show_Sound();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerDiscovered_C">();
	}
	static class UPlayerDiscovered_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerDiscovered_C>();
	}
};
static_assert(alignof(UPlayerDiscovered_C) == 0x000008, "Wrong alignment on UPlayerDiscovered_C");
static_assert(sizeof(UPlayerDiscovered_C) == 0x000380, "Wrong size on UPlayerDiscovered_C");
static_assert(offsetof(UPlayerDiscovered_C, UberGraphFrame) == 0x000308, "Member 'UPlayerDiscovered_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerDiscovered_C, BriefShow) == 0x000310, "Member 'UPlayerDiscovered_C::BriefShow' has a wrong offset!");
static_assert(offsetof(UPlayerDiscovered_C, CommonTextBlock_LandmarkName) == 0x000318, "Member 'UPlayerDiscovered_C::CommonTextBlock_LandmarkName' has a wrong offset!");
static_assert(offsetof(UPlayerDiscovered_C, Image_BulletLeft) == 0x000320, "Member 'UPlayerDiscovered_C::Image_BulletLeft' has a wrong offset!");
static_assert(offsetof(UPlayerDiscovered_C, Image_BulletRight) == 0x000328, "Member 'UPlayerDiscovered_C::Image_BulletRight' has a wrong offset!");
static_assert(offsetof(UPlayerDiscovered_C, MainBox) == 0x000330, "Member 'UPlayerDiscovered_C::MainBox' has a wrong offset!");
static_assert(offsetof(UPlayerDiscovered_C, MainBox_Landmark) == 0x000338, "Member 'UPlayerDiscovered_C::MainBox_Landmark' has a wrong offset!");
static_assert(offsetof(UPlayerDiscovered_C, MainLocationText) == 0x000340, "Member 'UPlayerDiscovered_C::MainLocationText' has a wrong offset!");
static_assert(offsetof(UPlayerDiscovered_C, MainLocationText_1) == 0x000348, "Member 'UPlayerDiscovered_C::MainLocationText_1' has a wrong offset!");
static_assert(offsetof(UPlayerDiscovered_C, Overlay_Container) == 0x000350, "Member 'UPlayerDiscovered_C::Overlay_Container' has a wrong offset!");
static_assert(offsetof(UPlayerDiscovered_C, WidgetSwitcher_LandmarkOrPOI) == 0x000358, "Member 'UPlayerDiscovered_C::WidgetSwitcher_LandmarkOrPOI' has a wrong offset!");
static_assert(offsetof(UPlayerDiscovered_C, RelevantPlaylistTags) == 0x000360, "Member 'UPlayerDiscovered_C::RelevantPlaylistTags' has a wrong offset!");

}

