#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressiveStageWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProgressiveCosmeticUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgressiveStageWidget.ProgressiveStageWidget_C
// 0x0058 (0x02F0 - 0x0298)
class UProgressiveStageWidget_C final : public UFortProgressiveStageWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               CenterSeparator;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DownArrow;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ItemLeftContainer;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ItemRightContainer;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressiveItemWidget_C*               ProgressiveItemWidget_Left;                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressiveItemWidget_C*               ProgressiveItemWidget_Right;                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Show_Top_Arrow;                                    // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	class UFortProgressiveItemWidget* AddStageItemWidget();
	void ClearStageItemWidgets();
	void Construct();
	void ExecuteUbergraph_ProgressiveStageWidget(int32 EntryPoint);
	void OnPeekStateChanged(bool bIsInPeekState);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgressiveStageWidget_C">();
	}
	static class UProgressiveStageWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressiveStageWidget_C>();
	}
};
static_assert(alignof(UProgressiveStageWidget_C) == 0x000008, "Wrong alignment on UProgressiveStageWidget_C");
static_assert(sizeof(UProgressiveStageWidget_C) == 0x0002F0, "Wrong size on UProgressiveStageWidget_C");
static_assert(offsetof(UProgressiveStageWidget_C, UberGraphFrame) == 0x000298, "Member 'UProgressiveStageWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProgressiveStageWidget_C, Outro) == 0x0002A0, "Member 'UProgressiveStageWidget_C::Outro' has a wrong offset!");
static_assert(offsetof(UProgressiveStageWidget_C, Intro) == 0x0002A8, "Member 'UProgressiveStageWidget_C::Intro' has a wrong offset!");
static_assert(offsetof(UProgressiveStageWidget_C, CenterSeparator) == 0x0002B0, "Member 'UProgressiveStageWidget_C::CenterSeparator' has a wrong offset!");
static_assert(offsetof(UProgressiveStageWidget_C, DownArrow) == 0x0002B8, "Member 'UProgressiveStageWidget_C::DownArrow' has a wrong offset!");
static_assert(offsetof(UProgressiveStageWidget_C, Image) == 0x0002C0, "Member 'UProgressiveStageWidget_C::Image' has a wrong offset!");
static_assert(offsetof(UProgressiveStageWidget_C, ItemLeftContainer) == 0x0002C8, "Member 'UProgressiveStageWidget_C::ItemLeftContainer' has a wrong offset!");
static_assert(offsetof(UProgressiveStageWidget_C, ItemRightContainer) == 0x0002D0, "Member 'UProgressiveStageWidget_C::ItemRightContainer' has a wrong offset!");
static_assert(offsetof(UProgressiveStageWidget_C, ProgressiveItemWidget_Left) == 0x0002D8, "Member 'UProgressiveStageWidget_C::ProgressiveItemWidget_Left' has a wrong offset!");
static_assert(offsetof(UProgressiveStageWidget_C, ProgressiveItemWidget_Right) == 0x0002E0, "Member 'UProgressiveStageWidget_C::ProgressiveItemWidget_Right' has a wrong offset!");
static_assert(offsetof(UProgressiveStageWidget_C, Show_Top_Arrow) == 0x0002E8, "Member 'UProgressiveStageWidget_C::Show_Top_Arrow' has a wrong offset!");

}

