#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressiveItemWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ProgressiveItemWidget.ProgressiveItemWidget_C.ExecuteUbergraph_ProgressiveItemWidget
// 0x0090 (0x0090 - 0x0000)
struct ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_3;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_4;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_5;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInPeekState;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget) == 0x000008, "Wrong alignment on ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget");
static_assert(sizeof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget) == 0x000090, "Wrong size on ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, EntryPoint) == 0x000000, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, Temp_byte_Variable) == 0x000004, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, Temp_byte_Variable_1) == 0x000005, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, Temp_bool_Variable) == 0x000006, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, Temp_byte_Variable_2) == 0x000007, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, Temp_byte_Variable_3) == 0x000008, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000028, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000030, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000038, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x000040, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000048, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, CallFunc_PlayAnimationReverse_ReturnValue_3) == 0x000050, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::CallFunc_PlayAnimationReverse_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, CallFunc_PlayAnimationForward_ReturnValue_4) == 0x000058, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::CallFunc_PlayAnimationForward_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, CallFunc_PlayAnimationForward_ReturnValue_5) == 0x000060, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::CallFunc_PlayAnimationForward_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, K2Node_Event_bIsInPeekState) == 0x000068, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::K2Node_Event_bIsInPeekState' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, K2Node_Select_Default) == 0x000069, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000070, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, CallFunc_PlayAnimation_ReturnValue_2) == 0x000078, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, Temp_bool_Variable_1) == 0x000080, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, K2Node_Select_Default_1) == 0x000081, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget, CallFunc_PlayAnimation_ReturnValue_3) == 0x000088, "Member 'ProgressiveItemWidget_C_ExecuteUbergraph_ProgressiveItemWidget::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");

// Function ProgressiveItemWidget.ProgressiveItemWidget_C.OnPeekStateChanged
// 0x0001 (0x0001 - 0x0000)
struct ProgressiveItemWidget_C_OnPeekStateChanged final
{
public:
	bool                                          bIsInPeekState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItemWidget_C_OnPeekStateChanged) == 0x000001, "Wrong alignment on ProgressiveItemWidget_C_OnPeekStateChanged");
static_assert(sizeof(ProgressiveItemWidget_C_OnPeekStateChanged) == 0x000001, "Wrong size on ProgressiveItemWidget_C_OnPeekStateChanged");
static_assert(offsetof(ProgressiveItemWidget_C_OnPeekStateChanged, bIsInPeekState) == 0x000000, "Member 'ProgressiveItemWidget_C_OnPeekStateChanged::bIsInPeekState' has a wrong offset!");

// Function ProgressiveItemWidget.ProgressiveItemWidget_C.OnStageItemChanged
// 0x00A8 (0x00A8 - 0x0000)
struct ProgressiveItemWidget_C_OnStageItemChanged final
{
public:
	struct FProgressiveStageItemInfo              InStageItemInfo;                                   // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortColorPalette                      CallFunc_GetRarityOrSeriesColors_ReturnValue;      // 0x0050(0x0050)(NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItemWidget_C_OnStageItemChanged) == 0x000008, "Wrong alignment on ProgressiveItemWidget_C_OnStageItemChanged");
static_assert(sizeof(ProgressiveItemWidget_C_OnStageItemChanged) == 0x0000A8, "Wrong size on ProgressiveItemWidget_C_OnStageItemChanged");
static_assert(offsetof(ProgressiveItemWidget_C_OnStageItemChanged, InStageItemInfo) == 0x000000, "Member 'ProgressiveItemWidget_C_OnStageItemChanged::InStageItemInfo' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_OnStageItemChanged, Temp_bool_Variable) == 0x000040, "Member 'ProgressiveItemWidget_C_OnStageItemChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_OnStageItemChanged, Temp_byte_Variable) == 0x000041, "Member 'ProgressiveItemWidget_C_OnStageItemChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_OnStageItemChanged, Temp_byte_Variable_1) == 0x000042, "Member 'ProgressiveItemWidget_C_OnStageItemChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_OnStageItemChanged, Temp_bool_Variable_1) == 0x000043, "Member 'ProgressiveItemWidget_C_OnStageItemChanged::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_OnStageItemChanged, Temp_byte_Variable_2) == 0x000044, "Member 'ProgressiveItemWidget_C_OnStageItemChanged::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_OnStageItemChanged, Temp_byte_Variable_3) == 0x000045, "Member 'ProgressiveItemWidget_C_OnStageItemChanged::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_OnStageItemChanged, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'ProgressiveItemWidget_C_OnStageItemChanged::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_OnStageItemChanged, CallFunc_GetRarityOrSeriesColors_ReturnValue) == 0x000050, "Member 'ProgressiveItemWidget_C_OnStageItemChanged::CallFunc_GetRarityOrSeriesColors_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_OnStageItemChanged, K2Node_Select_Default) == 0x0000A0, "Member 'ProgressiveItemWidget_C_OnStageItemChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ProgressiveItemWidget_C_OnStageItemChanged, K2Node_Select_Default_1) == 0x0000A1, "Member 'ProgressiveItemWidget_C_OnStageItemChanged::K2Node_Select_Default_1' has a wrong offset!");

}

