#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgressWidget.ProgressWidget_C
// 0x0018 (0x02A0 - 0x0288)
class UProgressWidget_C final : public UFortProgressWidget
{
public:
	class USizeBox*                               ProgressSizeBox;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ProgressVBox;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgressWidget_C">();
	}
	static class UProgressWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressWidget_C>();
	}
};
static_assert(alignof(UProgressWidget_C) == 0x000008, "Wrong alignment on UProgressWidget_C");
static_assert(sizeof(UProgressWidget_C) == 0x0002A0, "Wrong size on UProgressWidget_C");
static_assert(offsetof(UProgressWidget_C, ProgressSizeBox) == 0x000288, "Member 'UProgressWidget_C::ProgressSizeBox' has a wrong offset!");
static_assert(offsetof(UProgressWidget_C, ProgressSpinner) == 0x000290, "Member 'UProgressWidget_C::ProgressSpinner' has a wrong offset!");
static_assert(offsetof(UProgressWidget_C, ProgressVBox) == 0x000298, "Member 'UProgressWidget_C::ProgressVBox' has a wrong offset!");

}

