#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressiveStageListView

#include "Basic.hpp"

#include "ProgressiveCosmeticUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgressiveStageListView.ProgressiveStageListView_C
// 0x0020 (0x0398 - 0x0378)
class UProgressiveStageListView_C final : public UFortProgressiveStageList
{
public:
	class UProgressiveStageWidget_C*              ProgressiveStageList;                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressiveStageWidget_C*              ProgressiveStageList_1;                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressiveStageWidget_C*              ProgressiveStageList_2;                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_StagesContainer;                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UFortProgressiveStageWidget* AddStageWidget();
	void ClearStageWidgets();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgressiveStageListView_C">();
	}
	static class UProgressiveStageListView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressiveStageListView_C>();
	}
};
static_assert(alignof(UProgressiveStageListView_C) == 0x000008, "Wrong alignment on UProgressiveStageListView_C");
static_assert(sizeof(UProgressiveStageListView_C) == 0x000398, "Wrong size on UProgressiveStageListView_C");
static_assert(offsetof(UProgressiveStageListView_C, ProgressiveStageList) == 0x000378, "Member 'UProgressiveStageListView_C::ProgressiveStageList' has a wrong offset!");
static_assert(offsetof(UProgressiveStageListView_C, ProgressiveStageList_1) == 0x000380, "Member 'UProgressiveStageListView_C::ProgressiveStageList_1' has a wrong offset!");
static_assert(offsetof(UProgressiveStageListView_C, ProgressiveStageList_2) == 0x000388, "Member 'UProgressiveStageListView_C::ProgressiveStageList_2' has a wrong offset!");
static_assert(offsetof(UProgressiveStageListView_C, VBox_StagesContainer) == 0x000390, "Member 'UProgressiveStageListView_C::VBox_StagesContainer' has a wrong offset!");

}

