#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PurchaseNavButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PurchaseNavButton.PurchaseNavButton_C
// 0x0100 (0x0FB0 - 0x0EB0)
class UPurchaseNavButton_C final : public UCommonButtonBase
{
public:
	uint8                                         Pad_EA8[0x8];                                      // 0x0EA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0EB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PeriodAlert;                                       // 0x0EB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0EC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BorderSwapDirection;                               // 0x0EC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_AlertIcon;                                   // 0x0ED0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_arcs;                                        // 0x0ED8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arcs2;                                       // 0x0EE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arcs3;                                       // 0x0EE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arcs4;                                       // 0x0EF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x0EF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0F00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HazardGlow;                                  // 0x0F08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_IconGlow;                                    // 0x0F10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Lightning1;                                  // 0x0F18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Sharplines;                                  // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Spinner;                                     // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_IconEffects;                               // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Lightning;                                 // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x0F48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ButtonText_1;                                 // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ButtonText_2;                                 // 0x0F58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          FlipArrow;                                         // 0x0F60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F61[0x7];                                      // 0x0F61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              DispatchClicked;                                   // 0x0F68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   ButtonText;                                        // 0x0F78(0x0018)(Edit, BlueprintVisible)
	struct FTimerHandle                           PeriodicAnim;                                      // 0x0F90(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    BackupInputAction;                                 // 0x0F98(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          toBP;                                              // 0x0FA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void Construct();
	void EventSetupPeriodicTimer();
	void ExecuteUbergraph_PurchaseNavButton(int32 EntryPoint);
	void PlayPeriodicAnim();
	void PreConstruct(bool IsDesignTime);
	void ResetHoverAnimation();
	void UpdateTextSize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PurchaseNavButton_C">();
	}
	static class UPurchaseNavButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPurchaseNavButton_C>();
	}
};
static_assert(alignof(UPurchaseNavButton_C) == 0x000010, "Wrong alignment on UPurchaseNavButton_C");
static_assert(sizeof(UPurchaseNavButton_C) == 0x000FB0, "Wrong size on UPurchaseNavButton_C");
static_assert(offsetof(UPurchaseNavButton_C, UberGraphFrame) == 0x000EB0, "Member 'UPurchaseNavButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, PeriodAlert) == 0x000EB8, "Member 'UPurchaseNavButton_C::PeriodAlert' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Hover) == 0x000EC0, "Member 'UPurchaseNavButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, BorderSwapDirection) == 0x000EC8, "Member 'UPurchaseNavButton_C::BorderSwapDirection' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_AlertIcon) == 0x000ED0, "Member 'UPurchaseNavButton_C::Image_AlertIcon' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_arcs) == 0x000ED8, "Member 'UPurchaseNavButton_C::Image_arcs' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_Arcs2) == 0x000EE0, "Member 'UPurchaseNavButton_C::Image_Arcs2' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_Arcs3) == 0x000EE8, "Member 'UPurchaseNavButton_C::Image_Arcs3' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_Arcs4) == 0x000EF0, "Member 'UPurchaseNavButton_C::Image_Arcs4' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_Arrow) == 0x000EF8, "Member 'UPurchaseNavButton_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_BG) == 0x000F00, "Member 'UPurchaseNavButton_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_HazardGlow) == 0x000F08, "Member 'UPurchaseNavButton_C::Image_HazardGlow' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_IconGlow) == 0x000F10, "Member 'UPurchaseNavButton_C::Image_IconGlow' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_Lightning1) == 0x000F18, "Member 'UPurchaseNavButton_C::Image_Lightning1' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_Sharplines) == 0x000F20, "Member 'UPurchaseNavButton_C::Image_Sharplines' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_Spinner) == 0x000F28, "Member 'UPurchaseNavButton_C::Image_Spinner' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Overlay_IconEffects) == 0x000F30, "Member 'UPurchaseNavButton_C::Overlay_IconEffects' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Overlay_Lightning) == 0x000F38, "Member 'UPurchaseNavButton_C::Overlay_Lightning' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, SafeZone_0) == 0x000F40, "Member 'UPurchaseNavButton_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Shadow) == 0x000F48, "Member 'UPurchaseNavButton_C::Shadow' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Text_ButtonText_1) == 0x000F50, "Member 'UPurchaseNavButton_C::Text_ButtonText_1' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Text_ButtonText_2) == 0x000F58, "Member 'UPurchaseNavButton_C::Text_ButtonText_2' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, FlipArrow) == 0x000F60, "Member 'UPurchaseNavButton_C::FlipArrow' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, DispatchClicked) == 0x000F68, "Member 'UPurchaseNavButton_C::DispatchClicked' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, ButtonText) == 0x000F78, "Member 'UPurchaseNavButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, PeriodicAnim) == 0x000F90, "Member 'UPurchaseNavButton_C::PeriodicAnim' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, BackupInputAction) == 0x000F98, "Member 'UPurchaseNavButton_C::BackupInputAction' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, toBP) == 0x000FA8, "Member 'UPurchaseNavButton_C::toBP' has a wrong offset!");

}

