#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PurchaseNavButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function PurchaseNavButton.PurchaseNavButton_C.ExecuteUbergraph_PurchaseNavButton
// 0x0110 (0x0110 - 0x0000)
struct PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C8(0x0018)()
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x00E0(0x0010)(NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default_2;                           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton) == 0x000008, "Wrong alignment on PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton");
static_assert(sizeof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton) == 0x000110, "Wrong size on PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, EntryPoint) == 0x000000, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_bool_Variable) == 0x000004, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_struct_Variable) == 0x000008, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_struct_Variable_1) == 0x000010, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_bool_Variable_1) == 0x000018, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_byte_Variable) == 0x00002C, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_byte_Variable_1) == 0x000038, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_bool_Variable_2) == 0x000039, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_object_Variable) == 0x000040, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_object_Variable_1) == 0x000048, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, K2Node_Event_IsDesignTime) == 0x000050, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, K2Node_Select_Default) == 0x000054, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000060, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000068, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_Conv_TextToString_ReturnValue) == 0x000070, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_Split_LeftS) == 0x000080, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_Split_RightS) == 0x000090, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_Split_ReturnValue) == 0x0000A0, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A8, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_PlayAnimation_ReturnValue) == 0x0000C0, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000C8, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, K2Node_MakeStruct_DataTableRowHandle) == 0x0000E0, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, K2Node_Select_Default_1) == 0x0000F0, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, K2Node_Select_Default_2) == 0x0000F8, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_GetEndTime_ReturnValue) == 0x000100, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000108, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function PurchaseNavButton.PurchaseNavButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PurchaseNavButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PurchaseNavButton_C_PreConstruct) == 0x000001, "Wrong alignment on PurchaseNavButton_C_PreConstruct");
static_assert(sizeof(PurchaseNavButton_C_PreConstruct) == 0x000001, "Wrong size on PurchaseNavButton_C_PreConstruct");
static_assert(offsetof(PurchaseNavButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PurchaseNavButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PurchaseNavButton.PurchaseNavButton_C.ResetHoverAnimation
// 0x0010 (0x0010 - 0x0000)
struct PurchaseNavButton_C_ResetHoverAnimation final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PurchaseNavButton_C_ResetHoverAnimation) == 0x000008, "Wrong alignment on PurchaseNavButton_C_ResetHoverAnimation");
static_assert(sizeof(PurchaseNavButton_C_ResetHoverAnimation) == 0x000010, "Wrong size on PurchaseNavButton_C_ResetHoverAnimation");
static_assert(offsetof(PurchaseNavButton_C_ResetHoverAnimation, CallFunc_GetEndTime_ReturnValue) == 0x000000, "Member 'PurchaseNavButton_C_ResetHoverAnimation::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ResetHoverAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'PurchaseNavButton_C_ResetHoverAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function PurchaseNavButton.PurchaseNavButton_C.UpdateTextSize
// 0x00C8 (0x00C8 - 0x0000)
struct PurchaseNavButton_C_UpdateTextSize final
{
public:
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0008(0x0058)(HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x0070(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(PurchaseNavButton_C_UpdateTextSize) == 0x000008, "Wrong alignment on PurchaseNavButton_C_UpdateTextSize");
static_assert(sizeof(PurchaseNavButton_C_UpdateTextSize) == 0x0000C8, "Wrong size on PurchaseNavButton_C_UpdateTextSize");
static_assert(offsetof(PurchaseNavButton_C_UpdateTextSize, CallFunc_GetDesiredSize_ReturnValue) == 0x000000, "Member 'PurchaseNavButton_C_UpdateTextSize::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_UpdateTextSize, K2Node_MakeStruct_SlateFontInfo) == 0x000008, "Member 'PurchaseNavButton_C_UpdateTextSize::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_UpdateTextSize, CallFunc_BreakVector2D_X) == 0x000060, "Member 'PurchaseNavButton_C_UpdateTextSize::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_UpdateTextSize, CallFunc_BreakVector2D_Y) == 0x000064, "Member 'PurchaseNavButton_C_UpdateTextSize::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_UpdateTextSize, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000068, "Member 'PurchaseNavButton_C_UpdateTextSize::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_UpdateTextSize, K2Node_MakeStruct_SlateFontInfo_1) == 0x000070, "Member 'PurchaseNavButton_C_UpdateTextSize::K2Node_MakeStruct_SlateFontInfo_1' has a wrong offset!");

}

