#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReferAFriendActionMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ReferAFriendActionMenu.ReferAFriendActionMenu_C
// 0x0060 (0x03D8 - 0x0378)
class UReferAFriendActionMenu_C final : public UFortReferFriendActionMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ConfirmationOpened;                                // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Opened;                                            // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_OnlineStatusIndicator;                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_143;                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_AddFriendsQR;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PartyUpQR;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Platform;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_DisplayName;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_QR;                                 // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ReferAFriendActionMenu(int32 EntryPoint);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnOpened();
	void OnRequestOriginChanged(EReferFriendOrigin RequestOrigin);
	void Set_QRt_Image(EReferFriendOrigin Origin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReferAFriendActionMenu_C">();
	}
	static class UReferAFriendActionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReferAFriendActionMenu_C>();
	}
};
static_assert(alignof(UReferAFriendActionMenu_C) == 0x000008, "Wrong alignment on UReferAFriendActionMenu_C");
static_assert(sizeof(UReferAFriendActionMenu_C) == 0x0003D8, "Wrong size on UReferAFriendActionMenu_C");
static_assert(offsetof(UReferAFriendActionMenu_C, UberGraphFrame) == 0x000378, "Member 'UReferAFriendActionMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, ConfirmationOpened) == 0x000380, "Member 'UReferAFriendActionMenu_C::ConfirmationOpened' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, Opened) == 0x000388, "Member 'UReferAFriendActionMenu_C::Opened' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, Border_OnlineStatusIndicator) == 0x000390, "Member 'UReferAFriendActionMenu_C::Border_OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, CommonRichTextBlock) == 0x000398, "Member 'UReferAFriendActionMenu_C::CommonRichTextBlock' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, CommonRichTextBlock_143) == 0x0003A0, "Member 'UReferAFriendActionMenu_C::CommonRichTextBlock_143' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, EntryBorder) == 0x0003A8, "Member 'UReferAFriendActionMenu_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, Image_AddFriendsQR) == 0x0003B0, "Member 'UReferAFriendActionMenu_C::Image_AddFriendsQR' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, Image_PartyUpQR) == 0x0003B8, "Member 'UReferAFriendActionMenu_C::Image_PartyUpQR' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, Image_Platform) == 0x0003C0, "Member 'UReferAFriendActionMenu_C::Image_Platform' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, Text_DisplayName) == 0x0003C8, "Member 'UReferAFriendActionMenu_C::Text_DisplayName' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, WidgetSwitcher_QR) == 0x0003D0, "Member 'UReferAFriendActionMenu_C::WidgetSwitcher_QR' has a wrong offset!");

}

