#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardInfoSimpleWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RewardInfoSimpleWidget.RewardInfoSimpleWidget_C
// 0x0020 (0x0F40 - 0x0F20)
class URewardInfoSimpleWidget_C final : public UFortRewardInfoButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       ItemCount;                                         // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       ItemIcon;                                          // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RewardInfoSimpleWidget(int32 EntryPoint);
	void GetDisplayName(class FText* DisplayName);
	void HandleDifferentItemOrQuantitySetBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RewardInfoSimpleWidget_C">();
	}
	static class URewardInfoSimpleWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URewardInfoSimpleWidget_C>();
	}
};
static_assert(alignof(URewardInfoSimpleWidget_C) == 0x000010, "Wrong alignment on URewardInfoSimpleWidget_C");
static_assert(sizeof(URewardInfoSimpleWidget_C) == 0x000F40, "Wrong size on URewardInfoSimpleWidget_C");
static_assert(offsetof(URewardInfoSimpleWidget_C, UberGraphFrame) == 0x000F20, "Member 'URewardInfoSimpleWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URewardInfoSimpleWidget_C, ItemCount) == 0x000F28, "Member 'URewardInfoSimpleWidget_C::ItemCount' has a wrong offset!");
static_assert(offsetof(URewardInfoSimpleWidget_C, ItemIcon) == 0x000F30, "Member 'URewardInfoSimpleWidget_C::ItemIcon' has a wrong offset!");

}

