#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RootLayout_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RootLayout_Athena.RootLayout_Athena_C
// 0x0050 (0x03F0 - 0x03A0)
class URootLayout_Athena_C final : public UFortRootViewportLayout_Athena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UConfirmationWindow_C*                  ConfirmationWindow;                                // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProgressModalWidget_C*                 ControllerDisconnectedModal;                       // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bClosingErrorDialog;                               // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   QuitTitle;                                         // 0x03C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   QuitMessage;                                       // 0x03D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnGameWindowCloseButtonClicked();
	void OnModalQueueEmptied_1();
	bool IsConsole();
	void Construct();
	void ExecuteUbergraph_RootLayout_Athena(int32 EntryPoint);
	void DialogResult_0099D78247C40A9775C753A2024EA419(EFortDialogResult Result, class FName ResultName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RootLayout_Athena_C">();
	}
	static class URootLayout_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootLayout_Athena_C>();
	}
};
static_assert(alignof(URootLayout_Athena_C) == 0x000008, "Wrong alignment on URootLayout_Athena_C");
static_assert(sizeof(URootLayout_Athena_C) == 0x0003F0, "Wrong size on URootLayout_Athena_C");
static_assert(offsetof(URootLayout_Athena_C, UberGraphFrame) == 0x0003A0, "Member 'URootLayout_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URootLayout_Athena_C, ConfirmationWindow) == 0x0003A8, "Member 'URootLayout_Athena_C::ConfirmationWindow' has a wrong offset!");
static_assert(offsetof(URootLayout_Athena_C, ControllerDisconnectedModal) == 0x0003B0, "Member 'URootLayout_Athena_C::ControllerDisconnectedModal' has a wrong offset!");
static_assert(offsetof(URootLayout_Athena_C, bClosingErrorDialog) == 0x0003B8, "Member 'URootLayout_Athena_C::bClosingErrorDialog' has a wrong offset!");
static_assert(offsetof(URootLayout_Athena_C, QuitTitle) == 0x0003C0, "Member 'URootLayout_Athena_C::QuitTitle' has a wrong offset!");
static_assert(offsetof(URootLayout_Athena_C, QuitMessage) == 0x0003D8, "Member 'URootLayout_Athena_C::QuitMessage' has a wrong offset!");

}

