#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S17_PlayerBattlePassXpAndReward

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function S17_PlayerBattlePassXpAndReward.S17_PlayerBattlePassXpAndReward_C.ExecuteUbergraph_S17_PlayerBattlePassXpAndReward
// 0x0010 (0x0010 - 0x0000)
struct S17_PlayerBattlePassXpAndReward_C_ExecuteUbergraph_S17_PlayerBattlePassXpAndReward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(S17_PlayerBattlePassXpAndReward_C_ExecuteUbergraph_S17_PlayerBattlePassXpAndReward) == 0x000008, "Wrong alignment on S17_PlayerBattlePassXpAndReward_C_ExecuteUbergraph_S17_PlayerBattlePassXpAndReward");
static_assert(sizeof(S17_PlayerBattlePassXpAndReward_C_ExecuteUbergraph_S17_PlayerBattlePassXpAndReward) == 0x000010, "Wrong size on S17_PlayerBattlePassXpAndReward_C_ExecuteUbergraph_S17_PlayerBattlePassXpAndReward");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_ExecuteUbergraph_S17_PlayerBattlePassXpAndReward, EntryPoint) == 0x000000, "Member 'S17_PlayerBattlePassXpAndReward_C_ExecuteUbergraph_S17_PlayerBattlePassXpAndReward::EntryPoint' has a wrong offset!");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_ExecuteUbergraph_S17_PlayerBattlePassXpAndReward, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'S17_PlayerBattlePassXpAndReward_C_ExecuteUbergraph_S17_PlayerBattlePassXpAndReward::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function S17_PlayerBattlePassXpAndReward.S17_PlayerBattlePassXpAndReward_C.Update Text
// 0x0140 (0x0140 - 0x0000)
struct S17_PlayerBattlePassXpAndReward_C_Update_Text final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0060(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00D8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0118(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0128(0x0018)()
};
static_assert(alignof(S17_PlayerBattlePassXpAndReward_C_Update_Text) == 0x000008, "Wrong alignment on S17_PlayerBattlePassXpAndReward_C_Update_Text");
static_assert(sizeof(S17_PlayerBattlePassXpAndReward_C_Update_Text) == 0x000140, "Wrong size on S17_PlayerBattlePassXpAndReward_C_Update_Text");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_Update_Text, Temp_byte_Variable) == 0x000000, "Member 'S17_PlayerBattlePassXpAndReward_C_Update_Text::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_Update_Text, Temp_byte_Variable_1) == 0x000001, "Member 'S17_PlayerBattlePassXpAndReward_C_Update_Text::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_Update_Text, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'S17_PlayerBattlePassXpAndReward_C_Update_Text::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_Update_Text, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'S17_PlayerBattlePassXpAndReward_C_Update_Text::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_Update_Text, K2Node_MakeArray_Array) == 0x000050, "Member 'S17_PlayerBattlePassXpAndReward_C_Update_Text::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_Update_Text, K2Node_MakeStruct_FormatArgumentData_1) == 0x000060, "Member 'S17_PlayerBattlePassXpAndReward_C_Update_Text::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_Update_Text, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'S17_PlayerBattlePassXpAndReward_C_Update_Text::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_Update_Text, Temp_bool_Variable) == 0x0000B8, "Member 'S17_PlayerBattlePassXpAndReward_C_Update_Text::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_Update_Text, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000C0, "Member 'S17_PlayerBattlePassXpAndReward_C_Update_Text::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_Update_Text, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C8, "Member 'S17_PlayerBattlePassXpAndReward_C_Update_Text::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_Update_Text, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000CC, "Member 'S17_PlayerBattlePassXpAndReward_C_Update_Text::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_Update_Text, K2Node_Select_Default) == 0x0000D0, "Member 'S17_PlayerBattlePassXpAndReward_C_Update_Text::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_Update_Text, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000D8, "Member 'S17_PlayerBattlePassXpAndReward_C_Update_Text::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_Update_Text, K2Node_MakeArray_Array_1) == 0x000118, "Member 'S17_PlayerBattlePassXpAndReward_C_Update_Text::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(S17_PlayerBattlePassXpAndReward_C_Update_Text, CallFunc_Format_ReturnValue_1) == 0x000128, "Member 'S17_PlayerBattlePassXpAndReward_C_Update_Text::CallFunc_Format_ReturnValue_1' has a wrong offset!");

}

