#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SafeZoneEditor

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SafeZoneEditor.SafeZoneEditor_C
// 0x0038 (0x04E8 - 0x04B0)
class USafeZoneEditor_C final : public UFortSafeZoneEditor
{
public:
	class UVerticalBox*                           Default;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_156;                                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LowerLeftCorner;                                   // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LowerRightCorner;                                  // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UpperLeftCorner;                                   // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UpperRightCorner;                                  // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SafeZoneEditor_C">();
	}
	static class USafeZoneEditor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USafeZoneEditor_C>();
	}
};
static_assert(alignof(USafeZoneEditor_C) == 0x000008, "Wrong alignment on USafeZoneEditor_C");
static_assert(sizeof(USafeZoneEditor_C) == 0x0004E8, "Wrong size on USafeZoneEditor_C");
static_assert(offsetof(USafeZoneEditor_C, Default) == 0x0004B0, "Member 'USafeZoneEditor_C::Default' has a wrong offset!");
static_assert(offsetof(USafeZoneEditor_C, Image_156) == 0x0004B8, "Member 'USafeZoneEditor_C::Image_156' has a wrong offset!");
static_assert(offsetof(USafeZoneEditor_C, LowerLeftCorner) == 0x0004C0, "Member 'USafeZoneEditor_C::LowerLeftCorner' has a wrong offset!");
static_assert(offsetof(USafeZoneEditor_C, LowerRightCorner) == 0x0004C8, "Member 'USafeZoneEditor_C::LowerRightCorner' has a wrong offset!");
static_assert(offsetof(USafeZoneEditor_C, SafeZone_0) == 0x0004D0, "Member 'USafeZoneEditor_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(USafeZoneEditor_C, UpperLeftCorner) == 0x0004D8, "Member 'USafeZoneEditor_C::UpperLeftCorner' has a wrong offset!");
static_assert(offsetof(USafeZoneEditor_C, UpperRightCorner) == 0x0004E0, "Member 'USafeZoneEditor_C::UpperRightCorner' has a wrong offset!");

}

