#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsListEntry_Discrete

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SettingsListEntry_Discrete.SettingsListEntry_Discrete_C.ExecuteUbergraph_SettingsListEntry_Discrete
// 0x0130 (0x0130 - 0x0000)
struct SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0070)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C0(0x0070)(ConstParm)
};
static_assert(alignof(SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete) == 0x000008, "Wrong alignment on SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete");
static_assert(sizeof(SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete) == 0x000130, "Wrong size on SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete");
static_assert(offsetof(SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete, EntryPoint) == 0x000000, "Member 'SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete, CallFunc_IsUsingTouch_ReturnValue) == 0x000004, "Member 'SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete, K2Node_Event_MyGeometry) == 0x000008, "Member 'SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000B0, "Member 'SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000B8, "Member 'SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete, K2Node_Event_MouseEvent) == 0x0000C0, "Member 'SettingsListEntry_Discrete_C_ExecuteUbergraph_SettingsListEntry_Discrete::K2Node_Event_MouseEvent' has a wrong offset!");

// Function SettingsListEntry_Discrete.SettingsListEntry_Discrete_C.GetPrimaryGamepadFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct SettingsListEntry_Discrete_C_GetPrimaryGamepadFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsListEntry_Discrete_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong alignment on SettingsListEntry_Discrete_C_GetPrimaryGamepadFocusWidget");
static_assert(sizeof(SettingsListEntry_Discrete_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong size on SettingsListEntry_Discrete_C_GetPrimaryGamepadFocusWidget");
static_assert(offsetof(SettingsListEntry_Discrete_C_GetPrimaryGamepadFocusWidget, ReturnValue) == 0x000000, "Member 'SettingsListEntry_Discrete_C_GetPrimaryGamepadFocusWidget::ReturnValue' has a wrong offset!");

// Function SettingsListEntry_Discrete.SettingsListEntry_Discrete_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct SettingsListEntry_Discrete_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SettingsListEntry_Discrete_C_OnMouseEnter) == 0x000008, "Wrong alignment on SettingsListEntry_Discrete_C_OnMouseEnter");
static_assert(sizeof(SettingsListEntry_Discrete_C_OnMouseEnter) == 0x0000A8, "Wrong size on SettingsListEntry_Discrete_C_OnMouseEnter");
static_assert(offsetof(SettingsListEntry_Discrete_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'SettingsListEntry_Discrete_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Discrete_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'SettingsListEntry_Discrete_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function SettingsListEntry_Discrete.SettingsListEntry_Discrete_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct SettingsListEntry_Discrete_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SettingsListEntry_Discrete_C_OnMouseLeave) == 0x000008, "Wrong alignment on SettingsListEntry_Discrete_C_OnMouseLeave");
static_assert(sizeof(SettingsListEntry_Discrete_C_OnMouseLeave) == 0x000070, "Wrong size on SettingsListEntry_Discrete_C_OnMouseLeave");
static_assert(offsetof(SettingsListEntry_Discrete_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'SettingsListEntry_Discrete_C_OnMouseLeave::MouseEvent' has a wrong offset!");

}

