#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownRegionPopupMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function ShowdownRegionPopupMenu.ShowdownRegionPopupMenu_C.BP_SetButtonText
// 0x0020 (0x0020 - 0x0000)
struct ShowdownRegionPopupMenu_C_BP_SetButtonText final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ShowdownRegionPopupMenu_C_BP_SetButtonText) == 0x000008, "Wrong alignment on ShowdownRegionPopupMenu_C_BP_SetButtonText");
static_assert(sizeof(ShowdownRegionPopupMenu_C_BP_SetButtonText) == 0x000020, "Wrong size on ShowdownRegionPopupMenu_C_BP_SetButtonText");
static_assert(offsetof(ShowdownRegionPopupMenu_C_BP_SetButtonText, Button) == 0x000000, "Member 'ShowdownRegionPopupMenu_C_BP_SetButtonText::Button' has a wrong offset!");
static_assert(offsetof(ShowdownRegionPopupMenu_C_BP_SetButtonText, Text) == 0x000008, "Member 'ShowdownRegionPopupMenu_C_BP_SetButtonText::Text' has a wrong offset!");

// Function ShowdownRegionPopupMenu.ShowdownRegionPopupMenu_C.ExecuteUbergraph_ShowdownRegionPopupMenu
// 0x0038 (0x0038 - 0x0000)
struct ShowdownRegionPopupMenu_C_ExecuteUbergraph_ShowdownRegionPopupMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_Event_Button;                               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Text;                                 // 0x0010(0x0018)(ConstParm)
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownRegionPopupMenu_C_ExecuteUbergraph_ShowdownRegionPopupMenu) == 0x000008, "Wrong alignment on ShowdownRegionPopupMenu_C_ExecuteUbergraph_ShowdownRegionPopupMenu");
static_assert(sizeof(ShowdownRegionPopupMenu_C_ExecuteUbergraph_ShowdownRegionPopupMenu) == 0x000038, "Wrong size on ShowdownRegionPopupMenu_C_ExecuteUbergraph_ShowdownRegionPopupMenu");
static_assert(offsetof(ShowdownRegionPopupMenu_C_ExecuteUbergraph_ShowdownRegionPopupMenu, EntryPoint) == 0x000000, "Member 'ShowdownRegionPopupMenu_C_ExecuteUbergraph_ShowdownRegionPopupMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShowdownRegionPopupMenu_C_ExecuteUbergraph_ShowdownRegionPopupMenu, K2Node_Event_Button) == 0x000008, "Member 'ShowdownRegionPopupMenu_C_ExecuteUbergraph_ShowdownRegionPopupMenu::K2Node_Event_Button' has a wrong offset!");
static_assert(offsetof(ShowdownRegionPopupMenu_C_ExecuteUbergraph_ShowdownRegionPopupMenu, K2Node_Event_Text) == 0x000010, "Member 'ShowdownRegionPopupMenu_C_ExecuteUbergraph_ShowdownRegionPopupMenu::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(ShowdownRegionPopupMenu_C_ExecuteUbergraph_ShowdownRegionPopupMenu, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000028, "Member 'ShowdownRegionPopupMenu_C_ExecuteUbergraph_ShowdownRegionPopupMenu::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(ShowdownRegionPopupMenu_C_ExecuteUbergraph_ShowdownRegionPopupMenu, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ShowdownRegionPopupMenu_C_ExecuteUbergraph_ShowdownRegionPopupMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

