#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownTournamentDetailsScoringRule

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownTournamentDetailsScoringRule.ShowdownTournamentDetailsScoringRule_C
// 0x0028 (0x0298 - 0x0270)
class UShowdownTournamentDetailsScoringRule_C final : public UCommonUserWidget
{
public:
	class UCommonBorder*                          CommonBorder_BG;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_TextContainer;                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       RuleIcon;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RuleNameText;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RuleValueText;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetData(const struct FFortShowdownScoringRuleInfo& ScoreRule, const struct FFortTournamentDisplayInfo& TournamentDisplayInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownTournamentDetailsScoringRule_C">();
	}
	static class UShowdownTournamentDetailsScoringRule_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownTournamentDetailsScoringRule_C>();
	}
};
static_assert(alignof(UShowdownTournamentDetailsScoringRule_C) == 0x000008, "Wrong alignment on UShowdownTournamentDetailsScoringRule_C");
static_assert(sizeof(UShowdownTournamentDetailsScoringRule_C) == 0x000298, "Wrong size on UShowdownTournamentDetailsScoringRule_C");
static_assert(offsetof(UShowdownTournamentDetailsScoringRule_C, CommonBorder_BG) == 0x000270, "Member 'UShowdownTournamentDetailsScoringRule_C::CommonBorder_BG' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentDetailsScoringRule_C, CommonBorder_TextContainer) == 0x000278, "Member 'UShowdownTournamentDetailsScoringRule_C::CommonBorder_TextContainer' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentDetailsScoringRule_C, RuleIcon) == 0x000280, "Member 'UShowdownTournamentDetailsScoringRule_C::RuleIcon' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentDetailsScoringRule_C, RuleNameText) == 0x000288, "Member 'UShowdownTournamentDetailsScoringRule_C::RuleNameText' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentDetailsScoringRule_C, RuleValueText) == 0x000290, "Member 'UShowdownTournamentDetailsScoringRule_C::RuleValueText' has a wrong offset!");

}

