#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownTournamentPosterBack

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ShowdownTournamentPosterBack.ShowdownTournamentPosterBack_C.ExecuteUbergraph_ShowdownTournamentPosterBack
// 0x01A0 (0x01A0 - 0x0000)
struct ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTournamentDateEntry_C*                 K2Node_DynamicCast_AsTournament_Date_Entry;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTournamentId_ReturnValue;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0058(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x006C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0080(0x0014)()
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0098(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x00B0(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_2;                // 0x00C8(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_3;                // 0x00E0(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_4;                // 0x00F8(0x0018)()
	TArray<class FString>                         CallFunc_GetTournamentEvents_ReturnValue;          // 0x0110(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTournamentDateEntry_C*                 CallFunc_Create_ReturnValue;                       // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153[0x1];                                      // 0x0153(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E[0x2];                                      // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTournamentBestScore_ReturnValue;       // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTournamentId_ReturnValue_1;            // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack) == 0x000008, "Wrong alignment on ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack");
static_assert(sizeof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack) == 0x0001A0, "Wrong size on ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, EntryPoint) == 0x000000, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000008, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, Temp_int_Array_Index_Variable) == 0x000010, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, Temp_int_Variable) == 0x000014, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_GetChildrenCount_ReturnValue) == 0x000018, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_GetChildAt_ReturnValue) == 0x000020, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, K2Node_DynamicCast_AsTournament_Date_Entry) == 0x000030, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::K2Node_DynamicCast_AsTournament_Date_Entry' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000039, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_GetTournamentId_ReturnValue) == 0x000048, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_GetTournamentId_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, K2Node_MakeStruct_SlateColor) == 0x000058, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, K2Node_MakeStruct_SlateColor_1) == 0x00006C, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, K2Node_MakeStruct_SlateColor_2) == 0x000080, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_TextToUpper_ReturnValue) == 0x000098, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_TextToUpper_ReturnValue_1) == 0x0000B0, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_TextToUpper_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_TextToUpper_ReturnValue_2) == 0x0000C8, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_TextToUpper_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_TextToUpper_ReturnValue_3) == 0x0000E0, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_TextToUpper_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_TextToUpper_ReturnValue_4) == 0x0000F8, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_TextToUpper_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_GetTournamentEvents_ReturnValue) == 0x000110, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_GetTournamentEvents_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_Array_Get_Item) == 0x000120, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_Array_Length_ReturnValue) == 0x000130, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_Array_Length_ReturnValue_1) == 0x000134, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_Greater_IntInt_ReturnValue) == 0x000138, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_Less_IntInt_ReturnValue) == 0x000139, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00013C, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_Create_ReturnValue) == 0x000140, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000148, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, Temp_byte_Variable) == 0x000150, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, Temp_byte_Variable_1) == 0x000151, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, Temp_bool_Variable) == 0x000152, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, Temp_float_Variable) == 0x000154, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, Temp_float_Variable_1) == 0x000158, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, Temp_bool_Variable_1) == 0x00015C, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, Temp_bool_Variable_2) == 0x00015D, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_GetTournamentBestScore_ReturnValue) == 0x000160, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_GetTournamentBestScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, K2Node_Select_Default) == 0x000164, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000168, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00016C, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_Round_ReturnValue) == 0x000170, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, K2Node_Select_Default_1) == 0x000174, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_Percent_IntInt_ReturnValue) == 0x000178, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00017C, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_Divide_IntInt_ReturnValue) == 0x000180, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, K2Node_Select_Default_2) == 0x000184, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_GetTournamentId_ReturnValue_1) == 0x000188, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_GetTournamentId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack, CallFunc_IsMobileGame_ReturnValue) == 0x000198, "Member 'ShowdownTournamentPosterBack_C_ExecuteUbergraph_ShowdownTournamentPosterBack::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");

// Function ShowdownTournamentPosterBack.ShowdownTournamentPosterBack_C.GetTournamentDateText
// 0x0608 (0x0608 - 0x0000)
struct ShowdownTournamentPosterBack_C_GetTournamentDateText final
{
public:
	class FText                                   TournamentDate;                                    // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0030(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0050(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_3;                              // 0x0070(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_4;                              // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00C0(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00D8(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x00F0(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x0108(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x0120(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x0138(0x0018)()
	class FText                                   Temp_text_Variable_12;                             // 0x0150(0x0018)()
	class FText                                   Temp_text_Variable_13;                             // 0x0168(0x0018)()
	class FText                                   Temp_text_Variable_14;                             // 0x0180(0x0018)()
	class FText                                   Temp_text_Variable_15;                             // 0x0198(0x0018)()
	class FText                                   Temp_text_Variable_16;                             // 0x01B0(0x0018)()
	int32                                         Temp_int_Variable_1;                               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_17;                             // 0x01D0(0x0018)()
	class FText                                   Temp_text_Variable_18;                             // 0x01E8(0x0018)()
	class FText                                   Temp_text_Variable_19;                             // 0x0200(0x0018)()
	class FText                                   Temp_text_Variable_20;                             // 0x0218(0x0018)()
	class FText                                   Temp_text_Variable_21;                             // 0x0230(0x0018)()
	class FText                                   Temp_text_Variable_22;                             // 0x0248(0x0018)()
	class FText                                   Temp_text_Variable_23;                             // 0x0260(0x0018)()
	class FText                                   Temp_text_Variable_24;                             // 0x0278(0x0018)()
	class FText                                   Temp_text_Variable_25;                             // 0x0290(0x0018)()
	class FText                                   Temp_text_Variable_26;                             // 0x02A8(0x0018)()
	class FText                                   Temp_text_Variable_27;                             // 0x02C0(0x0018)()
	class FText                                   Temp_text_Variable_28;                             // 0x02D8(0x0018)()
	class FText                                   Temp_text_Variable_29;                             // 0x02F0(0x0018)()
	struct FDateTime                              CallFunc_GetTournamentEndTime_ReturnValue;         // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_GetTournamentBeginTime_ReturnValue;       // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BreakDateTime_Year_1;                     // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month_1;                    // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day_1;                      // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour_1;                     // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute_1;                   // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second_1;                   // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond_1;              // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetTournamentEndTime_ReturnValue_1;       // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BreakDateTime_Year_2;                     // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month_2;                    // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day_2;                      // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour_2;                     // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute_2;                   // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second_2;                   // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond_2;              // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0380(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0398(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x03B0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x03F0(0x0040)(HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetTournamentBeginTime_ReturnValue_1;     // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetTournamentEndTime_ReturnValue_2;       // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year_3;                     // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month_3;                    // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day_3;                      // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour_3;                     // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute_3;                   // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second_3;                   // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond_3;              // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year_4;                     // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month_4;                    // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day_4;                      // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour_4;                     // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute_4;                   // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second_4;                   // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond_4;              // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0478(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0498(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x04B0(0x0040)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_2;                           // 0x04F0(0x0018)()
	struct FDateTime                              CallFunc_GetTournamentBeginTime_ReturnValue_2;     // 0x0508(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0510(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year_5;                     // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month_5;                    // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day_5;                      // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour_5;                     // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute_5;                   // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second_5;                   // 0x0564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond_5;              // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x0570(0x0018)()
	class FText                                   K2Node_Select_Default_4;                           // 0x0588(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x05A0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x05E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x05F0(0x0018)()
};
static_assert(alignof(ShowdownTournamentPosterBack_C_GetTournamentDateText) == 0x000008, "Wrong alignment on ShowdownTournamentPosterBack_C_GetTournamentDateText");
static_assert(sizeof(ShowdownTournamentPosterBack_C_GetTournamentDateText) == 0x000608, "Wrong size on ShowdownTournamentPosterBack_C_GetTournamentDateText");
static_assert(offsetof(ShowdownTournamentPosterBack_C_GetTournamentDateText, TournamentDate) == 0x000000, "Member 'ShowdownTournamentPosterBack_C_GetTournamentDateText::TournamentDate' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_GetTournamentDateText, Temp_text_Variable) == 0x000018, "Member 'ShowdownTournamentPosterBack_C_GetTournamentDateText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentPosterBack_C_GetTournamentDateText, Temp_text_Variable_1) == 0x000030, "Member 'ShowdownTournamentPosterBack_C_GetTournamentDateText::Temp_text_Variable_1' has a wrong offset!");
