#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownLobbyViolator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownLobbyViolator.ShowdownLobbyViolator_C
// 0x0060 (0x0748 - 0x06E8)
class UShowdownLobbyViolator_C final : public UFortShowdownDetailView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x06F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_DetailsBG;                            // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_HighlightBorder;                      // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_TopContainer;                         // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_TimeRemainingDesc;                 // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_Status;                       // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BGFillColor;                                 // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_InnerTriangle;                               // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_OuterTriangle;                               // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ShowdownTitle;                                // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          runOnce;                                           // 0x0740(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ShowdownLobbyViolator(int32 EntryPoint);
	void RefreshDataBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownLobbyViolator_C">();
	}
	static class UShowdownLobbyViolator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownLobbyViolator_C>();
	}
};
static_assert(alignof(UShowdownLobbyViolator_C) == 0x000008, "Wrong alignment on UShowdownLobbyViolator_C");
static_assert(sizeof(UShowdownLobbyViolator_C) == 0x000748, "Wrong size on UShowdownLobbyViolator_C");
static_assert(offsetof(UShowdownLobbyViolator_C, UberGraphFrame) == 0x0006E8, "Member 'UShowdownLobbyViolator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, Intro) == 0x0006F0, "Member 'UShowdownLobbyViolator_C::Intro' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, CommonBorder_DetailsBG) == 0x0006F8, "Member 'UShowdownLobbyViolator_C::CommonBorder_DetailsBG' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, CommonBorder_HighlightBorder) == 0x000700, "Member 'UShowdownLobbyViolator_C::CommonBorder_HighlightBorder' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, CommonBorder_TopContainer) == 0x000708, "Member 'UShowdownLobbyViolator_C::CommonBorder_TopContainer' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, CommonTextBlock_TimeRemainingDesc) == 0x000710, "Member 'UShowdownLobbyViolator_C::CommonTextBlock_TimeRemainingDesc' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, CommonWidgetSwitcher_Status) == 0x000718, "Member 'UShowdownLobbyViolator_C::CommonWidgetSwitcher_Status' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, Image_BGFillColor) == 0x000720, "Member 'UShowdownLobbyViolator_C::Image_BGFillColor' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, Image_InnerTriangle) == 0x000728, "Member 'UShowdownLobbyViolator_C::Image_InnerTriangle' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, Image_OuterTriangle) == 0x000730, "Member 'UShowdownLobbyViolator_C::Image_OuterTriangle' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, Text_ShowdownTitle) == 0x000738, "Member 'UShowdownLobbyViolator_C::Text_ShowdownTitle' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, runOnce) == 0x000740, "Member 'UShowdownLobbyViolator_C::runOnce' has a wrong offset!");

}

