#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownTournamentTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownTournamentTile.ShowdownTournamentTile_C
// 0x0030 (0x0F60 - 0x0F30)
class UShowdownTournamentTile_C final : public UFortShowdownTournamentTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       sizeUp;                                            // 0x0F38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       changeFocus;                                       // 0x0F40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_TileFade;                                    // 0x0F48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PosterSizeBox;                                     // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          isFaded;                                           // 0x0F58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnSelected();
	void EventFade(bool FadeOut);
	void ExecuteUbergraph_ShowdownTournamentTile(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownTournamentTile_C">();
	}
	static class UShowdownTournamentTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownTournamentTile_C>();
	}
};
static_assert(alignof(UShowdownTournamentTile_C) == 0x000010, "Wrong alignment on UShowdownTournamentTile_C");
static_assert(sizeof(UShowdownTournamentTile_C) == 0x000F60, "Wrong size on UShowdownTournamentTile_C");
static_assert(offsetof(UShowdownTournamentTile_C, UberGraphFrame) == 0x000F30, "Member 'UShowdownTournamentTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentTile_C, sizeUp) == 0x000F38, "Member 'UShowdownTournamentTile_C::sizeUp' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentTile_C, changeFocus) == 0x000F40, "Member 'UShowdownTournamentTile_C::changeFocus' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentTile_C, Image_TileFade) == 0x000F48, "Member 'UShowdownTournamentTile_C::Image_TileFade' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentTile_C, PosterSizeBox) == 0x000F50, "Member 'UShowdownTournamentTile_C::PosterSizeBox' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentTile_C, isFaded) == 0x000F58, "Member 'UShowdownTournamentTile_C::isFaded' has a wrong offset!");

}

