#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarVoiceChatMemberListEntry

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarVoiceChatMemberListEntry.SidebarVoiceChatMemberListEntry_C
// 0x0050 (0x0FE0 - 0x0F90)
class USidebarVoiceChatMemberListEntry_C final : public UFortVoiceChatMemberListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhovered;                                         // 0x0F98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0FA0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0FA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x0FB8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x0FC8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarVoiceChatMemberListEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarVoiceChatMemberListEntry_C">();
	}
	static class USidebarVoiceChatMemberListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarVoiceChatMemberListEntry_C>();
	}
};
static_assert(alignof(USidebarVoiceChatMemberListEntry_C) == 0x000010, "Wrong alignment on USidebarVoiceChatMemberListEntry_C");
static_assert(sizeof(USidebarVoiceChatMemberListEntry_C) == 0x000FE0, "Wrong size on USidebarVoiceChatMemberListEntry_C");
static_assert(offsetof(USidebarVoiceChatMemberListEntry_C, UberGraphFrame) == 0x000F90, "Member 'USidebarVoiceChatMemberListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChatMemberListEntry_C, Unhovered) == 0x000F98, "Member 'USidebarVoiceChatMemberListEntry_C::Unhovered' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChatMemberListEntry_C, Selected) == 0x000FA0, "Member 'USidebarVoiceChatMemberListEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChatMemberListEntry_C, Hovered) == 0x000FA8, "Member 'USidebarVoiceChatMemberListEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChatMemberListEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x000FB0, "Member 'USidebarVoiceChatMemberListEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChatMemberListEntry_C, EncourageEpicFriend_IdleColor) == 0x000FB8, "Member 'USidebarVoiceChatMemberListEntry_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChatMemberListEntry_C, EncourageEpicFriend_HoveredColor) == 0x000FC8, "Member 'USidebarVoiceChatMemberListEntry_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");

}

