#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarOnboardingTooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarOnboardingTooltip.SidebarOnboardingTooltip_C
// 0x0048 (0x03A0 - 0x0358)
class USidebarOnboardingTooltip_C final : public UFortSidebarOnboardTooltipWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pulse;                                             // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_1;                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_106;                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_140;                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_81;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBurst;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SidebarOnboardingTooltip(int32 EntryPoint);
	void Finished_17A538A941F98B1090CABB99882ED7AC();
	void Finished_99BF07C64B870ED66F1A1E832D2626F0();
	void OnEndTooltip();
	void OnShowTooltip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarOnboardingTooltip_C">();
	}
	static class USidebarOnboardingTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarOnboardingTooltip_C>();
	}
};
static_assert(alignof(USidebarOnboardingTooltip_C) == 0x000008, "Wrong alignment on USidebarOnboardingTooltip_C");
static_assert(sizeof(USidebarOnboardingTooltip_C) == 0x0003A0, "Wrong size on USidebarOnboardingTooltip_C");
static_assert(offsetof(USidebarOnboardingTooltip_C, UberGraphFrame) == 0x000358, "Member 'USidebarOnboardingTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarOnboardingTooltip_C, Outro) == 0x000360, "Member 'USidebarOnboardingTooltip_C::Outro' has a wrong offset!");
static_assert(offsetof(USidebarOnboardingTooltip_C, Pulse) == 0x000368, "Member 'USidebarOnboardingTooltip_C::Pulse' has a wrong offset!");
static_assert(offsetof(USidebarOnboardingTooltip_C, CommonRichTextBlock_1) == 0x000370, "Member 'USidebarOnboardingTooltip_C::CommonRichTextBlock_1' has a wrong offset!");
static_assert(offsetof(USidebarOnboardingTooltip_C, CommonRichTextBlock_106) == 0x000378, "Member 'USidebarOnboardingTooltip_C::CommonRichTextBlock_106' has a wrong offset!");
static_assert(offsetof(USidebarOnboardingTooltip_C, CommonRichTextBlock_140) == 0x000380, "Member 'USidebarOnboardingTooltip_C::CommonRichTextBlock_140' has a wrong offset!");
static_assert(offsetof(USidebarOnboardingTooltip_C, Image_81) == 0x000388, "Member 'USidebarOnboardingTooltip_C::Image_81' has a wrong offset!");
static_assert(offsetof(USidebarOnboardingTooltip_C, Image_Arrow) == 0x000390, "Member 'USidebarOnboardingTooltip_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(USidebarOnboardingTooltip_C, ImageBurst) == 0x000398, "Member 'USidebarOnboardingTooltip_C::ImageBurst' has a wrong offset!");

}

