#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarProfileSubPanelIdentity

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SidebarProfileSubPanelIdentity.SidebarProfileSubPanelIdentity_C.ExecuteUbergraph_SidebarProfileSubPanelIdentity
// 0x0010 (0x0010 - 0x0000)
struct SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsVisible_1;                         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsVisible;                           // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity) == 0x000004, "Wrong alignment on SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity");
static_assert(sizeof(SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity) == 0x000010, "Wrong size on SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity");
static_assert(offsetof(SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity, EntryPoint) == 0x000000, "Member 'SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity, Temp_bool_Variable) == 0x000004, "Member 'SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity, Temp_byte_Variable) == 0x000005, "Member 'SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity, Temp_byte_Variable_1) == 0x000006, "Member 'SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity, Temp_bool_Variable_1) == 0x000007, "Member 'SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity, Temp_byte_Variable_2) == 0x000008, "Member 'SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity, Temp_byte_Variable_3) == 0x000009, "Member 'SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity, K2Node_Event_bIsVisible_1) == 0x00000A, "Member 'SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity::K2Node_Event_bIsVisible_1' has a wrong offset!");
static_assert(offsetof(SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity, K2Node_Event_bIsVisible) == 0x00000B, "Member 'SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity::K2Node_Event_bIsVisible' has a wrong offset!");
static_assert(offsetof(SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity, K2Node_Select_Default) == 0x00000C, "Member 'SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity, K2Node_Select_Default_1) == 0x00000D, "Member 'SidebarProfileSubPanelIdentity_C_ExecuteUbergraph_SidebarProfileSubPanelIdentity::K2Node_Select_Default_1' has a wrong offset!");

// Function SidebarProfileSubPanelIdentity.SidebarProfileSubPanelIdentity_C.SetBattlePassVisiblity
// 0x0001 (0x0001 - 0x0000)
struct SidebarProfileSubPanelIdentity_C_SetBattlePassVisiblity final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarProfileSubPanelIdentity_C_SetBattlePassVisiblity) == 0x000001, "Wrong alignment on SidebarProfileSubPanelIdentity_C_SetBattlePassVisiblity");
static_assert(sizeof(SidebarProfileSubPanelIdentity_C_SetBattlePassVisiblity) == 0x000001, "Wrong size on SidebarProfileSubPanelIdentity_C_SetBattlePassVisiblity");
static_assert(offsetof(SidebarProfileSubPanelIdentity_C_SetBattlePassVisiblity, bIsVisible) == 0x000000, "Member 'SidebarProfileSubPanelIdentity_C_SetBattlePassVisiblity::bIsVisible' has a wrong offset!");

// Function SidebarProfileSubPanelIdentity.SidebarProfileSubPanelIdentity_C.SetFortniteCrewVisiblity
// 0x0001 (0x0001 - 0x0000)
struct SidebarProfileSubPanelIdentity_C_SetFortniteCrewVisiblity final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarProfileSubPanelIdentity_C_SetFortniteCrewVisiblity) == 0x000001, "Wrong alignment on SidebarProfileSubPanelIdentity_C_SetFortniteCrewVisiblity");
static_assert(sizeof(SidebarProfileSubPanelIdentity_C_SetFortniteCrewVisiblity) == 0x000001, "Wrong size on SidebarProfileSubPanelIdentity_C_SetFortniteCrewVisiblity");
static_assert(offsetof(SidebarProfileSubPanelIdentity_C_SetFortniteCrewVisiblity, bIsVisible) == 0x000000, "Member 'SidebarProfileSubPanelIdentity_C_SetFortniteCrewVisiblity::bIsVisible' has a wrong offset!");

}

