#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarOnboardingTooltip

#include "Basic.hpp"


namespace SDK::Params
{

// Function SidebarOnboardingTooltip.SidebarOnboardingTooltip_C.ExecuteUbergraph_SidebarOnboardingTooltip
// 0x0058 (0x0058 - 0x0000)
struct SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip) == 0x000008, "Wrong alignment on SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip");
static_assert(sizeof(SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip) == 0x000058, "Wrong size on SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip");
static_assert(offsetof(SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip, EntryPoint) == 0x000000, "Member 'SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000028, "Member 'SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000030, "Member 'SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000038, "Member 'SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000040, "Member 'SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000050, "Member 'SidebarOnboardingTooltip_C_ExecuteUbergraph_SidebarOnboardingTooltip::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

}

