#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sidebar_FriendSearchBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Sidebar_FriendSearchBar.Sidebar_FriendSearchBar_C
// 0x0060 (0x0FF0 - 0x0F90)
class USidebar_FriendSearchBar_C final : public UFortFriendSearchButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHovered;                                         // 0x0F98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AddFriendBanIcon;                                  // 0x0FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ClearButtonSB;                                     // 0x0FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ClickCapture;                                      // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_CannotAddFriends;                         // 0x0FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_SocialBan;                                // 0x0FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       SharingIcon;                                       // 0x0FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortSimpleWidgetAnimationsPanel*       SimpleWidgetAnimationsPanel;                       // 0x0FD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_FriendSearch;                              // 0x0FD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   ShakeAnimation;                                    // 0x0FE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShakeAnimationIsPlaying;                          // 0x0FE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__EditableText_AddFriend_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_Sidebar_FriendSearchBar(int32 EntryPoint);
	struct FEventReply On_ClickCapture_MouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Sidebar_FriendSearchBar_C">();
	}
	static class USidebar_FriendSearchBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebar_FriendSearchBar_C>();
	}
};
static_assert(alignof(USidebar_FriendSearchBar_C) == 0x000010, "Wrong alignment on USidebar_FriendSearchBar_C");
static_assert(sizeof(USidebar_FriendSearchBar_C) == 0x000FF0, "Wrong size on USidebar_FriendSearchBar_C");
static_assert(offsetof(USidebar_FriendSearchBar_C, UberGraphFrame) == 0x000F90, "Member 'USidebar_FriendSearchBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, OnHovered) == 0x000F98, "Member 'USidebar_FriendSearchBar_C::OnHovered' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, AddFriendBanIcon) == 0x000FA0, "Member 'USidebar_FriendSearchBar_C::AddFriendBanIcon' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, ClearButtonSB) == 0x000FA8, "Member 'USidebar_FriendSearchBar_C::ClearButtonSB' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, ClickCapture) == 0x000FB0, "Member 'USidebar_FriendSearchBar_C::ClickCapture' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, RichText_CannotAddFriends) == 0x000FB8, "Member 'USidebar_FriendSearchBar_C::RichText_CannotAddFriends' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, RichText_SocialBan) == 0x000FC0, "Member 'USidebar_FriendSearchBar_C::RichText_SocialBan' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, SharingIcon) == 0x000FC8, "Member 'USidebar_FriendSearchBar_C::SharingIcon' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, SimpleWidgetAnimationsPanel) == 0x000FD0, "Member 'USidebar_FriendSearchBar_C::SimpleWidgetAnimationsPanel' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, SizeBox_FriendSearch) == 0x000FD8, "Member 'USidebar_FriendSearchBar_C::SizeBox_FriendSearch' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, ShakeAnimation) == 0x000FE0, "Member 'USidebar_FriendSearchBar_C::ShakeAnimation' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, bShakeAnimationIsPlaying) == 0x000FE8, "Member 'USidebar_FriendSearchBar_C::bShakeAnimationIsPlaying' has a wrong offset!");

}

