#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarUserSearchResultListEntry_XS

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarUserSearchResultListEntry_XS.SidebarUserSearchResultListEntry_XS_C
// 0x0060 (0x1000 - 0x0FA0)
class USidebarUserSearchResultListEntry_XS_C final : public UFortUserSearchResultListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhovered;                                         // 0x0FA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0FB0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0FB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x0FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Lock;                                        // 0x0FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_DisplayName;                                  // 0x0FD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x0FD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x0FE0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x0FF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarUserSearchResultListEntry_XS(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarUserSearchResultListEntry_XS_C">();
	}
	static class USidebarUserSearchResultListEntry_XS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarUserSearchResultListEntry_XS_C>();
	}
};
static_assert(alignof(USidebarUserSearchResultListEntry_XS_C) == 0x000010, "Wrong alignment on USidebarUserSearchResultListEntry_XS_C");
static_assert(sizeof(USidebarUserSearchResultListEntry_XS_C) == 0x001000, "Wrong size on USidebarUserSearchResultListEntry_XS_C");
static_assert(offsetof(USidebarUserSearchResultListEntry_XS_C, UberGraphFrame) == 0x000FA0, "Member 'USidebarUserSearchResultListEntry_XS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarUserSearchResultListEntry_XS_C, Unhovered) == 0x000FA8, "Member 'USidebarUserSearchResultListEntry_XS_C::Unhovered' has a wrong offset!");
static_assert(offsetof(USidebarUserSearchResultListEntry_XS_C, Selected) == 0x000FB0, "Member 'USidebarUserSearchResultListEntry_XS_C::Selected' has a wrong offset!");
static_assert(offsetof(USidebarUserSearchResultListEntry_XS_C, Hovered) == 0x000FB8, "Member 'USidebarUserSearchResultListEntry_XS_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarUserSearchResultListEntry_XS_C, EmptyButtonToEatOneMouseUpEvent) == 0x000FC0, "Member 'USidebarUserSearchResultListEntry_XS_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(USidebarUserSearchResultListEntry_XS_C, Image_Lock) == 0x000FC8, "Member 'USidebarUserSearchResultListEntry_XS_C::Image_Lock' has a wrong offset!");
static_assert(offsetof(USidebarUserSearchResultListEntry_XS_C, Text_DisplayName) == 0x000FD0, "Member 'USidebarUserSearchResultListEntry_XS_C::Text_DisplayName' has a wrong offset!");
static_assert(offsetof(USidebarUserSearchResultListEntry_XS_C, UserActionMenuInputButton) == 0x000FD8, "Member 'USidebarUserSearchResultListEntry_XS_C::UserActionMenuInputButton' has a wrong offset!");
static_assert(offsetof(USidebarUserSearchResultListEntry_XS_C, EncourageEpicFriend_IdleColor) == 0x000FE0, "Member 'USidebarUserSearchResultListEntry_XS_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(USidebarUserSearchResultListEntry_XS_C, EncourageEpicFriend_HoveredColor) == 0x000FF0, "Member 'USidebarUserSearchResultListEntry_XS_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");

}

