#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarUserListHeaderEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SocialUMG_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarUserListHeaderEntry.SidebarUserListHeaderEntry_C
// 0x0030 (0x0F50 - 0x0F20)
class USidebarUserListHeaderEntry_C final : public USocialUserListHeaderEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnExpansion;                                       // 0x0F28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0F30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortMobileImage*                       ExpandDirectionTick;                               // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Meeple;                                      // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_EntryContent;                                   // 0x0F48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarUserListHeaderEntry(int32 EntryPoint);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnListItemObjectSet_1(class UObject* ListItemObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarUserListHeaderEntry_C">();
	}
	static class USidebarUserListHeaderEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarUserListHeaderEntry_C>();
	}
};
static_assert(alignof(USidebarUserListHeaderEntry_C) == 0x000010, "Wrong alignment on USidebarUserListHeaderEntry_C");
static_assert(sizeof(USidebarUserListHeaderEntry_C) == 0x000F50, "Wrong size on USidebarUserListHeaderEntry_C");
static_assert(offsetof(USidebarUserListHeaderEntry_C, UberGraphFrame) == 0x000F20, "Member 'USidebarUserListHeaderEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarUserListHeaderEntry_C, OnExpansion) == 0x000F28, "Member 'USidebarUserListHeaderEntry_C::OnExpansion' has a wrong offset!");
static_assert(offsetof(USidebarUserListHeaderEntry_C, OnHover) == 0x000F30, "Member 'USidebarUserListHeaderEntry_C::OnHover' has a wrong offset!");
static_assert(offsetof(USidebarUserListHeaderEntry_C, ExpandDirectionTick) == 0x000F38, "Member 'USidebarUserListHeaderEntry_C::ExpandDirectionTick' has a wrong offset!");
static_assert(offsetof(USidebarUserListHeaderEntry_C, Image_Meeple) == 0x000F40, "Member 'USidebarUserListHeaderEntry_C::Image_Meeple' has a wrong offset!");
static_assert(offsetof(USidebarUserListHeaderEntry_C, SB_EntryContent) == 0x000F48, "Member 'USidebarUserListHeaderEntry_C::SB_EntryContent' has a wrong offset!");

}

