#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarInteraction_Profile

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarInteraction_Profile.SidebarInteraction_Profile_C
// 0x0060 (0x0FE0 - 0x0F80)
class USidebarInteraction_Profile_C final : public UFortSidebarSocialInteractionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0F88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 EncourageEpicFriend;                               // 0x0F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x0F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x0FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x0FB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x0FC0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           AddFriendColor;                                    // 0x0FD0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarInteraction_Profile(int32 EntryPoint);
	void OnInitialized();
	void OnInteractionSet();
	void SetArrow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarInteraction_Profile_C">();
	}
	static class USidebarInteraction_Profile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarInteraction_Profile_C>();
	}
};
static_assert(alignof(USidebarInteraction_Profile_C) == 0x000010, "Wrong alignment on USidebarInteraction_Profile_C");
static_assert(sizeof(USidebarInteraction_Profile_C) == 0x000FE0, "Wrong size on USidebarInteraction_Profile_C");
static_assert(offsetof(USidebarInteraction_Profile_C, UberGraphFrame) == 0x000F80, "Member 'USidebarInteraction_Profile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, OnHover) == 0x000F88, "Member 'USidebarInteraction_Profile_C::OnHover' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, EncourageEpicFriend) == 0x000F90, "Member 'USidebarInteraction_Profile_C::EncourageEpicFriend' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, Image_Arrow) == 0x000F98, "Member 'USidebarInteraction_Profile_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, MenuAnchor_Actions) == 0x000FA0, "Member 'USidebarInteraction_Profile_C::MenuAnchor_Actions' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, SizeBox_0) == 0x000FA8, "Member 'USidebarInteraction_Profile_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, EncourageEpicFriend_IdleColor) == 0x000FB0, "Member 'USidebarInteraction_Profile_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, EncourageEpicFriend_HoveredColor) == 0x000FC0, "Member 'USidebarInteraction_Profile_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, AddFriendColor) == 0x000FD0, "Member 'USidebarInteraction_Profile_C::AddFriendColor' has a wrong offset!");

}

