#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarJoinablePartyActionMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarJoinablePartyActionMenu.SidebarJoinablePartyActionMenu_C
// 0x0028 (0x0460 - 0x0438)
class USidebarJoinablePartyActionMenu_C final : public UFortJoinablePartyActionMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ConfirmationOpened;                                // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Opened;                                            // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_PartyMembers;                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SidebarJoinablePartyActionMenu(int32 EntryPoint);
	void OnOpened();
	void OnToggleConfirmation(bool bIsVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarJoinablePartyActionMenu_C">();
	}
	static class USidebarJoinablePartyActionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarJoinablePartyActionMenu_C>();
	}
};
static_assert(alignof(USidebarJoinablePartyActionMenu_C) == 0x000008, "Wrong alignment on USidebarJoinablePartyActionMenu_C");
static_assert(sizeof(USidebarJoinablePartyActionMenu_C) == 0x000460, "Wrong size on USidebarJoinablePartyActionMenu_C");
static_assert(offsetof(USidebarJoinablePartyActionMenu_C, UberGraphFrame) == 0x000438, "Member 'USidebarJoinablePartyActionMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyActionMenu_C, ConfirmationOpened) == 0x000440, "Member 'USidebarJoinablePartyActionMenu_C::ConfirmationOpened' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyActionMenu_C, Opened) == 0x000448, "Member 'USidebarJoinablePartyActionMenu_C::Opened' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyActionMenu_C, CommonRichTextBlock_PartyMembers) == 0x000450, "Member 'USidebarJoinablePartyActionMenu_C::CommonRichTextBlock_PartyMembers' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyActionMenu_C, EntryBorder) == 0x000458, "Member 'USidebarJoinablePartyActionMenu_C::EntryBorder' has a wrong offset!");

}

