#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarVoiceChannelHeaderButton

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarVoiceChannelHeaderButton.SidebarVoiceChannelHeaderButton_C
// 0x00A0 (0x0FF0 - 0x0F50)
class USidebarVoiceChannelHeaderButton_C final : public UFortVoiceChannelHeaderButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnExpansion;                                       // 0x0F58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       JoinSlideOut;                                      // 0x0F60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScaleUp;                                           // 0x0F68(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortMobileImage*                       ExpandDirectionTick;                               // 0x0F70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Join;                                         // 0x0F78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   JoinText;                                          // 0x0F80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       NotTransmitting;                                   // 0x0F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   OffText;                                           // 0x0F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        OnOffSwitcher;                                     // 0x0F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   OnText;                                            // 0x0FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x0FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SimultaneousChannelSwitcher;                       // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switch_Transmitting;                               // 0x0FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Transmitting;                                      // 0x0FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           VoiceStatusInactiveColor;                          // 0x0FC8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           VoiceStatusActiveColor;                            // 0x0FD8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDisabled();
	void BP_OnEnabled();
	void BP_OnHovered();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarVoiceChannelHeaderButton(int32 EntryPoint);
	void OnListItemObjectSet_1(class UObject* ListItemObject);
	void OnUpdateVisuals(bool bIsActiveAndListening, bool bIsActiveOrAvailable, bool bIsAvailableAndNotActive, bool bIsListening);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarVoiceChannelHeaderButton_C">();
	}
	static class USidebarVoiceChannelHeaderButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarVoiceChannelHeaderButton_C>();
	}
};
static_assert(alignof(USidebarVoiceChannelHeaderButton_C) == 0x000010, "Wrong alignment on USidebarVoiceChannelHeaderButton_C");
static_assert(sizeof(USidebarVoiceChannelHeaderButton_C) == 0x000FF0, "Wrong size on USidebarVoiceChannelHeaderButton_C");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, UberGraphFrame) == 0x000F50, "Member 'USidebarVoiceChannelHeaderButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, OnExpansion) == 0x000F58, "Member 'USidebarVoiceChannelHeaderButton_C::OnExpansion' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, JoinSlideOut) == 0x000F60, "Member 'USidebarVoiceChannelHeaderButton_C::JoinSlideOut' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, ScaleUp) == 0x000F68, "Member 'USidebarVoiceChannelHeaderButton_C::ScaleUp' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, ExpandDirectionTick) == 0x000F70, "Member 'USidebarVoiceChannelHeaderButton_C::ExpandDirectionTick' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, HBox_Join) == 0x000F78, "Member 'USidebarVoiceChannelHeaderButton_C::HBox_Join' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, JoinText) == 0x000F80, "Member 'USidebarVoiceChannelHeaderButton_C::JoinText' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, NotTransmitting) == 0x000F88, "Member 'USidebarVoiceChannelHeaderButton_C::NotTransmitting' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, OffText) == 0x000F90, "Member 'USidebarVoiceChannelHeaderButton_C::OffText' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, OnOffSwitcher) == 0x000F98, "Member 'USidebarVoiceChannelHeaderButton_C::OnOffSwitcher' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, OnText) == 0x000FA0, "Member 'USidebarVoiceChannelHeaderButton_C::OnText' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, Overlay_1) == 0x000FA8, "Member 'USidebarVoiceChannelHeaderButton_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, SimultaneousChannelSwitcher) == 0x000FB0, "Member 'USidebarVoiceChannelHeaderButton_C::SimultaneousChannelSwitcher' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, Switch_Transmitting) == 0x000FB8, "Member 'USidebarVoiceChannelHeaderButton_C::Switch_Transmitting' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, Transmitting) == 0x000FC0, "Member 'USidebarVoiceChannelHeaderButton_C::Transmitting' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, VoiceStatusInactiveColor) == 0x000FC8, "Member 'USidebarVoiceChannelHeaderButton_C::VoiceStatusInactiveColor' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelHeaderButton_C, VoiceStatusActiveColor) == 0x000FD8, "Member 'USidebarVoiceChannelHeaderButton_C::VoiceStatusActiveColor' has a wrong offset!");

}

