#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarPartyPortrait

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarPartyPortrait.SidebarPartyPortrait_C
// 0x0028 (0x02B0 - 0x0288)
class USidebarPartyPortrait_C final : public UFortJoinablePartyPortrait
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_OnlineStatusIndicator_1;                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Crown_1;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortSocialAvatarIcon*                  Image_ValueBackground;                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsPartyLeader;                                     // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SidebarPartyPortrait(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarPartyPortrait_C">();
	}
	static class USidebarPartyPortrait_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarPartyPortrait_C>();
	}
};
static_assert(alignof(USidebarPartyPortrait_C) == 0x000008, "Wrong alignment on USidebarPartyPortrait_C");
static_assert(sizeof(USidebarPartyPortrait_C) == 0x0002B0, "Wrong size on USidebarPartyPortrait_C");
static_assert(offsetof(USidebarPartyPortrait_C, UberGraphFrame) == 0x000288, "Member 'USidebarPartyPortrait_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarPartyPortrait_C, Border_OnlineStatusIndicator_1) == 0x000290, "Member 'USidebarPartyPortrait_C::Border_OnlineStatusIndicator_1' has a wrong offset!");
static_assert(offsetof(USidebarPartyPortrait_C, Image_Crown_1) == 0x000298, "Member 'USidebarPartyPortrait_C::Image_Crown_1' has a wrong offset!");
static_assert(offsetof(USidebarPartyPortrait_C, Image_ValueBackground) == 0x0002A0, "Member 'USidebarPartyPortrait_C::Image_ValueBackground' has a wrong offset!");
static_assert(offsetof(USidebarPartyPortrait_C, IsPartyLeader) == 0x0002A8, "Member 'USidebarPartyPortrait_C::IsPartyLeader' has a wrong offset!");

}

