#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarVoiceChannelSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarVoiceChannelSettings.SidebarVoiceChannelSettings_C
// 0x0070 (0x0368 - 0x02F8)
class USidebarVoiceChannelSettings_C final : public UFortVoiceSettingsDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GearHover;                                         // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonActionWidget*                    ActionWidget_InputDisplay;                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_NextInputDevice;                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_NextOutputDevice;                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_TogglePTT;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GearIcon;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   InputDevice;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   OutputDevice;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       PTTKeybindWidget;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   PushToTalk;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LowPowerMode;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VoiceDisabledIcon;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   VoiceDisabledText;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_OpenSettings_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void ExecuteUbergraph_SidebarVoiceChannelSettings(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarVoiceChannelSettings_C">();
	}
	static class USidebarVoiceChannelSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarVoiceChannelSettings_C>();
	}
};
static_assert(alignof(USidebarVoiceChannelSettings_C) == 0x000008, "Wrong alignment on USidebarVoiceChannelSettings_C");
static_assert(sizeof(USidebarVoiceChannelSettings_C) == 0x000368, "Wrong size on USidebarVoiceChannelSettings_C");
static_assert(offsetof(USidebarVoiceChannelSettings_C, UberGraphFrame) == 0x0002F8, "Member 'USidebarVoiceChannelSettings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, GearHover) == 0x000300, "Member 'USidebarVoiceChannelSettings_C::GearHover' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, ActionWidget_InputDisplay) == 0x000308, "Member 'USidebarVoiceChannelSettings_C::ActionWidget_InputDisplay' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, Button_NextInputDevice) == 0x000310, "Member 'USidebarVoiceChannelSettings_C::Button_NextInputDevice' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, Button_NextOutputDevice) == 0x000318, "Member 'USidebarVoiceChannelSettings_C::Button_NextOutputDevice' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, Button_TogglePTT) == 0x000320, "Member 'USidebarVoiceChannelSettings_C::Button_TogglePTT' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, GearIcon) == 0x000328, "Member 'USidebarVoiceChannelSettings_C::GearIcon' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, InputDevice) == 0x000330, "Member 'USidebarVoiceChannelSettings_C::InputDevice' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, OutputDevice) == 0x000338, "Member 'USidebarVoiceChannelSettings_C::OutputDevice' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, PTTKeybindWidget) == 0x000340, "Member 'USidebarVoiceChannelSettings_C::PTTKeybindWidget' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, PushToTalk) == 0x000348, "Member 'USidebarVoiceChannelSettings_C::PushToTalk' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, Text_LowPowerMode) == 0x000350, "Member 'USidebarVoiceChannelSettings_C::Text_LowPowerMode' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, VoiceDisabledIcon) == 0x000358, "Member 'USidebarVoiceChannelSettings_C::VoiceDisabledIcon' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, VoiceDisabledText) == 0x000360, "Member 'USidebarVoiceChannelSettings_C::VoiceDisabledText' has a wrong offset!");

}

