#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarEditNicknameButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarEditNicknameButton.SidebarEditNicknameButton_C
// 0x0020 (0x0F50 - 0x0F30)
class USidebarEditNicknameButton_C final : public UFortEditNicknameButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHovered;                                         // 0x0F38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                ClickCapture;                                      // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarEditNicknameButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarEditNicknameButton_C">();
	}
	static class USidebarEditNicknameButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarEditNicknameButton_C>();
	}
};
static_assert(alignof(USidebarEditNicknameButton_C) == 0x000010, "Wrong alignment on USidebarEditNicknameButton_C");
static_assert(sizeof(USidebarEditNicknameButton_C) == 0x000F50, "Wrong size on USidebarEditNicknameButton_C");
static_assert(offsetof(USidebarEditNicknameButton_C, UberGraphFrame) == 0x000F30, "Member 'USidebarEditNicknameButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarEditNicknameButton_C, OnHovered) == 0x000F38, "Member 'USidebarEditNicknameButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(USidebarEditNicknameButton_C, ClickCapture) == 0x000F40, "Member 'USidebarEditNicknameButton_C::ClickCapture' has a wrong offset!");

}

