#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarReferAFriendEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarReferAFriendEntry.SidebarReferAFriendEntry_C
// 0x0040 (0x0F60 - 0x0F20)
class USidebarReferAFriendEntry_C final : public UFortReferFriendListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0F28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0F30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_MissedInvitesText;                            // 0x0F48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_MissedInvitesText_Hover;                      // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x0F58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarReferAFriendEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarReferAFriendEntry_C">();
	}
	static class USidebarReferAFriendEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarReferAFriendEntry_C>();
	}
};
static_assert(alignof(USidebarReferAFriendEntry_C) == 0x000010, "Wrong alignment on USidebarReferAFriendEntry_C");
static_assert(sizeof(USidebarReferAFriendEntry_C) == 0x000F60, "Wrong size on USidebarReferAFriendEntry_C");
static_assert(offsetof(USidebarReferAFriendEntry_C, UberGraphFrame) == 0x000F20, "Member 'USidebarReferAFriendEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendEntry_C, Selected) == 0x000F28, "Member 'USidebarReferAFriendEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendEntry_C, Hovered) == 0x000F30, "Member 'USidebarReferAFriendEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x000F38, "Member 'USidebarReferAFriendEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendEntry_C, EntryBorder) == 0x000F40, "Member 'USidebarReferAFriendEntry_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendEntry_C, Text_MissedInvitesText) == 0x000F48, "Member 'USidebarReferAFriendEntry_C::Text_MissedInvitesText' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendEntry_C, Text_MissedInvitesText_Hover) == 0x000F50, "Member 'USidebarReferAFriendEntry_C::Text_MissedInvitesText_Hover' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendEntry_C, UserActionMenuInputButton) == 0x000F58, "Member 'USidebarReferAFriendEntry_C::UserActionMenuInputButton' has a wrong offset!");

}

