#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarPanelExit

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function SidebarPanelExit.SidebarPanelExit_C.BndEvt__SidebarPanelExit_Button_ExitGame_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarPanelExit_C_BndEvt__SidebarPanelExit_Button_ExitGame_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarPanelExit_C_BndEvt__SidebarPanelExit_Button_ExitGame_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SidebarPanelExit_C_BndEvt__SidebarPanelExit_Button_ExitGame_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SidebarPanelExit_C_BndEvt__SidebarPanelExit_Button_ExitGame_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SidebarPanelExit_C_BndEvt__SidebarPanelExit_Button_ExitGame_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SidebarPanelExit_C_BndEvt__SidebarPanelExit_Button_ExitGame_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SidebarPanelExit_C_BndEvt__SidebarPanelExit_Button_ExitGame_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SidebarPanelExit.SidebarPanelExit_C.BndEvt__SidebarPanelExit_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarPanelExit_C_BndEvt__SidebarPanelExit_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarPanelExit_C_BndEvt__SidebarPanelExit_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SidebarPanelExit_C_BndEvt__SidebarPanelExit_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SidebarPanelExit_C_BndEvt__SidebarPanelExit_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SidebarPanelExit_C_BndEvt__SidebarPanelExit_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SidebarPanelExit_C_BndEvt__SidebarPanelExit_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SidebarPanelExit_C_BndEvt__SidebarPanelExit_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SidebarPanelExit.SidebarPanelExit_C.DialogResult_72E03FD949433FCC7FD537BE143F3FA1
// 0x000C (0x000C - 0x0000)
struct SidebarPanelExit_C_DialogResult_72E03FD949433FCC7FD537BE143F3FA1 final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarPanelExit_C_DialogResult_72E03FD949433FCC7FD537BE143F3FA1) == 0x000004, "Wrong alignment on SidebarPanelExit_C_DialogResult_72E03FD949433FCC7FD537BE143F3FA1");
static_assert(sizeof(SidebarPanelExit_C_DialogResult_72E03FD949433FCC7FD537BE143F3FA1) == 0x00000C, "Wrong size on SidebarPanelExit_C_DialogResult_72E03FD949433FCC7FD537BE143F3FA1");
static_assert(offsetof(SidebarPanelExit_C_DialogResult_72E03FD949433FCC7FD537BE143F3FA1, Result) == 0x000000, "Member 'SidebarPanelExit_C_DialogResult_72E03FD949433FCC7FD537BE143F3FA1::Result' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_DialogResult_72E03FD949433FCC7FD537BE143F3FA1, ResultName) == 0x000004, "Member 'SidebarPanelExit_C_DialogResult_72E03FD949433FCC7FD537BE143F3FA1::ResultName' has a wrong offset!");

// Function SidebarPanelExit.SidebarPanelExit_C.DialogResult_D6C37C7D45574B8D0C2F22B5DE53C01B
// 0x000C (0x000C - 0x0000)
struct SidebarPanelExit_C_DialogResult_D6C37C7D45574B8D0C2F22B5DE53C01B final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarPanelExit_C_DialogResult_D6C37C7D45574B8D0C2F22B5DE53C01B) == 0x000004, "Wrong alignment on SidebarPanelExit_C_DialogResult_D6C37C7D45574B8D0C2F22B5DE53C01B");
static_assert(sizeof(SidebarPanelExit_C_DialogResult_D6C37C7D45574B8D0C2F22B5DE53C01B) == 0x00000C, "Wrong size on SidebarPanelExit_C_DialogResult_D6C37C7D45574B8D0C2F22B5DE53C01B");
static_assert(offsetof(SidebarPanelExit_C_DialogResult_D6C37C7D45574B8D0C2F22B5DE53C01B, Result) == 0x000000, "Member 'SidebarPanelExit_C_DialogResult_D6C37C7D45574B8D0C2F22B5DE53C01B::Result' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_DialogResult_D6C37C7D45574B8D0C2F22B5DE53C01B, ResultName) == 0x000004, "Member 'SidebarPanelExit_C_DialogResult_D6C37C7D45574B8D0C2F22B5DE53C01B::ResultName' has a wrong offset!");

// Function SidebarPanelExit.SidebarPanelExit_C.ExecuteUbergraph_SidebarPanelExit
// 0x0090 (0x0090 - 0x0000)
struct SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	EFortDialogResult                             K2Node_CustomEvent_Result_1;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName_1;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable_1;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue_1; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit) == 0x000008, "Wrong alignment on SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit");
static_assert(sizeof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit) == 0x000090, "Wrong size on SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, EntryPoint) == 0x000000, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, K2Node_CustomEvent_Result_1) == 0x000020, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, K2Node_CustomEvent_ResultName_1) == 0x000024, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::K2Node_CustomEvent_ResultName_1' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, Temp_name_Variable) == 0x00002C, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, Temp_byte_Variable) == 0x000034, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, K2Node_SwitchEnum_CmpSuccess) == 0x000035, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue) == 0x000038, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, K2Node_CustomEvent_Result) == 0x000051, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, K2Node_CustomEvent_ResultName) == 0x000054, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, Temp_name_Variable_1) == 0x00005C, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, Temp_byte_Variable_1) == 0x000064, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, K2Node_SwitchEnum_CmpSuccess_1) == 0x000065, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue_1) == 0x000068, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, CallFunc_GetContext_ReturnValue_1) == 0x000070, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, K2Node_ComponentBoundEvent_Button_1) == 0x000080, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit, K2Node_ComponentBoundEvent_Button) == 0x000088, "Member 'SidebarPanelExit_C_ExecuteUbergraph_SidebarPanelExit::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

}

