#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleFeatured_YellowButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SimpleFeatured_YellowButton.SimpleFeatured_YellowButton_C
// 0x0060 (0x0F80 - 0x0F20)
class USimpleFeatured_YellowButton_C final : public UFortSimpleFeaturedYellowButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pressed;                                           // 0x0F28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TextBounce;                                        // 0x0F30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0F38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Container;                                  // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0F48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ButtonAction;                                 // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SecondaryText;                                // 0x0F58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_Description;                                // 0x0F60(0x0018)(Edit, BlueprintVisible)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ChangeSecondaryText(const class FText& NewText);
	void Construct();
	void ExecuteUbergraph_SimpleFeatured_YellowButton(int32 EntryPoint);
	void HandleSize();
	void PreConstruct(bool IsDesignTime);
	void RefreshUI();
	void SetText(const class FText& NewText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SimpleFeatured_YellowButton_C">();
	}
	static class USimpleFeatured_YellowButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleFeatured_YellowButton_C>();
	}
};
static_assert(alignof(USimpleFeatured_YellowButton_C) == 0x000010, "Wrong alignment on USimpleFeatured_YellowButton_C");
static_assert(sizeof(USimpleFeatured_YellowButton_C) == 0x000F80, "Wrong size on USimpleFeatured_YellowButton_C");
static_assert(offsetof(USimpleFeatured_YellowButton_C, UberGraphFrame) == 0x000F20, "Member 'USimpleFeatured_YellowButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USimpleFeatured_YellowButton_C, Pressed) == 0x000F28, "Member 'USimpleFeatured_YellowButton_C::Pressed' has a wrong offset!");
static_assert(offsetof(USimpleFeatured_YellowButton_C, TextBounce) == 0x000F30, "Member 'USimpleFeatured_YellowButton_C::TextBounce' has a wrong offset!");
static_assert(offsetof(USimpleFeatured_YellowButton_C, Hover) == 0x000F38, "Member 'USimpleFeatured_YellowButton_C::Hover' has a wrong offset!");
static_assert(offsetof(USimpleFeatured_YellowButton_C, Border_Container) == 0x000F40, "Member 'USimpleFeatured_YellowButton_C::Border_Container' has a wrong offset!");
static_assert(offsetof(USimpleFeatured_YellowButton_C, ButtonBacking) == 0x000F48, "Member 'USimpleFeatured_YellowButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(USimpleFeatured_YellowButton_C, Text_ButtonAction) == 0x000F50, "Member 'USimpleFeatured_YellowButton_C::Text_ButtonAction' has a wrong offset!");
static_assert(offsetof(USimpleFeatured_YellowButton_C, Text_SecondaryText) == 0x000F58, "Member 'USimpleFeatured_YellowButton_C::Text_SecondaryText' has a wrong offset!");
static_assert(offsetof(USimpleFeatured_YellowButton_C, Button_Description) == 0x000F60, "Member 'USimpleFeatured_YellowButton_C::Button_Description' has a wrong offset!");

}

