#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlateCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SlateCore.ECheckBoxState
// NumValues: 0x0003
enum class ECheckBoxState : uint8
{
	Unchecked                                = 0,
	Checked                                  = 1,
	Undetermined                             = 2,
};

// Enum SlateCore.EWidgetClipping
// NumValues: 0x0005
enum class EWidgetClipping : uint8
{
	Inherit                                  = 0,
	ClipToBounds                             = 1,
	ClipToBoundsWithoutIntersecting          = 2,
	ClipToBoundsAlways                       = 3,
	OnDemand                                 = 4,
};

// Enum SlateCore.ESlateBrushImageType
// NumValues: 0x0004
enum class ESlateBrushImageType : uint8
{
	NoImage                                  = 0,
	FullColor                                = 1,
	Linear                                   = 2,
	Vector                                   = 3,
};

// Enum SlateCore.ESlateBrushMirrorType
// NumValues: 0x0004
enum class ESlateBrushMirrorType : uint8
{
	NoMirror                                 = 0,
	Horizontal                               = 1,
	Vertical                                 = 2,
	Both                                     = 3,
};

// Enum SlateCore.ESlateBrushTileType
// NumValues: 0x0004
enum class ESlateBrushTileType : uint8
{
	NoTile                                   = 0,
	Horizontal                               = 1,
	Vertical                                 = 2,
	Both                                     = 3,
};

// Enum SlateCore.ESlateBrushDrawType
// NumValues: 0x0005
enum class ESlateBrushDrawType : uint8
{
	NoDrawType                               = 0,
	Box                                      = 1,
	Border                                   = 2,
	Image                                    = 3,
	RoundedBox                               = 4,
};

// Enum SlateCore.ESlateBrushRoundingType
// NumValues: 0x0002
enum class ESlateBrushRoundingType : uint8
{
	FixedRadius                              = 0,
	HalfHeightRadius                         = 1,
};

// Enum SlateCore.ESlateColorStylingMode
// NumValues: 0x0005
enum class ESlateColorStylingMode : uint8
{
	UseColor_Specified                       = 0,
	UseColor_ColorTable                      = 1,
	UseColor_Foreground                      = 2,
	UseColor_Foreground_Subdued              = 3,
	UseColor_UseStyle                        = 4,
};

// Enum SlateCore.EUINavigationRule
// NumValues: 0x0007
enum class EUINavigationRule : uint8
{
	Escape                                   = 0,
	Explicit                                 = 1,
	Wrap                                     = 2,
	Stop                                     = 3,
	Custom                                   = 4,
	CustomBoundary                           = 5,
	Invalid                                  = 6,
};

// Enum SlateCore.EUINavigation
// NumValues: 0x0008
enum class EUINavigation : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	Up                                       = 2,
	Down                                     = 3,
	Next                                     = 4,
	Previous                                 = 5,
	Num                                      = 6,
	Invalid                                  = 7,
};

// Enum SlateCore.EFlowDirectionPreference
// NumValues: 0x0004
enum class EFlowDirectionPreference : uint8
{
	Inherit                                  = 0,
	Culture                                  = 1,
	LeftToRight                              = 2,
	RightToLeft                              = 3,
};

// Enum SlateCore.ESelectInfo
// NumValues: 0x0004
enum class ESelectInfo : uint8
{
	OnKeyPress                               = 0,
	OnNavigation                             = 1,
	OnMouseClick                             = 2,
	Direct                                   = 3,
};

// Enum SlateCore.EVerticalAlignment
// NumValues: 0x0004
enum class EVerticalAlignment : uint8
{
	VAlign_Fill                              = 0,
	VAlign_Top                               = 1,
	VAlign_Center                            = 2,
	VAlign_Bottom                            = 3,
};

// Enum SlateCore.ETextCommit
// NumValues: 0x0004
enum class ETextCommit : uint8
{
	Default                                  = 0,
	OnEnter                                  = 1,
	OnUserMovedFocus                         = 2,
	OnCleared                                = 3,
};

// Enum SlateCore.ETextOverflowPolicy
// NumValues: 0x0002
enum class ETextOverflowPolicy : uint8
{
	Clip                                     = 0,
	Ellipsis                                 = 1,
};

// Enum SlateCore.ETextShapingMethod
// NumValues: 0x0003
enum class ETextShapingMethod : uint8
{
	Auto                                     = 0,
	KerningOnly                              = 1,
	FullShaping                              = 2,
};

// Enum SlateCore.ETextTransformPolicy
// NumValues: 0x0003
enum class ETextTransformPolicy : uint8
{
	None                                     = 0,
	ToLower                                  = 1,
	ToUpper                                  = 2,
};

// Enum SlateCore.EMenuPlacement
// NumValues: 0x000D
enum class EMenuPlacement : uint8
{
	MenuPlacement_BelowAnchor                = 0,
	MenuPlacement_CenteredBelowAnchor        = 1,
	MenuPlacement_BelowRightAnchor           = 2,
	MenuPlacement_ComboBox                   = 3,
	MenuPlacement_ComboBoxRight              = 4,
	MenuPlacement_MenuRight                  = 5,
	MenuPlacement_AboveAnchor                = 6,
	MenuPlacement_CenteredAboveAnchor        = 7,
	MenuPlacement_AboveRightAnchor           = 8,
	MenuPlacement_MenuLeft                   = 9,
	MenuPlacement_Center                     = 10,
	MenuPlacement_RightLeftCenter            = 11,
	MenuPlacement_MatchBottomLeft            = 12,
};

// Enum SlateCore.EColorVisionDeficiency
// NumValues: 0x0004
enum class EColorVisionDeficiency : uint8
{
	NormalVision                             = 0,
	Deuteranope                              = 1,
	Protanope                                = 2,
	Tritanope                                = 3,
};

// Enum SlateCore.EHorizontalAlignment
// NumValues: 0x0004
enum class EHorizontalAlignment : uint8
{
	HAlign_Fill                              = 0,
	HAlign_Left                              = 1,
	HAlign_Center                            = 2,
	HAlign_Right                             = 3,
};

// Enum SlateCore.EButtonClickMethod
// NumValues: 0x0004
enum class EButtonClickMethod : uint8
{
	DownAndUp                                = 0,
	MouseDown                                = 1,
	MouseUp                                  = 2,
	PreciseClick                             = 3,
};

// Enum SlateCore.EButtonPressMethod
// NumValues: 0x0003
enum class EButtonPressMethod : uint8
{
	DownAndUp                                = 0,
	ButtonPress                              = 1,
	ButtonRelease                            = 2,
};

// Enum SlateCore.EButtonTouchMethod
// NumValues: 0x0003
enum class EButtonTouchMethod : uint8
{
	DownAndUp                                = 0,
	Down                                     = 1,
	PreciseTap                               = 2,
};

// Enum SlateCore.EFontHinting
// NumValues: 0x0005
enum class EFontHinting : uint8
{
	Default                                  = 0,
	Auto                                     = 1,
	AutoLight                                = 2,
	Monochrome                               = 3,
	None                                     = 4,
};

// Enum SlateCore.EFontLoadingPolicy
// NumValues: 0x0003
enum class EFontLoadingPolicy : uint8
{
	LazyLoad                                 = 0,
	Stream                                   = 1,
	Inline                                   = 2,
};

// Enum SlateCore.EFontLayoutMethod
// NumValues: 0x0002
enum class EFontLayoutMethod : uint8
{
	Metrics                                  = 0,
	BoundingBox                              = 1,
};

// Enum SlateCore.EFocusCause
// NumValues: 0x0006
enum class EFocusCause : uint8
{
	Mouse                                    = 0,
	Navigation                               = 1,
	SetDirectly                              = 2,
	Cleared                                  = 3,
	OtherWidgetLostFocus                     = 4,
	WindowActivate                           = 5,
};

// Enum SlateCore.ESlateDebuggingInputEvent
// NumValues: 0x001B
enum class ESlateDebuggingInputEvent : uint8
{
	MouseMove                                = 0,
	MouseEnter                               = 1,
	MouseLeave                               = 2,
	PreviewMouseButtonDown                   = 3,
	MouseButtonDown                          = 4,
	MouseButtonUp                            = 5,
	MouseButtonDoubleClick                   = 6,
	MouseWheel                               = 7,
	TouchStart                               = 8,
	TouchEnd                                 = 9,
	TouchForceChanged                        = 10,
	TouchFirstMove                           = 11,
	TouchMoved                               = 12,
	DragDetected                             = 13,
	DragEnter                                = 14,
	DragLeave                                = 15,
	DragOver                                 = 16,
	DragDrop                                 = 17,
	DropMessage                              = 18,
	PreviewKeyDown                           = 19,
	KeyDown                                  = 20,
	KeyUp                                    = 21,
	KeyChar                                  = 22,
	AnalogInput                              = 23,
	TouchGesture                             = 24,
	MotionDetected                           = 25,
	MAX                                      = 26,
};

// Enum SlateCore.ESlateDebuggingStateChangeEvent
// NumValues: 0x0002
enum class ESlateDebuggingStateChangeEvent : uint8
{
	MouseCaptureGained                       = 0,
	MouseCaptureLost                         = 1,
};

// Enum SlateCore.ESlateDebuggingNavigationMethod
// NumValues: 0x0006
enum class ESlateDebuggingNavigationMethod : uint8
{
	Unknown                                  = 0,
	Explicit                                 = 1,
	CustomDelegateBound                      = 2,
	CustomDelegateUnbound                    = 3,
	NextOrPrevious                           = 4,
	HitTestGrid                              = 5,
};

// Enum SlateCore.ESlateDebuggingFocusEvent
// NumValues: 0x0004
enum class ESlateDebuggingFocusEvent : uint8
{
	FocusChanging                            = 0,
	FocusLost                                = 1,
	FocusReceived                            = 2,
	MAX                                      = 3,
};

// Enum SlateCore.EUINavigationAction
// NumValues: 0x0004
enum class EUINavigationAction : uint8
{
	Accept                                   = 0,
	Back                                     = 1,
	Num                                      = 2,
	Invalid                                  = 3,
};

// Enum SlateCore.ENavigationSource
// NumValues: 0x0002
enum class ENavigationSource : uint8
{
	FocusedWidget                            = 0,
	WidgetUnderCursor                        = 1,
};

// Enum SlateCore.ENavigationGenesis
// NumValues: 0x0003
enum class ENavigationGenesis : uint8
{
	Keyboard                                 = 0,
	Controller                               = 1,
	User                                     = 2,
};

// Enum SlateCore.EOrientation
// NumValues: 0x0002
enum class EOrientation : uint8
{
	Orient_Horizontal                        = 0,
	Orient_Vertical                          = 1,
};

// Enum SlateCore.EScrollDirection
// NumValues: 0x0002
enum class EScrollDirection : uint8
{
	Scroll_Down                              = 0,
	Scroll_Up                                = 1,
};

// Enum SlateCore.EConsumeMouseWheel
// NumValues: 0x0003
enum class EConsumeMouseWheel : uint8
{
	WhenScrollingPossible                    = 0,
	Always                                   = 1,
	Never                                    = 2,
};

// Enum SlateCore.ESlateParentWindowSearchMethod
// NumValues: 0x0002
enum class ESlateParentWindowSearchMethod : uint8
{
	ActiveWindow                             = 0,
	MainWindow                               = 1,
};

// Enum SlateCore.ESlateCheckBoxType
// NumValues: 0x0002
enum class ESlateCheckBoxType : uint8
{
	CheckBox                                 = 0,
	ToggleButton                             = 1,
};

// Enum SlateCore.EStyleColor
// NumValues: 0x003E
enum class EStyleColor : uint8
{
	Black                                    = 0,
	Background                               = 1,
	Title                                    = 2,
	WindowBorder                             = 3,
	Foldout                                  = 4,
	Input                                    = 5,
	InputOutline                             = 6,
	Recessed                                 = 7,
	Panel                                    = 8,
	Header                                   = 9,
	Dropdown                                 = 10,
	DropdownOutline                          = 11,
	Hover                                    = 12,
	Hover2                                   = 13,
	White                                    = 14,
	White25                                  = 15,
	Highlight                                = 16,
	Primary                                  = 17,
	PrimaryHover                             = 18,
	PrimaryPress                             = 19,
	Secondary                                = 20,
	Foreground                               = 21,
	ForegroundHover                          = 22,
	ForegroundInverted                       = 23,
	ForegroundHeader                         = 24,
	Select                                   = 25,
	SelectInactive                           = 26,
	SelectParent                             = 27,
	SelectHover                              = 28,
	Notifications                            = 29,
	AccentBlue                               = 30,
	AccentPurple                             = 31,
	AccentPink                               = 32,
	AccentRed                                = 33,
	AccentOrange                             = 34,
	AccentYellow                             = 35,
	AccentGreen                              = 36,
	AccentBrown                              = 37,
	AccentBlack                              = 38,
	AccentGray                               = 39,
	AccentWhite                              = 40,
	AccentFolder                             = 41,
	Warning                                  = 42,
	Error                                    = 43,
	Success                                  = 44,
	User1                                    = 45,
	User2                                    = 46,
	User3                                    = 47,
	User4                                    = 48,
	User5                                    = 49,
	User6                                    = 50,
	User7                                    = 51,
	User8                                    = 52,
	User9                                    = 53,
	User10                                   = 54,
	User11                                   = 55,
	User12                                   = 56,
	User13                                   = 57,
	User14                                   = 58,
	User15                                   = 59,
	User16                                   = 60,
	MAX                                      = 61,
};

// ScriptStruct SlateCore.FontData
// 0x0028 (0x0028 - 0x0000)
struct FFontData final
{
public:
	class FString                                 FontFilename;                                      // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10[0x4];                                       // 0x0010(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	EFontHinting                                  Hinting;                                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFontLoadingPolicy                            LoadingPolicy;                                     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubFaceIndex;                                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                FontFaceAsset;                                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FFontData) == 0x000008, "Wrong alignment on FFontData");
static_assert(sizeof(FFontData) == 0x000028, "Wrong size on FFontData");
static_assert(offsetof(FFontData, FontFilename) == 0x000000, "Member 'FFontData::FontFilename' has a wrong offset!");
static_assert(offsetof(FFontData, Hinting) == 0x000014, "Member 'FFontData::Hinting' has a wrong offset!");
static_assert(offsetof(FFontData, LoadingPolicy) == 0x000015, "Member 'FFontData::LoadingPolicy' has a wrong offset!");
static_assert(offsetof(FFontData, SubFaceIndex) == 0x000018, "Member 'FFontData::SubFaceIndex' has a wrong offset!");
static_assert(offsetof(FFontData, FontFaceAsset) == 0x000020, "Member 'FFontData::FontFaceAsset' has a wrong offset!");

// ScriptStruct SlateCore.Geometry
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x04) FGeometry final
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGeometry) == 0x000004, "Wrong alignment on FGeometry");
static_assert(sizeof(FGeometry) == 0x000038, "Wrong size on FGeometry");

// ScriptStruct SlateCore.SlateSound
// 0x0018 (0x0018 - 0x0000)
struct FSlateSound final
{
public:
	class UObject*                                ResourceObject;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSlateSound) == 0x000008, "Wrong alignment on FSlateSound");
static_assert(sizeof(FSlateSound) == 0x000018, "Wrong size on FSlateSound");
static_assert(offsetof(FSlateSound, ResourceObject) == 0x000000, "Member 'FSlateSound::ResourceObject' has a wrong offset!");

// ScriptStruct SlateCore.Margin
// 0x0010 (0x0010 - 0x0000)
struct FMargin final
{
public:
	float                                         Left;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Top;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Right;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Bottom;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMargin) == 0x000004, "Wrong alignment on FMargin");
static_assert(sizeof(FMargin) == 0x000010, "Wrong size on FMargin");
static_assert(offsetof(FMargin, Left) == 0x000000, "Member 'FMargin::Left' has a wrong offset!");
static_assert(offsetof(FMargin, Top) == 0x000004, "Member 'FMargin::Top' has a wrong offset!");
static_assert(offsetof(FMargin, Right) == 0x000008, "Member 'FMargin::Right' has a wrong offset!");
static_assert(offsetof(FMargin, Bottom) == 0x00000C, "Member 'FMargin::Bottom' has a wrong offset!");

// ScriptStruct SlateCore.SlateColor
// 0x0014 (0x0014 - 0x0000)
struct FSlateColor final
{
public:
	struct FLinearColor                           SpecifiedColor;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateColorStylingMode                        ColorUseRule;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSlateColor) == 0x000004, "Wrong alignment on FSlateColor");
static_assert(sizeof(FSlateColor) == 0x000014, "Wrong size on FSlateColor");
static_assert(offsetof(FSlateColor, SpecifiedColor) == 0x000000, "Member 'FSlateColor::SpecifiedColor' has a wrong offset!");
static_assert(offsetof(FSlateColor, ColorUseRule) == 0x000010, "Member 'FSlateColor::ColorUseRule' has a wrong offset!");

// ScriptStruct SlateCore.SlateBrushOutlineSettings
// 0x0030 (0x0030 - 0x0000)
struct FSlateBrushOutlineSettings final
{
public:
	struct FVector4                               CornerRadii;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            Color;                                             // 0x0010(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushRoundingType                       RoundingType;                                      // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSlateBrushOutlineSettings) == 0x000010, "Wrong alignment on FSlateBrushOutlineSettings");
static_assert(sizeof(FSlateBrushOutlineSettings) == 0x000030, "Wrong size on FSlateBrushOutlineSettings");
static_assert(offsetof(FSlateBrushOutlineSettings, CornerRadii) == 0x000000, "Member 'FSlateBrushOutlineSettings::CornerRadii' has a wrong offset!");
static_assert(offsetof(FSlateBrushOutlineSettings, Color) == 0x000010, "Member 'FSlateBrushOutlineSettings::Color' has a wrong offset!");
static_assert(offsetof(FSlateBrushOutlineSettings, Width) == 0x000024, "Member 'FSlateBrushOutlineSettings::Width' has a wrong offset!");
static_assert(offsetof(FSlateBrushOutlineSettings, RoundingType) == 0x000028, "Member 'FSlateBrushOutlineSettings::RoundingType' has a wrong offset!");

// ScriptStruct SlateCore.SlateBrush
// 0x00B0 (0x00B0 - 0x0000)
struct FSlateBrush final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ImageSize;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                Margin;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateColor                            TintColor;                                         // 0x0028(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrushOutlineSettings             OutlineSettings;                                   // 0x0040(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UObject*                                ResourceObject;                                    // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ResourceName;                                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBox2D                                 UVRegion;                                          // 0x0080(0x0014)(ZeroConstructor, NoDestructor, Protected, NativeAccessSpecifierProtected)
	ESlateBrushDrawType                           DrawAs;                                            // 0x0094(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushTileType                           Tiling;                                            // 0x0095(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushMirrorType                         Mirroring;                                         // 0x0096(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushImageType                          ImageType;                                         // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x10];                                      // 0x0098(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bIsDynamicallyLoaded : 1;                          // 0x00A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bHasUObject : 1;                                   // 0x00A8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Deprecated, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSlateBrush) == 0x000010, "Wrong alignment on FSlateBrush");
static_assert(sizeof(FSlateBrush) == 0x0000B0, "Wrong size on FSlateBrush");
static_assert(offsetof(FSlateBrush, ImageSize) == 0x000010, "Member 'FSlateBrush::ImageSize' has a wrong offset!");
static_assert(offsetof(FSlateBrush, Margin) == 0x000018, "Member 'FSlateBrush::Margin' has a wrong offset!");
static_assert(offsetof(FSlateBrush, TintColor) == 0x000028, "Member 'FSlateBrush::TintColor' has a wrong offset!");
static_assert(offsetof(FSlateBrush, OutlineSettings) == 0x000040, "Member 'FSlateBrush::OutlineSettings' has a wrong offset!");
static_assert(offsetof(FSlateBrush, ResourceObject) == 0x000070, "Member 'FSlateBrush::ResourceObject' has a wrong offset!");
static_assert(offsetof(FSlateBrush, ResourceName) == 0x000078, "Member 'FSlateBrush::ResourceName' has a wrong offset!");
static_assert(offsetof(FSlateBrush, UVRegion) == 0x000080, "Member 'FSlateBrush::UVRegion' has a wrong offset!");
static_assert(offsetof(FSlateBrush, DrawAs) == 0x000094, "Member 'FSlateBrush::DrawAs' has a wrong offset!");
static_assert(offsetof(FSlateBrush, Tiling) == 0x000095, "Member 'FSlateBrush::Tiling' has a wrong offset!");
static_assert(offsetof(FSlateBrush, Mirroring) == 0x000096, "Member 'FSlateBrush::Mirroring' has a wrong offset!");
static_assert(offsetof(FSlateBrush, ImageType) == 0x000097, "Member 'FSlateBrush::ImageType' has a wrong offset!");

// ScriptStruct SlateCore.SlateWidgetStyle
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSlateWidgetStyle
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSlateWidgetStyle) == 0x000008, "Wrong alignment on FSlateWidgetStyle");
static_assert(sizeof(FSlateWidgetStyle) == 0x000008, "Wrong size on FSlateWidgetStyle");

// ScriptStruct SlateCore.ScrollBarStyle
// 0x0648 (0x0650 - 0x0008)
struct FScrollBarStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            HorizontalBackgroundImage;                         // 0x0010(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            VerticalBackgroundImage;                           // 0x00C0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            VerticalTopSlotImage;                              // 0x0170(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HorizontalTopSlotImage;                            // 0x0220(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            VerticalBottomSlotImage;                           // 0x02D0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HorizontalBottomSlotImage;                         // 0x0380(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            NormalThumbImage;                                  // 0x0430(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HoveredThumbImage;                                 // 0x04E0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DraggedThumbImage;                                 // 0x0590(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         Thickness;                                         // 0x0640(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_644[0xC];                                      // 0x0644(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FScrollBarStyle) == 0x000010, "Wrong alignment on FScrollBarStyle");
static_assert(sizeof(FScrollBarStyle) == 0x000650, "Wrong size on FScrollBarStyle");
static_assert(offsetof(FScrollBarStyle, HorizontalBackgroundImage) == 0x000010, "Member 'FScrollBarStyle::HorizontalBackgroundImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, VerticalBackgroundImage) == 0x0000C0, "Member 'FScrollBarStyle::VerticalBackgroundImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, VerticalTopSlotImage) == 0x000170, "Member 'FScrollBarStyle::VerticalTopSlotImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, HorizontalTopSlotImage) == 0x000220, "Member 'FScrollBarStyle::HorizontalTopSlotImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, VerticalBottomSlotImage) == 0x0002D0, "Member 'FScrollBarStyle::VerticalBottomSlotImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, HorizontalBottomSlotImage) == 0x000380, "Member 'FScrollBarStyle::HorizontalBottomSlotImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, NormalThumbImage) == 0x000430, "Member 'FScrollBarStyle::NormalThumbImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, HoveredThumbImage) == 0x0004E0, "Member 'FScrollBarStyle::HoveredThumbImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, DraggedThumbImage) == 0x000590, "Member 'FScrollBarStyle::DraggedThumbImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, Thickness) == 0x000640, "Member 'FScrollBarStyle::Thickness' has a wrong offset!");

// ScriptStruct SlateCore.FontOutlineSettings
// 0x0020 (0x0020 - 0x0000)
struct FFontOutlineSettings final
{
public:
	int32                                         OutlineSize;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSeparateFillAlpha;                                // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyOutlineToDropShadows;                        // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                OutlineMaterial;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OutlineColor;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFontOutlineSettings) == 0x000008, "Wrong alignment on FFontOutlineSettings");
static_assert(sizeof(FFontOutlineSettings) == 0x000020, "Wrong size on FFontOutlineSettings");
static_assert(offsetof(FFontOutlineSettings, OutlineSize) == 0x000000, "Member 'FFontOutlineSettings::OutlineSize' has a wrong offset!");
static_assert(offsetof(FFontOutlineSettings, bSeparateFillAlpha) == 0x000004, "Member 'FFontOutlineSettings::bSeparateFillAlpha' has a wrong offset!");
static_assert(offsetof(FFontOutlineSettings, bApplyOutlineToDropShadows) == 0x000005, "Member 'FFontOutlineSettings::bApplyOutlineToDropShadows' has a wrong offset!");
static_assert(offsetof(FFontOutlineSettings, OutlineMaterial) == 0x000008, "Member 'FFontOutlineSettings::OutlineMaterial' has a wrong offset!");
static_assert(offsetof(FFontOutlineSettings, OutlineColor) == 0x000010, "Member 'FFontOutlineSettings::OutlineColor' has a wrong offset!");

// ScriptStruct SlateCore.SlateFontInfo
// 0x0058 (0x0058 - 0x0000)
struct FSlateFontInfo final
{
public:
	class UObject*                                FontObject;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                FontMaterial;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFontOutlineSettings                   OutlineSettings;                                   // 0x0010(0x0020)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TypefaceFontName;                                  // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Size;                                              // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LetterSpacing;                                     // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSlateFontInfo) == 0x000008, "Wrong alignment on FSlateFontInfo");
static_assert(sizeof(FSlateFontInfo) == 0x000058, "Wrong size on FSlateFontInfo");
static_assert(offsetof(FSlateFontInfo, FontObject) == 0x000000, "Member 'FSlateFontInfo::FontObject' has a wrong offset!");
static_assert(offsetof(FSlateFontInfo, FontMaterial) == 0x000008, "Member 'FSlateFontInfo::FontMaterial' has a wrong offset!");
static_assert(offsetof(FSlateFontInfo, OutlineSettings) == 0x000010, "Member 'FSlateFontInfo::OutlineSettings' has a wrong offset!");
static_assert(offsetof(FSlateFontInfo, TypefaceFontName) == 0x000040, "Member 'FSlateFontInfo::TypefaceFontName' has a wrong offset!");
static_assert(offsetof(FSlateFontInfo, Size) == 0x000048, "Member 'FSlateFontInfo::Size' has a wrong offset!");
static_assert(offsetof(FSlateFontInfo, LetterSpacing) == 0x00004C, "Member 'FSlateFontInfo::LetterSpacing' has a wrong offset!");

// ScriptStruct SlateCore.EditableTextBoxStyle
// 0x09F8 (0x0A00 - 0x0008)
struct FEditableTextBoxStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            BackgroundImageNormal;                             // 0x0010(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundImageHovered;                            // 0x00C0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundImageFocused;                            // 0x0170(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundImageReadOnly;                           // 0x0220(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                Padding;                                           // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         Font;                                              // 0x02E0(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            ForegroundColor;                                   // 0x0338(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            BackgroundColor;                                   // 0x034C(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            ReadOnlyForegroundColor;                           // 0x0360(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            FocusedForegroundColor;                            // 0x0374(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                HScrollBarPadding;                                 // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                VScrollBarPadding;                                 // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScrollBarStyle                        ScrollBarStyle;                                    // 0x03B0(0x0650)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEditableTextBoxStyle) == 0x000010, "Wrong alignment on FEditableTextBoxStyle");
static_assert(sizeof(FEditableTextBoxStyle) == 0x000A00, "Wrong size on FEditableTextBoxStyle");
static_assert(offsetof(FEditableTextBoxStyle, BackgroundImageNormal) == 0x000010, "Member 'FEditableTextBoxStyle::BackgroundImageNormal' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, BackgroundImageHovered) == 0x0000C0, "Member 'FEditableTextBoxStyle::BackgroundImageHovered' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, BackgroundImageFocused) == 0x000170, "Member 'FEditableTextBoxStyle::BackgroundImageFocused' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, BackgroundImageReadOnly) == 0x000220, "Member 'FEditableTextBoxStyle::BackgroundImageReadOnly' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, Padding) == 0x0002D0, "Member 'FEditableTextBoxStyle::Padding' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, Font) == 0x0002E0, "Member 'FEditableTextBoxStyle::Font' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, ForegroundColor) == 0x000338, "Member 'FEditableTextBoxStyle::ForegroundColor' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, BackgroundColor) == 0x00034C, "Member 'FEditableTextBoxStyle::BackgroundColor' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, ReadOnlyForegroundColor) == 0x000360, "Member 'FEditableTextBoxStyle::ReadOnlyForegroundColor' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, FocusedForegroundColor) == 0x000374, "Member 'FEditableTextBoxStyle::FocusedForegroundColor' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, HScrollBarPadding) == 0x000388, "Member 'FEditableTextBoxStyle::HScrollBarPadding' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, VScrollBarPadding) == 0x000398, "Member 'FEditableTextBoxStyle::VScrollBarPadding' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, ScrollBarStyle) == 0x0003B0, "Member 'FEditableTextBoxStyle::ScrollBarStyle' has a wrong offset!");

// ScriptStruct SlateCore.TextBlockStyle
// 0x02D8 (0x02E0 - 0x0008)
struct FTextBlockStyle final : public FSlateWidgetStyle
{
public:
	struct FSlateFontInfo                         Font;                                              // 0x0008(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            ColorAndOpacity;                                   // 0x0060(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FVector2D                              ShadowOffset;                                      // 0x0074(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ShadowColorAndOpacity;                             // 0x007C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            SelectedBackgroundColor;                           // 0x008C(0x0014)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            HighlightColor;                                    // 0x00A0(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0xC];                                       // 0x00B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            HighlightShape;                                    // 0x00C0(0x00B0)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateBrush                            StrikeBrush;                                       // 0x0170(0x00B0)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UnderlineBrush;                                    // 0x0220(0x00B0)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	ETextTransformPolicy                          TransformPolicy;                                   // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextOverflowPolicy                           OverflowPolicy;                                    // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D2[0xE];                                      // 0x02D2(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTextBlockStyle) == 0x000010, "Wrong alignment on FTextBlockStyle");
static_assert(sizeof(FTextBlockStyle) == 0x0002E0, "Wrong size on FTextBlockStyle");
static_assert(offsetof(FTextBlockStyle, Font) == 0x000008, "Member 'FTextBlockStyle::Font' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, ColorAndOpacity) == 0x000060, "Member 'FTextBlockStyle::ColorAndOpacity' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, ShadowOffset) == 0x000074, "Member 'FTextBlockStyle::ShadowOffset' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, ShadowColorAndOpacity) == 0x00007C, "Member 'FTextBlockStyle::ShadowColorAndOpacity' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, SelectedBackgroundColor) == 0x00008C, "Member 'FTextBlockStyle::SelectedBackgroundColor' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, HighlightColor) == 0x0000A0, "Member 'FTextBlockStyle::HighlightColor' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, HighlightShape) == 0x0000C0, "Member 'FTextBlockStyle::HighlightShape' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, StrikeBrush) == 0x000170, "Member 'FTextBlockStyle::StrikeBrush' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, UnderlineBrush) == 0x000220, "Member 'FTextBlockStyle::UnderlineBrush' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, TransformPolicy) == 0x0002D0, "Member 'FTextBlockStyle::TransformPolicy' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, OverflowPolicy) == 0x0002D1, "Member 'FTextBlockStyle::OverflowPolicy' has a wrong offset!");

// ScriptStruct SlateCore.InlineEditableTextBlockStyle
// 0x0CE8 (0x0CF0 - 0x0008)
struct FInlineEditableTextBlockStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditableTextBoxStyle                  EditableTextBoxStyle;                              // 0x0010(0x0A00)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        TextStyle;                                         // 0x0A10(0x02E0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FInlineEditableTextBlockStyle) == 0x000010, "Wrong alignment on FInlineEditableTextBlockStyle");
static_assert(sizeof(FInlineEditableTextBlockStyle) == 0x000CF0, "Wrong size on FInlineEditableTextBlockStyle");
static_assert(offsetof(FInlineEditableTextBlockStyle, EditableTextBoxStyle) == 0x000010, "Member 'FInlineEditableTextBlockStyle::EditableTextBoxStyle' has a wrong offset!");
static_assert(offsetof(FInlineEditableTextBlockStyle, TextStyle) == 0x000A10, "Member 'FInlineEditableTextBlockStyle::TextStyle' has a wrong offset!");

// ScriptStruct SlateCore.InputEvent
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FInputEvent
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FInputEvent) == 0x000008, "Wrong alignment on FInputEvent");
static_assert(sizeof(FInputEvent) == 0x000018, "Wrong size on FInputEvent");

// ScriptStruct SlateCore.PointerEvent
// 0x0058 (0x0070 - 0x0018)
struct FPointerEvent final : public FInputEvent
{
public:
	uint8                                         Pad_18[0x58];                                      // 0x0018(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPointerEvent) == 0x000008, "Wrong alignment on FPointerEvent");
static_assert(sizeof(FPointerEvent) == 0x000070, "Wrong size on FPointerEvent");

// ScriptStruct SlateCore.SplitterStyle
// 0x0168 (0x0170 - 0x0008)
struct FSplitterStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            HandleNormalBrush;                                 // 0x0010(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HandleHighlightBrush;                              // 0x00C0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSplitterStyle) == 0x000010, "Wrong alignment on FSplitterStyle");
static_assert(sizeof(FSplitterStyle) == 0x000170, "Wrong size on FSplitterStyle");
static_assert(offsetof(FSplitterStyle, HandleNormalBrush) == 0x000010, "Member 'FSplitterStyle::HandleNormalBrush' has a wrong offset!");
static_assert(offsetof(FSplitterStyle, HandleHighlightBrush) == 0x0000C0, "Member 'FSplitterStyle::HandleHighlightBrush' has a wrong offset!");

// ScriptStruct SlateCore.ButtonStyle
// 0x0368 (0x0370 - 0x0008)
struct FButtonStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Normal;                                            // 0x0010(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Hovered;                                           // 0x00C0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Pressed;                                           // 0x0170(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Disabled;                                          // 0x0220(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            NormalForeground;                                  // 0x02D0(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            HoveredForeground;                                 // 0x02E4(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            PressedForeground;                                 // 0x02F8(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            DisabledForeground;                                // 0x030C(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FMargin                                NormalPadding;                                     // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                PressedPadding;                                    // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            PressedSlateSound;                                 // 0x0340(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            HoveredSlateSound;                                 // 0x0358(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FButtonStyle) == 0x000010, "Wrong alignment on FButtonStyle");
static_assert(sizeof(FButtonStyle) == 0x000370, "Wrong size on FButtonStyle");
static_assert(offsetof(FButtonStyle, Normal) == 0x000010, "Member 'FButtonStyle::Normal' has a wrong offset!");
static_assert(offsetof(FButtonStyle, Hovered) == 0x0000C0, "Member 'FButtonStyle::Hovered' has a wrong offset!");
static_assert(offsetof(FButtonStyle, Pressed) == 0x000170, "Member 'FButtonStyle::Pressed' has a wrong offset!");
static_assert(offsetof(FButtonStyle, Disabled) == 0x000220, "Member 'FButtonStyle::Disabled' has a wrong offset!");
static_assert(offsetof(FButtonStyle, NormalForeground) == 0x0002D0, "Member 'FButtonStyle::NormalForeground' has a wrong offset!");
static_assert(offsetof(FButtonStyle, HoveredForeground) == 0x0002E4, "Member 'FButtonStyle::HoveredForeground' has a wrong offset!");
static_assert(offsetof(FButtonStyle, PressedForeground) == 0x0002F8, "Member 'FButtonStyle::PressedForeground' has a wrong offset!");
static_assert(offsetof(FButtonStyle, DisabledForeground) == 0x00030C, "Member 'FButtonStyle::DisabledForeground' has a wrong offset!");
static_assert(offsetof(FButtonStyle, NormalPadding) == 0x000320, "Member 'FButtonStyle::NormalPadding' has a wrong offset!");
static_assert(offsetof(FButtonStyle, PressedPadding) == 0x000330, "Member 'FButtonStyle::PressedPadding' has a wrong offset!");
static_assert(offsetof(FButtonStyle, PressedSlateSound) == 0x000340, "Member 'FButtonStyle::PressedSlateSound' has a wrong offset!");
static_assert(offsetof(FButtonStyle, HoveredSlateSound) == 0x000358, "Member 'FButtonStyle::HoveredSlateSound' has a wrong offset!");

// ScriptStruct SlateCore.ComboButtonStyle
// 0x0538 (0x0540 - 0x0008)
struct FComboButtonStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           ButtonStyle;                                       // 0x0010(0x0370)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DownArrowImage;                                    // 0x0380(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FVector2D                              ShadowOffset;                                      // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ShadowColorAndOpacity;                             // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            MenuBorderBrush;                                   // 0x0450(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                MenuBorderPadding;                                 // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ContentPadding;                                    // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                DownArrowPadding;                                  // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EVerticalAlignment                            DownArrowAlign;                                    // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_531[0xF];                                      // 0x0531(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FComboButtonStyle) == 0x000010, "Wrong alignment on FComboButtonStyle");
static_assert(sizeof(FComboButtonStyle) == 0x000540, "Wrong size on FComboButtonStyle");
static_assert(offsetof(FComboButtonStyle, ButtonStyle) == 0x000010, "Member 'FComboButtonStyle::ButtonStyle' has a wrong offset!");
static_assert(offsetof(FComboButtonStyle, DownArrowImage) == 0x000380, "Member 'FComboButtonStyle::DownArrowImage' has a wrong offset!");
static_assert(offsetof(FComboButtonStyle, ShadowOffset) == 0x000430, "Member 'FComboButtonStyle::ShadowOffset' has a wrong offset!");
static_assert(offsetof(FComboButtonStyle, ShadowColorAndOpacity) == 0x000438, "Member 'FComboButtonStyle::ShadowColorAndOpacity' has a wrong offset!");
static_assert(offsetof(FComboButtonStyle, MenuBorderBrush) == 0x000450, "Member 'FComboButtonStyle::MenuBorderBrush' has a wrong offset!");
static_assert(offsetof(FComboButtonStyle, MenuBorderPadding) == 0x000500, "Member 'FComboButtonStyle::MenuBorderPadding' has a wrong offset!");
static_assert(offsetof(FComboButtonStyle, ContentPadding) == 0x000510, "Member 'FComboButtonStyle::ContentPadding' has a wrong offset!");
static_assert(offsetof(FComboButtonStyle, DownArrowPadding) == 0x000520, "Member 'FComboButtonStyle::DownArrowPadding' has a wrong offset!");
static_assert(offsetof(FComboButtonStyle, DownArrowAlign) == 0x000530, "Member 'FComboButtonStyle::DownArrowAlign' has a wrong offset!");

// ScriptStruct SlateCore.TypefaceEntry
// 0x0030 (0x0030 - 0x0000)
struct FTypefaceEntry final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFontData                              Font;                                              // 0x0008(0x0028)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTypefaceEntry) == 0x000008, "Wrong alignment on FTypefaceEntry");
