#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlidingLayerAnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct SlidingLayerAnimBP.SlidingLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01E7 (0x01E8 - 0x0001)
struct SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            ObjectProperty_273;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ERefPoseType                                  ByteProperty_274;                                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            ObjectProperty_275;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_276;                                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 ArrayProperty_277;                                 // 0x0028(0x0010)()
	class UAnimSequenceBase*                      ObjectProperty_278;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_279;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_280;                                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_281;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_282;                                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_283;                                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_284;                                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_285;                                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_286;                                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_287;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BoolProperty_288;                                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_289;                                  // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          ObjectProperty_290;                                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            ObjectProperty_291;                                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             EnumProperty_292;                                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      EnumProperty_293;                                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ArrayProperty_294;                                 // 0x00B0(0x0010)()
	class FName                                   NameProperty_295;                                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_296;                                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          StructProperty_297;                                // 0x00CC(0x002C)(NoDestructor)
	float                                         FloatProperty_298;                                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_299;                                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BoolProperty_300;                                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               EnumProperty_301;                                  // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                ByteProperty_302;                                  // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x1];                                      // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_303;                                  // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_304;                                  // 0x0114(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   StructProperty_305;                                // 0x0120(0x0020)(NoDestructor)
	class FName                                   NameProperty_306;                                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_307;                                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0150(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01D0(0x0018)()
};
static_assert(alignof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001E8, "Wrong size on SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_273) == 0x000008, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_273' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ByteProperty_274) == 0x000010, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ByteProperty_274' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_275) == 0x000018, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_275' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_276) == 0x000020, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_276' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_277) == 0x000028, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_277' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_278) == 0x000038, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_278' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_279) == 0x000040, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_279' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_280) == 0x000048, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_280' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_281) == 0x000050, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_281' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_282) == 0x000058, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_282' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_283) == 0x000060, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_283' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_284) == 0x000068, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_284' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_285) == 0x000070, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_285' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_286) == 0x000078, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_286' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_287) == 0x000080, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_287' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_288) == 0x000088, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_288' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_289) == 0x00008C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_289' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_290) == 0x000098, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_290' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_291) == 0x0000A0, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_291' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_292) == 0x0000A8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_292' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_293) == 0x0000A9, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_293' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_294) == 0x0000B0, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_294' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_295) == 0x0000C0, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_295' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_296) == 0x0000C8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_296' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_297) == 0x0000CC, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_297' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_298) == 0x0000F8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_298' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_299) == 0x000100, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_299' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_300) == 0x000108, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_300' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_301) == 0x000109, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_301' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, ByteProperty_302) == 0x00010A, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::ByteProperty_302' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_303) == 0x00010C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_303' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_304) == 0x000114, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_304' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_305) == 0x000120, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_305' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_306) == 0x000140, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_306' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_307) == 0x000148, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_307' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000150, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001D0, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct SlidingLayerAnimBP.SlidingLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x003F (0x0040 - 0x0001)
struct SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty;                                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_0;                                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_1;                                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_2;                                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_3;                                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_4;                                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_5;                                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_6;                                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_7;                                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_8;                                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_9;                                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_10;                                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_11;                                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_12;                                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_13;                                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000040, "Wrong size on SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, FloatProperty) == 0x000004, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::FloatProperty' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, BoolProperty_0) == 0x000008, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::BoolProperty_0' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, FloatProperty_1) == 0x00000C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::FloatProperty_1' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, BoolProperty_2) == 0x000010, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::BoolProperty_2' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, FloatProperty_3) == 0x000014, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::FloatProperty_3' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, FloatProperty_4) == 0x000018, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::FloatProperty_4' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, FloatProperty_5) == 0x00001C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::FloatProperty_5' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, FloatProperty_6) == 0x000020, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::FloatProperty_6' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, FloatProperty_7) == 0x000024, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::FloatProperty_7' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, FloatProperty_8) == 0x000028, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::FloatProperty_8' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, FloatProperty_9) == 0x00002C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::FloatProperty_9' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, FloatProperty_10) == 0x000030, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::FloatProperty_10' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, FloatProperty_11) == 0x000034, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::FloatProperty_11' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, FloatProperty_12) == 0x000038, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::FloatProperty_12' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, BoolProperty_13) == 0x00003C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::BoolProperty_13' has a wrong offset!");

}

