#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SnowSurfaceTreeBitArray

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SnowSurfaceTreeBitArray.SnowSurfaceTreeBitArray_C
// 0x0028 (0x00D8 - 0x00B0)
class USnowSurfaceTreeBitArray_C final : public UGameFrameworkComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortGameStateComponent_SurfaceOverride* SurfaceOverrideComponent;                          // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AParent_Tree_Apollo_C*                  ParentTreeApollo;                                  // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ParentActor;                                       // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Static_Mesh_Component;                             // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SnowSurfaceTreeBitArray(int32 EntryPoint);
	void IsTreeInSnow();
	void ReceiveBeginPlay();
	void S_19_Is_Tree_in_Snow(bool* InSnow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SnowSurfaceTreeBitArray_C">();
	}
	static class USnowSurfaceTreeBitArray_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USnowSurfaceTreeBitArray_C>();
	}
};
static_assert(alignof(USnowSurfaceTreeBitArray_C) == 0x000008, "Wrong alignment on USnowSurfaceTreeBitArray_C");
static_assert(sizeof(USnowSurfaceTreeBitArray_C) == 0x0000D8, "Wrong size on USnowSurfaceTreeBitArray_C");
static_assert(offsetof(USnowSurfaceTreeBitArray_C, UberGraphFrame) == 0x0000B0, "Member 'USnowSurfaceTreeBitArray_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USnowSurfaceTreeBitArray_C, SurfaceOverrideComponent) == 0x0000B8, "Member 'USnowSurfaceTreeBitArray_C::SurfaceOverrideComponent' has a wrong offset!");
static_assert(offsetof(USnowSurfaceTreeBitArray_C, ParentTreeApollo) == 0x0000C0, "Member 'USnowSurfaceTreeBitArray_C::ParentTreeApollo' has a wrong offset!");
static_assert(offsetof(USnowSurfaceTreeBitArray_C, ParentActor) == 0x0000C8, "Member 'USnowSurfaceTreeBitArray_C::ParentActor' has a wrong offset!");
static_assert(offsetof(USnowSurfaceTreeBitArray_C, Static_Mesh_Component) == 0x0000D0, "Member 'USnowSurfaceTreeBitArray_C::Static_Mesh_Component' has a wrong offset!");

}

