#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function SocialScreen.SocialScreen_C.ExecuteUbergraph_SocialScreen
// 0x0018 (0x0018 - 0x0000)
struct SocialScreen_C_ExecuteUbergraph_SocialScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialScreen_C_ExecuteUbergraph_SocialScreen) == 0x000008, "Wrong alignment on SocialScreen_C_ExecuteUbergraph_SocialScreen");
static_assert(sizeof(SocialScreen_C_ExecuteUbergraph_SocialScreen) == 0x000018, "Wrong size on SocialScreen_C_ExecuteUbergraph_SocialScreen");
static_assert(offsetof(SocialScreen_C_ExecuteUbergraph_SocialScreen, EntryPoint) == 0x000000, "Member 'SocialScreen_C_ExecuteUbergraph_SocialScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialScreen_C_ExecuteUbergraph_SocialScreen, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'SocialScreen_C_ExecuteUbergraph_SocialScreen::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialScreen_C_ExecuteUbergraph_SocialScreen, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000008, "Member 'SocialScreen_C_ExecuteUbergraph_SocialScreen::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialScreen_C_ExecuteUbergraph_SocialScreen, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000010, "Member 'SocialScreen_C_ExecuteUbergraph_SocialScreen::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");

// Function SocialScreen.SocialScreen_C.Show Career Screen Event
// 0x0001 (0x0001 - 0x0000)
struct SocialScreen_C_Show_Career_Screen_Event final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialScreen_C_Show_Career_Screen_Event) == 0x000001, "Wrong alignment on SocialScreen_C_Show_Career_Screen_Event");
static_assert(sizeof(SocialScreen_C_Show_Career_Screen_Event) == 0x000001, "Wrong size on SocialScreen_C_Show_Career_Screen_Event");
static_assert(offsetof(SocialScreen_C_Show_Career_Screen_Event, bPassThrough) == 0x000000, "Member 'SocialScreen_C_Show_Career_Screen_Event::bPassThrough' has a wrong offset!");

}

