#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialUMG

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct SocialUMG.SocialChatMessageEntryTextStyle
// 0x0068 (0x0068 - 0x0000)
struct FSocialChatMessageEntryTextStyle final
{
public:
	struct FSlateFontInfo                         FontInfo;                                          // 0x0000(0x0058)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorAndOpacity;                                   // 0x0058(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSocialChatMessageEntryTextStyle) == 0x000008, "Wrong alignment on FSocialChatMessageEntryTextStyle");
static_assert(sizeof(FSocialChatMessageEntryTextStyle) == 0x000068, "Wrong size on FSocialChatMessageEntryTextStyle");
static_assert(offsetof(FSocialChatMessageEntryTextStyle, FontInfo) == 0x000000, "Member 'FSocialChatMessageEntryTextStyle::FontInfo' has a wrong offset!");
static_assert(offsetof(FSocialChatMessageEntryTextStyle, ColorAndOpacity) == 0x000058, "Member 'FSocialChatMessageEntryTextStyle::ColorAndOpacity' has a wrong offset!");

// ScriptStruct SocialUMG.SocialChatMessageEntryStyle
// 0x0138 (0x0138 - 0x0000)
struct FSocialChatMessageEntryStyle final
{
public:
	struct FSocialChatMessageEntryTextStyle       SenderNameStyle;                                   // 0x0000(0x0068)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSocialChatMessageEntryTextStyle       ChannelNameStyle;                                  // 0x0068(0x0068)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSocialChatMessageEntryTextStyle       MessageTextStyle;                                  // 0x00D0(0x0068)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSocialChatMessageEntryStyle) == 0x000008, "Wrong alignment on FSocialChatMessageEntryStyle");
static_assert(sizeof(FSocialChatMessageEntryStyle) == 0x000138, "Wrong size on FSocialChatMessageEntryStyle");
static_assert(offsetof(FSocialChatMessageEntryStyle, SenderNameStyle) == 0x000000, "Member 'FSocialChatMessageEntryStyle::SenderNameStyle' has a wrong offset!");
static_assert(offsetof(FSocialChatMessageEntryStyle, ChannelNameStyle) == 0x000068, "Member 'FSocialChatMessageEntryStyle::ChannelNameStyle' has a wrong offset!");
static_assert(offsetof(FSocialChatMessageEntryStyle, MessageTextStyle) == 0x0000D0, "Member 'FSocialChatMessageEntryStyle::MessageTextStyle' has a wrong offset!");

}

