#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialInteraction

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SocialUMG_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialInteraction.SocialInteraction_C
// 0x0060 (0x0FD0 - 0x0F70)
class USocialInteraction_C final : public USocialInteractionButton
{
public:
	uint8                                         Pad_F68[0x8];                                      // 0x0F68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0F78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 EncourageEpicFriend;                               // 0x0F80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InteractionIcon;                                   // 0x0F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x0F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x0F98(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x0FA8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           AddFriendColor;                                    // 0x0FB8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_SocialInteraction(int32 EntryPoint);
	void OnInteractionSet();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialInteraction_C">();
	}
	static class USocialInteraction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInteraction_C>();
	}
};
static_assert(alignof(USocialInteraction_C) == 0x000010, "Wrong alignment on USocialInteraction_C");
static_assert(sizeof(USocialInteraction_C) == 0x000FD0, "Wrong size on USocialInteraction_C");
static_assert(offsetof(USocialInteraction_C, UberGraphFrame) == 0x000F70, "Member 'USocialInteraction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialInteraction_C, OnHover) == 0x000F78, "Member 'USocialInteraction_C::OnHover' has a wrong offset!");
static_assert(offsetof(USocialInteraction_C, EncourageEpicFriend) == 0x000F80, "Member 'USocialInteraction_C::EncourageEpicFriend' has a wrong offset!");
static_assert(offsetof(USocialInteraction_C, InteractionIcon) == 0x000F88, "Member 'USocialInteraction_C::InteractionIcon' has a wrong offset!");
static_assert(offsetof(USocialInteraction_C, MenuAnchor_Actions) == 0x000F90, "Member 'USocialInteraction_C::MenuAnchor_Actions' has a wrong offset!");
static_assert(offsetof(USocialInteraction_C, EncourageEpicFriend_IdleColor) == 0x000F98, "Member 'USocialInteraction_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(USocialInteraction_C, EncourageEpicFriend_HoveredColor) == 0x000FA8, "Member 'USocialInteraction_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");
static_assert(offsetof(USocialInteraction_C, AddFriendColor) == 0x000FB8, "Member 'USocialInteraction_C::AddFriendColor' has a wrong offset!");

}

