#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialPanel.SocialPanel_C
// 0x0030 (0x04F0 - 0x04C0)
class USocialPanel_C final : public UFortSocialPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnOpened;                                          // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Back;                                        // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USocialPanel_TopBarExtension_C*         SocialPanel_TopBarExtension;                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__SocialPanel_TopBarExtension_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void ClosePanel();
	void ClosePanelAfterAnimation();
	void Destruct();
	void ExecuteUbergraph_SocialPanel(int32 EntryPoint);
	void HandleIntroEnded();
	void HandleOutroEnded();
	void OnBeginIntro();
	void OnBeginOutro();
	struct FEventReply OnMouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Play_Panel_Animation_Sound();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialPanel_C">();
	}
	static class USocialPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPanel_C>();
	}
};
static_assert(alignof(USocialPanel_C) == 0x000008, "Wrong alignment on USocialPanel_C");
static_assert(sizeof(USocialPanel_C) == 0x0004F0, "Wrong size on USocialPanel_C");
static_assert(offsetof(USocialPanel_C, UberGraphFrame) == 0x0004C0, "Member 'USocialPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialPanel_C, OnOpened) == 0x0004C8, "Member 'USocialPanel_C::OnOpened' has a wrong offset!");
static_assert(offsetof(USocialPanel_C, Image_Back) == 0x0004D0, "Member 'USocialPanel_C::Image_Back' has a wrong offset!");
static_assert(offsetof(USocialPanel_C, Lightbox) == 0x0004D8, "Member 'USocialPanel_C::Lightbox' has a wrong offset!");
static_assert(offsetof(USocialPanel_C, SafeZone_0) == 0x0004E0, "Member 'USocialPanel_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(USocialPanel_C, SocialPanel_TopBarExtension) == 0x0004E8, "Member 'USocialPanel_C::SocialPanel_TopBarExtension' has a wrong offset!");

}

