#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialButton.SocialButton_C
// 0x0070 (0x0F90 - 0x0F20)
class USocialButton_C final : public UFortSocialButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Indentifier_Outro;                                 // 0x0F28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Indentifier_Intro;                                 // 0x0F30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Grow;                                        // 0x0F38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Bounce;                                      // 0x0F40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0F48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortPlayerBanner*                      Banner_MemberBanner;                               // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0F58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                IconColor;                                         // 0x0F60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_FriendIcon;                                  // 0x0F68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LeaderIcon;                                  // 0x0F70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                NumFriendsColor;                                   // 0x0F78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerIdentifier_Bkg;                              // 0x0F80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               VariableSize;                                      // 0x0F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_SocialButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialButton_C">();
	}
	static class USocialButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialButton_C>();
	}
};
static_assert(alignof(USocialButton_C) == 0x000010, "Wrong alignment on USocialButton_C");
static_assert(sizeof(USocialButton_C) == 0x000F90, "Wrong size on USocialButton_C");
static_assert(offsetof(USocialButton_C, UberGraphFrame) == 0x000F20, "Member 'USocialButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Indentifier_Outro) == 0x000F28, "Member 'USocialButton_C::Indentifier_Outro' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Indentifier_Intro) == 0x000F30, "Member 'USocialButton_C::Indentifier_Intro' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Hover_Grow) == 0x000F38, "Member 'USocialButton_C::Hover_Grow' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Hover_Bounce) == 0x000F40, "Member 'USocialButton_C::Hover_Bounce' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Hover) == 0x000F48, "Member 'USocialButton_C::Hover' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Banner_MemberBanner) == 0x000F50, "Member 'USocialButton_C::Banner_MemberBanner' has a wrong offset!");
static_assert(offsetof(USocialButton_C, ButtonBacking) == 0x000F58, "Member 'USocialButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(USocialButton_C, IconColor) == 0x000F60, "Member 'USocialButton_C::IconColor' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Image_FriendIcon) == 0x000F68, "Member 'USocialButton_C::Image_FriendIcon' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Image_LeaderIcon) == 0x000F70, "Member 'USocialButton_C::Image_LeaderIcon' has a wrong offset!");
static_assert(offsetof(USocialButton_C, NumFriendsColor) == 0x000F78, "Member 'USocialButton_C::NumFriendsColor' has a wrong offset!");
static_assert(offsetof(USocialButton_C, PlayerIdentifier_Bkg) == 0x000F80, "Member 'USocialButton_C::PlayerIdentifier_Bkg' has a wrong offset!");
static_assert(offsetof(USocialButton_C, VariableSize) == 0x000F88, "Member 'USocialButton_C::VariableSize' has a wrong offset!");

}

