#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialButton_Sidebar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SocialButton_Sidebar.SocialButton_Sidebar_C.ExecuteUbergraph_SocialButton_Sidebar
// 0x0078 (0x0078 - 0x0000)
struct SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_1;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_SelectMaterialInstance_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_2;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar) == 0x000008, "Wrong alignment on SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar");
static_assert(sizeof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar) == 0x000078, "Wrong size on SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, EntryPoint) == 0x000000, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, K2Node_Event_IsDesignTime) == 0x000004, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, Temp_bool_Variable) == 0x000005, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, Temp_float_Variable) == 0x000008, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, Temp_float_Variable_1) == 0x00000C, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_IsMobileGame_ReturnValue) == 0x000010, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000018, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, Temp_float_Variable_2) == 0x000020, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_BooleanAND_ReturnValue) == 0x000024, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000030, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_IsMobileGame_ReturnValue_1) == 0x000038, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_GetRuntimeOptions_ReturnValue_1) == 0x000040, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_GetRuntimeOptions_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, Temp_float_Variable_3) == 0x000048, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_BooleanAND_ReturnValue_1) == 0x00004C, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_SelectMaterialInstance_ReturnValue) == 0x000050, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_SelectMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_SelectColor_ReturnValue) == 0x000058, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_IsMobileGame_ReturnValue_2) == 0x000068, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_IsMobileGame_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, Temp_bool_Variable_1) == 0x000069, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, K2Node_Select_Default) == 0x00006C, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, K2Node_Select_Default_1) == 0x000070, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::K2Node_Select_Default_1' has a wrong offset!");

// Function SocialButton_Sidebar.SocialButton_Sidebar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SocialButton_Sidebar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialButton_Sidebar_C_PreConstruct) == 0x000001, "Wrong alignment on SocialButton_Sidebar_C_PreConstruct");
static_assert(sizeof(SocialButton_Sidebar_C_PreConstruct) == 0x000001, "Wrong size on SocialButton_Sidebar_C_PreConstruct");
static_assert(offsetof(SocialButton_Sidebar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SocialButton_Sidebar_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

