#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoloButton_ViewQuest

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SoloButton_ViewQuest.SoloButton_ViewQuest_C.ExecuteUbergraph_SoloButton_ViewQuest
// 0x0048 (0x0048 - 0x0000)
struct SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUnseenQuests_ReturnValue;              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUnseenQuests_ReturnValue_1;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasUnseenQuests;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_Event_NewTriggeredAction;                   // 0x0038(0x0010)(ConstParm, NoDestructor)
};
static_assert(alignof(SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest) == 0x000008, "Wrong alignment on SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest");
static_assert(sizeof(SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest) == 0x000048, "Wrong size on SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest");
static_assert(offsetof(SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest, EntryPoint) == 0x000000, "Member 'SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest::EntryPoint' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest, Temp_bool_Variable) == 0x000004, "Member 'SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest, Temp_bool_Variable_1) == 0x000005, "Member 'SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest, CallFunc_HasUnseenQuests_ReturnValue) == 0x000006, "Member 'SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest::CallFunc_HasUnseenQuests_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest, CallFunc_HasUnseenQuests_ReturnValue_1) == 0x000007, "Member 'SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest::CallFunc_HasUnseenQuests_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest, K2Node_Select_Default) == 0x000008, "Member 'SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest, K2Node_Select_Default_1) == 0x000010, "Member 'SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000020, "Member 'SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest, K2Node_Event_bHasUnseenQuests) == 0x000028, "Member 'SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest::K2Node_Event_bHasUnseenQuests' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest, K2Node_Event_NewTriggeredAction) == 0x000038, "Member 'SoloButton_ViewQuest_C_ExecuteUbergraph_SoloButton_ViewQuest::K2Node_Event_NewTriggeredAction' has a wrong offset!");

// Function SoloButton_ViewQuest.SoloButton_ViewQuest_C.HandleUnseenQuestsChanged
// 0x0001 (0x0001 - 0x0000)
struct SoloButton_ViewQuest_C_HandleUnseenQuestsChanged final
{
public:
	bool                                          bHasUnseenQuests;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoloButton_ViewQuest_C_HandleUnseenQuestsChanged) == 0x000001, "Wrong alignment on SoloButton_ViewQuest_C_HandleUnseenQuestsChanged");
static_assert(sizeof(SoloButton_ViewQuest_C_HandleUnseenQuestsChanged) == 0x000001, "Wrong size on SoloButton_ViewQuest_C_HandleUnseenQuestsChanged");
static_assert(offsetof(SoloButton_ViewQuest_C_HandleUnseenQuestsChanged, bHasUnseenQuests) == 0x000000, "Member 'SoloButton_ViewQuest_C_HandleUnseenQuestsChanged::bHasUnseenQuests' has a wrong offset!");

// Function SoloButton_ViewQuest.SoloButton_ViewQuest_C.OnTriggeredInputActionChanged
// 0x0010 (0x0010 - 0x0000)
struct SoloButton_ViewQuest_C_OnTriggeredInputActionChanged final
{
public:
	struct FDataTableRowHandle                    NewTriggeredAction;                                // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(SoloButton_ViewQuest_C_OnTriggeredInputActionChanged) == 0x000008, "Wrong alignment on SoloButton_ViewQuest_C_OnTriggeredInputActionChanged");
static_assert(sizeof(SoloButton_ViewQuest_C_OnTriggeredInputActionChanged) == 0x000010, "Wrong size on SoloButton_ViewQuest_C_OnTriggeredInputActionChanged");
static_assert(offsetof(SoloButton_ViewQuest_C_OnTriggeredInputActionChanged, NewTriggeredAction) == 0x000000, "Member 'SoloButton_ViewQuest_C_OnTriggeredInputActionChanged::NewTriggeredAction' has a wrong offset!");

// Function SoloButton_ViewQuest.SoloButton_ViewQuest_C.UpdateInputActionIconScale
// 0x0018 (0x0018 - 0x0000)
struct SoloButton_ViewQuest_C_UpdateInputActionIconScale final
{
public:
	float                                         Temp_float_Variable;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoloButton_ViewQuest_C_UpdateInputActionIconScale) == 0x000008, "Wrong alignment on SoloButton_ViewQuest_C_UpdateInputActionIconScale");
static_assert(sizeof(SoloButton_ViewQuest_C_UpdateInputActionIconScale) == 0x000018, "Wrong size on SoloButton_ViewQuest_C_UpdateInputActionIconScale");
static_assert(offsetof(SoloButton_ViewQuest_C_UpdateInputActionIconScale, Temp_float_Variable) == 0x000000, "Member 'SoloButton_ViewQuest_C_UpdateInputActionIconScale::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_UpdateInputActionIconScale, Temp_float_Variable_1) == 0x000004, "Member 'SoloButton_ViewQuest_C_UpdateInputActionIconScale::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_UpdateInputActionIconScale, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'SoloButton_ViewQuest_C_UpdateInputActionIconScale::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_UpdateInputActionIconScale, Temp_bool_Variable) == 0x000010, "Member 'SoloButton_ViewQuest_C_UpdateInputActionIconScale::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_UpdateInputActionIconScale, CallFunc_GetCurrentInputType_ReturnValue) == 0x000011, "Member 'SoloButton_ViewQuest_C_UpdateInputActionIconScale::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_UpdateInputActionIconScale, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'SoloButton_ViewQuest_C_UpdateInputActionIconScale::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloButton_ViewQuest_C_UpdateInputActionIconScale, K2Node_Select_Default) == 0x000014, "Member 'SoloButton_ViewQuest_C_UpdateInputActionIconScale::K2Node_Select_Default' has a wrong offset!");

}

