#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoloButton_BattlePassPurchase

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SoloButton_BattlePassPurchase.SoloButton_BattlePassPurchase_C
// 0x0080 (0x0F80 - 0x0F00)
class USoloButton_BattlePassPurchase_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_EF8[0x8];                                      // 0x0EF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pressed;                                           // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0F10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Container;                                  // 0x0F18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_0;                                        // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Control;                                   // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ButtonAction;                                 // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_Description;                                // 0x0F40(0x0018)(Edit, BlueprintVisible)
	bool                                          FontSizeOveride;                                   // 0x0F58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F59[0x3];                                      // 0x0F59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FontSize;                                          // 0x0F5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                Padding_Overide;                                   // 0x0F60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PaddingOveride;                                    // 0x0F70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_SoloButton_BattlePassPurchase(int32 EntryPoint);
	void HandleSize();
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SoloButton_BattlePassPurchase_C">();
	}
	static class USoloButton_BattlePassPurchase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoloButton_BattlePassPurchase_C>();
	}
};
static_assert(alignof(USoloButton_BattlePassPurchase_C) == 0x000010, "Wrong alignment on USoloButton_BattlePassPurchase_C");
static_assert(sizeof(USoloButton_BattlePassPurchase_C) == 0x000F80, "Wrong size on USoloButton_BattlePassPurchase_C");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, UberGraphFrame) == 0x000F00, "Member 'USoloButton_BattlePassPurchase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, Pressed) == 0x000F08, "Member 'USoloButton_BattlePassPurchase_C::Pressed' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, Hover) == 0x000F10, "Member 'USoloButton_BattlePassPurchase_C::Hover' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, Border_Container) == 0x000F18, "Member 'USoloButton_BattlePassPurchase_C::Border_Container' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, ButtonBacking) == 0x000F20, "Member 'USoloButton_BattlePassPurchase_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, ScaleBox_0) == 0x000F28, "Member 'USoloButton_BattlePassPurchase_C::ScaleBox_0' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, SizeBox_Control) == 0x000F30, "Member 'USoloButton_BattlePassPurchase_C::SizeBox_Control' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, Text_ButtonAction) == 0x000F38, "Member 'USoloButton_BattlePassPurchase_C::Text_ButtonAction' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, Button_Description) == 0x000F40, "Member 'USoloButton_BattlePassPurchase_C::Button_Description' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, FontSizeOveride) == 0x000F58, "Member 'USoloButton_BattlePassPurchase_C::FontSizeOveride' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, FontSize) == 0x000F5C, "Member 'USoloButton_BattlePassPurchase_C::FontSize' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, Padding_Overide) == 0x000F60, "Member 'USoloButton_BattlePassPurchase_C::Padding_Overide' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, PaddingOveride) == 0x000F70, "Member 'USoloButton_BattlePassPurchase_C::PaddingOveride' has a wrong offset!");

}

