#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SortAndFilterButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SortAndFilterButton.SortAndFilterButton_C
// 0x0050 (0x0F50 - 0x0F00)
class USortAndFilterButton_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_EF8[0x8];                                      // 0x0EF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowPipOutline;                                    // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Deselected;                                        // 0x0F10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0F18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0F20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ButtonAction;                                 // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_Description;                                // 0x0F30(0x0018)(Edit, BlueprintVisible)
	bool                                          IsSelected;                                        // 0x0F48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnSelected();
	void Construct();
	void ExecuteUbergraph_SortAndFilterButton(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void ResetAnimations();
	void SetText(const class FText& Text);
	void SnapToEndOfAnimation(class UWidgetAnimation* Animation, EUMGSequencePlayMode PlayMode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SortAndFilterButton_C">();
	}
	static class USortAndFilterButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USortAndFilterButton_C>();
	}
};
static_assert(alignof(USortAndFilterButton_C) == 0x000010, "Wrong alignment on USortAndFilterButton_C");
static_assert(sizeof(USortAndFilterButton_C) == 0x000F50, "Wrong size on USortAndFilterButton_C");
static_assert(offsetof(USortAndFilterButton_C, UberGraphFrame) == 0x000F00, "Member 'USortAndFilterButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USortAndFilterButton_C, ShowPipOutline) == 0x000F08, "Member 'USortAndFilterButton_C::ShowPipOutline' has a wrong offset!");
static_assert(offsetof(USortAndFilterButton_C, Deselected) == 0x000F10, "Member 'USortAndFilterButton_C::Deselected' has a wrong offset!");
static_assert(offsetof(USortAndFilterButton_C, Selected) == 0x000F18, "Member 'USortAndFilterButton_C::Selected' has a wrong offset!");
static_assert(offsetof(USortAndFilterButton_C, Hover) == 0x000F20, "Member 'USortAndFilterButton_C::Hover' has a wrong offset!");
static_assert(offsetof(USortAndFilterButton_C, Text_ButtonAction) == 0x000F28, "Member 'USortAndFilterButton_C::Text_ButtonAction' has a wrong offset!");
static_assert(offsetof(USortAndFilterButton_C, Button_Description) == 0x000F30, "Member 'USortAndFilterButton_C::Button_Description' has a wrong offset!");
static_assert(offsetof(USortAndFilterButton_C, IsSelected) == 0x000F48, "Member 'USortAndFilterButton_C::IsSelected' has a wrong offset!");

}

