#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SortAndFilterButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SortAndFilterButton.SortAndFilterButton_C.ExecuteUbergraph_SortAndFilterButton
// 0x0150 (0x0150 - 0x0000)
struct SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0060(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D0(0x0070)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton) == 0x000008, "Wrong alignment on SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton");
static_assert(sizeof(SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton) == 0x000150, "Wrong size on SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton");
static_assert(offsetof(SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton, EntryPoint) == 0x000000, "Member 'SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000010, "Member 'SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000020, "Member 'SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton, K2Node_Event_MyGeometry) == 0x000028, "Member 'SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton, K2Node_Event_MouseEvent_1) == 0x000060, "Member 'SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton, K2Node_Event_MouseEvent) == 0x0000D0, "Member 'SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000140, "Member 'SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000148, "Member 'SortAndFilterButton_C_ExecuteUbergraph_SortAndFilterButton::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");

// Function SortAndFilterButton.SortAndFilterButton_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct SortAndFilterButton_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SortAndFilterButton_C_OnMouseEnter) == 0x000008, "Wrong alignment on SortAndFilterButton_C_OnMouseEnter");
static_assert(sizeof(SortAndFilterButton_C_OnMouseEnter) == 0x0000A8, "Wrong size on SortAndFilterButton_C_OnMouseEnter");
static_assert(offsetof(SortAndFilterButton_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'SortAndFilterButton_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(SortAndFilterButton_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'SortAndFilterButton_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function SortAndFilterButton.SortAndFilterButton_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct SortAndFilterButton_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SortAndFilterButton_C_OnMouseLeave) == 0x000008, "Wrong alignment on SortAndFilterButton_C_OnMouseLeave");
static_assert(sizeof(SortAndFilterButton_C_OnMouseLeave) == 0x000070, "Wrong size on SortAndFilterButton_C_OnMouseLeave");
static_assert(offsetof(SortAndFilterButton_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'SortAndFilterButton_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function SortAndFilterButton.SortAndFilterButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SortAndFilterButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SortAndFilterButton_C_PreConstruct) == 0x000001, "Wrong alignment on SortAndFilterButton_C_PreConstruct");
static_assert(sizeof(SortAndFilterButton_C_PreConstruct) == 0x000001, "Wrong size on SortAndFilterButton_C_PreConstruct");
static_assert(offsetof(SortAndFilterButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SortAndFilterButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SortAndFilterButton.SortAndFilterButton_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct SortAndFilterButton_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(SortAndFilterButton_C_SetText) == 0x000008, "Wrong alignment on SortAndFilterButton_C_SetText");
static_assert(sizeof(SortAndFilterButton_C_SetText) == 0x000018, "Wrong size on SortAndFilterButton_C_SetText");
static_assert(offsetof(SortAndFilterButton_C_SetText, Text) == 0x000000, "Member 'SortAndFilterButton_C_SetText::Text' has a wrong offset!");

// Function SortAndFilterButton.SortAndFilterButton_C.SnapToEndOfAnimation
// 0x0018 (0x0018 - 0x0000)
struct SortAndFilterButton_C_SnapToEndOfAnimation final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SortAndFilterButton_C_SnapToEndOfAnimation) == 0x000008, "Wrong alignment on SortAndFilterButton_C_SnapToEndOfAnimation");
static_assert(sizeof(SortAndFilterButton_C_SnapToEndOfAnimation) == 0x000018, "Wrong size on SortAndFilterButton_C_SnapToEndOfAnimation");
static_assert(offsetof(SortAndFilterButton_C_SnapToEndOfAnimation, Animation) == 0x000000, "Member 'SortAndFilterButton_C_SnapToEndOfAnimation::Animation' has a wrong offset!");
static_assert(offsetof(SortAndFilterButton_C_SnapToEndOfAnimation, PlayMode) == 0x000008, "Member 'SortAndFilterButton_C_SnapToEndOfAnimation::PlayMode' has a wrong offset!");
static_assert(offsetof(SortAndFilterButton_C_SnapToEndOfAnimation, CallFunc_GetEndTime_ReturnValue) == 0x00000C, "Member 'SortAndFilterButton_C_SnapToEndOfAnimation::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(SortAndFilterButton_C_SnapToEndOfAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'SortAndFilterButton_C_SnapToEndOfAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

