#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoundLibrary

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum SoundLibrary.ESoundLibraryNotifyTriggerType
// NumValues: 0x0003
enum class ESoundLibraryNotifyTriggerType : uint8
{
	Play                                     = 0,
	Stop                                     = 1,
	None                                     = 2,
};

// ScriptStruct SoundLibrary.SoundLibraryPlaySoundResult
// 0x0030 (0x0030 - 0x0000)
struct FSoundLibraryPlaySoundResult final
{
public:
	struct FGameplayTag                           EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasBlocked;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x16];                                       // 0x000A(0x0016)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x0020(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSoundLibraryPlaySoundResult) == 0x000008, "Wrong alignment on FSoundLibraryPlaySoundResult");
static_assert(sizeof(FSoundLibraryPlaySoundResult) == 0x000030, "Wrong size on FSoundLibraryPlaySoundResult");
static_assert(offsetof(FSoundLibraryPlaySoundResult, EventName) == 0x000000, "Member 'FSoundLibraryPlaySoundResult::EventName' has a wrong offset!");
static_assert(offsetof(FSoundLibraryPlaySoundResult, bWasBlocked) == 0x000008, "Member 'FSoundLibraryPlaySoundResult::bWasBlocked' has a wrong offset!");
static_assert(offsetof(FSoundLibraryPlaySoundResult, bSuccess) == 0x000009, "Member 'FSoundLibraryPlaySoundResult::bSuccess' has a wrong offset!");
static_assert(offsetof(FSoundLibraryPlaySoundResult, AudioComponents) == 0x000020, "Member 'FSoundLibraryPlaySoundResult::AudioComponents' has a wrong offset!");

// ScriptStruct SoundLibrary.SoundLibraryAnimContextSettings
// 0x0028 (0x0028 - 0x0000)
struct FSoundLibraryAnimContextSettings final
{
public:
	struct FFloatInterval                         AnimRateThreshold;                                 // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EventName;                                         // 0x0008(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachToActor;                                    // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachName;                                        // 0x0014(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFadeOutOnEnd;                                     // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeTime;                                          // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NotifyTriggerChance;                               // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSoundLibraryAnimContextSettings) == 0x000004, "Wrong alignment on FSoundLibraryAnimContextSettings");
static_assert(sizeof(FSoundLibraryAnimContextSettings) == 0x000028, "Wrong size on FSoundLibraryAnimContextSettings");
static_assert(offsetof(FSoundLibraryAnimContextSettings, AnimRateThreshold) == 0x000000, "Member 'FSoundLibraryAnimContextSettings::AnimRateThreshold' has a wrong offset!");
static_assert(offsetof(FSoundLibraryAnimContextSettings, EventName) == 0x000008, "Member 'FSoundLibraryAnimContextSettings::EventName' has a wrong offset!");
static_assert(offsetof(FSoundLibraryAnimContextSettings, bAttachToActor) == 0x000010, "Member 'FSoundLibraryAnimContextSettings::bAttachToActor' has a wrong offset!");
static_assert(offsetof(FSoundLibraryAnimContextSettings, AttachName) == 0x000014, "Member 'FSoundLibraryAnimContextSettings::AttachName' has a wrong offset!");
static_assert(offsetof(FSoundLibraryAnimContextSettings, bFadeOutOnEnd) == 0x00001C, "Member 'FSoundLibraryAnimContextSettings::bFadeOutOnEnd' has a wrong offset!");
static_assert(offsetof(FSoundLibraryAnimContextSettings, FadeTime) == 0x000020, "Member 'FSoundLibraryAnimContextSettings::FadeTime' has a wrong offset!");
static_assert(offsetof(FSoundLibraryAnimContextSettings, NotifyTriggerChance) == 0x000024, "Member 'FSoundLibraryAnimContextSettings::NotifyTriggerChance' has a wrong offset!");

// ScriptStruct SoundLibrary.SimpleSoundLibraryContextSettings
// 0x0028 (0x0028 - 0x0000)
struct FSimpleSoundLibraryContextSettings final
{
public:
	struct FGameplayTag                           EventName;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIs1P;                                             // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceComponentCreation;                           // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VolumeMultiplier;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundConcurrency*                      ConcurrencySettings;                               // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      AttenuationSettings;                               // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSimpleSoundLibraryContextSettings) == 0x000008, "Wrong alignment on FSimpleSoundLibraryContextSettings");
static_assert(sizeof(FSimpleSoundLibraryContextSettings) == 0x000028, "Wrong size on FSimpleSoundLibraryContextSettings");
static_assert(offsetof(FSimpleSoundLibraryContextSettings, EventName) == 0x000000, "Member 'FSimpleSoundLibraryContextSettings::EventName' has a wrong offset!");
static_assert(offsetof(FSimpleSoundLibraryContextSettings, bIs1P) == 0x000008, "Member 'FSimpleSoundLibraryContextSettings::bIs1P' has a wrong offset!");
static_assert(offsetof(FSimpleSoundLibraryContextSettings, bForceComponentCreation) == 0x000009, "Member 'FSimpleSoundLibraryContextSettings::bForceComponentCreation' has a wrong offset!");
static_assert(offsetof(FSimpleSoundLibraryContextSettings, VolumeMultiplier) == 0x00000C, "Member 'FSimpleSoundLibraryContextSettings::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(FSimpleSoundLibraryContextSettings, PitchMultiplier) == 0x000010, "Member 'FSimpleSoundLibraryContextSettings::PitchMultiplier' has a wrong offset!");
static_assert(offsetof(FSimpleSoundLibraryContextSettings, StartTime) == 0x000014, "Member 'FSimpleSoundLibraryContextSettings::StartTime' has a wrong offset!");
static_assert(offsetof(FSimpleSoundLibraryContextSettings, ConcurrencySettings) == 0x000018, "Member 'FSimpleSoundLibraryContextSettings::ConcurrencySettings' has a wrong offset!");
static_assert(offsetof(FSimpleSoundLibraryContextSettings, AttenuationSettings) == 0x000020, "Member 'FSimpleSoundLibraryContextSettings::AttenuationSettings' has a wrong offset!");

// ScriptStruct SoundLibrary.AttachedSoundLibraryContextSettings
// 0x0048 (0x0048 - 0x0000)
struct FAttachedSoundLibraryContextSettings final
{
public:
	struct FGameplayTag                           EventName;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachName;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachLocation                               LocationType;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeMultiplier;                                  // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundConcurrency*                      ConcurrencySettings;                               // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      AttenuationSettings;                               // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopWhenAttachedDestroyed;                        // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoDestroy;                                      // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAttachedSoundLibraryContextSettings) == 0x000008, "Wrong alignment on FAttachedSoundLibraryContextSettings");
static_assert(sizeof(FAttachedSoundLibraryContextSettings) == 0x000048, "Wrong size on FAttachedSoundLibraryContextSettings");
static_assert(offsetof(FAttachedSoundLibraryContextSettings, EventName) == 0x000000, "Member 'FAttachedSoundLibraryContextSettings::EventName' has a wrong offset!");
static_assert(offsetof(FAttachedSoundLibraryContextSettings, AttachName) == 0x000008, "Member 'FAttachedSoundLibraryContextSettings::AttachName' has a wrong offset!");
static_assert(offsetof(FAttachedSoundLibraryContextSettings, LocationType) == 0x000010, "Member 'FAttachedSoundLibraryContextSettings::LocationType' has a wrong offset!");
static_assert(offsetof(FAttachedSoundLibraryContextSettings, Location) == 0x000014, "Member 'FAttachedSoundLibraryContextSettings::Location' has a wrong offset!");
static_assert(offsetof(FAttachedSoundLibraryContextSettings, VolumeMultiplier) == 0x000020, "Member 'FAttachedSoundLibraryContextSettings::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(FAttachedSoundLibraryContextSettings, PitchMultiplier) == 0x000024, "Member 'FAttachedSoundLibraryContextSettings::PitchMultiplier' has a wrong offset!");
static_assert(offsetof(FAttachedSoundLibraryContextSettings, StartTime) == 0x000028, "Member 'FAttachedSoundLibraryContextSettings::StartTime' has a wrong offset!");
static_assert(offsetof(FAttachedSoundLibraryContextSettings, ConcurrencySettings) == 0x000030, "Member 'FAttachedSoundLibraryContextSettings::ConcurrencySettings' has a wrong offset!");
static_assert(offsetof(FAttachedSoundLibraryContextSettings, AttenuationSettings) == 0x000038, "Member 'FAttachedSoundLibraryContextSettings::AttenuationSettings' has a wrong offset!");
static_assert(offsetof(FAttachedSoundLibraryContextSettings, bStopWhenAttachedDestroyed) == 0x000040, "Member 'FAttachedSoundLibraryContextSettings::bStopWhenAttachedDestroyed' has a wrong offset!");
static_assert(offsetof(FAttachedSoundLibraryContextSettings, bAutoDestroy) == 0x000041, "Member 'FAttachedSoundLibraryContextSettings::bAutoDestroy' has a wrong offset!");

// ScriptStruct SoundLibrary.SoundLibraryActorData
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FSoundLibraryActorData final
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSoundLibraryActorData) == 0x000008, "Wrong alignment on FSoundLibraryActorData");
static_assert(sizeof(FSoundLibraryActorData) == 0x000038, "Wrong size on FSoundLibraryActorData");

}

