#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Spatial_Specialbutton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Spatial_Specialbutton.Spatial_Specialbutton_C
// 0x00A0 (0x0FA0 - 0x0F00)
class USpatial_Specialbutton_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_EF8[0x8];                                      // 0x0EF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover2;                                            // 0x0F08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0F10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Material;                                   // 0x0F18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_45;                                          // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Right_Image;                               // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Rich_text;                                         // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Height;                                    // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_text;                                       // 0x0F48(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            Text_Color;                                        // 0x0F60(0x0014)(Edit, BlueprintVisible)
	uint8                                         Pad_F74[0x4];                                      // 0x0F74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material_Brush;                                    // 0x0F78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Right_Image;                                       // 0x0F80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Justifiction;                                      // 0x0F88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Auto_wrap_text;                                    // 0x0F89(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          SimpleHover;                                       // 0x0F8A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FontSizeOverride;                                  // 0x0F8B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FontSize;                                          // 0x0F8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShearText;                                         // 0x0F90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_Spatial_Specialbutton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Spatial_Specialbutton_C">();
	}
	static class USpatial_Specialbutton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatial_Specialbutton_C>();
	}
};
static_assert(alignof(USpatial_Specialbutton_C) == 0x000010, "Wrong alignment on USpatial_Specialbutton_C");
static_assert(sizeof(USpatial_Specialbutton_C) == 0x000FA0, "Wrong size on USpatial_Specialbutton_C");
static_assert(offsetof(USpatial_Specialbutton_C, UberGraphFrame) == 0x000F00, "Member 'USpatial_Specialbutton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Hover2) == 0x000F08, "Member 'USpatial_Specialbutton_C::Hover2' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Hover) == 0x000F10, "Member 'USpatial_Specialbutton_C::Hover' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Border_Material) == 0x000F18, "Member 'USpatial_Specialbutton_C::Border_Material' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Image) == 0x000F20, "Member 'USpatial_Specialbutton_C::Image' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Image_45) == 0x000F28, "Member 'USpatial_Specialbutton_C::Image_45' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Overlay_Right_Image) == 0x000F30, "Member 'USpatial_Specialbutton_C::Overlay_Right_Image' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Rich_text) == 0x000F38, "Member 'USpatial_Specialbutton_C::Rich_text' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, SizeBox_Height) == 0x000F40, "Member 'USpatial_Specialbutton_C::SizeBox_Height' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Button_text) == 0x000F48, "Member 'USpatial_Specialbutton_C::Button_text' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Text_Color) == 0x000F60, "Member 'USpatial_Specialbutton_C::Text_Color' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Material_Brush) == 0x000F78, "Member 'USpatial_Specialbutton_C::Material_Brush' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Right_Image) == 0x000F80, "Member 'USpatial_Specialbutton_C::Right_Image' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Justifiction) == 0x000F88, "Member 'USpatial_Specialbutton_C::Justifiction' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Auto_wrap_text) == 0x000F89, "Member 'USpatial_Specialbutton_C::Auto_wrap_text' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, SimpleHover) == 0x000F8A, "Member 'USpatial_Specialbutton_C::SimpleHover' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, FontSizeOverride) == 0x000F8B, "Member 'USpatial_Specialbutton_C::FontSizeOverride' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, FontSize) == 0x000F8C, "Member 'USpatial_Specialbutton_C::FontSize' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, ShearText) == 0x000F90, "Member 'USpatial_Specialbutton_C::ShearText' has a wrong offset!");

}

