#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Spatial_Specialbutton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Spatial_Specialbutton.Spatial_Specialbutton_C.ExecuteUbergraph_Spatial_Specialbutton
// 0x00A8 (0x00A8 - 0x0000)
struct Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0048(0x0058)(HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_3;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton) == 0x000008, "Wrong alignment on Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton");
static_assert(sizeof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton) == 0x0000A8, "Wrong size on Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, EntryPoint) == 0x000000, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::EntryPoint' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, Temp_bool_Variable) == 0x000004, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, Temp_byte_Variable) == 0x000005, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, Temp_bool_Variable_1) == 0x000006, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, Temp_bool_Variable_2) == 0x000007, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, Temp_int_Variable) == 0x000008, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, Temp_bool_Variable_3) == 0x00000C, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, Temp_struct_Variable) == 0x000010, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, Temp_struct_Variable_1) == 0x000018, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, K2Node_Event_IsDesignTime) == 0x000020, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, Temp_byte_Variable_1) == 0x000021, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, CallFunc_IsValid_ReturnValue) == 0x000022, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, K2Node_Select_Default) == 0x000023, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, K2Node_Select_Default_1) == 0x000028, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000030, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000038, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, K2Node_Select_Default_2) == 0x000040, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, K2Node_MakeStruct_SlateFontInfo) == 0x000048, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, K2Node_Select_Default_3) == 0x0000A0, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::K2Node_Select_Default_3' has a wrong offset!");

// Function Spatial_Specialbutton.Spatial_Specialbutton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Spatial_Specialbutton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Spatial_Specialbutton_C_PreConstruct) == 0x000001, "Wrong alignment on Spatial_Specialbutton_C_PreConstruct");
static_assert(sizeof(Spatial_Specialbutton_C_PreConstruct) == 0x000001, "Wrong size on Spatial_Specialbutton_C_PreConstruct");
static_assert(offsetof(Spatial_Specialbutton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Spatial_Specialbutton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

