#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpecialEventGameplayRuntime

#include "Basic.hpp"

#include "SpecialEventGameplayRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SpecialEventGameplayRuntime.FortCharacterMovementMutatorComponent.OnMovementModeChanged
// 0x0010 (0x0010 - 0x0000)
struct FortCharacterMovementMutatorComponent_OnMovementModeChanged final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 PreviousMovementMode;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortCharacterMovementMutatorComponent_OnMovementModeChanged) == 0x000008, "Wrong alignment on FortCharacterMovementMutatorComponent_OnMovementModeChanged");
static_assert(sizeof(FortCharacterMovementMutatorComponent_OnMovementModeChanged) == 0x000010, "Wrong size on FortCharacterMovementMutatorComponent_OnMovementModeChanged");
static_assert(offsetof(FortCharacterMovementMutatorComponent_OnMovementModeChanged, Character) == 0x000000, "Member 'FortCharacterMovementMutatorComponent_OnMovementModeChanged::Character' has a wrong offset!");
static_assert(offsetof(FortCharacterMovementMutatorComponent_OnMovementModeChanged, PreviousMovementMode) == 0x000008, "Member 'FortCharacterMovementMutatorComponent_OnMovementModeChanged::PreviousMovementMode' has a wrong offset!");
static_assert(offsetof(FortCharacterMovementMutatorComponent_OnMovementModeChanged, PreviousCustomMode) == 0x000009, "Member 'FortCharacterMovementMutatorComponent_OnMovementModeChanged::PreviousCustomMode' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCharacterMovementMutatorComponent.OverrideBuffetFlyingMaxSpeed
// 0x000C (0x000C - 0x0000)
struct FortCharacterMovementMutatorComponent_OverrideBuffetFlyingMaxSpeed final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsMultiplier;                                     // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InterpSpeed;                                       // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCharacterMovementMutatorComponent_OverrideBuffetFlyingMaxSpeed) == 0x000004, "Wrong alignment on FortCharacterMovementMutatorComponent_OverrideBuffetFlyingMaxSpeed");
static_assert(sizeof(FortCharacterMovementMutatorComponent_OverrideBuffetFlyingMaxSpeed) == 0x00000C, "Wrong size on FortCharacterMovementMutatorComponent_OverrideBuffetFlyingMaxSpeed");
static_assert(offsetof(FortCharacterMovementMutatorComponent_OverrideBuffetFlyingMaxSpeed, Value) == 0x000000, "Member 'FortCharacterMovementMutatorComponent_OverrideBuffetFlyingMaxSpeed::Value' has a wrong offset!");
static_assert(offsetof(FortCharacterMovementMutatorComponent_OverrideBuffetFlyingMaxSpeed, bAsMultiplier) == 0x000004, "Member 'FortCharacterMovementMutatorComponent_OverrideBuffetFlyingMaxSpeed::bAsMultiplier' has a wrong offset!");
static_assert(offsetof(FortCharacterMovementMutatorComponent_OverrideBuffetFlyingMaxSpeed, InterpSpeed) == 0x000008, "Member 'FortCharacterMovementMutatorComponent_OverrideBuffetFlyingMaxSpeed::InterpSpeed' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCharacterMovementMutatorComponent.OverrideBuffetFlyingVelocityDirectionInterpSpeed
// 0x0008 (0x0008 - 0x0000)
struct FortCharacterMovementMutatorComponent_OverrideBuffetFlyingVelocityDirectionInterpSpeed final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsMultiplier;                                     // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortCharacterMovementMutatorComponent_OverrideBuffetFlyingVelocityDirectionInterpSpeed) == 0x000004, "Wrong alignment on FortCharacterMovementMutatorComponent_OverrideBuffetFlyingVelocityDirectionInterpSpeed");
static_assert(sizeof(FortCharacterMovementMutatorComponent_OverrideBuffetFlyingVelocityDirectionInterpSpeed) == 0x000008, "Wrong size on FortCharacterMovementMutatorComponent_OverrideBuffetFlyingVelocityDirectionInterpSpeed");
static_assert(offsetof(FortCharacterMovementMutatorComponent_OverrideBuffetFlyingVelocityDirectionInterpSpeed, Value) == 0x000000, "Member 'FortCharacterMovementMutatorComponent_OverrideBuffetFlyingVelocityDirectionInterpSpeed::Value' has a wrong offset!");
static_assert(offsetof(FortCharacterMovementMutatorComponent_OverrideBuffetFlyingVelocityDirectionInterpSpeed, bAsMultiplier) == 0x000004, "Member 'FortCharacterMovementMutatorComponent_OverrideBuffetFlyingVelocityDirectionInterpSpeed::bAsMultiplier' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCharacterMovementMutatorComponent.SetBuffetBubblesFollowActor
// 0x0008 (0x0008 - 0x0000)
struct FortCharacterMovementMutatorComponent_SetBuffetBubblesFollowActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCharacterMovementMutatorComponent_SetBuffetBubblesFollowActor) == 0x000008, "Wrong alignment on FortCharacterMovementMutatorComponent_SetBuffetBubblesFollowActor");
static_assert(sizeof(FortCharacterMovementMutatorComponent_SetBuffetBubblesFollowActor) == 0x000008, "Wrong size on FortCharacterMovementMutatorComponent_SetBuffetBubblesFollowActor");
static_assert(offsetof(FortCharacterMovementMutatorComponent_SetBuffetBubblesFollowActor, Actor) == 0x000000, "Member 'FortCharacterMovementMutatorComponent_SetBuffetBubblesFollowActor::Actor' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCharacterMovementMutatorComponent.SetBuffetBubblesInitialFollowBoxOffsetPercent
// 0x000C (0x000C - 0x0000)
struct FortCharacterMovementMutatorComponent_SetBuffetBubblesInitialFollowBoxOffsetPercent final
{
public:
	struct FVector                                BoxOffsetPercent;                                  // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCharacterMovementMutatorComponent_SetBuffetBubblesInitialFollowBoxOffsetPercent) == 0x000004, "Wrong alignment on FortCharacterMovementMutatorComponent_SetBuffetBubblesInitialFollowBoxOffsetPercent");
static_assert(sizeof(FortCharacterMovementMutatorComponent_SetBuffetBubblesInitialFollowBoxOffsetPercent) == 0x00000C, "Wrong size on FortCharacterMovementMutatorComponent_SetBuffetBubblesInitialFollowBoxOffsetPercent");
static_assert(offsetof(FortCharacterMovementMutatorComponent_SetBuffetBubblesInitialFollowBoxOffsetPercent, BoxOffsetPercent) == 0x000000, "Member 'FortCharacterMovementMutatorComponent_SetBuffetBubblesInitialFollowBoxOffsetPercent::BoxOffsetPercent' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCharacterMovementMutatorComponent.SetBuffetBubblesIntroTargetTransform
// 0x0030 (0x0030 - 0x0000)
struct FortCharacterMovementMutatorComponent_SetBuffetBubblesIntroTargetTransform final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCharacterMovementMutatorComponent_SetBuffetBubblesIntroTargetTransform) == 0x000010, "Wrong alignment on FortCharacterMovementMutatorComponent_SetBuffetBubblesIntroTargetTransform");
static_assert(sizeof(FortCharacterMovementMutatorComponent_SetBuffetBubblesIntroTargetTransform) == 0x000030, "Wrong size on FortCharacterMovementMutatorComponent_SetBuffetBubblesIntroTargetTransform");
static_assert(offsetof(FortCharacterMovementMutatorComponent_SetBuffetBubblesIntroTargetTransform, Transform) == 0x000000, "Member 'FortCharacterMovementMutatorComponent_SetBuffetBubblesIntroTargetTransform::Transform' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCheatManager_FakeKillRelevancy.FakeKillRelevancyDebug
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_FakeKillRelevancy_FakeKillRelevancyDebug final
{
public:
	float                                         TextScale;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancyDebug) == 0x000004, "Wrong alignment on FortCheatManager_FakeKillRelevancy_FakeKillRelevancyDebug");
static_assert(sizeof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancyDebug) == 0x000004, "Wrong size on FortCheatManager_FakeKillRelevancy_FakeKillRelevancyDebug");
static_assert(offsetof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancyDebug, TextScale) == 0x000000, "Member 'FortCheatManager_FakeKillRelevancy_FakeKillRelevancyDebug::TextScale' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCheatManager_FakeKillRelevancy.FakeKillRelevancySetUpPhase
// 0x0020 (0x0020 - 0x0000)
struct FortCheatManager_FakeKillRelevancy_FakeKillRelevancySetUpPhase final
{
public:
	int32                                         MaxPlayersRemaining;                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReasonGameplayTagString;                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumWaves;                                          // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RelevancyDelay;                                    // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancySetUpPhase) == 0x000008, "Wrong alignment on FortCheatManager_FakeKillRelevancy_FakeKillRelevancySetUpPhase");
static_assert(sizeof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancySetUpPhase) == 0x000020, "Wrong size on FortCheatManager_FakeKillRelevancy_FakeKillRelevancySetUpPhase");
static_assert(offsetof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancySetUpPhase, MaxPlayersRemaining) == 0x000000, "Member 'FortCheatManager_FakeKillRelevancy_FakeKillRelevancySetUpPhase::MaxPlayersRemaining' has a wrong offset!");
static_assert(offsetof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancySetUpPhase, ReasonGameplayTagString) == 0x000008, "Member 'FortCheatManager_FakeKillRelevancy_FakeKillRelevancySetUpPhase::ReasonGameplayTagString' has a wrong offset!");
static_assert(offsetof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancySetUpPhase, NumWaves) == 0x000018, "Member 'FortCheatManager_FakeKillRelevancy_FakeKillRelevancySetUpPhase::NumWaves' has a wrong offset!");
static_assert(offsetof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancySetUpPhase, RelevancyDelay) == 0x00001C, "Member 'FortCheatManager_FakeKillRelevancy_FakeKillRelevancySetUpPhase::RelevancyDelay' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCheatManager_FakeKillRelevancy.FakeKillRelevancyTestAlgorithm
// 0x0028 (0x0028 - 0x0000)
struct FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm final
{
public:
	int32                                         NumPlayers;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MaxPlayersRemainingAfterPhases;                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinSquadSize;                                      // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxSquadSize;                                      // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Iterations;                                        // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LogVerbosity;                                      // 0x0024(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm) == 0x000008, "Wrong alignment on FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm");
static_assert(sizeof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm) == 0x000028, "Wrong size on FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm");
static_assert(offsetof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm, NumPlayers) == 0x000000, "Member 'FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm::NumPlayers' has a wrong offset!");
static_assert(offsetof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm, MaxPlayersRemainingAfterPhases) == 0x000008, "Member 'FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm::MaxPlayersRemainingAfterPhases' has a wrong offset!");
static_assert(offsetof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm, MinSquadSize) == 0x000018, "Member 'FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm::MinSquadSize' has a wrong offset!");
static_assert(offsetof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm, MaxSquadSize) == 0x00001C, "Member 'FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm::MaxSquadSize' has a wrong offset!");
static_assert(offsetof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm, Iterations) == 0x000020, "Member 'FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm::Iterations' has a wrong offset!");
static_assert(offsetof(FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm, LogVerbosity) == 0x000024, "Member 'FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm::LogVerbosity' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortControllerComponent_FakeKillRelevancy.CancelKillEffectsOnClient
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_FakeKillRelevancy_CancelKillEffectsOnClient final
{
public:
	TArray<class AFortPlayerStateAthena*>         PlayerStates;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortControllerComponent_FakeKillRelevancy_CancelKillEffectsOnClient) == 0x000008, "Wrong alignment on FortControllerComponent_FakeKillRelevancy_CancelKillEffectsOnClient");
static_assert(sizeof(FortControllerComponent_FakeKillRelevancy_CancelKillEffectsOnClient) == 0x000010, "Wrong size on FortControllerComponent_FakeKillRelevancy_CancelKillEffectsOnClient");
static_assert(offsetof(FortControllerComponent_FakeKillRelevancy_CancelKillEffectsOnClient, PlayerStates) == 0x000000, "Member 'FortControllerComponent_FakeKillRelevancy_CancelKillEffectsOnClient::PlayerStates' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortControllerComponent_FakeKillRelevancy.OnKillEffectsPlayed
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_FakeKillRelevancy_OnKillEffectsPlayed final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortControllerComponent_FakeKillRelevancy_OnKillEffectsPlayed) == 0x000008, "Wrong alignment on FortControllerComponent_FakeKillRelevancy_OnKillEffectsPlayed");
static_assert(sizeof(FortControllerComponent_FakeKillRelevancy_OnKillEffectsPlayed) == 0x000008, "Wrong size on FortControllerComponent_FakeKillRelevancy_OnKillEffectsPlayed");
static_assert(offsetof(FortControllerComponent_FakeKillRelevancy_OnKillEffectsPlayed, PlayerState) == 0x000000, "Member 'FortControllerComponent_FakeKillRelevancy_OnKillEffectsPlayed::PlayerState' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortControllerComponent_FakeKillRelevancy.PlayKillEffects
// 0x0040 (0x0040 - 0x0000)
struct FortControllerComponent_FakeKillRelevancy_PlayKillEffects final
{
public:
	struct FFakeKillRelevancyPlayerDataEntry      FakeKillData;                                      // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         RelevancyDelay;                                    // 0x0038(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortControllerComponent_FakeKillRelevancy_PlayKillEffects) == 0x000008, "Wrong alignment on FortControllerComponent_FakeKillRelevancy_PlayKillEffects");
static_assert(sizeof(FortControllerComponent_FakeKillRelevancy_PlayKillEffects) == 0x000040, "Wrong size on FortControllerComponent_FakeKillRelevancy_PlayKillEffects");
static_assert(offsetof(FortControllerComponent_FakeKillRelevancy_PlayKillEffects, FakeKillData) == 0x000000, "Member 'FortControllerComponent_FakeKillRelevancy_PlayKillEffects::FakeKillData' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_FakeKillRelevancy_PlayKillEffects, RelevancyDelay) == 0x000038, "Member 'FortControllerComponent_FakeKillRelevancy_PlayKillEffects::RelevancyDelay' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortControllerComponent_FakeKillRelevancy.GetDeathLocation
// 0x0018 (0x0018 - 0x0000)
struct FortControllerComponent_FakeKillRelevancy_GetDeathLocation final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortControllerComponent_FakeKillRelevancy_GetDeathLocation) == 0x000008, "Wrong alignment on FortControllerComponent_FakeKillRelevancy_GetDeathLocation");
static_assert(sizeof(FortControllerComponent_FakeKillRelevancy_GetDeathLocation) == 0x000018, "Wrong size on FortControllerComponent_FakeKillRelevancy_GetDeathLocation");
static_assert(offsetof(FortControllerComponent_FakeKillRelevancy_GetDeathLocation, PlayerState) == 0x000000, "Member 'FortControllerComponent_FakeKillRelevancy_GetDeathLocation::PlayerState' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_FakeKillRelevancy_GetDeathLocation, ReturnValue) == 0x000008, "Member 'FortControllerComponent_FakeKillRelevancy_GetDeathLocation::ReturnValue' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_FakeKillRelevancy.EndWave
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_FakeKillRelevancy_EndWave final
{
public:
	int32                                         EndPhaseNum;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WaveNum;                                           // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_FakeKillRelevancy_EndWave) == 0x000004, "Wrong alignment on FortAthenaMutator_FakeKillRelevancy_EndWave");
static_assert(sizeof(FortAthenaMutator_FakeKillRelevancy_EndWave) == 0x000008, "Wrong size on FortAthenaMutator_FakeKillRelevancy_EndWave");
static_assert(offsetof(FortAthenaMutator_FakeKillRelevancy_EndWave, EndPhaseNum) == 0x000000, "Member 'FortAthenaMutator_FakeKillRelevancy_EndWave::EndPhaseNum' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_FakeKillRelevancy_EndWave, WaveNum) == 0x000004, "Member 'FortAthenaMutator_FakeKillRelevancy_EndWave::WaveNum' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_FakeKillRelevancy.SetUpKillPhase
// 0x0014 (0x0014 - 0x0000)
struct FortAthenaMutator_FakeKillRelevancy_SetUpKillPhase final
{
public:
	int32                                         MaxPlayersRemaining;                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Reason;                                            // 0x0004(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumWaves;                                          // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RelevancyDelay;                                    // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_FakeKillRelevancy_SetUpKillPhase) == 0x000004, "Wrong alignment on FortAthenaMutator_FakeKillRelevancy_SetUpKillPhase");
static_assert(sizeof(FortAthenaMutator_FakeKillRelevancy_SetUpKillPhase) == 0x000014, "Wrong size on FortAthenaMutator_FakeKillRelevancy_SetUpKillPhase");
static_assert(offsetof(FortAthenaMutator_FakeKillRelevancy_SetUpKillPhase, MaxPlayersRemaining) == 0x000000, "Member 'FortAthenaMutator_FakeKillRelevancy_SetUpKillPhase::MaxPlayersRemaining' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_FakeKillRelevancy_SetUpKillPhase, Reason) == 0x000004, "Member 'FortAthenaMutator_FakeKillRelevancy_SetUpKillPhase::Reason' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_FakeKillRelevancy_SetUpKillPhase, NumWaves) == 0x00000C, "Member 'FortAthenaMutator_FakeKillRelevancy_SetUpKillPhase::NumWaves' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_FakeKillRelevancy_SetUpKillPhase, RelevancyDelay) == 0x000010, "Member 'FortAthenaMutator_FakeKillRelevancy_SetUpKillPhase::RelevancyDelay' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_LoadGameFeature.OnPlaylistDataReady
// 0x0030 (0x0030 - 0x0000)
struct FortAthenaMutator_LoadGameFeature_OnPlaylistDataReady final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_LoadGameFeature_OnPlaylistDataReady) == 0x000008, "Wrong alignment on FortAthenaMutator_LoadGameFeature_OnPlaylistDataReady");
static_assert(sizeof(FortAthenaMutator_LoadGameFeature_OnPlaylistDataReady) == 0x000030, "Wrong size on FortAthenaMutator_LoadGameFeature_OnPlaylistDataReady");
static_assert(offsetof(FortAthenaMutator_LoadGameFeature_OnPlaylistDataReady, GameState) == 0x000000, "Member 'FortAthenaMutator_LoadGameFeature_OnPlaylistDataReady::GameState' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_LoadGameFeature_OnPlaylistDataReady, Playlist) == 0x000008, "Member 'FortAthenaMutator_LoadGameFeature_OnPlaylistDataReady::Playlist' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_LoadGameFeature_OnPlaylistDataReady, PlaylistContextTags) == 0x000010, "Member 'FortAthenaMutator_LoadGameFeature_OnPlaylistDataReady::PlaylistContextTags' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_RemoveGameFeatures.OnPlaylistDataReady
// 0x0030 (0x0030 - 0x0000)
struct FortAthenaMutator_RemoveGameFeatures_OnPlaylistDataReady final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_RemoveGameFeatures_OnPlaylistDataReady) == 0x000008, "Wrong alignment on FortAthenaMutator_RemoveGameFeatures_OnPlaylistDataReady");
static_assert(sizeof(FortAthenaMutator_RemoveGameFeatures_OnPlaylistDataReady) == 0x000030, "Wrong size on FortAthenaMutator_RemoveGameFeatures_OnPlaylistDataReady");
static_assert(offsetof(FortAthenaMutator_RemoveGameFeatures_OnPlaylistDataReady, GameState) == 0x000000, "Member 'FortAthenaMutator_RemoveGameFeatures_OnPlaylistDataReady::GameState' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_RemoveGameFeatures_OnPlaylistDataReady, Playlist) == 0x000008, "Member 'FortAthenaMutator_RemoveGameFeatures_OnPlaylistDataReady::Playlist' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_RemoveGameFeatures_OnPlaylistDataReady, PlaylistContextTags) == 0x000010, "Member 'FortAthenaMutator_RemoveGameFeatures_OnPlaylistDataReady::PlaylistContextTags' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.AddCSVEvent
// 0x0010 (0x0010 - 0x0000)
struct FortCheatManager_SpecialEvent_AddCSVEvent final
{
public:
	class FString                                 CSVEventName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_SpecialEvent_AddCSVEvent) == 0x000008, "Wrong alignment on FortCheatManager_SpecialEvent_AddCSVEvent");
static_assert(sizeof(FortCheatManager_SpecialEvent_AddCSVEvent) == 0x000010, "Wrong size on FortCheatManager_SpecialEvent_AddCSVEvent");
static_assert(offsetof(FortCheatManager_SpecialEvent_AddCSVEvent, CSVEventName) == 0x000000, "Member 'FortCheatManager_SpecialEvent_AddCSVEvent::CSVEventName' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.ChangeWinCondition
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_SpecialEvent_ChangeWinCondition final
{
public:
	float                                         NewGoalScore;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_SpecialEvent_ChangeWinCondition) == 0x000004, "Wrong alignment on FortCheatManager_SpecialEvent_ChangeWinCondition");
static_assert(sizeof(FortCheatManager_SpecialEvent_ChangeWinCondition) == 0x000004, "Wrong size on FortCheatManager_SpecialEvent_ChangeWinCondition");
static_assert(offsetof(FortCheatManager_SpecialEvent_ChangeWinCondition, NewGoalScore) == 0x000000, "Member 'FortCheatManager_SpecialEvent_ChangeWinCondition::NewGoalScore' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.PauseWinCondition
// 0x0001 (0x0001 - 0x0000)
struct FortCheatManager_SpecialEvent_PauseWinCondition final
{
public:
	bool                                          bLockScores;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_SpecialEvent_PauseWinCondition) == 0x000001, "Wrong alignment on FortCheatManager_SpecialEvent_PauseWinCondition");
static_assert(sizeof(FortCheatManager_SpecialEvent_PauseWinCondition) == 0x000001, "Wrong size on FortCheatManager_SpecialEvent_PauseWinCondition");
static_assert(offsetof(FortCheatManager_SpecialEvent_PauseWinCondition, bLockScores) == 0x000000, "Member 'FortCheatManager_SpecialEvent_PauseWinCondition::bLockScores' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.SetDestroyVehiclesInStorm
// 0x0001 (0x0001 - 0x0000)
struct FortCheatManager_SpecialEvent_SetDestroyVehiclesInStorm final
{
public:
	bool                                          bDestroyVehiclesInStorm;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_SpecialEvent_SetDestroyVehiclesInStorm) == 0x000001, "Wrong alignment on FortCheatManager_SpecialEvent_SetDestroyVehiclesInStorm");
static_assert(sizeof(FortCheatManager_SpecialEvent_SetDestroyVehiclesInStorm) == 0x000001, "Wrong size on FortCheatManager_SpecialEvent_SetDestroyVehiclesInStorm");
static_assert(offsetof(FortCheatManager_SpecialEvent_SetDestroyVehiclesInStorm, bDestroyVehiclesInStorm) == 0x000000, "Member 'FortCheatManager_SpecialEvent_SetDestroyVehiclesInStorm::bDestroyVehiclesInStorm' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.SetIsSimulatingDamage
// 0x0001 (0x0001 - 0x0000)
struct FortCheatManager_SpecialEvent_SetIsSimulatingDamage final
{
public:
	bool                                          bIsSimulating;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_SpecialEvent_SetIsSimulatingDamage) == 0x000001, "Wrong alignment on FortCheatManager_SpecialEvent_SetIsSimulatingDamage");
static_assert(sizeof(FortCheatManager_SpecialEvent_SetIsSimulatingDamage) == 0x000001, "Wrong size on FortCheatManager_SpecialEvent_SetIsSimulatingDamage");
static_assert(offsetof(FortCheatManager_SpecialEvent_SetIsSimulatingDamage, bIsSimulating) == 0x000000, "Member 'FortCheatManager_SpecialEvent_SetIsSimulatingDamage::bIsSimulating' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.SetLockingOnFocalPoint
// 0x0001 (0x0001 - 0x0000)
struct FortCheatManager_SpecialEvent_SetLockingOnFocalPoint final
{
public:
	bool                                          bInLockingOnFocalPoint;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_SpecialEvent_SetLockingOnFocalPoint) == 0x000001, "Wrong alignment on FortCheatManager_SpecialEvent_SetLockingOnFocalPoint");
static_assert(sizeof(FortCheatManager_SpecialEvent_SetLockingOnFocalPoint) == 0x000001, "Wrong size on FortCheatManager_SpecialEvent_SetLockingOnFocalPoint");
static_assert(offsetof(FortCheatManager_SpecialEvent_SetLockingOnFocalPoint, bInLockingOnFocalPoint) == 0x000000, "Member 'FortCheatManager_SpecialEvent_SetLockingOnFocalPoint::bInLockingOnFocalPoint' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.SetMatchTime
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_SpecialEvent_SetMatchTime final
{
public:
	int32                                         NewMatchTime;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_SpecialEvent_SetMatchTime) == 0x000004, "Wrong alignment on FortCheatManager_SpecialEvent_SetMatchTime");
static_assert(sizeof(FortCheatManager_SpecialEvent_SetMatchTime) == 0x000004, "Wrong size on FortCheatManager_SpecialEvent_SetMatchTime");
static_assert(offsetof(FortCheatManager_SpecialEvent_SetMatchTime, NewMatchTime) == 0x000000, "Member 'FortCheatManager_SpecialEvent_SetMatchTime::NewMatchTime' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.SetReturnToMainMenuDelay
// 0x0008 (0x0008 - 0x0000)
struct FortCheatManager_SpecialEvent_SetReturnToMainMenuDelay final
{
public:
	float                                         MinDelayReturnToMainMenu;                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDelayReturnToMainMenu;                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_SpecialEvent_SetReturnToMainMenuDelay) == 0x000004, "Wrong alignment on FortCheatManager_SpecialEvent_SetReturnToMainMenuDelay");
static_assert(sizeof(FortCheatManager_SpecialEvent_SetReturnToMainMenuDelay) == 0x000008, "Wrong size on FortCheatManager_SpecialEvent_SetReturnToMainMenuDelay");
static_assert(offsetof(FortCheatManager_SpecialEvent_SetReturnToMainMenuDelay, MinDelayReturnToMainMenu) == 0x000000, "Member 'FortCheatManager_SpecialEvent_SetReturnToMainMenuDelay::MinDelayReturnToMainMenu' has a wrong offset!");
static_assert(offsetof(FortCheatManager_SpecialEvent_SetReturnToMainMenuDelay, MaxDelayReturnToMainMenu) == 0x000004, "Member 'FortCheatManager_SpecialEvent_SetReturnToMainMenuDelay::MaxDelayReturnToMainMenu' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.SpecialEventSetAdditionalViewpoint
// 0x000C (0x000C - 0x0000)
struct FortCheatManager_SpecialEvent_SpecialEventSetAdditionalViewpoint final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_SpecialEvent_SpecialEventSetAdditionalViewpoint) == 0x000004, "Wrong alignment on FortCheatManager_SpecialEvent_SpecialEventSetAdditionalViewpoint");
static_assert(sizeof(FortCheatManager_SpecialEvent_SpecialEventSetAdditionalViewpoint) == 0x00000C, "Wrong size on FortCheatManager_SpecialEvent_SpecialEventSetAdditionalViewpoint");
static_assert(offsetof(FortCheatManager_SpecialEvent_SpecialEventSetAdditionalViewpoint, X) == 0x000000, "Member 'FortCheatManager_SpecialEvent_SpecialEventSetAdditionalViewpoint::X' has a wrong offset!");
static_assert(offsetof(FortCheatManager_SpecialEvent_SpecialEventSetAdditionalViewpoint, Y) == 0x000004, "Member 'FortCheatManager_SpecialEvent_SpecialEventSetAdditionalViewpoint::Y' has a wrong offset!");
static_assert(offsetof(FortCheatManager_SpecialEvent_SpecialEventSetAdditionalViewpoint, Z) == 0x000008, "Member 'FortCheatManager_SpecialEvent_SpecialEventSetAdditionalViewpoint::Z' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.StartEventScript
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_SpecialEvent_StartEventScript final
{
public:
	int32                                         InStartingIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_SpecialEvent_StartEventScript) == 0x000004, "Wrong alignment on FortCheatManager_SpecialEvent_StartEventScript");
static_assert(sizeof(FortCheatManager_SpecialEvent_StartEventScript) == 0x000004, "Wrong size on FortCheatManager_SpecialEvent_StartEventScript");
static_assert(offsetof(FortCheatManager_SpecialEvent_StartEventScript, InStartingIndex) == 0x000000, "Member 'FortCheatManager_SpecialEvent_StartEventScript::InStartingIndex' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.TeleportAllPlayers
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_SpecialEvent_TeleportAllPlayers final
{
public:
	int32                                         SafeZoneIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_SpecialEvent_TeleportAllPlayers) == 0x000004, "Wrong alignment on FortCheatManager_SpecialEvent_TeleportAllPlayers");
static_assert(sizeof(FortCheatManager_SpecialEvent_TeleportAllPlayers) == 0x000004, "Wrong size on FortCheatManager_SpecialEvent_TeleportAllPlayers");
static_assert(offsetof(FortCheatManager_SpecialEvent_TeleportAllPlayers, SafeZoneIndex) == 0x000000, "Member 'FortCheatManager_SpecialEvent_TeleportAllPlayers::SafeZoneIndex' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.ToggleDisableParachutes
// 0x0001 (0x0001 - 0x0000)
struct FortCheatManager_SpecialEvent_ToggleDisableParachutes final
{
public:
	bool                                          bIsDisabled;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_SpecialEvent_ToggleDisableParachutes) == 0x000001, "Wrong alignment on FortCheatManager_SpecialEvent_ToggleDisableParachutes");
static_assert(sizeof(FortCheatManager_SpecialEvent_ToggleDisableParachutes) == 0x000001, "Wrong size on FortCheatManager_SpecialEvent_ToggleDisableParachutes");
static_assert(offsetof(FortCheatManager_SpecialEvent_ToggleDisableParachutes, bIsDisabled) == 0x000000, "Member 'FortCheatManager_SpecialEvent_ToggleDisableParachutes::bIsDisabled' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.UnloadTerrainMaps
// 0x0008 (0x0008 - 0x0000)
struct FortCheatManager_SpecialEvent_UnloadTerrainMaps final
{
public:
	class FName                                   MapTag;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_SpecialEvent_UnloadTerrainMaps) == 0x000004, "Wrong alignment on FortCheatManager_SpecialEvent_UnloadTerrainMaps");
static_assert(sizeof(FortCheatManager_SpecialEvent_UnloadTerrainMaps) == 0x000008, "Wrong size on FortCheatManager_SpecialEvent_UnloadTerrainMaps");
static_assert(offsetof(FortCheatManager_SpecialEvent_UnloadTerrainMaps, MapTag) == 0x000000, "Member 'FortCheatManager_SpecialEvent_UnloadTerrainMaps::MapTag' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.AddClientCSVEvent
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_SpecialEvent_AddClientCSVEvent final
{
public:
	class FString                                 CSVEventName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_SpecialEvent_AddClientCSVEvent) == 0x000008, "Wrong alignment on FortAthenaMutator_SpecialEvent_AddClientCSVEvent");
static_assert(sizeof(FortAthenaMutator_SpecialEvent_AddClientCSVEvent) == 0x000010, "Wrong size on FortAthenaMutator_SpecialEvent_AddClientCSVEvent");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_AddClientCSVEvent, CSVEventName) == 0x000000, "Member 'FortAthenaMutator_SpecialEvent_AddClientCSVEvent::CSVEventName' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.AddCSVEvent
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaMutator_SpecialEvent_AddCSVEvent final
{
public:
	class FString                                 CSVEventName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldRepToClient;                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAthenaMutator_SpecialEvent_AddCSVEvent) == 0x000008, "Wrong alignment on FortAthenaMutator_SpecialEvent_AddCSVEvent");
static_assert(sizeof(FortAthenaMutator_SpecialEvent_AddCSVEvent) == 0x000018, "Wrong size on FortAthenaMutator_SpecialEvent_AddCSVEvent");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_AddCSVEvent, CSVEventName) == 0x000000, "Member 'FortAthenaMutator_SpecialEvent_AddCSVEvent::CSVEventName' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_AddCSVEvent, bShouldRepToClient) == 0x000010, "Member 'FortAthenaMutator_SpecialEvent_AddCSVEvent::bShouldRepToClient' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.AddToBlockedNativeActions
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaMutator_SpecialEvent_AddToBlockedNativeActions final
{
public:
	struct FGameplayTagContainer                  Actions;                                           // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bCancelAbilities;                                  // 0x0020(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAthenaMutator_SpecialEvent_AddToBlockedNativeActions) == 0x000008, "Wrong alignment on FortAthenaMutator_SpecialEvent_AddToBlockedNativeActions");
static_assert(sizeof(FortAthenaMutator_SpecialEvent_AddToBlockedNativeActions) == 0x000028, "Wrong size on FortAthenaMutator_SpecialEvent_AddToBlockedNativeActions");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_AddToBlockedNativeActions, Actions) == 0x000000, "Member 'FortAthenaMutator_SpecialEvent_AddToBlockedNativeActions::Actions' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_AddToBlockedNativeActions, bCancelAbilities) == 0x000020, "Member 'FortAthenaMutator_SpecialEvent_AddToBlockedNativeActions::bCancelAbilities' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.ChangeWinCondition
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_SpecialEvent_ChangeWinCondition final
{
public:
	float                                         NewGoalScore;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_SpecialEvent_ChangeWinCondition) == 0x000004, "Wrong alignment on FortAthenaMutator_SpecialEvent_ChangeWinCondition");
static_assert(sizeof(FortAthenaMutator_SpecialEvent_ChangeWinCondition) == 0x000004, "Wrong size on FortAthenaMutator_SpecialEvent_ChangeWinCondition");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_ChangeWinCondition, NewGoalScore) == 0x000000, "Member 'FortAthenaMutator_SpecialEvent_ChangeWinCondition::NewGoalScore' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.ForceSafeZoneFinalLocation
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaMutator_SpecialEvent_ForceSafeZoneFinalLocation final
{
public:
	struct FVector                                NewFinalLocation;                                  // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultAircraftOffsetFromMidLine;                  // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDefaultMidlineAngle;                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDefaultMidlineAngle;                            // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_SpecialEvent_ForceSafeZoneFinalLocation) == 0x000004, "Wrong alignment on FortAthenaMutator_SpecialEvent_ForceSafeZoneFinalLocation");
static_assert(sizeof(FortAthenaMutator_SpecialEvent_ForceSafeZoneFinalLocation) == 0x000018, "Wrong size on FortAthenaMutator_SpecialEvent_ForceSafeZoneFinalLocation");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_ForceSafeZoneFinalLocation, NewFinalLocation) == 0x000000, "Member 'FortAthenaMutator_SpecialEvent_ForceSafeZoneFinalLocation::NewFinalLocation' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_ForceSafeZoneFinalLocation, DefaultAircraftOffsetFromMidLine) == 0x00000C, "Member 'FortAthenaMutator_SpecialEvent_ForceSafeZoneFinalLocation::DefaultAircraftOffsetFromMidLine' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_ForceSafeZoneFinalLocation, MinDefaultMidlineAngle) == 0x000010, "Member 'FortAthenaMutator_SpecialEvent_ForceSafeZoneFinalLocation::MinDefaultMidlineAngle' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_ForceSafeZoneFinalLocation, MaxDefaultMidlineAngle) == 0x000014, "Member 'FortAthenaMutator_SpecialEvent_ForceSafeZoneFinalLocation::MaxDefaultMidlineAngle' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.JumpToSafeZonePhase
// 0x0014 (0x0014 - 0x0000)
struct FortAthenaMutator_SpecialEvent_JumpToSafeZonePhase final
{
public:
	struct FVector                                PawnSpawnCenterLocation;                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PawnSpawnMinDistance;                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PawnSpawnMaxDistance;                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_SpecialEvent_JumpToSafeZonePhase) == 0x000004, "Wrong alignment on FortAthenaMutator_SpecialEvent_JumpToSafeZonePhase");
static_assert(sizeof(FortAthenaMutator_SpecialEvent_JumpToSafeZonePhase) == 0x000014, "Wrong size on FortAthenaMutator_SpecialEvent_JumpToSafeZonePhase");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_JumpToSafeZonePhase, PawnSpawnCenterLocation) == 0x000000, "Member 'FortAthenaMutator_SpecialEvent_JumpToSafeZonePhase::PawnSpawnCenterLocation' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_JumpToSafeZonePhase, PawnSpawnMinDistance) == 0x00000C, "Member 'FortAthenaMutator_SpecialEvent_JumpToSafeZonePhase::PawnSpawnMinDistance' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_JumpToSafeZonePhase, PawnSpawnMaxDistance) == 0x000010, "Member 'FortAthenaMutator_SpecialEvent_JumpToSafeZonePhase::PawnSpawnMaxDistance' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.OnActorPreSpawnInitialization
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_SpecialEvent_OnActorPreSpawnInitialization final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_SpecialEvent_OnActorPreSpawnInitialization) == 0x000008, "Wrong alignment on FortAthenaMutator_SpecialEvent_OnActorPreSpawnInitialization");
static_assert(sizeof(FortAthenaMutator_SpecialEvent_OnActorPreSpawnInitialization) == 0x000008, "Wrong size on FortAthenaMutator_SpecialEvent_OnActorPreSpawnInitialization");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_OnActorPreSpawnInitialization, Actor) == 0x000000, "Member 'FortAthenaMutator_SpecialEvent_OnActorPreSpawnInitialization::Actor' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.OnActorSpawned
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_SpecialEvent_OnActorSpawned final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_SpecialEvent_OnActorSpawned) == 0x000008, "Wrong alignment on FortAthenaMutator_SpecialEvent_OnActorSpawned");
static_assert(sizeof(FortAthenaMutator_SpecialEvent_OnActorSpawned) == 0x000008, "Wrong size on FortAthenaMutator_SpecialEvent_OnActorSpawned");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_OnActorSpawned, Actor) == 0x000000, "Member 'FortAthenaMutator_SpecialEvent_OnActorSpawned::Actor' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.OnAircraftEnteredDropZone
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_SpecialEvent_OnAircraftEnteredDropZone final
{
public:
	class AFortAthenaAircraft*                    FortAthenaAircraft;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_SpecialEvent_OnAircraftEnteredDropZone) == 0x000008, "Wrong alignment on FortAthenaMutator_SpecialEvent_OnAircraftEnteredDropZone");
static_assert(sizeof(FortAthenaMutator_SpecialEvent_OnAircraftEnteredDropZone) == 0x000008, "Wrong size on FortAthenaMutator_SpecialEvent_OnAircraftEnteredDropZone");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_OnAircraftEnteredDropZone, FortAthenaAircraft) == 0x000000, "Member 'FortAthenaMutator_SpecialEvent_OnAircraftEnteredDropZone::FortAthenaAircraft' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.OnAircraftExitedDropZone
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_SpecialEvent_OnAircraftExitedDropZone final
{
public:
	class AFortAthenaAircraft*                    FortAthenaAircraft;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_SpecialEvent_OnAircraftExitedDropZone) == 0x000008, "Wrong alignment on FortAthenaMutator_SpecialEvent_OnAircraftExitedDropZone");
static_assert(sizeof(FortAthenaMutator_SpecialEvent_OnAircraftExitedDropZone) == 0x000008, "Wrong size on FortAthenaMutator_SpecialEvent_OnAircraftExitedDropZone");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_OnAircraftExitedDropZone, FortAthenaAircraft) == 0x000000, "Member 'FortAthenaMutator_SpecialEvent_OnAircraftExitedDropZone::FortAthenaAircraft' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.OnAircraftFlightEnded
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_SpecialEvent_OnAircraftFlightEnded final
{
public:
	class AFortAthenaAircraft*                    FortAthenaAircraft;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_SpecialEvent_OnAircraftFlightEnded) == 0x000008, "Wrong alignment on FortAthenaMutator_SpecialEvent_OnAircraftFlightEnded");
static_assert(sizeof(FortAthenaMutator_SpecialEvent_OnAircraftFlightEnded) == 0x000008, "Wrong size on FortAthenaMutator_SpecialEvent_OnAircraftFlightEnded");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_OnAircraftFlightEnded, FortAthenaAircraft) == 0x000000, "Member 'FortAthenaMutator_SpecialEvent_OnAircraftFlightEnded::FortAthenaAircraft' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.OnGamePhaseStepChanged
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaMutator_SpecialEvent_OnGamePhaseStepChanged final
{
public:
	TScriptInterface<class IFortSafeZoneInterface> SafeZoneInterface;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAthenaGamePhaseStep                          GamePhaseStep;                                     // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAthenaMutator_SpecialEvent_OnGamePhaseStepChanged) == 0x000008, "Wrong alignment on FortAthenaMutator_SpecialEvent_OnGamePhaseStepChanged");
static_assert(sizeof(FortAthenaMutator_SpecialEvent_OnGamePhaseStepChanged) == 0x000018, "Wrong size on FortAthenaMutator_SpecialEvent_OnGamePhaseStepChanged");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_OnGamePhaseStepChanged, SafeZoneInterface) == 0x000000, "Member 'FortAthenaMutator_SpecialEvent_OnGamePhaseStepChanged::SafeZoneInterface' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_OnGamePhaseStepChanged, GamePhaseStep) == 0x000010, "Member 'FortAthenaMutator_SpecialEvent_OnGamePhaseStepChanged::GamePhaseStep' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.OnGameViewportActivationChanged
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_SpecialEvent_OnGameViewportActivationChanged final
{
public:
	bool                                          bHasFocus;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_SpecialEvent_OnGameViewportActivationChanged) == 0x000001, "Wrong alignment on FortAthenaMutator_SpecialEvent_OnGameViewportActivationChanged");
static_assert(sizeof(FortAthenaMutator_SpecialEvent_OnGameViewportActivationChanged) == 0x000001, "Wrong size on FortAthenaMutator_SpecialEvent_OnGameViewportActivationChanged");
static_assert(offsetof(FortAthenaMutator_SpecialEvent_OnGameViewportActivationChanged, bHasFocus) == 0x000000, "Member 'FortAthenaMutator_SpecialEvent_OnGameViewportActivationChanged::bHasFocus' has a wrong offset!");

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.OnWarmUpTeleportComplete
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_SpecialEvent_OnWarmUpTeleportComplete final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_SpecialEvent_OnWarmUpTeleportComplete) == 0x000008, "Wrong alignment on FortAthenaMutator_SpecialEvent_OnWarmUpTeleportComplete");
static_assert(sizeof(FortAthenaMutator_SpecialEvent_OnWarmUpTeleportComplete) == 0x000008, "Wrong size on FortAthenaMutator_SpecialEvent_OnWarmUpTeleportComplete");
