#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpecialEventVaultWorld

#include "Basic.hpp"

#include "VaultWorld_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SpecialEventVaultWorld.SpecialEventVaultWorld_C
// 0x0080 (0x0358 - 0x02D8)
class ASpecialEventVaultWorld_C final : public AVaultWorld_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SpecialEventVaultWorld_C;           // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Floor;                                             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ItemDetails_X_Offset_1EDCEF5F41216A9DADD25897C8B68493; // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ItemDetails__Direction_1EDCEF5F41216A9DADD25897C8B68493; // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ItemDetails;                                       // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Floor_Visibility_FloorMask_37382717410D795E9E7E0990FC3EFCC2; // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Floor_Visibility__Direction_37382717410D795E9E7E0990FC3EFCC2; // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Floor_Visibility;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Background_Effects_SetStreaks_7B5688E44724D9F68D3C20A520093829; // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Background_Effects__Direction_7B5688E44724D9F68D3C20A520093829; // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Background_Effects;                                // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_FX_Transition_Fade_FDB9DC244ED5578954F07A87EDA84CA5; // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_Pre_TransitionOffset_FDB9DC244ED5578954F07A87EDA84CA5; // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_Forward_FDB9DC244ED5578954F07A87EDA84CA5; // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TransitionForward__Direction_FDB9DC244ED5578954F07A87EDA84CA5; // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TransitionForward;                                 // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionBackward_fx_Transition_fade_9CCDE9524354AF859735079DD2ED12AA; // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionBackward_Pre_Transition_Offset_9CCDE9524354AF859735079DD2ED12AA; // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionBackward_Backward_9CCDE9524354AF859735079DD2ED12AA; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TransitionBackward__Direction_9CCDE9524354AF859735079DD2ED12AA; // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TransitionBackward;                                // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      FloorMI;                                           // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FloorMID;                                          // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TransitionForward__UpdateFunc();
	void UserConstructionScript();
	void TransitionForward__FinishedFunc();
	void TransitionBackward__UpdateFunc();
	void TransitionBackward__FinishedFunc();
	void TransitionBackgroundForward(float Forward, float PreTransitionOffset, float FXTransitionFade, class UMaterialInstanceDynamic* Mid);
	void TransitionBackgroundBackward(float Backward, float PreTransitionOffset, float FXTransitionFade, class UMaterialInstanceDynamic* Mid);
	void SetupBackgroundMaterial(class UTexture2D*& TextureBackground, struct FTrackDynamicBackground& BackgroundInfo, class UMaterialInstanceDynamic* Mid);
	void ReceiveBeginPlay();
	void OnUpdateMaterialIndex(int32 MaterialIndex);
	void OnUpdateDisplay(bool bShowFloor, bool bShowEffects);
	void OnTransitionItemDetails(const bool bShowItemDetails);
	void OnTransitionBackground(bool bPlayForward);
	void OnSetupBackground(const class UTexture2D* LoadedBackgroundTexture, const struct FTrackDynamicBackground& BackgroundInfo);
	void OnInitialBackgroundTransition();
	void ItemDetails__UpdateFunc();
	void ItemDetails__FinishedFunc();
	void Floor_Visibility__UpdateFunc();
	void Floor_Visibility__FinishedFunc();
	void ExecuteUbergraph_SpecialEventVaultWorld(int32 EntryPoint);
	void Background_Effects__UpdateFunc();
	void Background_Effects__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpecialEventVaultWorld_C">();
	}
	static class ASpecialEventVaultWorld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpecialEventVaultWorld_C>();
	}
};
static_assert(alignof(ASpecialEventVaultWorld_C) == 0x000008, "Wrong alignment on ASpecialEventVaultWorld_C");
static_assert(sizeof(ASpecialEventVaultWorld_C) == 0x000358, "Wrong size on ASpecialEventVaultWorld_C");
static_assert(offsetof(ASpecialEventVaultWorld_C, UberGraphFrame_SpecialEventVaultWorld_C) == 0x0002D8, "Member 'ASpecialEventVaultWorld_C::UberGraphFrame_SpecialEventVaultWorld_C' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, Floor) == 0x0002E0, "Member 'ASpecialEventVaultWorld_C::Floor' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, ItemDetails_X_Offset_1EDCEF5F41216A9DADD25897C8B68493) == 0x0002E8, "Member 'ASpecialEventVaultWorld_C::ItemDetails_X_Offset_1EDCEF5F41216A9DADD25897C8B68493' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, ItemDetails__Direction_1EDCEF5F41216A9DADD25897C8B68493) == 0x0002EC, "Member 'ASpecialEventVaultWorld_C::ItemDetails__Direction_1EDCEF5F41216A9DADD25897C8B68493' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, ItemDetails) == 0x0002F0, "Member 'ASpecialEventVaultWorld_C::ItemDetails' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, Floor_Visibility_FloorMask_37382717410D795E9E7E0990FC3EFCC2) == 0x0002F8, "Member 'ASpecialEventVaultWorld_C::Floor_Visibility_FloorMask_37382717410D795E9E7E0990FC3EFCC2' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, Floor_Visibility__Direction_37382717410D795E9E7E0990FC3EFCC2) == 0x0002FC, "Member 'ASpecialEventVaultWorld_C::Floor_Visibility__Direction_37382717410D795E9E7E0990FC3EFCC2' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, Floor_Visibility) == 0x000300, "Member 'ASpecialEventVaultWorld_C::Floor_Visibility' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, Background_Effects_SetStreaks_7B5688E44724D9F68D3C20A520093829) == 0x000308, "Member 'ASpecialEventVaultWorld_C::Background_Effects_SetStreaks_7B5688E44724D9F68D3C20A520093829' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, Background_Effects__Direction_7B5688E44724D9F68D3C20A520093829) == 0x00030C, "Member 'ASpecialEventVaultWorld_C::Background_Effects__Direction_7B5688E44724D9F68D3C20A520093829' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, Background_Effects) == 0x000310, "Member 'ASpecialEventVaultWorld_C::Background_Effects' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionForward_FX_Transition_Fade_FDB9DC244ED5578954F07A87EDA84CA5) == 0x000318, "Member 'ASpecialEventVaultWorld_C::TransitionForward_FX_Transition_Fade_FDB9DC244ED5578954F07A87EDA84CA5' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionForward_Pre_TransitionOffset_FDB9DC244ED5578954F07A87EDA84CA5) == 0x00031C, "Member 'ASpecialEventVaultWorld_C::TransitionForward_Pre_TransitionOffset_FDB9DC244ED5578954F07A87EDA84CA5' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionForward_Forward_FDB9DC244ED5578954F07A87EDA84CA5) == 0x000320, "Member 'ASpecialEventVaultWorld_C::TransitionForward_Forward_FDB9DC244ED5578954F07A87EDA84CA5' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionForward__Direction_FDB9DC244ED5578954F07A87EDA84CA5) == 0x000324, "Member 'ASpecialEventVaultWorld_C::TransitionForward__Direction_FDB9DC244ED5578954F07A87EDA84CA5' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionForward) == 0x000328, "Member 'ASpecialEventVaultWorld_C::TransitionForward' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionBackward_fx_Transition_fade_9CCDE9524354AF859735079DD2ED12AA) == 0x000330, "Member 'ASpecialEventVaultWorld_C::TransitionBackward_fx_Transition_fade_9CCDE9524354AF859735079DD2ED12AA' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionBackward_Pre_Transition_Offset_9CCDE9524354AF859735079DD2ED12AA) == 0x000334, "Member 'ASpecialEventVaultWorld_C::TransitionBackward_Pre_Transition_Offset_9CCDE9524354AF859735079DD2ED12AA' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionBackward_Backward_9CCDE9524354AF859735079DD2ED12AA) == 0x000338, "Member 'ASpecialEventVaultWorld_C::TransitionBackward_Backward_9CCDE9524354AF859735079DD2ED12AA' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionBackward__Direction_9CCDE9524354AF859735079DD2ED12AA) == 0x00033C, "Member 'ASpecialEventVaultWorld_C::TransitionBackward__Direction_9CCDE9524354AF859735079DD2ED12AA' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionBackward) == 0x000340, "Member 'ASpecialEventVaultWorld_C::TransitionBackward' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, FloorMI) == 0x000348, "Member 'ASpecialEventVaultWorld_C::FloorMI' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, FloorMID) == 0x000350, "Member 'ASpecialEventVaultWorld_C::FloorMID' has a wrong offset!");

}

