#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpecialEventGameplayUI

#include "Basic.hpp"

#include "SpecialEventGameplayUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class SpecialEventGameplayUI.FortGameplayCinematicHostWidget
// 0x0038 (0x02E8 - 0x02B0)
class UFortGameplayCinematicHostWidget final : public UFortHUDElementWidget
{
public:
	class FName                                   IntroWidgetEntryName;                              // 0x02B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCinematicWidgetData>           WidgetEntries;                                     // 0x02B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UAthenaLoadingScreenItemDefinition*     LoadingScreenDefinition;                           // 0x02C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D0[0x18];                                     // 0x02D0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayCinematicHostWidget">();
	}
	static class UFortGameplayCinematicHostWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayCinematicHostWidget>();
	}
};
static_assert(alignof(UFortGameplayCinematicHostWidget) == 0x000008, "Wrong alignment on UFortGameplayCinematicHostWidget");
static_assert(sizeof(UFortGameplayCinematicHostWidget) == 0x0002E8, "Wrong size on UFortGameplayCinematicHostWidget");
static_assert(offsetof(UFortGameplayCinematicHostWidget, IntroWidgetEntryName) == 0x0002B0, "Member 'UFortGameplayCinematicHostWidget::IntroWidgetEntryName' has a wrong offset!");
static_assert(offsetof(UFortGameplayCinematicHostWidget, WidgetEntries) == 0x0002B8, "Member 'UFortGameplayCinematicHostWidget::WidgetEntries' has a wrong offset!");
static_assert(offsetof(UFortGameplayCinematicHostWidget, LoadingScreenDefinition) == 0x0002C8, "Member 'UFortGameplayCinematicHostWidget::LoadingScreenDefinition' has a wrong offset!");

// Class SpecialEventGameplayUI.FortGameplayCinematicWidget
// 0x0020 (0x0350 - 0x0330)
class UFortGameplayCinematicWidget final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0x8];                                      // 0x0330(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSkipCinematics;                                   // 0x0338(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_339[0x17];                                     // 0x0339(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCinematicFinished();
	void OnStartCinematic();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayCinematicWidget">();
	}
	static class UFortGameplayCinematicWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayCinematicWidget>();
	}
};
static_assert(alignof(UFortGameplayCinematicWidget) == 0x000008, "Wrong alignment on UFortGameplayCinematicWidget");
static_assert(sizeof(UFortGameplayCinematicWidget) == 0x000350, "Wrong size on UFortGameplayCinematicWidget");
static_assert(offsetof(UFortGameplayCinematicWidget, bSkipCinematics) == 0x000338, "Member 'UFortGameplayCinematicWidget::bSkipCinematics' has a wrong offset!");

// Class SpecialEventGameplayUI.FortGameplayIntroPanelWidget
// 0x0020 (0x0350 - 0x0330)
class UFortGameplayIntroPanelWidget final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0x20];                                     // 0x0330(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnIntroFinished();
	void OnStartIntro();
	void OnWaitingForMinTime();
	void OnWaitingForPawn();
	void OnWaitingForReadyForGameplay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayIntroPanelWidget">();
	}
	static class UFortGameplayIntroPanelWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayIntroPanelWidget>();
	}
};
static_assert(alignof(UFortGameplayIntroPanelWidget) == 0x000008, "Wrong alignment on UFortGameplayIntroPanelWidget");
static_assert(sizeof(UFortGameplayIntroPanelWidget) == 0x000350, "Wrong size on UFortGameplayIntroPanelWidget");

}

