#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplashScreenWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SplashScreenWidget.SplashScreenWidget_C
// 0x0060 (0x04D8 - 0x0478)
class USplashScreenWidget_C final : public UFortSplashScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       InputPromptIdle;                                   // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonActionWidget*                    GamepadActionWidget;                               // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         GamepadInputHbox;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       GamepadInputText;                                  // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       I_Fortnite;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageFakeButtonBackground;                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MobileInputHbox;                                   // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MobileInputText;                                   // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MouseInputHBox;                                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MouseInputText;                                    // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Input;                                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnInputMethodChanged(ECommonInputType InputType);
	void ExecuteUbergraph_SplashScreenWidget(int32 EntryPoint);
	void BP_OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SplashScreenWidget_C">();
	}
	static class USplashScreenWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USplashScreenWidget_C>();
	}
};
static_assert(alignof(USplashScreenWidget_C) == 0x000008, "Wrong alignment on USplashScreenWidget_C");
static_assert(sizeof(USplashScreenWidget_C) == 0x0004D8, "Wrong size on USplashScreenWidget_C");
static_assert(offsetof(USplashScreenWidget_C, UberGraphFrame) == 0x000478, "Member 'USplashScreenWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, InputPromptIdle) == 0x000480, "Member 'USplashScreenWidget_C::InputPromptIdle' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, GamepadActionWidget) == 0x000488, "Member 'USplashScreenWidget_C::GamepadActionWidget' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, GamepadInputHbox) == 0x000490, "Member 'USplashScreenWidget_C::GamepadInputHbox' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, GamepadInputText) == 0x000498, "Member 'USplashScreenWidget_C::GamepadInputText' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, I_Fortnite) == 0x0004A0, "Member 'USplashScreenWidget_C::I_Fortnite' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, ImageFakeButtonBackground) == 0x0004A8, "Member 'USplashScreenWidget_C::ImageFakeButtonBackground' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, MobileInputHbox) == 0x0004B0, "Member 'USplashScreenWidget_C::MobileInputHbox' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, MobileInputText) == 0x0004B8, "Member 'USplashScreenWidget_C::MobileInputText' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, MouseInputHBox) == 0x0004C0, "Member 'USplashScreenWidget_C::MouseInputHBox' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, MouseInputText) == 0x0004C8, "Member 'USplashScreenWidget_C::MouseInputText' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, Switcher_Input) == 0x0004D0, "Member 'USplashScreenWidget_C::Switcher_Input' has a wrong offset!");

}

