#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SquadSelection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SquadSelection.SquadSelection_C
// 0x0018 (0x03C8 - 0x03B0)
class USquadSelection_C final : public UFortSquadSelectionMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCloseButton_C*                         Mobile_CloseButton;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void ExecuteUbergraph_SquadSelection(int32 EntryPoint);
	void OnLocalPlayerParticipationChanged(bool bIsParticipating);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SquadSelection_C">();
	}
	static class USquadSelection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USquadSelection_C>();
	}
};
static_assert(alignof(USquadSelection_C) == 0x000008, "Wrong alignment on USquadSelection_C");
static_assert(sizeof(USquadSelection_C) == 0x0003C8, "Wrong size on USquadSelection_C");
static_assert(offsetof(USquadSelection_C, UberGraphFrame) == 0x0003B0, "Member 'USquadSelection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USquadSelection_C, Mobile_CloseButton) == 0x0003B8, "Member 'USquadSelection_C::Mobile_CloseButton' has a wrong offset!");
static_assert(offsetof(USquadSelection_C, SafeZone_0) == 0x0003C0, "Member 'USquadSelection_C::SafeZone_0' has a wrong offset!");

}

