#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SquadMemberTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SquadMemberTile.SquadMemberTile_C
// 0x0080 (0x0FE0 - 0x0F60)
class USquadMemberTile_C final : public UAthenaSquadMemberDetailedEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnIntro;                                           // 0x0F68(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnLocalUserDefined;                                // 0x0F70(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnSelected;                                        // 0x0F78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SetRibbonRotation;                                 // 0x0F80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StyleEmpty;                                        // 0x0F88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StyleNotReady;                                     // 0x0F90(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StyleReady;                                        // 0x0F98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StyleSitOut;                                       // 0x0FA0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHovered;                                         // 0x0FA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadingThrobberBacking;                            // 0x0FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LocalUserIcon;                                     // 0x0FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SquadOverlay;                                      // 0x0FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SquadRibbon;                                       // 0x0FD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnTeamMemberEstablished(bool bHasValidMember);
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_SquadMemberTile(int32 EntryPoint);
	void OnLoaded_A3B69DDA4214DBAA66546FAB9F43D5E7(class UObject* Loaded);
	void OnMemberGameReadinessChanged(EGameReadiness ReadyStatus);
	void OnMemberIsInFrontendChanged(bool bIsInFrontEnd);
	void OnSquadAssigned();
	void PreConstruct(bool IsDesignTime);
	void SetEmptyVisuals();
	void SetNotReadyVisuals();
	void SetReadyVisuals();
	void SetSitOutVisuals();
	void SetVisuals(EGameReadiness Member_Readiness, bool Is_In_Frontend);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SquadMemberTile_C">();
	}
	static class USquadMemberTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USquadMemberTile_C>();
	}
};
static_assert(alignof(USquadMemberTile_C) == 0x000010, "Wrong alignment on USquadMemberTile_C");
static_assert(sizeof(USquadMemberTile_C) == 0x000FE0, "Wrong size on USquadMemberTile_C");
static_assert(offsetof(USquadMemberTile_C, UberGraphFrame) == 0x000F60, "Member 'USquadMemberTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, OnIntro) == 0x000F68, "Member 'USquadMemberTile_C::OnIntro' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, OnLocalUserDefined) == 0x000F70, "Member 'USquadMemberTile_C::OnLocalUserDefined' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, OnSelected) == 0x000F78, "Member 'USquadMemberTile_C::OnSelected' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, SetRibbonRotation) == 0x000F80, "Member 'USquadMemberTile_C::SetRibbonRotation' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, StyleEmpty) == 0x000F88, "Member 'USquadMemberTile_C::StyleEmpty' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, StyleNotReady) == 0x000F90, "Member 'USquadMemberTile_C::StyleNotReady' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, StyleReady) == 0x000F98, "Member 'USquadMemberTile_C::StyleReady' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, StyleSitOut) == 0x000FA0, "Member 'USquadMemberTile_C::StyleSitOut' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, OnHovered) == 0x000FA8, "Member 'USquadMemberTile_C::OnHovered' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, EntryBorder) == 0x000FB0, "Member 'USquadMemberTile_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, LoadingThrobberBacking) == 0x000FB8, "Member 'USquadMemberTile_C::LoadingThrobberBacking' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, LocalUserIcon) == 0x000FC0, "Member 'USquadMemberTile_C::LocalUserIcon' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, SquadOverlay) == 0x000FC8, "Member 'USquadMemberTile_C::SquadOverlay' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, SquadRibbon) == 0x000FD0, "Member 'USquadMemberTile_C::SquadRibbon' has a wrong offset!");

}

