#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SR_Core

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SrirachaRanch_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SR_Core.SR_Core_C
// 0x0010 (0x0458 - 0x0448)
class USR_Core_C final : public UStreamingRadioPlayerComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0448(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bMixIsActive;                                      // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsADS;                                            // 0x0451(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInsideVehicle;                                  // 0x0452(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SR_Core(int32 EntryPoint);
	void GetIsMixAllowed(bool* MixAllowed);
	void HandleADSStateUpdated(bool Is_Targeting);
	void HandleOnSourcePlayed(class UStreamingRadioPlayerComponent* Component, const struct FAthenaRadioStation& AffectedSource);
	void HandleSeatStateUpdated(class AFortPawn* Pawn, bool Entering, int32 SeatIdx);
	void HandleWeaponStateUpdated(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnPawnEnterSeat(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void OnPawnExitSeat(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void UpdateMixState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SR_Core_C">();
	}
	static class USR_Core_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USR_Core_C>();
	}
};
static_assert(alignof(USR_Core_C) == 0x000008, "Wrong alignment on USR_Core_C");
static_assert(sizeof(USR_Core_C) == 0x000458, "Wrong size on USR_Core_C");
static_assert(offsetof(USR_Core_C, UberGraphFrame) == 0x000448, "Member 'USR_Core_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USR_Core_C, bMixIsActive) == 0x000450, "Member 'USR_Core_C::bMixIsActive' has a wrong offset!");
static_assert(offsetof(USR_Core_C, bIsADS) == 0x000451, "Member 'USR_Core_C::bIsADS' has a wrong offset!");
static_assert(offsetof(USR_Core_C, bIsInsideVehicle) == 0x000452, "Member 'USR_Core_C::bIsInsideVehicle' has a wrong offset!");

}

