#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StandaloneItemShop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StandaloneItemShop.StandaloneItemShop_C
// 0x0040 (0x05B8 - 0x0578)
class UStandaloneItemShop_C final : public UFortStandaloneItemShop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaLockerTab_C*                     ActivatableContent_Locker;                         // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Tabs;                                         // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                LoadingBackground;                                 // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMTXButton_C*                           MTXButton;                                         // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    NextTabAction;                                     // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    PreviousTabAction;                                 // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_TabButtons;                               // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_StandaloneItemShop(int32 EntryPoint);
	void InitializeTabs();
	void OnCameraLevelLoaded();
	void OnLoadingIndicatorShown(bool bShown);
	void OnTabSelected(int32 TabIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StandaloneItemShop_C">();
	}
	static class UStandaloneItemShop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStandaloneItemShop_C>();
	}
};
static_assert(alignof(UStandaloneItemShop_C) == 0x000008, "Wrong alignment on UStandaloneItemShop_C");
static_assert(sizeof(UStandaloneItemShop_C) == 0x0005B8, "Wrong size on UStandaloneItemShop_C");
static_assert(offsetof(UStandaloneItemShop_C, UberGraphFrame) == 0x000578, "Member 'UStandaloneItemShop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStandaloneItemShop_C, ActivatableContent_Locker) == 0x000580, "Member 'UStandaloneItemShop_C::ActivatableContent_Locker' has a wrong offset!");
static_assert(offsetof(UStandaloneItemShop_C, HBox_Tabs) == 0x000588, "Member 'UStandaloneItemShop_C::HBox_Tabs' has a wrong offset!");
static_assert(offsetof(UStandaloneItemShop_C, LoadingBackground) == 0x000590, "Member 'UStandaloneItemShop_C::LoadingBackground' has a wrong offset!");
static_assert(offsetof(UStandaloneItemShop_C, MTXButton) == 0x000598, "Member 'UStandaloneItemShop_C::MTXButton' has a wrong offset!");
static_assert(offsetof(UStandaloneItemShop_C, NextTabAction) == 0x0005A0, "Member 'UStandaloneItemShop_C::NextTabAction' has a wrong offset!");
static_assert(offsetof(UStandaloneItemShop_C, PreviousTabAction) == 0x0005A8, "Member 'UStandaloneItemShop_C::PreviousTabAction' has a wrong offset!");
static_assert(offsetof(UStandaloneItemShop_C, SafeZone_TabButtons) == 0x0005B0, "Member 'UStandaloneItemShop_C::SafeZone_TabButtons' has a wrong offset!");

}

