#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreMain_Root

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StoreMain_Root.StoreMain_Root_C
// 0x00C8 (0x05F0 - 0x0528)
class UStoreMain_Root_C final : public UFortMtxStoreRootBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_0;                                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_3;                                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Container_AvailableAmount;                         // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CurrencyNotificationBorder;                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrencyNotificationText;                          // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_142;                                         // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             NewLTMGrid;                                        // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NEWLTMOfferSection;                                // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NewNoOffersBox;                                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NewPurchasingDisabledBox;                          // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewSpinner;                                        // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            NewSwitcherItemsProgress;                          // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             NewVBuckGrid;                                      // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NewVbuckOffers;                                    // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NewVBuckSection;                                   // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              OfferScaleBoxRoot;                                 // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleMTXDisplay_C*                    SimpleMTXDisplay;                                  // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStore_BannerMessage_C*                 StoreBannerMessage;                                // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAudioComponent*                        Ambient_Sound;                                     // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                InitiallyFocusedOffer;                             // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowingCampaignUpsell;                            // 0x05E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateCurrencyNotification();
	void Start_Ambient_Sound(bool Condition);
	void SetupForCampaignUpsell();
	void SetupFirstFocusableTile();
	void PlayEquippedLockerMusic();
	void OnUpdateOtherPlatformMTXMessage(bool HasOtherPlatformCurrency, const class FText& CurrencyMessageLocText);
	void OnTransitionedBySwitcher();
	void OnStartReadingOffers();
	void OnPurchasingDisabled();
	void OnOffersGenerated();
	void OnMainTabSelected(class FName TabName);
	void NoOffersAvailable();
	void LayoutVBuckTiles();
	void HandleRedeem(bool* bPassThrough);
	void HandleGenerateOffer(class UFortStoreFrontOfferInfo* OfferInfo);
	void HandleBack(bool* PassThrough);
	void HandleAllOffersGenerated();
	void GetVisibilityByChildrenPresence(class UPanelWidget* Panel, ESlateVisibility* NewParam);
	void GenerateOfferWidget(class UFortStoreFrontOfferInfo* OfferData);
	void Focus();
	void ExecuteUbergraph_StoreMain_Root(int32 EntryPoint);
	void Destruct();
	void Construct();
	void ClearOfferWidgets();
	void BP_OnActivated();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StoreMain_Root_C">();
	}
	static class UStoreMain_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreMain_Root_C>();
	}
};
static_assert(alignof(UStoreMain_Root_C) == 0x000008, "Wrong alignment on UStoreMain_Root_C");
static_assert(sizeof(UStoreMain_Root_C) == 0x0005F0, "Wrong size on UStoreMain_Root_C");
static_assert(offsetof(UStoreMain_Root_C, UberGraphFrame) == 0x000528, "Member 'UStoreMain_Root_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, Intro) == 0x000530, "Member 'UStoreMain_Root_C::Intro' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, CommonBorder_0) == 0x000538, "Member 'UStoreMain_Root_C::CommonBorder_0' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, CommonTextBlock_3) == 0x000540, "Member 'UStoreMain_Root_C::CommonTextBlock_3' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, Container_AvailableAmount) == 0x000548, "Member 'UStoreMain_Root_C::Container_AvailableAmount' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, CurrencyNotificationBorder) == 0x000550, "Member 'UStoreMain_Root_C::CurrencyNotificationBorder' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, CurrencyNotificationText) == 0x000558, "Member 'UStoreMain_Root_C::CurrencyNotificationText' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, HorizontalBox_0) == 0x000560, "Member 'UStoreMain_Root_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, Image_142) == 0x000568, "Member 'UStoreMain_Root_C::Image_142' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, NewLTMGrid) == 0x000570, "Member 'UStoreMain_Root_C::NewLTMGrid' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, NEWLTMOfferSection) == 0x000578, "Member 'UStoreMain_Root_C::NEWLTMOfferSection' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, NewNoOffersBox) == 0x000580, "Member 'UStoreMain_Root_C::NewNoOffersBox' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, NewPurchasingDisabledBox) == 0x000588, "Member 'UStoreMain_Root_C::NewPurchasingDisabledBox' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, NewSpinner) == 0x000590, "Member 'UStoreMain_Root_C::NewSpinner' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, NewSwitcherItemsProgress) == 0x000598, "Member 'UStoreMain_Root_C::NewSwitcherItemsProgress' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, NewVBuckGrid) == 0x0005A0, "Member 'UStoreMain_Root_C::NewVBuckGrid' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, NewVbuckOffers) == 0x0005A8, "Member 'UStoreMain_Root_C::NewVbuckOffers' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, NewVBuckSection) == 0x0005B0, "Member 'UStoreMain_Root_C::NewVBuckSection' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, OfferScaleBoxRoot) == 0x0005B8, "Member 'UStoreMain_Root_C::OfferScaleBoxRoot' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, Overlay_0) == 0x0005C0, "Member 'UStoreMain_Root_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, SimpleMTXDisplay) == 0x0005C8, "Member 'UStoreMain_Root_C::SimpleMTXDisplay' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, StoreBannerMessage) == 0x0005D0, "Member 'UStoreMain_Root_C::StoreBannerMessage' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, Ambient_Sound) == 0x0005D8, "Member 'UStoreMain_Root_C::Ambient_Sound' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, InitiallyFocusedOffer) == 0x0005E0, "Member 'UStoreMain_Root_C::InitiallyFocusedOffer' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, bShowingCampaignUpsell) == 0x0005E8, "Member 'UStoreMain_Root_C::bShowingCampaignUpsell' has a wrong offset!");

}

