#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreMain_MTXOffer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function StoreMain_MTXOffer.StoreMain_MTXOffer_C.TriggerIntro
// 0x0008 (0x0008 - 0x0000)
struct StoreMain_MTXOffer_C_TriggerIntro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_MTXOffer_C_TriggerIntro) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_TriggerIntro");
static_assert(sizeof(StoreMain_MTXOffer_C_TriggerIntro) == 0x000008, "Wrong size on StoreMain_MTXOffer_C_TriggerIntro");
static_assert(offsetof(StoreMain_MTXOffer_C_TriggerIntro, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'StoreMain_MTXOffer_C_TriggerIntro::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function StoreMain_MTXOffer.StoreMain_MTXOffer_C.SetTileSize
// 0x0068 (0x0068 - 0x0000)
struct StoreMain_MTXOffer_C_SetTileSize final
{
public:
	EFortMtxOfferDisplaySize                      DisplaySize;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0008(0x0058)(HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_MTXOffer_C_SetTileSize) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_SetTileSize");
static_assert(sizeof(StoreMain_MTXOffer_C_SetTileSize) == 0x000068, "Wrong size on StoreMain_MTXOffer_C_SetTileSize");
static_assert(offsetof(StoreMain_MTXOffer_C_SetTileSize, DisplaySize) == 0x000000, "Member 'StoreMain_MTXOffer_C_SetTileSize::DisplaySize' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_SetTileSize, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'StoreMain_MTXOffer_C_SetTileSize::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_SetTileSize, K2Node_MakeStruct_SlateFontInfo) == 0x000008, "Member 'StoreMain_MTXOffer_C_SetTileSize::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_SetTileSize, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000060, "Member 'StoreMain_MTXOffer_C_SetTileSize::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function StoreMain_MTXOffer.StoreMain_MTXOffer_C.SetTextOutlineColor
// 0x0030 (0x0030 - 0x0000)
struct StoreMain_MTXOffer_C_SetTextOutlineColor final
{
public:
	class UTextBlock*                             Text;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortMtxGradient                       Gradient;                                          // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicOutlineMaterial_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_MTXOffer_C_SetTextOutlineColor) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_SetTextOutlineColor");
static_assert(sizeof(StoreMain_MTXOffer_C_SetTextOutlineColor) == 0x000030, "Wrong size on StoreMain_MTXOffer_C_SetTextOutlineColor");
static_assert(offsetof(StoreMain_MTXOffer_C_SetTextOutlineColor, Text) == 0x000000, "Member 'StoreMain_MTXOffer_C_SetTextOutlineColor::Text' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_SetTextOutlineColor, Gradient) == 0x000008, "Member 'StoreMain_MTXOffer_C_SetTextOutlineColor::Gradient' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_SetTextOutlineColor, CallFunc_GetDynamicOutlineMaterial_ReturnValue) == 0x000028, "Member 'StoreMain_MTXOffer_C_SetTextOutlineColor::CallFunc_GetDynamicOutlineMaterial_ReturnValue' has a wrong offset!");

// Function StoreMain_MTXOffer.StoreMain_MTXOffer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct StoreMain_MTXOffer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_MTXOffer_C_PreConstruct) == 0x000001, "Wrong alignment on StoreMain_MTXOffer_C_PreConstruct");
static_assert(sizeof(StoreMain_MTXOffer_C_PreConstruct) == 0x000001, "Wrong size on StoreMain_MTXOffer_C_PreConstruct");
static_assert(offsetof(StoreMain_MTXOffer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'StoreMain_MTXOffer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function StoreMain_MTXOffer.StoreMain_MTXOffer_C.OnUpdateStorePrice
// 0x0018 (0x0018 - 0x0000)
struct StoreMain_MTXOffer_C_OnUpdateStorePrice final
{
public:
	class FText                                   InStorePrice;                                      // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(StoreMain_MTXOffer_C_OnUpdateStorePrice) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_OnUpdateStorePrice");
static_assert(sizeof(StoreMain_MTXOffer_C_OnUpdateStorePrice) == 0x000018, "Wrong size on StoreMain_MTXOffer_C_OnUpdateStorePrice");
static_assert(offsetof(StoreMain_MTXOffer_C_OnUpdateStorePrice, InStorePrice) == 0x000000, "Member 'StoreMain_MTXOffer_C_OnUpdateStorePrice::InStorePrice' has a wrong offset!");

// Function StoreMain_MTXOffer.StoreMain_MTXOffer_C.OnOfferTileBrushLoaded
// 0x00B0 (0x00B0 - 0x0000)
struct StoreMain_MTXOffer_C_OnOfferTileBrushLoaded final
{
public:
	struct FSlateBrush                            OfferBrush;                                        // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(StoreMain_MTXOffer_C_OnOfferTileBrushLoaded) == 0x000010, "Wrong alignment on StoreMain_MTXOffer_C_OnOfferTileBrushLoaded");
static_assert(sizeof(StoreMain_MTXOffer_C_OnOfferTileBrushLoaded) == 0x0000B0, "Wrong size on StoreMain_MTXOffer_C_OnOfferTileBrushLoaded");
static_assert(offsetof(StoreMain_MTXOffer_C_OnOfferTileBrushLoaded, OfferBrush) == 0x000000, "Member 'StoreMain_MTXOffer_C_OnOfferTileBrushLoaded::OfferBrush' has a wrong offset!");

// Function StoreMain_MTXOffer.StoreMain_MTXOffer_C.InitOffer
// 0x0370 (0x0370 - 0x0000)
struct StoreMain_MTXOffer_C_InitOffer final
{
public:
	class UFortMtxOfferData*                      DisplayAsset;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortMtxGradient                       Gradient;                                          // 0x0008(0x0020)(Edit, BlueprintVisible, NoDestructor)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            TileImage;                                         // 0x0030(0x00B0)(Edit, BlueprintVisible)
	int32                                         TotalQuantity;                                     // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BonusQuantity;                                     // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               OfferInfo;                                         // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   BonusMTX;                                          // 0x00F0(0x0018)(Edit, BlueprintVisible)
	class FText                                   BaseMtx;                                           // 0x0108(0x0018)(Edit, BlueprintVisible)
	class UMaterial*                              OfferMaterial;                                     // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12F[0x1];                                      // 0x012F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBannerOverrideTag_ReturnValue;         // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetSalePriceFromLastAppStore_SalePrice;   // 0x0148(0x0018)()
	bool                                          CallFunc_GetSalePriceFromLastAppStore_ReturnValue; // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0168(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183[0x1];                                      // 0x0183(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetStorefrontName_ReturnValue;            // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPurchasingAvailable_ReturnValue;        // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18E[0x2];                                      // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0190(0x00B0)()
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetNormalPrice_ReturnValue;               // 0x0248(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0260(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0280(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetName_ReturnValue;                      // 0x02A0(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x2];                                      // 0x02BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBonusQuantity_ReturnValue;             // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetBonusText_BonusText;                   // 0x02C8(0x0018)()
	EFortMtxStoreOfferType                        CallFunc_GetFortStoreOfferType_ReturnValue;        // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMtxOfferData*                      CallFunc_GetOfferDisplayAsset_ReturnValue;         // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_1;               // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMtxOfferDisplaySize                      CallFunc_GetOfferDisplaySize_ReturnValue;          // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_312[0x2];                                      // 0x0312(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalQuantity_ReturnValue;             // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_2;               // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetBannerOverrideTag_ReturnValue_1;       // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_3;                           // 0x0338(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_4;                           // 0x0348(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_MTXOffer_C_InitOffer) == 0x000010, "Wrong alignment on StoreMain_MTXOffer_C_InitOffer");
static_assert(sizeof(StoreMain_MTXOffer_C_InitOffer) == 0x000370, "Wrong size on StoreMain_MTXOffer_C_InitOffer");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, DisplayAsset) == 0x000000, "Member 'StoreMain_MTXOffer_C_InitOffer::DisplayAsset' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, Gradient) == 0x000008, "Member 'StoreMain_MTXOffer_C_InitOffer::Gradient' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, TileImage) == 0x000030, "Member 'StoreMain_MTXOffer_C_InitOffer::TileImage' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, TotalQuantity) == 0x0000E0, "Member 'StoreMain_MTXOffer_C_InitOffer::TotalQuantity' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, BonusQuantity) == 0x0000E4, "Member 'StoreMain_MTXOffer_C_InitOffer::BonusQuantity' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, OfferInfo) == 0x0000E8, "Member 'StoreMain_MTXOffer_C_InitOffer::OfferInfo' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, BonusMTX) == 0x0000F0, "Member 'StoreMain_MTXOffer_C_InitOffer::BonusMTX' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, BaseMtx) == 0x000108, "Member 'StoreMain_MTXOffer_C_InitOffer::BaseMtx' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, OfferMaterial) == 0x000120, "Member 'StoreMain_MTXOffer_C_InitOffer::OfferMaterial' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, Temp_byte_Variable) == 0x000128, "Member 'StoreMain_MTXOffer_C_InitOffer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, Temp_bool_Variable) == 0x000129, "Member 'StoreMain_MTXOffer_C_InitOffer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, Temp_byte_Variable_1) == 0x00012A, "Member 'StoreMain_MTXOffer_C_InitOffer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, Temp_byte_Variable_2) == 0x00012B, "Member 'StoreMain_MTXOffer_C_InitOffer::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, Temp_bool_Variable_1) == 0x00012C, "Member 'StoreMain_MTXOffer_C_InitOffer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, Temp_byte_Variable_3) == 0x00012D, "Member 'StoreMain_MTXOffer_C_InitOffer::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, Temp_byte_Variable_4) == 0x00012E, "Member 'StoreMain_MTXOffer_C_InitOffer::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000130, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetBannerOverrideTag_ReturnValue) == 0x000138, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetBannerOverrideTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetSalePriceFromLastAppStore_SalePrice) == 0x000148, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetSalePriceFromLastAppStore_SalePrice' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetSalePriceFromLastAppStore_ReturnValue) == 0x000160, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetSalePriceFromLastAppStore_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_Map_Find_Value) == 0x000168, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_Map_Find_ReturnValue) == 0x000180, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, K2Node_Select_Default) == 0x000181, "Member 'StoreMain_MTXOffer_C_InitOffer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, Temp_byte_Variable_5) == 0x000182, "Member 'StoreMain_MTXOffer_C_InitOffer::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetStorefrontName_ReturnValue) == 0x000184, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetStorefrontName_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_NotEqual_NameName_ReturnValue) == 0x00018C, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_IsPurchasingAvailable_ReturnValue) == 0x00018D, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_IsPurchasingAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, K2Node_MakeStruct_SlateBrush) == 0x000190, "Member 'StoreMain_MTXOffer_C_InitOffer::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetBrushResourceAsTexture2D_ReturnValue) == 0x000240, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetBrushResourceAsTexture2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetNormalPrice_ReturnValue) == 0x000248, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetNormalPrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_Conv_IntToText_ReturnValue) == 0x000260, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_Greater_IntInt_ReturnValue) == 0x000278, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000280, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, K2Node_Select_Default_1) == 0x000298, "Member 'StoreMain_MTXOffer_C_InitOffer::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetName_ReturnValue) == 0x0002A0, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0002B8, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_BooleanAND_ReturnValue) == 0x0002B9, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetBonusQuantity_ReturnValue) == 0x0002BC, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetBonusQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_BooleanOR_ReturnValue) == 0x0002C0, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetBonusText_BonusText) == 0x0002C8, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetBonusText_BonusText' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetFortStoreOfferType_ReturnValue) == 0x0002E0, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetFortStoreOfferType_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetOfferInfo_ReturnValue) == 0x0002E8, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002F0, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetOfferDisplayAsset_ReturnValue) == 0x0002F8, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetOfferDisplayAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, Temp_bool_Variable_2) == 0x000300, "Member 'StoreMain_MTXOffer_C_InitOffer::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetOfferInfo_ReturnValue_1) == 0x000308, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetOfferInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, K2Node_Select_Default_2) == 0x000310, "Member 'StoreMain_MTXOffer_C_InitOffer::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetOfferDisplaySize_ReturnValue) == 0x000311, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetOfferDisplaySize_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetTotalQuantity_ReturnValue) == 0x000314, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetTotalQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetOfferInfo_ReturnValue_2) == 0x000318, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetOfferInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, Temp_bool_Variable_3) == 0x000320, "Member 'StoreMain_MTXOffer_C_InitOffer::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetBannerOverrideTag_ReturnValue_1) == 0x000328, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetBannerOverrideTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, K2Node_Select_Default_3) == 0x000338, "Member 'StoreMain_MTXOffer_C_InitOffer::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, Temp_bool_Variable_4) == 0x000340, "Member 'StoreMain_MTXOffer_C_InitOffer::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, K2Node_Select_Default_4) == 0x000348, "Member 'StoreMain_MTXOffer_C_InitOffer::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000360, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000368, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function StoreMain_MTXOffer.StoreMain_MTXOffer_C.InitialReset
// 0x0008 (0x0008 - 0x0000)
struct StoreMain_MTXOffer_C_InitialReset final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_MTXOffer_C_InitialReset) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_InitialReset");
static_assert(sizeof(StoreMain_MTXOffer_C_InitialReset) == 0x000008, "Wrong size on StoreMain_MTXOffer_C_InitialReset");
static_assert(offsetof(StoreMain_MTXOffer_C_InitialReset, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'StoreMain_MTXOffer_C_InitialReset::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function StoreMain_MTXOffer.StoreMain_MTXOffer_C.GetBonusText
// 0x00A8 (0x00A8 - 0x0000)
struct StoreMain_MTXOffer_C_GetBonusText final
{
public:
	class UFortStoreFrontOfferInfo*               OfferInfo;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   BonusText_0;                                       // 0x0008(0x0018)(Parm, OutParm)
	int32                                         CallFunc_GetBonusQuantity_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBaseQuantity_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
};
static_assert(alignof(StoreMain_MTXOffer_C_GetBonusText) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_GetBonusText");
static_assert(sizeof(StoreMain_MTXOffer_C_GetBonusText) == 0x0000A8, "Wrong size on StoreMain_MTXOffer_C_GetBonusText");
static_assert(offsetof(StoreMain_MTXOffer_C_GetBonusText, OfferInfo) == 0x000000, "Member 'StoreMain_MTXOffer_C_GetBonusText::OfferInfo' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_GetBonusText, BonusText_0) == 0x000008, "Member 'StoreMain_MTXOffer_C_GetBonusText::BonusText_0' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_GetBonusText, CallFunc_GetBonusQuantity_ReturnValue) == 0x000020, "Member 'StoreMain_MTXOffer_C_GetBonusText::CallFunc_GetBonusQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_GetBonusText, CallFunc_GetBaseQuantity_ReturnValue) == 0x000024, "Member 'StoreMain_MTXOffer_C_GetBonusText::CallFunc_GetBaseQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_GetBonusText, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000028, "Member 'StoreMain_MTXOffer_C_GetBonusText::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_GetBonusText, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00002C, "Member 'StoreMain_MTXOffer_C_GetBonusText::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_GetBonusText, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000030, "Member 'StoreMain_MTXOffer_C_GetBonusText::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_GetBonusText, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000034, "Member 'StoreMain_MTXOffer_C_GetBonusText::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_GetBonusText, CallFunc_FTrunc_ReturnValue) == 0x000038, "Member 'StoreMain_MTXOffer_C_GetBonusText::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_GetBonusText, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'StoreMain_MTXOffer_C_GetBonusText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_GetBonusText, K2Node_MakeArray_Array) == 0x000080, "Member 'StoreMain_MTXOffer_C_GetBonusText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_GetBonusText, CallFunc_Format_ReturnValue) == 0x000090, "Member 'StoreMain_MTXOffer_C_GetBonusText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function StoreMain_MTXOffer.StoreMain_MTXOffer_C.ExecuteUbergraph_StoreMain_MTXOffer
// 0x0100 (0x0100 - 0x0000)
struct StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMtxOfferDisplaySize                      CallFunc_GetOfferDisplaySize_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InStorePrice;                         // 0x0028(0x0018)(ConstParm)
	struct FSlateBrush                            K2Node_Event_OfferBrush;                           // 0x0040(0x00B0)(ConstParm)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer) == 0x000010, "Wrong alignment on StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer");
static_assert(sizeof(StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer) == 0x000100, "Wrong size on StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer");
static_assert(offsetof(StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer, EntryPoint) == 0x000000, "Member 'StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer::EntryPoint' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer, K2Node_Event_IsDesignTime) == 0x000004, "Member 'StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer::K2Node_Event_IsDesignTime' has a wrong offset!");
