#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubscriptionDetailsWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SubscriptionDetailsWidget.SubscriptionDetailsWidget_C
// 0x01D8 (0x0590 - 0x03B8)
class USubscriptionDetailsWidget_C final : public USubscriptionDetailsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Temp;                                              // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background_Left;                                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Right;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Badge;                                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BattlePass_Star_Bullet;                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Vbuck_DisclaimerColor;                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BP_Asterisk;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BP_Asterisk_1;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BP_CheckMark;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              BP_DisclaimerIndicatorSwitcher;                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BP_Text_Color;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BP_Text_Details_Color;                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ColorA;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ColorB;                                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ColorC;                                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_173;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_314;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BattlePassReward;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BPCharacterRender;                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MtxReward;                                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SkinPreview;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                InfoHeaderColor;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftBeam;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftGlow;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo;                                              // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightBeam;                                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightGlow;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Skin_Asterisk;                                     // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Skin_CheckMark;                                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Skin_DisclaimerIndicatorSwitcher;                  // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Skin_Text_Bullet;                                  // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Skin_Text_Color;                                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Skin_Text_Details_Color;                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Spike_Angle_Left;                                  // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Spike_Angle_Right;                                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SubsNameText;                                      // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ThinSpike_Left;                                    // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ThinSpike_Right;                                   // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_BulletPoints;                                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VBuck_Star_Bullet;                                 // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                VBuck_Text_Color;                                  // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Vbuck_Text_Details_Color;                          // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               VBucks_Asterisk;                                   // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               VBucks_CheckMark;                                  // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              VBucks_DisclaimerIndicatorSwitcher;                // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WhiteFill;                                         // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         TimeOffset;                                        // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       IntroAnim;                                         // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              BulletPointOffset;                                 // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USubscriptionBulletPointWidget_C*> BulletPoints;                                      // 0x0580(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void AddBulletPoint(const struct FSubscriptionBulletPoint& BulletPointInfo);
	void ClearBulletPoints();
	void Configure_Bullet_Point_Widget(class USubscriptionBulletPointWidget_C* BulletPointWidget, const struct FSubscriptionBulletPoint& BulletPointInfo);
	void EndBulletPointIntro();
	void ExecuteUbergraph_SubscriptionDetailsWidget(int32 EntryPoint);
	void HandleStopTransitionToSubsAnim();
	void HandleTransitionToSubsScreenAnim();
	void OnBattlepassDisclaimerStateUpdated(ESubscriptionDisclaimerState DisclaimerState);
	void OnBattlepassImageLoaded(class UTexture2D* SkinImage);
	void OnScreenStateSet(EMcpSubscriptionState NewState);
	void OnSkinDisclaimerStateUpdated(ESubscriptionDisclaimerState DisclaimerState);
	void OnSkinImageLoaded(class UTexture2D* SkinImage);
	void OnSkinImageTakeOver(bool bTakeOver);
	void OnVbucksDisclaimerStateUpdated(ESubscriptionDisclaimerState DisclaimerState);
	void ResetBulletPointsIntro();
	void SequenceEvent__ENTRYPOINTSubscriptionDetailsWidget_0();
	void SequenceEvent__ENTRYPOINTSubscriptionDetailsWidget_1();
	void SequenceEvent__ENTRYPOINTSubscriptionDetailsWidget_2();
	void SequenceEvent__ENTRYPOINTSubscriptionDetailsWidget_3();
	void SequenceEvent__ENTRYPOINTSubscriptionDetailsWidget_4();
	void SequenceEvent__ENTRYPOINTSubscriptionDetailsWidget_5();
	void SetMaterialColors();
	void SetRandomFlareTime();
	void SetScreenCompletedAnimState();
	void SetScreenForResetState();
	void SetScreenForTransitionAnim();
	void StartBulletPointIntro(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SubscriptionDetailsWidget_C">();
	}
	static class USubscriptionDetailsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubscriptionDetailsWidget_C>();
	}
};
static_assert(alignof(USubscriptionDetailsWidget_C) == 0x000008, "Wrong alignment on USubscriptionDetailsWidget_C");
static_assert(sizeof(USubscriptionDetailsWidget_C) == 0x000590, "Wrong size on USubscriptionDetailsWidget_C");
static_assert(offsetof(USubscriptionDetailsWidget_C, UberGraphFrame) == 0x0003B8, "Member 'USubscriptionDetailsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Intro) == 0x0003C0, "Member 'USubscriptionDetailsWidget_C::Intro' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Temp) == 0x0003C8, "Member 'USubscriptionDetailsWidget_C::Temp' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Background_Left) == 0x0003D0, "Member 'USubscriptionDetailsWidget_C::Background_Left' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Background_Right) == 0x0003D8, "Member 'USubscriptionDetailsWidget_C::Background_Right' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Badge) == 0x0003E0, "Member 'USubscriptionDetailsWidget_C::Badge' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, BattlePass_Star_Bullet) == 0x0003E8, "Member 'USubscriptionDetailsWidget_C::BattlePass_Star_Bullet' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Border_Vbuck_DisclaimerColor) == 0x0003F0, "Member 'USubscriptionDetailsWidget_C::Border_Vbuck_DisclaimerColor' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, BP_Asterisk) == 0x0003F8, "Member 'USubscriptionDetailsWidget_C::BP_Asterisk' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, BP_Asterisk_1) == 0x000400, "Member 'USubscriptionDetailsWidget_C::BP_Asterisk_1' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, BP_CheckMark) == 0x000408, "Member 'USubscriptionDetailsWidget_C::BP_CheckMark' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, BP_DisclaimerIndicatorSwitcher) == 0x000410, "Member 'USubscriptionDetailsWidget_C::BP_DisclaimerIndicatorSwitcher' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, BP_Text_Color) == 0x000418, "Member 'USubscriptionDetailsWidget_C::BP_Text_Color' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, BP_Text_Details_Color) == 0x000420, "Member 'USubscriptionDetailsWidget_C::BP_Text_Details_Color' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, ColorA) == 0x000428, "Member 'USubscriptionDetailsWidget_C::ColorA' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, ColorB) == 0x000430, "Member 'USubscriptionDetailsWidget_C::ColorB' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, ColorC) == 0x000438, "Member 'USubscriptionDetailsWidget_C::ColorC' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Image) == 0x000440, "Member 'USubscriptionDetailsWidget_C::Image' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Image_1) == 0x000448, "Member 'USubscriptionDetailsWidget_C::Image_1' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Image_2) == 0x000450, "Member 'USubscriptionDetailsWidget_C::Image_2' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Image_3) == 0x000458, "Member 'USubscriptionDetailsWidget_C::Image_3' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Image_4) == 0x000460, "Member 'USubscriptionDetailsWidget_C::Image_4' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Image_173) == 0x000468, "Member 'USubscriptionDetailsWidget_C::Image_173' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Image_314) == 0x000470, "Member 'USubscriptionDetailsWidget_C::Image_314' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Image_BattlePassReward) == 0x000478, "Member 'USubscriptionDetailsWidget_C::Image_BattlePassReward' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Image_BPCharacterRender) == 0x000480, "Member 'USubscriptionDetailsWidget_C::Image_BPCharacterRender' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Image_MtxReward) == 0x000488, "Member 'USubscriptionDetailsWidget_C::Image_MtxReward' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Image_SkinPreview) == 0x000490, "Member 'USubscriptionDetailsWidget_C::Image_SkinPreview' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, InfoHeaderColor) == 0x000498, "Member 'USubscriptionDetailsWidget_C::InfoHeaderColor' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, LeftBeam) == 0x0004A0, "Member 'USubscriptionDetailsWidget_C::LeftBeam' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, LeftGlow) == 0x0004A8, "Member 'USubscriptionDetailsWidget_C::LeftGlow' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Logo) == 0x0004B0, "Member 'USubscriptionDetailsWidget_C::Logo' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, RightBeam) == 0x0004B8, "Member 'USubscriptionDetailsWidget_C::RightBeam' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, RightGlow) == 0x0004C0, "Member 'USubscriptionDetailsWidget_C::RightGlow' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, SafeZone_0) == 0x0004C8, "Member 'USubscriptionDetailsWidget_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Skin_Asterisk) == 0x0004D0, "Member 'USubscriptionDetailsWidget_C::Skin_Asterisk' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Skin_CheckMark) == 0x0004D8, "Member 'USubscriptionDetailsWidget_C::Skin_CheckMark' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Skin_DisclaimerIndicatorSwitcher) == 0x0004E0, "Member 'USubscriptionDetailsWidget_C::Skin_DisclaimerIndicatorSwitcher' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Skin_Text_Bullet) == 0x0004E8, "Member 'USubscriptionDetailsWidget_C::Skin_Text_Bullet' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Skin_Text_Color) == 0x0004F0, "Member 'USubscriptionDetailsWidget_C::Skin_Text_Color' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Skin_Text_Details_Color) == 0x0004F8, "Member 'USubscriptionDetailsWidget_C::Skin_Text_Details_Color' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Spike_Angle_Left) == 0x000500, "Member 'USubscriptionDetailsWidget_C::Spike_Angle_Left' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Spike_Angle_Right) == 0x000508, "Member 'USubscriptionDetailsWidget_C::Spike_Angle_Right' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, SubsNameText) == 0x000510, "Member 'USubscriptionDetailsWidget_C::SubsNameText' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, ThinSpike_Left) == 0x000518, "Member 'USubscriptionDetailsWidget_C::ThinSpike_Left' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, ThinSpike_Right) == 0x000520, "Member 'USubscriptionDetailsWidget_C::ThinSpike_Right' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, VBox_BulletPoints) == 0x000528, "Member 'USubscriptionDetailsWidget_C::VBox_BulletPoints' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, VBuck_Star_Bullet) == 0x000530, "Member 'USubscriptionDetailsWidget_C::VBuck_Star_Bullet' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, VBuck_Text_Color) == 0x000538, "Member 'USubscriptionDetailsWidget_C::VBuck_Text_Color' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, Vbuck_Text_Details_Color) == 0x000540, "Member 'USubscriptionDetailsWidget_C::Vbuck_Text_Details_Color' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, VBucks_Asterisk) == 0x000548, "Member 'USubscriptionDetailsWidget_C::VBucks_Asterisk' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, VBucks_CheckMark) == 0x000550, "Member 'USubscriptionDetailsWidget_C::VBucks_CheckMark' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, VBucks_DisclaimerIndicatorSwitcher) == 0x000558, "Member 'USubscriptionDetailsWidget_C::VBucks_DisclaimerIndicatorSwitcher' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, WhiteFill) == 0x000560, "Member 'USubscriptionDetailsWidget_C::WhiteFill' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, TimeOffset) == 0x000568, "Member 'USubscriptionDetailsWidget_C::TimeOffset' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, IntroAnim) == 0x000570, "Member 'USubscriptionDetailsWidget_C::IntroAnim' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, BulletPointOffset) == 0x000578, "Member 'USubscriptionDetailsWidget_C::BulletPointOffset' has a wrong offset!");
static_assert(offsetof(USubscriptionDetailsWidget_C, BulletPoints) == 0x000580, "Member 'USubscriptionDetailsWidget_C::BulletPoints' has a wrong offset!");

}

