#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubscriptionBulletPointWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SubscriptionBulletPointWidget.SubscriptionBulletPointWidget_C.ExecuteUbergraph_SubscriptionBulletPointWidget
// 0x0004 (0x0004 - 0x0000)
struct SubscriptionBulletPointWidget_C_ExecuteUbergraph_SubscriptionBulletPointWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubscriptionBulletPointWidget_C_ExecuteUbergraph_SubscriptionBulletPointWidget) == 0x000004, "Wrong alignment on SubscriptionBulletPointWidget_C_ExecuteUbergraph_SubscriptionBulletPointWidget");
static_assert(sizeof(SubscriptionBulletPointWidget_C_ExecuteUbergraph_SubscriptionBulletPointWidget) == 0x000004, "Wrong size on SubscriptionBulletPointWidget_C_ExecuteUbergraph_SubscriptionBulletPointWidget");
static_assert(offsetof(SubscriptionBulletPointWidget_C_ExecuteUbergraph_SubscriptionBulletPointWidget, EntryPoint) == 0x000000, "Member 'SubscriptionBulletPointWidget_C_ExecuteUbergraph_SubscriptionBulletPointWidget::EntryPoint' has a wrong offset!");

// Function SubscriptionBulletPointWidget.SubscriptionBulletPointWidget_C.SetIntroEndState
// 0x0010 (0x0010 - 0x0000)
struct SubscriptionBulletPointWidget_C_SetIntroEndState final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubscriptionBulletPointWidget_C_SetIntroEndState) == 0x000008, "Wrong alignment on SubscriptionBulletPointWidget_C_SetIntroEndState");
static_assert(sizeof(SubscriptionBulletPointWidget_C_SetIntroEndState) == 0x000010, "Wrong size on SubscriptionBulletPointWidget_C_SetIntroEndState");
static_assert(offsetof(SubscriptionBulletPointWidget_C_SetIntroEndState, CallFunc_GetEndTime_ReturnValue) == 0x000000, "Member 'SubscriptionBulletPointWidget_C_SetIntroEndState::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubscriptionBulletPointWidget_C_SetIntroEndState, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'SubscriptionBulletPointWidget_C_SetIntroEndState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function SubscriptionBulletPointWidget.SubscriptionBulletPointWidget_C.SetIntroStartState
// 0x0010 (0x0010 - 0x0000)
struct SubscriptionBulletPointWidget_C_SetIntroStartState final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubscriptionBulletPointWidget_C_SetIntroStartState) == 0x000008, "Wrong alignment on SubscriptionBulletPointWidget_C_SetIntroStartState");
static_assert(sizeof(SubscriptionBulletPointWidget_C_SetIntroStartState) == 0x000010, "Wrong size on SubscriptionBulletPointWidget_C_SetIntroStartState");
static_assert(offsetof(SubscriptionBulletPointWidget_C_SetIntroStartState, CallFunc_GetEndTime_ReturnValue) == 0x000000, "Member 'SubscriptionBulletPointWidget_C_SetIntroStartState::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubscriptionBulletPointWidget_C_SetIntroStartState, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'SubscriptionBulletPointWidget_C_SetIntroStartState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function SubscriptionBulletPointWidget.SubscriptionBulletPointWidget_C.SetMaterialColors
// 0x0020 (0x0020 - 0x0000)
struct SubscriptionBulletPointWidget_C_SetMaterialColors final
{
public:
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubscriptionBulletPointWidget_C_SetMaterialColors) == 0x000004, "Wrong alignment on SubscriptionBulletPointWidget_C_SetMaterialColors");
static_assert(sizeof(SubscriptionBulletPointWidget_C_SetMaterialColors) == 0x000020, "Wrong size on SubscriptionBulletPointWidget_C_SetMaterialColors");
static_assert(offsetof(SubscriptionBulletPointWidget_C_SetMaterialColors, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000000, "Member 'SubscriptionBulletPointWidget_C_SetMaterialColors::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubscriptionBulletPointWidget_C_SetMaterialColors, CallFunc_LinearColorLerp_ReturnValue) == 0x000010, "Member 'SubscriptionBulletPointWidget_C_SetMaterialColors::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");

// Function SubscriptionBulletPointWidget.SubscriptionBulletPointWidget_C.StartIntroAnim
// 0x0008 (0x0008 - 0x0000)
struct SubscriptionBulletPointWidget_C_StartIntroAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubscriptionBulletPointWidget_C_StartIntroAnim) == 0x000008, "Wrong alignment on SubscriptionBulletPointWidget_C_StartIntroAnim");
static_assert(sizeof(SubscriptionBulletPointWidget_C_StartIntroAnim) == 0x000008, "Wrong size on SubscriptionBulletPointWidget_C_StartIntroAnim");
static_assert(offsetof(SubscriptionBulletPointWidget_C_StartIntroAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'SubscriptionBulletPointWidget_C_StartIntroAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

