#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubscriptionBulletPointWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SubscriptionBulletPointWidget.SubscriptionBulletPointWidget_C
// 0x0058 (0x02E8 - 0x0290)
class USubscriptionBulletPointWidget_C final : public UFortSubscriptionBulletPointWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Asterisk;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CheckMark;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              DisclaimerIndicatorSwitcher;                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_Bullet;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Text_Color;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Text_Details_Color;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DelayShineSwipe;                                   // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Highlighted;                                       // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SubscriptionBulletPointWidget(int32 EntryPoint);
	void OnBulletPointInfoSet();
	void SetIntroEndState();
	void SetIntroStartState();
	void SetMaterialColors();
	void StartIntroAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SubscriptionBulletPointWidget_C">();
	}
	static class USubscriptionBulletPointWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubscriptionBulletPointWidget_C>();
	}
};
static_assert(alignof(USubscriptionBulletPointWidget_C) == 0x000008, "Wrong alignment on USubscriptionBulletPointWidget_C");
static_assert(sizeof(USubscriptionBulletPointWidget_C) == 0x0002E8, "Wrong size on USubscriptionBulletPointWidget_C");
static_assert(offsetof(USubscriptionBulletPointWidget_C, UberGraphFrame) == 0x000290, "Member 'USubscriptionBulletPointWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USubscriptionBulletPointWidget_C, Intro) == 0x000298, "Member 'USubscriptionBulletPointWidget_C::Intro' has a wrong offset!");
static_assert(offsetof(USubscriptionBulletPointWidget_C, Asterisk) == 0x0002A0, "Member 'USubscriptionBulletPointWidget_C::Asterisk' has a wrong offset!");
static_assert(offsetof(USubscriptionBulletPointWidget_C, CheckMark) == 0x0002A8, "Member 'USubscriptionBulletPointWidget_C::CheckMark' has a wrong offset!");
static_assert(offsetof(USubscriptionBulletPointWidget_C, DisclaimerIndicatorSwitcher) == 0x0002B0, "Member 'USubscriptionBulletPointWidget_C::DisclaimerIndicatorSwitcher' has a wrong offset!");
static_assert(offsetof(USubscriptionBulletPointWidget_C, Image_2) == 0x0002B8, "Member 'USubscriptionBulletPointWidget_C::Image_2' has a wrong offset!");
static_assert(offsetof(USubscriptionBulletPointWidget_C, Image_3) == 0x0002C0, "Member 'USubscriptionBulletPointWidget_C::Image_3' has a wrong offset!");
static_assert(offsetof(USubscriptionBulletPointWidget_C, Star_Bullet) == 0x0002C8, "Member 'USubscriptionBulletPointWidget_C::Star_Bullet' has a wrong offset!");
static_assert(offsetof(USubscriptionBulletPointWidget_C, Text_Color) == 0x0002D0, "Member 'USubscriptionBulletPointWidget_C::Text_Color' has a wrong offset!");
static_assert(offsetof(USubscriptionBulletPointWidget_C, Text_Details_Color) == 0x0002D8, "Member 'USubscriptionBulletPointWidget_C::Text_Details_Color' has a wrong offset!");
static_assert(offsetof(USubscriptionBulletPointWidget_C, DelayShineSwipe) == 0x0002E0, "Member 'USubscriptionBulletPointWidget_C::DelayShineSwipe' has a wrong offset!");
static_assert(offsetof(USubscriptionBulletPointWidget_C, Highlighted) == 0x0002E1, "Member 'USubscriptionBulletPointWidget_C::Highlighted' has a wrong offset!");

}

