#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SuperstormRuntime

#include "Basic.hpp"

#include "SuperstormRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "TargetingSystem_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class SuperstormRuntime.TempestLightningComponent
// 0x0388 (0x0438 - 0x00B0)
class UTempestLightningComponent final : public UGameFrameworkComponent
{
public:
	TSubclassOf<class AFortGameplayEffectDeliveryActor> LightningBoltClass;                                // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FTempestLightningBoltEffectContainer> LightningBoltTargetEffectContainers;               // 0x00B8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class UTargetingPreset*                       LightningBoltTargetingPreset;                      // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEnvQuery*                              FindTargetablePawnsQuery;                          // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEnvQuery*                              FindTargetableLocationQuery;                       // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   EnvironmentQueryParamName_LightningRadius;         // 0x00E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   EnvironmentQueryParamName_MinLightningTargetDistance; // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningCloudHeight;                              // 0x00F0(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningRadius;                                   // 0x0118(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinLightningTargetDistance;                        // 0x0140(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningFrequencyMin;                             // 0x0168(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningFrequencyMax;                             // 0x0190(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltsMin;                                 // 0x01B8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltsMax;                                 // 0x01E0(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltIntervalMin;                          // 0x0208(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltIntervalMax;                          // 0x0230(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltSeparationDistance;                   // 0x0258(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningStruckPawnReselectionInterval;            // 0x0280(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltTelegraphDuration;                    // 0x02A8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltImpactIgnitionRadius;                 // 0x02D0(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltGrassIgnitionRadius;                  // 0x02F8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltGrassFirePropagationFuel;             // 0x0320(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           LightningAreaTargetTelegraphCue;                   // 0x0348(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           LightningBoltTargetTelegraphCue;                   // 0x0350(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FTempestLightningBoltData>      LightningBoltData;                                 // 0x0358(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_368[0xD0];                                     // 0x0368(0x00D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetCloudHeight() const;
	float GetLightningRadius() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TempestLightningComponent">();
	}
	static class UTempestLightningComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTempestLightningComponent>();
	}
};
static_assert(alignof(UTempestLightningComponent) == 0x000008, "Wrong alignment on UTempestLightningComponent");
static_assert(sizeof(UTempestLightningComponent) == 0x000438, "Wrong size on UTempestLightningComponent");
static_assert(offsetof(UTempestLightningComponent, LightningBoltClass) == 0x0000B0, "Member 'UTempestLightningComponent::LightningBoltClass' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningBoltTargetEffectContainers) == 0x0000B8, "Member 'UTempestLightningComponent::LightningBoltTargetEffectContainers' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningBoltTargetingPreset) == 0x0000C8, "Member 'UTempestLightningComponent::LightningBoltTargetingPreset' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, FindTargetablePawnsQuery) == 0x0000D0, "Member 'UTempestLightningComponent::FindTargetablePawnsQuery' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, FindTargetableLocationQuery) == 0x0000D8, "Member 'UTempestLightningComponent::FindTargetableLocationQuery' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, EnvironmentQueryParamName_LightningRadius) == 0x0000E0, "Member 'UTempestLightningComponent::EnvironmentQueryParamName_LightningRadius' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, EnvironmentQueryParamName_MinLightningTargetDistance) == 0x0000E8, "Member 'UTempestLightningComponent::EnvironmentQueryParamName_MinLightningTargetDistance' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningCloudHeight) == 0x0000F0, "Member 'UTempestLightningComponent::LightningCloudHeight' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningRadius) == 0x000118, "Member 'UTempestLightningComponent::LightningRadius' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, MinLightningTargetDistance) == 0x000140, "Member 'UTempestLightningComponent::MinLightningTargetDistance' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningFrequencyMin) == 0x000168, "Member 'UTempestLightningComponent::LightningFrequencyMin' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningFrequencyMax) == 0x000190, "Member 'UTempestLightningComponent::LightningFrequencyMax' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningBoltsMin) == 0x0001B8, "Member 'UTempestLightningComponent::LightningBoltsMin' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningBoltsMax) == 0x0001E0, "Member 'UTempestLightningComponent::LightningBoltsMax' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningBoltIntervalMin) == 0x000208, "Member 'UTempestLightningComponent::LightningBoltIntervalMin' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningBoltIntervalMax) == 0x000230, "Member 'UTempestLightningComponent::LightningBoltIntervalMax' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningBoltSeparationDistance) == 0x000258, "Member 'UTempestLightningComponent::LightningBoltSeparationDistance' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningStruckPawnReselectionInterval) == 0x000280, "Member 'UTempestLightningComponent::LightningStruckPawnReselectionInterval' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningBoltTelegraphDuration) == 0x0002A8, "Member 'UTempestLightningComponent::LightningBoltTelegraphDuration' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningBoltImpactIgnitionRadius) == 0x0002D0, "Member 'UTempestLightningComponent::LightningBoltImpactIgnitionRadius' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningBoltGrassIgnitionRadius) == 0x0002F8, "Member 'UTempestLightningComponent::LightningBoltGrassIgnitionRadius' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningBoltGrassFirePropagationFuel) == 0x000320, "Member 'UTempestLightningComponent::LightningBoltGrassFirePropagationFuel' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningAreaTargetTelegraphCue) == 0x000348, "Member 'UTempestLightningComponent::LightningAreaTargetTelegraphCue' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningBoltTargetTelegraphCue) == 0x000350, "Member 'UTempestLightningComponent::LightningBoltTargetTelegraphCue' has a wrong offset!");
static_assert(offsetof(UTempestLightningComponent, LightningBoltData) == 0x000358, "Member 'UTempestLightningComponent::LightningBoltData' has a wrong offset!");

// Class SuperstormRuntime.TempestTornadoForcesComponent
// 0x04E0 (0x0590 - 0x00B0)
class UTempestTornadoForcesComponent final : public UGameFrameworkComponent
{
public:
	struct FDataTableRowHandle                    ConfigHandle;                                      // 0x00B0(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class AFortAthenaVehicle>         AttachedPawnHiddenVehicle;                         // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FGameplayTag>                   PhysicsPresetTagsAngularDampingToOverride;         // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AngularDampingOverride;                            // 0x00D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<ETornadoObjectType, struct FScalableFloat> ObjectTypeToMaxCapCount;                           // 0x0100(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TagsToIgnore;                                      // 0x0150(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>            RecentlyRemovedGE;                                 // 0x0170(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTargetingPreset*                       TargetingPreset;                                   // 0x0178(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           DamageSetByCallerTag;                              // 0x0180(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>            PeriodicDamageGE;                                  // 0x0188(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>            BurstDamageGE;                                     // 0x0190(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TornadoActiveCue;                                  // 0x0198(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           PlayerNearCue;                                     // 0x01A0(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           PlayerInCue;                                       // 0x01A8(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PlayerNearRange;                                   // 0x01B0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  PlayerBlockAbilitiesWithTag;                       // 0x01D8(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FTornadoClientSimulationArray          ActorsToClientSimulate;                            // 0x01F8(0x0118)(Net, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_310[0x148];                                    // 0x0310(0x0148)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AFortPawn* Pawn, class AFortAthenaVehicle* Vehicle)> OnPawnEnterInvisibleVehicle;                       // 0x0458(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class AFortPawn* Pawn)> OnPawnExitInvisibleVehicle;                        // 0x0468(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_478[0x18];                                     // 0x0478(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTargetingRequestHandle                AsyncTargetingHandle;                              // 0x0490(0x0004)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class AFortPlayerPawn*>                  PreviouslyNearPlayers;                             // 0x0498(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4E8[0xA8];                                     // 0x04E8(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsActorInTornado(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TempestTornadoForcesComponent">();
	}
	static class UTempestTornadoForcesComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTempestTornadoForcesComponent>();
	}
};
static_assert(alignof(UTempestTornadoForcesComponent) == 0x000008, "Wrong alignment on UTempestTornadoForcesComponent");
static_assert(sizeof(UTempestTornadoForcesComponent) == 0x000590, "Wrong size on UTempestTornadoForcesComponent");
static_assert(offsetof(UTempestTornadoForcesComponent, ConfigHandle) == 0x0000B0, "Member 'UTempestTornadoForcesComponent::ConfigHandle' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, AttachedPawnHiddenVehicle) == 0x0000C0, "Member 'UTempestTornadoForcesComponent::AttachedPawnHiddenVehicle' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, PhysicsPresetTagsAngularDampingToOverride) == 0x0000C8, "Member 'UTempestTornadoForcesComponent::PhysicsPresetTagsAngularDampingToOverride' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, AngularDampingOverride) == 0x0000D8, "Member 'UTempestTornadoForcesComponent::AngularDampingOverride' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, ObjectTypeToMaxCapCount) == 0x000100, "Member 'UTempestTornadoForcesComponent::ObjectTypeToMaxCapCount' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, TagsToIgnore) == 0x000150, "Member 'UTempestTornadoForcesComponent::TagsToIgnore' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, RecentlyRemovedGE) == 0x000170, "Member 'UTempestTornadoForcesComponent::RecentlyRemovedGE' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, TargetingPreset) == 0x000178, "Member 'UTempestTornadoForcesComponent::TargetingPreset' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, DamageSetByCallerTag) == 0x000180, "Member 'UTempestTornadoForcesComponent::DamageSetByCallerTag' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, PeriodicDamageGE) == 0x000188, "Member 'UTempestTornadoForcesComponent::PeriodicDamageGE' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, BurstDamageGE) == 0x000190, "Member 'UTempestTornadoForcesComponent::BurstDamageGE' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, TornadoActiveCue) == 0x000198, "Member 'UTempestTornadoForcesComponent::TornadoActiveCue' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, PlayerNearCue) == 0x0001A0, "Member 'UTempestTornadoForcesComponent::PlayerNearCue' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, PlayerInCue) == 0x0001A8, "Member 'UTempestTornadoForcesComponent::PlayerInCue' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, PlayerNearRange) == 0x0001B0, "Member 'UTempestTornadoForcesComponent::PlayerNearRange' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, PlayerBlockAbilitiesWithTag) == 0x0001D8, "Member 'UTempestTornadoForcesComponent::PlayerBlockAbilitiesWithTag' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, ActorsToClientSimulate) == 0x0001F8, "Member 'UTempestTornadoForcesComponent::ActorsToClientSimulate' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, OnPawnEnterInvisibleVehicle) == 0x000458, "Member 'UTempestTornadoForcesComponent::OnPawnEnterInvisibleVehicle' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, OnPawnExitInvisibleVehicle) == 0x000468, "Member 'UTempestTornadoForcesComponent::OnPawnExitInvisibleVehicle' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, AsyncTargetingHandle) == 0x000490, "Member 'UTempestTornadoForcesComponent::AsyncTargetingHandle' has a wrong offset!");
static_assert(offsetof(UTempestTornadoForcesComponent, PreviouslyNearPlayers) == 0x000498, "Member 'UTempestTornadoForcesComponent::PreviouslyNearPlayers' has a wrong offset!");

}

