#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SwimmingAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct SwimmingAnimBP.SwimmingAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x03AF (0x03B0 - 0x0001)
struct SwimmingAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_1080;                                 // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            ObjectProperty_1081;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_1082;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1083;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1084;                                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1085;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1086;                                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1087;                               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1088;                                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1089;                               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1090;                                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1091;                                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1092;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1093;                                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1094;                                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_1095;                               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1096;                                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1097;                                 // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1098;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1099;                                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1100;                                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1101;                                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1102;                               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 ArrayProperty_1103;                                // 0x00C0(0x0010)()
	class UAnimSequenceBase*                      ObjectProperty_1104;                               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1105;                                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1106;                                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_1107;                               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         FloatProperty_1108;                                // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1109;                                 // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_1110;                                // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1111;                               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1112;                                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1113;                                 // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1114;                               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1115;                                 // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1116;                                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1117;                                 // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1118;                                 // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1119;                               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1120;                                 // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1121;                                 // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1122;                                 // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_1123;                               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_1124;                               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1125;                                 // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1126;                               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1127;                                 // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1128;                                 // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1129;                                 // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_1130;                               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimGroupRole                                ByteProperty_1131;                                 // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_1132;                                 // 0x01A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1133;                                 // 0x01AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1134;                                 // 0x01B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            ObjectProperty_1135;                               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1136;                                 // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_1137;                                // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                ByteProperty_1138;                                 // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_1139;                                 // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 ArrayProperty_1140;                                // 0x01E0(0x0010)()
	class FName                                   NameProperty_1141;                                 // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_1142;                               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1143;                                 // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_1144;                               // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_1145;                               // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               EnumProperty_1146;                                 // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_1147;                                 // 0x021C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            ObjectProperty_1148;                               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 ArrayProperty_1149;                                // 0x0230(0x0010)()
	TArray<int32>                                 ArrayProperty_1150;                                // 0x0240(0x0010)()
	class UBlendSpace*                            ObjectProperty_1151;                               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1152;                                 // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1153;                               // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   NameProperty_1154;                                 // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1155;                                 // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          ObjectProperty_1156;                               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            ObjectProperty_1157;                               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             EnumProperty_1158;                                 // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      EnumProperty_1159;                                 // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ArrayProperty_1160;                                // 0x0290(0x0010)()
	bool                                          BoolProperty_1161;                                 // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_1162;                                // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          StructProperty_1163;                               // 0x02A8(0x002C)(NoDestructor)
	float                                         FloatProperty_1164;                                // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_1165;                               // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BoolProperty_1166;                                 // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               EnumProperty_1167;                                 // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                ByteProperty_1168;                                 // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E3[0x5];                                      // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   StructProperty_1169;                               // 0x02E8(0x0020)(NoDestructor)
	class FName                                   NameProperty_1170;                                 // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_1171;                                 // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0318(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0398(0x0018)()
};
static_assert(alignof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on SwimmingAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData) == 0x0003B0, "Wrong size on SwimmingAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1080) == 0x000004, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1080' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1081) == 0x000010, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1081' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1082) == 0x000018, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1082' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1083) == 0x000020, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1083' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1084) == 0x000028, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1084' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1085) == 0x000030, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1085' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1086) == 0x000038, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1086' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1087) == 0x000040, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1087' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1088) == 0x000048, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1088' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1089) == 0x000050, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1089' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1090) == 0x000058, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1090' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1091) == 0x000060, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1091' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1092) == 0x000068, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1092' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1093) == 0x000070, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1093' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1094) == 0x000078, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1094' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1095) == 0x000080, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1095' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1096) == 0x000088, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1096' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1097) == 0x000090, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1097' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1098) == 0x000098, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1098' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1099) == 0x0000A0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1099' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1100) == 0x0000A8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1100' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1101) == 0x0000B0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1101' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1102) == 0x0000B8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1102' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_1103) == 0x0000C0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_1103' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1104) == 0x0000D0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1104' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1105) == 0x0000D8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1105' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1106) == 0x0000E0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1106' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1107) == 0x0000E8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1107' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_1108) == 0x0000F0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_1108' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1109) == 0x0000F4, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1109' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_1110) == 0x0000FC, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_1110' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1111) == 0x000100, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1111' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1112) == 0x000108, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1112' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1113) == 0x000110, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1113' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1114) == 0x000118, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1114' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1115) == 0x000120, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1115' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1116) == 0x000128, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1116' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1117) == 0x000130, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1117' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1118) == 0x000138, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1118' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1119) == 0x000140, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1119' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1120) == 0x000148, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1120' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1121) == 0x000150, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1121' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1122) == 0x000158, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1122' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1123) == 0x000160, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1123' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1124) == 0x000168, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1124' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1125) == 0x000170, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1125' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1126) == 0x000178, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1126' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1127) == 0x000180, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1127' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1128) == 0x000188, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1128' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1129) == 0x000190, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1129' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1130) == 0x000198, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1130' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ByteProperty_1131) == 0x0001A0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ByteProperty_1131' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1132) == 0x0001A4, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1132' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1133) == 0x0001AC, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1133' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1134) == 0x0001B4, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1134' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1135) == 0x0001C0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1135' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1136) == 0x0001C8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1136' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_1137) == 0x0001D0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_1137' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ByteProperty_1138) == 0x0001D4, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ByteProperty_1138' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1139) == 0x0001D8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1139' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_1140) == 0x0001E0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_1140' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1141) == 0x0001F0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1141' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1142) == 0x0001F8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1142' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1143) == 0x000200, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1143' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1144) == 0x000208, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1144' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1145) == 0x000210, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1145' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_1146) == 0x000218, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_1146' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1147) == 0x00021C, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1147' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1148) == 0x000228, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1148' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_1149) == 0x000230, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_1149' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_1150) == 0x000240, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_1150' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1151) == 0x000250, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1151' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1152) == 0x000258, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1152' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1153) == 0x000260, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1153' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1154) == 0x000268, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1154' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1155) == 0x000270, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1155' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1156) == 0x000278, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1156' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1157) == 0x000280, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1157' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_1158) == 0x000288, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_1158' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_1159) == 0x000289, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_1159' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ArrayProperty_1160) == 0x000290, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ArrayProperty_1160' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_1161) == 0x0002A0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_1161' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_1162) == 0x0002A4, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_1162' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_1163) == 0x0002A8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_1163' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, FloatProperty_1164) == 0x0002D4, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::FloatProperty_1164' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ObjectProperty_1165) == 0x0002D8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ObjectProperty_1165' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, BoolProperty_1166) == 0x0002E0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::BoolProperty_1166' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, EnumProperty_1167) == 0x0002E1, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::EnumProperty_1167' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, ByteProperty_1168) == 0x0002E2, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::ByteProperty_1168' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, StructProperty_1169) == 0x0002E8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::StructProperty_1169' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1170) == 0x000308, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1170' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, NameProperty_1171) == 0x000310, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::NameProperty_1171' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000318, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000398, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct SwimmingAnimBP.SwimmingAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x00AF (0x00B0 - 0x0001)
struct SwimmingAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty;                                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_0;                                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_1;                                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_2;                                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ByteProperty_3;                                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            ObjectProperty_4;                                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         FloatProperty_5;                                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_6;                                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_7;                                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         FloatProperty_8;                                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_9;                                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_10;                                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_11;                                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_12;                                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_13;                                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_14;                                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_15;                                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_16;                                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_17;                                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_18;                                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_19;                                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_20;                                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_21;                                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_22;                                   // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ObjectProperty_23;                                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_24;                                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         FloatProperty_25;                                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_26;                                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            ObjectProperty_27;                                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         FloatProperty_28;                                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_29;                                   // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_30;                                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_31;                                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ByteProperty_32;                                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_33;                                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatProperty_34;                                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ByteProperty_35;                                   // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_36;                                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_37;                                   // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_38;                                   // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SwimmingAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on SwimmingAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(SwimmingAnimBP::FAnimBlueprintGeneratedMutableData) == 0x0000B0, "Wrong size on SwimmingAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedMutableData, FloatProperty) == 0x000004, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedMutableData::FloatProperty' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedMutableData, FloatProperty_0) == 0x000008, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedMutableData::FloatProperty_0' has a wrong offset!");
