#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabGameplayOptions_New

#include "Basic.hpp"


namespace SDK::Params
{

// Function TabGameplayOptions_New.TabGameplayOptions_New_C.ExecuteUbergraph_TabGameplayOptions_New
// 0x0008 (0x0008 - 0x0000)
struct TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New) == 0x000004, "Wrong alignment on TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New");
static_assert(sizeof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New) == 0x000008, "Wrong size on TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, EntryPoint) == 0x000000, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::EntryPoint' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, K2Node_CustomEvent_Value) == 0x000004, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::K2Node_CustomEvent_Value' has a wrong offset!");

// Function TabGameplayOptions_New.TabGameplayOptions_New_C.SettingValueChanged
// 0x0004 (0x0004 - 0x0000)
struct TabGameplayOptions_New_C_SettingValueChanged final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameplayOptions_New_C_SettingValueChanged) == 0x000004, "Wrong alignment on TabGameplayOptions_New_C_SettingValueChanged");
static_assert(sizeof(TabGameplayOptions_New_C_SettingValueChanged) == 0x000004, "Wrong size on TabGameplayOptions_New_C_SettingValueChanged");
static_assert(offsetof(TabGameplayOptions_New_C_SettingValueChanged, Value) == 0x000000, "Member 'TabGameplayOptions_New_C_SettingValueChanged::Value' has a wrong offset!");

}

