#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMemberListEntry

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TeamMemberListEntry.TeamMemberListEntry_C
// 0x0050 (0x0FF0 - 0x0FA0)
class UTeamMemberListEntry_C final : public UFortTeamMemberListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0FA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0FB0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x0FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x0FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x0FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x0FD0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x0FE0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_TeamMemberListEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TeamMemberListEntry_C">();
	}
	static class UTeamMemberListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeamMemberListEntry_C>();
	}
};
static_assert(alignof(UTeamMemberListEntry_C) == 0x000010, "Wrong alignment on UTeamMemberListEntry_C");
static_assert(sizeof(UTeamMemberListEntry_C) == 0x000FF0, "Wrong size on UTeamMemberListEntry_C");
static_assert(offsetof(UTeamMemberListEntry_C, UberGraphFrame) == 0x000FA0, "Member 'UTeamMemberListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTeamMemberListEntry_C, Selected) == 0x000FA8, "Member 'UTeamMemberListEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UTeamMemberListEntry_C, Hovered) == 0x000FB0, "Member 'UTeamMemberListEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(UTeamMemberListEntry_C, Arrow) == 0x000FB8, "Member 'UTeamMemberListEntry_C::Arrow' has a wrong offset!");
static_assert(offsetof(UTeamMemberListEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x000FC0, "Member 'UTeamMemberListEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(UTeamMemberListEntry_C, UserActionMenuInputButton) == 0x000FC8, "Member 'UTeamMemberListEntry_C::UserActionMenuInputButton' has a wrong offset!");
static_assert(offsetof(UTeamMemberListEntry_C, EncourageEpicFriend_IdleColor) == 0x000FD0, "Member 'UTeamMemberListEntry_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(UTeamMemberListEntry_C, EncourageEpicFriend_HoveredColor) == 0x000FE0, "Member 'UTeamMemberListEntry_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");

}

