#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMemberManage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TeamMemberManage.TeamMemberManage_C
// 0x0050 (0x0570 - 0x0520)
class UTeamMemberManage_C final : public UFortTeamMemberManage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_LocalPlayerBannerEditor_C*          BP_LocalPlayerBannerEditor;                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         CloseButton;                                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CloseProfileButton;                                // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            ContentSwitcher;                                   // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayCloseButton;                                // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TeamMemberManageOptions;                           // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_1_CloseBannerEditor__DelegateSignature(class FName IconId, class FName ColorId);
	void BndEvt__CloseProfileButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__ContentSwitcher_K2Node_ComponentBoundEvent_2_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_TeamMemberManage(int32 EntryPoint);
	void OnParticipationChanged(bool bIsParticipating);
	void OpenBannerEditor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TeamMemberManage_C">();
	}
	static class UTeamMemberManage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeamMemberManage_C>();
	}
};
static_assert(alignof(UTeamMemberManage_C) == 0x000008, "Wrong alignment on UTeamMemberManage_C");
static_assert(sizeof(UTeamMemberManage_C) == 0x000570, "Wrong size on UTeamMemberManage_C");
static_assert(offsetof(UTeamMemberManage_C, UberGraphFrame) == 0x000520, "Member 'UTeamMemberManage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, BP_LocalPlayerBannerEditor) == 0x000528, "Member 'UTeamMemberManage_C::BP_LocalPlayerBannerEditor' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, CloseButton) == 0x000530, "Member 'UTeamMemberManage_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, CloseProfileButton) == 0x000538, "Member 'UTeamMemberManage_C::CloseProfileButton' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, ContentSwitcher) == 0x000540, "Member 'UTeamMemberManage_C::ContentSwitcher' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, Image_0) == 0x000548, "Member 'UTeamMemberManage_C::Image_0' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, Image_8) == 0x000550, "Member 'UTeamMemberManage_C::Image_8' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, Lightbox) == 0x000558, "Member 'UTeamMemberManage_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, OverlayCloseButton) == 0x000560, "Member 'UTeamMemberManage_C::OverlayCloseButton' has a wrong offset!");
static_assert(offsetof(UTeamMemberManage_C, TeamMemberManageOptions) == 0x000568, "Member 'UTeamMemberManage_C::TeamMemberManageOptions' has a wrong offset!");

}

