#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMemberPedestal_Nameplate

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TeamMemberPedestal_Nameplate.TeamMemberPedestal_Nameplate_C
// 0x0310 (0x12D0 - 0x0FC0)
class UTeamMemberPedestal_Nameplate_C final : public UFortTeamMemberPedestalNameplate
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NotReadyTextColor;                                 // 0x0FC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ReadyTextColor;                                    // 0x0FD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       On_Ready_Change_Text;                              // 0x0FD8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               SB_InputAction;                                    // 0x0FE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTeamMemberPedestal_ActivatableContainer_C* TeamMemberPedestal_ActivatableContainer;           // 0x0FE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Widget_PlayerLevel;                                // 0x0FF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_FF8[0x8];                                      // 0x0FF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x1000(0x0230)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bHovered;                                          // 0x1230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1231[0x3];                                     // 0x1231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ReadyColor;                                        // 0x1234(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NotReadyColor;                                     // 0x1244(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1254[0x4];                                     // 0x1254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             UnReadySound;                                      // 0x1258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ReadySound;                                        // 0x1260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   AddFriendText;                                     // 0x1268(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   AcceptedInviteText;                                // 0x1280(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   AcceptFriendRequestText;                           // 0x1298(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SentInviteText;                                    // 0x12B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	ESlateVisibility                              FALSE_0;                                           // 0x12C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               DefaultOldCameraValue;                             // 0x12C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnTeamMemberEstablished(bool bHasValidMember);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_TeamMemberPedestal_Nameplate(int32 EntryPoint);
	ESlateVisibility GetInputActionVisibility();
	void HandleInputMethodChanged(ECommonInputType bNewInputType);
	void OnCurrentSubGameChanged(ESubGame NewSubGame);
	void OnFriendStatusUpdated(const EFortFriendRequestStatus FriendRequestStatus);
	void OnFrontEndCameraChanged(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera);
	void OnPlayReadyAudio(bool bIsReadyForMatchmaking);
	void OnReadyStatusChanged(EGameReadiness GameReadiness);
	void UpdateInputActionVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TeamMemberPedestal_Nameplate_C">();
	}
	static class UTeamMemberPedestal_Nameplate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeamMemberPedestal_Nameplate_C>();
	}
};
static_assert(alignof(UTeamMemberPedestal_Nameplate_C) == 0x000010, "Wrong alignment on UTeamMemberPedestal_Nameplate_C");
static_assert(sizeof(UTeamMemberPedestal_Nameplate_C) == 0x0012D0, "Wrong size on UTeamMemberPedestal_Nameplate_C");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, UberGraphFrame) == 0x000FC0, "Member 'UTeamMemberPedestal_Nameplate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, NotReadyTextColor) == 0x000FC8, "Member 'UTeamMemberPedestal_Nameplate_C::NotReadyTextColor' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, ReadyTextColor) == 0x000FD0, "Member 'UTeamMemberPedestal_Nameplate_C::ReadyTextColor' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, On_Ready_Change_Text) == 0x000FD8, "Member 'UTeamMemberPedestal_Nameplate_C::On_Ready_Change_Text' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, SB_InputAction) == 0x000FE0, "Member 'UTeamMemberPedestal_Nameplate_C::SB_InputAction' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, TeamMemberPedestal_ActivatableContainer) == 0x000FE8, "Member 'UTeamMemberPedestal_Nameplate_C::TeamMemberPedestal_ActivatableContainer' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, Widget_PlayerLevel) == 0x000FF0, "Member 'UTeamMemberPedestal_Nameplate_C::Widget_PlayerLevel' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, TeamMemberInfo) == 0x001000, "Member 'UTeamMemberPedestal_Nameplate_C::TeamMemberInfo' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, bHovered) == 0x001230, "Member 'UTeamMemberPedestal_Nameplate_C::bHovered' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, ReadyColor) == 0x001234, "Member 'UTeamMemberPedestal_Nameplate_C::ReadyColor' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, NotReadyColor) == 0x001244, "Member 'UTeamMemberPedestal_Nameplate_C::NotReadyColor' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, UnReadySound) == 0x001258, "Member 'UTeamMemberPedestal_Nameplate_C::UnReadySound' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, ReadySound) == 0x001260, "Member 'UTeamMemberPedestal_Nameplate_C::ReadySound' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, AddFriendText) == 0x001268, "Member 'UTeamMemberPedestal_Nameplate_C::AddFriendText' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, AcceptedInviteText) == 0x001280, "Member 'UTeamMemberPedestal_Nameplate_C::AcceptedInviteText' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, AcceptFriendRequestText) == 0x001298, "Member 'UTeamMemberPedestal_Nameplate_C::AcceptFriendRequestText' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, SentInviteText) == 0x0012B0, "Member 'UTeamMemberPedestal_Nameplate_C::SentInviteText' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, FALSE_0) == 0x0012C8, "Member 'UTeamMemberPedestal_Nameplate_C::FALSE_0' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, DefaultOldCameraValue) == 0x0012C9, "Member 'UTeamMemberPedestal_Nameplate_C::DefaultOldCameraValue' has a wrong offset!");

}

