#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToastSocialWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ToastSocialWidget.ToastSocialWidget_C
// 0x0098 (0x0358 - 0x02C0)
class UToastSocialWidget_C final : public UFortSocialNotificationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro_New;                                         // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          B_NotificationImage;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          B_NotificationImageExtended;                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_Cursor;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_Hold;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_MainWidget;                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Description;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         NotificationImage;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_InputButtons;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortUINotification*                    ToastNotification;                                 // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimationFinishedDelay;                            // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFinishedToast;                                   // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           AnimationDelayTimer;                               // 0x0348(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bActionTaken;                                      // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TakeAction();
	void StartIntro();
	void ShowText(const class FText& Text, class UCommonTextBlock* TextBlock);
	void SetVisibilityForOptionalElements();
	void SetupAnimBindings(bool Unbind);
	void SetToast(class UFortUINotification* Toast);
	void SetImage();
	void PlayOutro();
	void OnUserStartedHoldActionNotification();
	void OnTakeActionNotification();
	void OnSetToast(class UFortUINotification* ToastNotification_0);
	void OnPlayOpenAnimation();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void HandleOutroFinished();
	void HandleIntroFinished();
	ESlateVisibility GetInputSwitcherVisibility();
	void GetFinishedAnimationDelay(float* Value);
	void GetButtonHoldText(class FText* Text);
	void GetButtonCursorText(class FText* Text);
	int32 GetActiveWidgetIndex();
	void ExecuteUbergraph_ToastSocialWidget(int32 EntryPoint);
	void Destruct();
	void Construct();
	void CleanupBeforeClosing();
	void BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void ApplyAdditionalStyling();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnInputModeChanged(ECommonInputType NewInputType);
	void OnCursorModeChanged(bool bCursorModeEnabled);
	void OnCancelNotification();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ToastSocialWidget_C">();
	}
	static class UToastSocialWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToastSocialWidget_C>();
	}
};
static_assert(alignof(UToastSocialWidget_C) == 0x000008, "Wrong alignment on UToastSocialWidget_C");
static_assert(sizeof(UToastSocialWidget_C) == 0x000358, "Wrong size on UToastSocialWidget_C");
static_assert(offsetof(UToastSocialWidget_C, UberGraphFrame) == 0x0002C0, "Member 'UToastSocialWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, Outro_New) == 0x0002C8, "Member 'UToastSocialWidget_C::Outro_New' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, Intro) == 0x0002D0, "Member 'UToastSocialWidget_C::Intro' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, B_NotificationImage) == 0x0002D8, "Member 'UToastSocialWidget_C::B_NotificationImage' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, B_NotificationImageExtended) == 0x0002E0, "Member 'UToastSocialWidget_C::B_NotificationImageExtended' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, Button_Cursor) == 0x0002E8, "Member 'UToastSocialWidget_C::Button_Cursor' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, Button_Hold) == 0x0002F0, "Member 'UToastSocialWidget_C::Button_Hold' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, CommonBorder_MainWidget) == 0x0002F8, "Member 'UToastSocialWidget_C::CommonBorder_MainWidget' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, Description) == 0x000300, "Member 'UToastSocialWidget_C::Description' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, NotificationImage) == 0x000308, "Member 'UToastSocialWidget_C::NotificationImage' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, Switcher_InputButtons) == 0x000310, "Member 'UToastSocialWidget_C::Switcher_InputButtons' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, TextBlock_0) == 0x000318, "Member 'UToastSocialWidget_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, Title) == 0x000320, "Member 'UToastSocialWidget_C::Title' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, ToastNotification) == 0x000328, "Member 'UToastSocialWidget_C::ToastNotification' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, AnimationFinishedDelay) == 0x000330, "Member 'UToastSocialWidget_C::AnimationFinishedDelay' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, OnFinishedToast) == 0x000338, "Member 'UToastSocialWidget_C::OnFinishedToast' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, AnimationDelayTimer) == 0x000348, "Member 'UToastSocialWidget_C::AnimationDelayTimer' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, bActionTaken) == 0x000350, "Member 'UToastSocialWidget_C::bActionTaken' has a wrong offset!");

}

