#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TopBarTabButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function TopBarTabButton.TopBarTabButton_C.ExecuteUbergraph_TopBarTabButton
// 0x0100 (0x0100 - 0x0000)
struct TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0024(0x0014)()
	bool                                          K2Node_CustomEvent_bIsSelected;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_CustomEvent_Button;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Selected;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_2;               // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_3;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_4;               // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_5;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_1;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_2;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNormalBangWrapper_C*                   K2Node_DynamicCast_AsNormal_Bang_Wrapper;          // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlternateLabelStyleUsed_ReturnValue;    // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_6;               // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonTextStyle>           CallFunc_GetCurrentTextStyleClass_ReturnValue;     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_7;               // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_3;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonLegacy* Button, bool Selected)> K2Node_CreateDelegate_OutputDelegate;              // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton) == 0x000008, "Wrong alignment on TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton");
static_assert(sizeof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton) == 0x000100, "Wrong size on TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, EntryPoint) == 0x000000, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, Temp_class_Variable) == 0x000008, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, K2Node_MakeStruct_SlateColor_1) == 0x000024, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, K2Node_CustomEvent_bIsSelected) == 0x000038, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::K2Node_CustomEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000039, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000040, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000048, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000050, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000058, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, K2Node_CustomEvent_Button) == 0x000060, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, K2Node_CustomEvent_Selected) == 0x000068, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::K2Node_CustomEvent_Selected' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_IsMobileGame_ReturnValue) == 0x000069, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_IsMobileGame_ReturnValue_1) == 0x00006A, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_IsMobileGame_ReturnValue_2) == 0x00006B, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_IsMobileGame_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_IsMobileGame_ReturnValue_3) == 0x00006C, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_IsMobileGame_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_IsMobileGame_ReturnValue_4) == 0x00006D, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_IsMobileGame_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000070, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_IsMobileGame_ReturnValue_5) == 0x000078, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_IsMobileGame_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_GetRuntimeOptions_ReturnValue_1) == 0x000080, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_GetRuntimeOptions_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_BooleanAND_ReturnValue) == 0x000088, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_BooleanAND_ReturnValue_1) == 0x000089, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_GetRuntimeOptions_ReturnValue_2) == 0x000090, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_GetRuntimeOptions_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, Temp_class_Variable_1) == 0x000098, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x0000A0, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, K2Node_MakeStruct_Margin) == 0x0000A8, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, K2Node_DynamicCast_AsNormal_Bang_Wrapper) == 0x0000B8, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::K2Node_DynamicCast_AsNormal_Bang_Wrapper' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, K2Node_Event_IsDesignTime) == 0x0000C1, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_IsAlternateLabelStyleUsed_ReturnValue) == 0x0000C2, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_IsAlternateLabelStyleUsed_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_IsMobileGame_ReturnValue_6) == 0x0000C3, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_IsMobileGame_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_GetCurrentTextStyleClass_ReturnValue) == 0x0000C8, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_GetCurrentTextStyleClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_BooleanAND_ReturnValue_2) == 0x0000D0, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_IsMobileGame_ReturnValue_7) == 0x0000D1, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_IsMobileGame_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_GetRuntimeOptions_ReturnValue_3) == 0x0000D8, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_GetRuntimeOptions_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, Temp_bool_Variable) == 0x0000E0, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, CallFunc_BooleanAND_ReturnValue_3) == 0x0000E1, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, K2Node_Select_Default) == 0x0000E8, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton, K2Node_CreateDelegate_OutputDelegate) == 0x0000F0, "Member 'TopBarTabButton_C_ExecuteUbergraph_TopBarTabButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function TopBarTabButton.TopBarTabButton_C.HandleSelectionChangedVisuals
// 0x0001 (0x0001 - 0x0000)
struct TopBarTabButton_C_HandleSelectionChangedVisuals final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_C_HandleSelectionChangedVisuals) == 0x000001, "Wrong alignment on TopBarTabButton_C_HandleSelectionChangedVisuals");
static_assert(sizeof(TopBarTabButton_C_HandleSelectionChangedVisuals) == 0x000001, "Wrong size on TopBarTabButton_C_HandleSelectionChangedVisuals");
static_assert(offsetof(TopBarTabButton_C_HandleSelectionChangedVisuals, bIsSelected) == 0x000000, "Member 'TopBarTabButton_C_HandleSelectionChangedVisuals::bIsSelected' has a wrong offset!");

// Function TopBarTabButton.TopBarTabButton_C.InitializeButtonBorderMID
// 0x0008 (0x0008 - 0x0000)
struct TopBarTabButton_C_InitializeButtonBorderMID final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetSingleMaterialStyleMID_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_C_InitializeButtonBorderMID) == 0x000008, "Wrong alignment on TopBarTabButton_C_InitializeButtonBorderMID");
static_assert(sizeof(TopBarTabButton_C_InitializeButtonBorderMID) == 0x000008, "Wrong size on TopBarTabButton_C_InitializeButtonBorderMID");
static_assert(offsetof(TopBarTabButton_C_InitializeButtonBorderMID, CallFunc_GetSingleMaterialStyleMID_ReturnValue) == 0x000000, "Member 'TopBarTabButton_C_InitializeButtonBorderMID::CallFunc_GetSingleMaterialStyleMID_ReturnValue' has a wrong offset!");

// Function TopBarTabButton.TopBarTabButton_C.OnSelectedChangedEvent
// 0x0010 (0x0010 - 0x0000)
struct TopBarTabButton_C_OnSelectedChangedEvent final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected_0;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_C_OnSelectedChangedEvent) == 0x000008, "Wrong alignment on TopBarTabButton_C_OnSelectedChangedEvent");
static_assert(sizeof(TopBarTabButton_C_OnSelectedChangedEvent) == 0x000010, "Wrong size on TopBarTabButton_C_OnSelectedChangedEvent");
static_assert(offsetof(TopBarTabButton_C_OnSelectedChangedEvent, Button) == 0x000000, "Member 'TopBarTabButton_C_OnSelectedChangedEvent::Button' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_OnSelectedChangedEvent, Selected_0) == 0x000008, "Member 'TopBarTabButton_C_OnSelectedChangedEvent::Selected_0' has a wrong offset!");

// Function TopBarTabButton.TopBarTabButton_C.OverrideIcon
// 0x00D0 (0x00D0 - 0x0000)
struct TopBarTabButton_C_OverrideIcon final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            inSlateBrush;                                      // 0x0010(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_C_OverrideIcon) == 0x000010, "Wrong alignment on TopBarTabButton_C_OverrideIcon");
static_assert(sizeof(TopBarTabButton_C_OverrideIcon) == 0x0000D0, "Wrong size on TopBarTabButton_C_OverrideIcon");
static_assert(offsetof(TopBarTabButton_C_OverrideIcon, Show) == 0x000000, "Member 'TopBarTabButton_C_OverrideIcon::Show' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_OverrideIcon, inSlateBrush) == 0x000010, "Member 'TopBarTabButton_C_OverrideIcon::inSlateBrush' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_OverrideIcon, Temp_bool_Variable) == 0x0000C0, "Member 'TopBarTabButton_C_OverrideIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_OverrideIcon, Temp_byte_Variable) == 0x0000C1, "Member 'TopBarTabButton_C_OverrideIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_OverrideIcon, Temp_byte_Variable_1) == 0x0000C2, "Member 'TopBarTabButton_C_OverrideIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_OverrideIcon, K2Node_Select_Default) == 0x0000C3, "Member 'TopBarTabButton_C_OverrideIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_OverrideIcon, CallFunc_IsValid_ReturnValue) == 0x0000C4, "Member 'TopBarTabButton_C_OverrideIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TopBarTabButton.TopBarTabButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct TopBarTabButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_C_PreConstruct) == 0x000001, "Wrong alignment on TopBarTabButton_C_PreConstruct");
static_assert(sizeof(TopBarTabButton_C_PreConstruct) == 0x000001, "Wrong size on TopBarTabButton_C_PreConstruct");
static_assert(offsetof(TopBarTabButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'TopBarTabButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function TopBarTabButton.TopBarTabButton_C.SeedRandomValues
// 0x0010 (0x0010 - 0x0000)
struct TopBarTabButton_C_SeedRandomValues final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_C_SeedRandomValues) == 0x000004, "Wrong alignment on TopBarTabButton_C_SeedRandomValues");
static_assert(sizeof(TopBarTabButton_C_SeedRandomValues) == 0x000010, "Wrong size on TopBarTabButton_C_SeedRandomValues");
static_assert(offsetof(TopBarTabButton_C_SeedRandomValues, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'TopBarTabButton_C_SeedRandomValues::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_SeedRandomValues, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000004, "Member 'TopBarTabButton_C_SeedRandomValues::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_SeedRandomValues, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000008, "Member 'TopBarTabButton_C_SeedRandomValues::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_SeedRandomValues, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x00000C, "Member 'TopBarTabButton_C_SeedRandomValues::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");

// Function TopBarTabButton.TopBarTabButton_C.SetText
// 0x0020 (0x0020 - 0x0000)
struct TopBarTabButton_C_SetText final
{
public:
	class FText                                   ButtonText_0;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_C_SetText) == 0x000008, "Wrong alignment on TopBarTabButton_C_SetText");
static_assert(sizeof(TopBarTabButton_C_SetText) == 0x000020, "Wrong size on TopBarTabButton_C_SetText");
static_assert(offsetof(TopBarTabButton_C_SetText, ButtonText_0) == 0x000000, "Member 'TopBarTabButton_C_SetText::ButtonText_0' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_SetText, CallFunc_TextIsEmpty_ReturnValue) == 0x000018, "Member 'TopBarTabButton_C_SetText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_C_SetText, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'TopBarTabButton_C_SetText::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function TopBarTabButton.TopBarTabButton_C.UpdateMIDWithRandomValues
// 0x0001 (0x0001 - 0x0000)
struct TopBarTabButton_C_UpdateMIDWithRandomValues final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_C_UpdateMIDWithRandomValues) == 0x000001, "Wrong alignment on TopBarTabButton_C_UpdateMIDWithRandomValues");
static_assert(sizeof(TopBarTabButton_C_UpdateMIDWithRandomValues) == 0x000001, "Wrong size on TopBarTabButton_C_UpdateMIDWithRandomValues");
static_assert(offsetof(TopBarTabButton_C_UpdateMIDWithRandomValues, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'TopBarTabButton_C_UpdateMIDWithRandomValues::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

