#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TopBarTabButton_SpyBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TopBarTabButton_SpyBase.TopBarTabButton_SpyBase_C
// 0x0090 (0x0FF0 - 0x0F60)
class UTopBarTabButton_SpyBase_C final : public UFortTopBarTabTextIconButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hovered;                                           // 0x0F68(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0F70(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 SpyIcon;                                           // 0x0F78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_ButtonBorder;                                  // 0x0F80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreviewMobileStyle;                                // 0x0F88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F89[0x3];                                      // 0x0F89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatSpringState                      SpringState_ShapeChange;                           // 0x0F8C(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FFloatSpringState                      SpringState_Scale;                                 // 0x0F98(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Spring_Scale_Target;                               // 0x0FA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MassMultiply;                                      // 0x0FA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DampenMultiply;                                    // 0x0FAC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StiffnessMultiply;                                 // 0x0FB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VisualSelectionState;                              // 0x0FB4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB5[0x3];                                      // 0x0FB5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RandomFloat_Top;                                   // 0x0FB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomFloat_Left;                                  // 0x0FBC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomFloat_Right;                                 // 0x0FC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomFloat_Bottom;                                // 0x0FC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShapeChange_New;                                   // 0x0FC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShapeChange_Target;                                // 0x0FCC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UpdateSpring;                                      // 0x0FD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD1[0x7];                                      // 0x0FD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ButtonText;                                        // 0x0FD8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_TopBarTabButton_SpyBase(int32 EntryPoint);
	void HandleSelectionChangedVisuals(bool bIsSelected);
	void InitializeButtonBorderMID();
	void OnCurrentTextStyleChanged();
	void OnInitialized();
	void OnSelectedChangedEvent(class UCommonButtonLegacy* Button, bool Selected_0);
	void OverrideIcon(bool Show, const struct FSlateBrush& inSlateBrush);
	void PreConstruct(bool IsDesignTime);
	void SeedRandomValues();
	void SetText(const class FText& ButtonText_0);
	void UpdateMIDWithRandomValues();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TopBarTabButton_SpyBase_C">();
	}
	static class UTopBarTabButton_SpyBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTopBarTabButton_SpyBase_C>();
	}
};
static_assert(alignof(UTopBarTabButton_SpyBase_C) == 0x000010, "Wrong alignment on UTopBarTabButton_SpyBase_C");
static_assert(sizeof(UTopBarTabButton_SpyBase_C) == 0x000FF0, "Wrong size on UTopBarTabButton_SpyBase_C");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, UberGraphFrame) == 0x000F60, "Member 'UTopBarTabButton_SpyBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, Hovered) == 0x000F68, "Member 'UTopBarTabButton_SpyBase_C::Hovered' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, Selected) == 0x000F70, "Member 'UTopBarTabButton_SpyBase_C::Selected' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, SpyIcon) == 0x000F78, "Member 'UTopBarTabButton_SpyBase_C::SpyIcon' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, MID_ButtonBorder) == 0x000F80, "Member 'UTopBarTabButton_SpyBase_C::MID_ButtonBorder' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, PreviewMobileStyle) == 0x000F88, "Member 'UTopBarTabButton_SpyBase_C::PreviewMobileStyle' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, SpringState_ShapeChange) == 0x000F8C, "Member 'UTopBarTabButton_SpyBase_C::SpringState_ShapeChange' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, SpringState_Scale) == 0x000F98, "Member 'UTopBarTabButton_SpyBase_C::SpringState_Scale' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, Spring_Scale_Target) == 0x000FA4, "Member 'UTopBarTabButton_SpyBase_C::Spring_Scale_Target' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, MassMultiply) == 0x000FA8, "Member 'UTopBarTabButton_SpyBase_C::MassMultiply' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, DampenMultiply) == 0x000FAC, "Member 'UTopBarTabButton_SpyBase_C::DampenMultiply' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, StiffnessMultiply) == 0x000FB0, "Member 'UTopBarTabButton_SpyBase_C::StiffnessMultiply' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, VisualSelectionState) == 0x000FB4, "Member 'UTopBarTabButton_SpyBase_C::VisualSelectionState' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, RandomFloat_Top) == 0x000FB8, "Member 'UTopBarTabButton_SpyBase_C::RandomFloat_Top' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, RandomFloat_Left) == 0x000FBC, "Member 'UTopBarTabButton_SpyBase_C::RandomFloat_Left' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, RandomFloat_Right) == 0x000FC0, "Member 'UTopBarTabButton_SpyBase_C::RandomFloat_Right' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, RandomFloat_Bottom) == 0x000FC4, "Member 'UTopBarTabButton_SpyBase_C::RandomFloat_Bottom' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, ShapeChange_New) == 0x000FC8, "Member 'UTopBarTabButton_SpyBase_C::ShapeChange_New' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, ShapeChange_Target) == 0x000FCC, "Member 'UTopBarTabButton_SpyBase_C::ShapeChange_Target' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, UpdateSpring) == 0x000FD0, "Member 'UTopBarTabButton_SpyBase_C::UpdateSpring' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_SpyBase_C, ButtonText) == 0x000FD8, "Member 'UTopBarTabButton_SpyBase_C::ButtonText' has a wrong offset!");

}

