#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TopRightWindowControlsWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function TopRightWindowControlsWidget.TopRightWindowControlsWidget_C.ExecuteUbergraph_TopRightWindowControlsWidget
// 0x0004 (0x0004 - 0x0000)
struct TopRightWindowControlsWidget_C_ExecuteUbergraph_TopRightWindowControlsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopRightWindowControlsWidget_C_ExecuteUbergraph_TopRightWindowControlsWidget) == 0x000004, "Wrong alignment on TopRightWindowControlsWidget_C_ExecuteUbergraph_TopRightWindowControlsWidget");
static_assert(sizeof(TopRightWindowControlsWidget_C_ExecuteUbergraph_TopRightWindowControlsWidget) == 0x000004, "Wrong size on TopRightWindowControlsWidget_C_ExecuteUbergraph_TopRightWindowControlsWidget");
static_assert(offsetof(TopRightWindowControlsWidget_C_ExecuteUbergraph_TopRightWindowControlsWidget, EntryPoint) == 0x000000, "Member 'TopRightWindowControlsWidget_C_ExecuteUbergraph_TopRightWindowControlsWidget::EntryPoint' has a wrong offset!");

// Function TopRightWindowControlsWidget.TopRightWindowControlsWidget_C.UpdateButtons
// 0x0018 (0x0018 - 0x0000)
struct TopRightWindowControlsWidget_C_UpdateButtons final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopRightWindowControlsWidget_C_UpdateButtons) == 0x000008, "Wrong alignment on TopRightWindowControlsWidget_C_UpdateButtons");
static_assert(sizeof(TopRightWindowControlsWidget_C_UpdateButtons) == 0x000018, "Wrong size on TopRightWindowControlsWidget_C_UpdateButtons");
static_assert(offsetof(TopRightWindowControlsWidget_C_UpdateButtons, Temp_bool_Variable) == 0x000000, "Member 'TopRightWindowControlsWidget_C_UpdateButtons::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TopRightWindowControlsWidget_C_UpdateButtons, Temp_byte_Variable) == 0x000001, "Member 'TopRightWindowControlsWidget_C_UpdateButtons::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TopRightWindowControlsWidget_C_UpdateButtons, Temp_byte_Variable_1) == 0x000002, "Member 'TopRightWindowControlsWidget_C_UpdateButtons::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TopRightWindowControlsWidget_C_UpdateButtons, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'TopRightWindowControlsWidget_C_UpdateButtons::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopRightWindowControlsWidget_C_UpdateButtons, CallFunc_IsInZone_ReturnValue) == 0x000010, "Member 'TopRightWindowControlsWidget_C_UpdateButtons::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopRightWindowControlsWidget_C_UpdateButtons, K2Node_Select_Default) == 0x000011, "Member 'TopRightWindowControlsWidget_C_UpdateButtons::K2Node_Select_Default' has a wrong offset!");

}

