#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TournamentPayoutModal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function TournamentPayoutModal.TournamentPayoutModal_C.BndEvt__BackButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TournamentPayoutModal_C_BndEvt__BackButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentPayoutModal_C_BndEvt__BackButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TournamentPayoutModal_C_BndEvt__BackButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TournamentPayoutModal_C_BndEvt__BackButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TournamentPayoutModal_C_BndEvt__BackButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TournamentPayoutModal_C_BndEvt__BackButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TournamentPayoutModal_C_BndEvt__BackButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TournamentPayoutModal.TournamentPayoutModal_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TournamentPayoutModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentPayoutModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TournamentPayoutModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TournamentPayoutModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TournamentPayoutModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TournamentPayoutModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TournamentPayoutModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TournamentPayoutModal.TournamentPayoutModal_C.EmptyFunction
// 0x0001 (0x0001 - 0x0000)
struct TournamentPayoutModal_C_EmptyFunction final
{
public:
	bool                                          Handled;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentPayoutModal_C_EmptyFunction) == 0x000001, "Wrong alignment on TournamentPayoutModal_C_EmptyFunction");
static_assert(sizeof(TournamentPayoutModal_C_EmptyFunction) == 0x000001, "Wrong size on TournamentPayoutModal_C_EmptyFunction");
static_assert(offsetof(TournamentPayoutModal_C_EmptyFunction, Handled) == 0x000000, "Member 'TournamentPayoutModal_C_EmptyFunction::Handled' has a wrong offset!");

// Function TournamentPayoutModal.TournamentPayoutModal_C.EventColorize
// 0x01D0 (0x01D0 - 0x0000)
struct TournamentPayoutModal_C_EventColorize final
{
public:
	struct FFortTournamentDisplayInfo             TournamentDisplayInfo;                             // 0x0000(0x01D0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(TournamentPayoutModal_C_EventColorize) == 0x000008, "Wrong alignment on TournamentPayoutModal_C_EventColorize");
static_assert(sizeof(TournamentPayoutModal_C_EventColorize) == 0x0001D0, "Wrong size on TournamentPayoutModal_C_EventColorize");
static_assert(offsetof(TournamentPayoutModal_C_EventColorize, TournamentDisplayInfo) == 0x000000, "Member 'TournamentPayoutModal_C_EventColorize::TournamentDisplayInfo' has a wrong offset!");

// Function TournamentPayoutModal.TournamentPayoutModal_C.ExecuteUbergraph_TournamentPayoutModal
// 0x0218 (0x0218 - 0x0000)
struct TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventWindowId;                  // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_TournamentId;                   // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortTournamentDisplayInfo             K2Node_CustomEvent_TournamentDisplayInfo;          // 0x0038(0x01D0)()
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal) == 0x000008, "Wrong alignment on TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal");
static_assert(sizeof(TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal) == 0x000218, "Wrong size on TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal");
static_assert(offsetof(TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal, EntryPoint) == 0x000000, "Member 'TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal, K2Node_CustomEvent_EventWindowId) == 0x000010, "Member 'TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal::K2Node_CustomEvent_EventWindowId' has a wrong offset!");
static_assert(offsetof(TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal, K2Node_CustomEvent_TournamentId) == 0x000020, "Member 'TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal::K2Node_CustomEvent_TournamentId' has a wrong offset!");
static_assert(offsetof(TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal, K2Node_ComponentBoundEvent_Button_1) == 0x000030, "Member 'TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal, K2Node_CustomEvent_TournamentDisplayInfo) == 0x000038, "Member 'TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal::K2Node_CustomEvent_TournamentDisplayInfo' has a wrong offset!");
static_assert(offsetof(TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal, K2Node_MakeStruct_LinearColor) == 0x000208, "Member 'TournamentPayoutModal_C_ExecuteUbergraph_TournamentPayoutModal::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function TournamentPayoutModal.TournamentPayoutModal_C.Init
// 0x0020 (0x0020 - 0x0000)
struct TournamentPayoutModal_C_Init final
{
public:
	class FString                                 EventWindowId;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 TournamentId;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentPayoutModal_C_Init) == 0x000008, "Wrong alignment on TournamentPayoutModal_C_Init");
static_assert(sizeof(TournamentPayoutModal_C_Init) == 0x000020, "Wrong size on TournamentPayoutModal_C_Init");
static_assert(offsetof(TournamentPayoutModal_C_Init, EventWindowId) == 0x000000, "Member 'TournamentPayoutModal_C_Init::EventWindowId' has a wrong offset!");
static_assert(offsetof(TournamentPayoutModal_C_Init, TournamentId) == 0x000010, "Member 'TournamentPayoutModal_C_Init::TournamentId' has a wrong offset!");

}

