#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TournamentLiveGamesEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TournamentLiveGamesEntry.TournamentLiveGamesEntry_C
// 0x0030 (0x0F40 - 0x0F10)
class UTournamentLiveGamesEntry_C final : public UFortTournamentLiveGameSessionEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0F18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_IsPlayer;                             // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_Selected;                             // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_Zebra;                                // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnSelected();
	void ExecuteUbergraph_TournamentLiveGamesEntry(int32 EntryPoint);
	void OnEntrySet(int32 EntryIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TournamentLiveGamesEntry_C">();
	}
	static class UTournamentLiveGamesEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTournamentLiveGamesEntry_C>();
	}
};
static_assert(alignof(UTournamentLiveGamesEntry_C) == 0x000010, "Wrong alignment on UTournamentLiveGamesEntry_C");
static_assert(sizeof(UTournamentLiveGamesEntry_C) == 0x000F40, "Wrong size on UTournamentLiveGamesEntry_C");
static_assert(offsetof(UTournamentLiveGamesEntry_C, UberGraphFrame) == 0x000F10, "Member 'UTournamentLiveGamesEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTournamentLiveGamesEntry_C, Selected) == 0x000F18, "Member 'UTournamentLiveGamesEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UTournamentLiveGamesEntry_C, CommonBorder_IsPlayer) == 0x000F20, "Member 'UTournamentLiveGamesEntry_C::CommonBorder_IsPlayer' has a wrong offset!");
static_assert(offsetof(UTournamentLiveGamesEntry_C, CommonBorder_Selected) == 0x000F28, "Member 'UTournamentLiveGamesEntry_C::CommonBorder_Selected' has a wrong offset!");
static_assert(offsetof(UTournamentLiveGamesEntry_C, CommonBorder_Zebra) == 0x000F30, "Member 'UTournamentLiveGamesEntry_C::CommonBorder_Zebra' has a wrong offset!");

}

