#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TournamentDetails

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function TournamentDetails.TournamentDetails_C.AnimTransition
// 0x0018 (0x0018 - 0x0000)
struct TournamentDetails_C_AnimTransition final
{
public:
	bool                                          In;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlaySpeed;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentDetails_C_AnimTransition) == 0x000008, "Wrong alignment on TournamentDetails_C_AnimTransition");
static_assert(sizeof(TournamentDetails_C_AnimTransition) == 0x000018, "Wrong size on TournamentDetails_C_AnimTransition");
static_assert(offsetof(TournamentDetails_C_AnimTransition, In) == 0x000000, "Member 'TournamentDetails_C_AnimTransition::In' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_AnimTransition, Animation) == 0x000008, "Member 'TournamentDetails_C_AnimTransition::Animation' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_AnimTransition, PlaySpeed) == 0x000010, "Member 'TournamentDetails_C_AnimTransition::PlaySpeed' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.BndEvt__BackButton2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TournamentDetails_C_BndEvt__BackButton2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentDetails_C_BndEvt__BackButton2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TournamentDetails_C_BndEvt__BackButton2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TournamentDetails_C_BndEvt__BackButton2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TournamentDetails_C_BndEvt__BackButton2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TournamentDetails_C_BndEvt__BackButton2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TournamentDetails_C_BndEvt__BackButton2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.BndEvt__Button_EnableMFA_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TournamentDetails_C_BndEvt__Button_EnableMFA_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentDetails_C_BndEvt__Button_EnableMFA_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TournamentDetails_C_BndEvt__Button_EnableMFA_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TournamentDetails_C_BndEvt__Button_EnableMFA_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TournamentDetails_C_BndEvt__Button_EnableMFA_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TournamentDetails_C_BndEvt__Button_EnableMFA_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TournamentDetails_C_BndEvt__Button_EnableMFA_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TournamentDetails_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentDetails_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TournamentDetails_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TournamentDetails_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TournamentDetails_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TournamentDetails_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TournamentDetails_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.BndEvt__DetailsPanelButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TournamentDetails_C_BndEvt__DetailsPanelButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentDetails_C_BndEvt__DetailsPanelButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TournamentDetails_C_BndEvt__DetailsPanelButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TournamentDetails_C_BndEvt__DetailsPanelButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TournamentDetails_C_BndEvt__DetailsPanelButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TournamentDetails_C_BndEvt__DetailsPanelButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TournamentDetails_C_BndEvt__DetailsPanelButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.BndEvt__OverviewPanelButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TournamentDetails_C_BndEvt__OverviewPanelButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentDetails_C_BndEvt__OverviewPanelButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TournamentDetails_C_BndEvt__OverviewPanelButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TournamentDetails_C_BndEvt__OverviewPanelButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TournamentDetails_C_BndEvt__OverviewPanelButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TournamentDetails_C_BndEvt__OverviewPanelButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TournamentDetails_C_BndEvt__OverviewPanelButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.BndEvt__TournamentDetails_FloatingLeaderboardButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TournamentDetails_C_BndEvt__TournamentDetails_FloatingLeaderboardButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentDetails_C_BndEvt__TournamentDetails_FloatingLeaderboardButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TournamentDetails_C_BndEvt__TournamentDetails_FloatingLeaderboardButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TournamentDetails_C_BndEvt__TournamentDetails_FloatingLeaderboardButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TournamentDetails_C_BndEvt__TournamentDetails_FloatingLeaderboardButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TournamentDetails_C_BndEvt__TournamentDetails_FloatingLeaderboardButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TournamentDetails_C_BndEvt__TournamentDetails_FloatingLeaderboardButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.CreateScoringWidgets
// 0x00A8 (0x00A8 - 0x0000)
struct TournamentDetails_C_CreateScoringWidgets final
{
public:
	class FString                                 TournamentSeriesId;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 TournamentId;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFortShowdownScoringRuleInfo>   CallFunc_FindTournamentScoringRules_ReturnValue;   // 0x0020(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortShowdownScoringRuleInfo           CallFunc_Array_Get_Item;                           // 0x0038(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UShowdownTournamentDetailsScoringRule_C* CallFunc_Create_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentDetails_C_CreateScoringWidgets) == 0x000008, "Wrong alignment on TournamentDetails_C_CreateScoringWidgets");
static_assert(sizeof(TournamentDetails_C_CreateScoringWidgets) == 0x0000A8, "Wrong size on TournamentDetails_C_CreateScoringWidgets");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, TournamentSeriesId) == 0x000000, "Member 'TournamentDetails_C_CreateScoringWidgets::TournamentSeriesId' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, TournamentId) == 0x000010, "Member 'TournamentDetails_C_CreateScoringWidgets::TournamentId' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_FindTournamentScoringRules_ReturnValue) == 0x000020, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_FindTournamentScoringRules_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, Temp_int_Array_Index_Variable) == 0x000030, "Member 'TournamentDetails_C_CreateScoringWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_Array_Get_Item) == 0x000038, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'TournamentDetails_C_CreateScoringWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_Divide_IntInt_ReturnValue) == 0x000068, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00006C, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_Subtract_IntInt_ReturnValue) == 0x000070, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_Create_ReturnValue) == 0x000080, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, Temp_bool_Variable) == 0x000088, "Member 'TournamentDetails_C_CreateScoringWidgets::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, K2Node_Select_Default) == 0x00008C, "Member 'TournamentDetails_C_CreateScoringWidgets::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000090, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, Temp_int_Variable) == 0x000098, "Member 'TournamentDetails_C_CreateScoringWidgets::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, Temp_int_Variable_1) == 0x00009C, "Member 'TournamentDetails_C_CreateScoringWidgets::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, Temp_bool_Variable_1) == 0x0000A0, "Member 'TournamentDetails_C_CreateScoringWidgets::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, K2Node_Select_Default_1) == 0x0000A4, "Member 'TournamentDetails_C_CreateScoringWidgets::K2Node_Select_Default_1' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.EventCenterEventWindow
// 0x0008 (0x0008 - 0x0000)
struct TournamentDetails_C_EventCenterEventWindow final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentDetails_C_EventCenterEventWindow) == 0x000008, "Wrong alignment on TournamentDetails_C_EventCenterEventWindow");
static_assert(sizeof(TournamentDetails_C_EventCenterEventWindow) == 0x000008, "Wrong size on TournamentDetails_C_EventCenterEventWindow");
static_assert(offsetof(TournamentDetails_C_EventCenterEventWindow, Widget) == 0x000000, "Member 'TournamentDetails_C_EventCenterEventWindow::Widget' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.EventDeselectWindows
// 0x0008 (0x0008 - 0x0000)
struct TournamentDetails_C_EventDeselectWindows final
{
public:
	class UWidget*                                SelectedWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentDetails_C_EventDeselectWindows) == 0x000008, "Wrong alignment on TournamentDetails_C_EventDeselectWindows");
static_assert(sizeof(TournamentDetails_C_EventDeselectWindows) == 0x000008, "Wrong size on TournamentDetails_C_EventDeselectWindows");
static_assert(offsetof(TournamentDetails_C_EventDeselectWindows, SelectedWidget) == 0x000000, "Member 'TournamentDetails_C_EventDeselectWindows::SelectedWidget' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.EventShowWindowDetails
// 0x0008 (0x0008 - 0x0000)
struct TournamentDetails_C_EventShowWindowDetails final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentDetails_C_EventShowWindowDetails) == 0x000008, "Wrong alignment on TournamentDetails_C_EventShowWindowDetails");
static_assert(sizeof(TournamentDetails_C_EventShowWindowDetails) == 0x000008, "Wrong size on TournamentDetails_C_EventShowWindowDetails");
static_assert(offsetof(TournamentDetails_C_EventShowWindowDetails, Button) == 0x000000, "Member 'TournamentDetails_C_EventShowWindowDetails::Button' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.EventToggleFullScreenContent
// 0x0001 (0x0001 - 0x0000)
struct TournamentDetails_C_EventToggleFullScreenContent final
{
public:
	bool                                          In;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentDetails_C_EventToggleFullScreenContent) == 0x000001, "Wrong alignment on TournamentDetails_C_EventToggleFullScreenContent");
static_assert(sizeof(TournamentDetails_C_EventToggleFullScreenContent) == 0x000001, "Wrong size on TournamentDetails_C_EventToggleFullScreenContent");
static_assert(offsetof(TournamentDetails_C_EventToggleFullScreenContent, In) == 0x000000, "Member 'TournamentDetails_C_EventToggleFullScreenContent::In' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.EventViewFullLeaderboard
// 0x0020 (0x0020 - 0x0000)
struct TournamentDetails_C_EventViewFullLeaderboard final
{
public:
	class FString                                 TournamentId;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EventId;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentDetails_C_EventViewFullLeaderboard) == 0x000008, "Wrong alignment on TournamentDetails_C_EventViewFullLeaderboard");
static_assert(sizeof(TournamentDetails_C_EventViewFullLeaderboard) == 0x000020, "Wrong size on TournamentDetails_C_EventViewFullLeaderboard");
static_assert(offsetof(TournamentDetails_C_EventViewFullLeaderboard, TournamentId) == 0x000000, "Member 'TournamentDetails_C_EventViewFullLeaderboard::TournamentId' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_EventViewFullLeaderboard, EventId) == 0x000010, "Member 'TournamentDetails_C_EventViewFullLeaderboard::EventId' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.EventViewPayout
// 0x0020 (0x0020 - 0x0000)
struct TournamentDetails_C_EventViewPayout final
{
public:
	class FString                                 EventWindowId;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EventId;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentDetails_C_EventViewPayout) == 0x000008, "Wrong alignment on TournamentDetails_C_EventViewPayout");
static_assert(sizeof(TournamentDetails_C_EventViewPayout) == 0x000020, "Wrong size on TournamentDetails_C_EventViewPayout");
static_assert(offsetof(TournamentDetails_C_EventViewPayout, EventWindowId) == 0x000000, "Member 'TournamentDetails_C_EventViewPayout::EventWindowId' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_EventViewPayout, EventId) == 0x000010, "Member 'TournamentDetails_C_EventViewPayout::EventId' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.ExecuteUbergraph_TournamentDetails
// 0x0390 (0x0390 - 0x0000)
struct TournamentDetails_C_ExecuteUbergraph_TournamentDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSeriesPointLeaderboardAvailable_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UShowdownEventTile_C*                   K2Node_DynamicCast_AsShowdown_Event_Tile;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_CustomEvent_Button;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShowdownEventTile_C*                   K2Node_DynamicCast_AsShowdown_Event_Tile_1;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_In_1;                           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_CustomEvent_Animation;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_PlaySpeed;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_1;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShowdownEventTile_C*                   K2Node_DynamicCast_AsShowdown_Event_Tile_2;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UShowdownEventTile_C*                   K2Node_DynamicCast_AsShowdown_Event_Tile_3;        // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue_2;           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_CustomEvent_SelectedWidget;                 // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildIndex_ReturnValue;                // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_3;           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_CustomEvent_Widget;                         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_DynamicCast_AsCommon_Button_Legacy;         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x011C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x012C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_GetSafeZonePadding_SafePadding;           // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSafeZonePadding_SafePaddingScale;      // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_GetSafeZonePadding_SpillOverPadding;      // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01CC(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_4;        // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_2;          // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& EventWindowId, const class FString& EventId)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0218(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_5;               // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_4;               // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_3;               // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_TournamentId;                   // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventId_1;                      // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_In;                             // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_2;               // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoCalloutMFARequirement_ReturnValue;      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnableMultiFactorAuthModalBP_C*        CallFunc_Create_ReturnValue;                       // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_QueueModal_ReturnValue;                   // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventWindowId;                  // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventId;                        // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0x2];                                      // 0x02C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_2;                 // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShowdownEventTile_C*                   K2Node_DynamicCast_AsShowdown_Event_Tile_4;        // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA[0x2];                                      // 0x02DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_3;                 // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UShowdownEventTile_C*                   K2Node_DynamicCast_AsShowdown_Event_Tile_5;        // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B[0x1];                                      // 0x030B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0320(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTournamentId_ReturnValue;              // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue_4;           // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& TournamentId, const class FString& EventId)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0358(0x0010)(ZeroConstructor, NoDestructor)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_4;                 // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSeriesPointLeaderboardAvailable_ReturnValue_1; // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0374(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails) == 0x000010, "Wrong alignment on TournamentDetails_C_ExecuteUbergraph_TournamentDetails");
static_assert(sizeof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails) == 0x000390, "Wrong size on TournamentDetails_C_ExecuteUbergraph_TournamentDetails");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, EntryPoint) == 0x000000, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, CallFunc_IsSeriesPointLeaderboardAvailable_ReturnValue) == 0x000004, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::CallFunc_IsSeriesPointLeaderboardAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, Temp_int_Variable) == 0x000008, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, K2Node_DynamicCast_AsShowdown_Event_Tile) == 0x000010, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::K2Node_DynamicCast_AsShowdown_Event_Tile' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, Temp_float_Variable) == 0x000020, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, K2Node_CustomEvent_Button) == 0x000028, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, K2Node_DynamicCast_AsShowdown_Event_Tile_1) == 0x000030, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::K2Node_DynamicCast_AsShowdown_Event_Tile_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, K2Node_CustomEvent_In_1) == 0x000039, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::K2Node_CustomEvent_In_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, K2Node_CustomEvent_Animation) == 0x000040, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::K2Node_CustomEvent_Animation' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, K2Node_CustomEvent_PlaySpeed) == 0x000048, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::K2Node_CustomEvent_PlaySpeed' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, CallFunc_PauseAnimation_ReturnValue) == 0x00004C, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, CallFunc_GetStartTime_ReturnValue) == 0x000060, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, CallFunc_PauseAnimation_ReturnValue_1) == 0x000064, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::CallFunc_PauseAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000068, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, CallFunc_Add_FloatFloat_ReturnValue) == 0x00006C, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, CallFunc_GetEndTime_ReturnValue) == 0x000070, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, CallFunc_PlayAnimation_ReturnValue) == 0x000078, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_ExecuteUbergraph_TournamentDetails, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000080, "Member 'TournamentDetails_C_ExecuteUbergraph_TournamentDetails::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
