#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_BigGoldButton

#include "Basic.hpp"

#include "CrewUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_BigGoldButton.UI_BigGoldButton_C.EventHover
// 0x0001 (0x0001 - 0x0000)
struct UI_BigGoldButton_C_EventHover final
{
public:
	bool                                          In;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_BigGoldButton_C_EventHover) == 0x000001, "Wrong alignment on UI_BigGoldButton_C_EventHover");
static_assert(sizeof(UI_BigGoldButton_C_EventHover) == 0x000001, "Wrong size on UI_BigGoldButton_C_EventHover");
static_assert(offsetof(UI_BigGoldButton_C_EventHover, In) == 0x000000, "Member 'UI_BigGoldButton_C_EventHover::In' has a wrong offset!");

// Function UI_BigGoldButton.UI_BigGoldButton_C.ExecuteUbergraph_UI_BigGoldButton
// 0x0068 (0x0068 - 0x0000)
struct UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattlePassPurchaseButtonCurrencyType         Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattlePassPurchaseButtonCurrencyType         Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattlePassPurchaseButtonCurrencyType         Temp_byte_Variable_4;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_In;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_2;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_3;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton) == 0x000008, "Wrong alignment on UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton");
static_assert(sizeof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton) == 0x000068, "Wrong size on UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, EntryPoint) == 0x000000, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable) == 0x000004, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_1) == 0x000005, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_bool_Variable) == 0x000006, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_2) == 0x000007, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_3) == 0x000008, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_bool_Variable_1) == 0x000009, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_object_Variable) == 0x000010, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_object_Variable_1) == 0x000018, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_4) == 0x000020, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_5) == 0x000021, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_6) == 0x000022, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_7) == 0x000023, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_bool_Variable_2) == 0x000024, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_8) == 0x000025, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_9) == 0x000026, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Event_IsDesignTime) == 0x000027, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_CustomEvent_In) == 0x000028, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_CustomEvent_In' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000030, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000038, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Select_Default) == 0x000040, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Select_Default_1) == 0x000048, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Select_Default_2) == 0x000050, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Select_Default_3) == 0x000058, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Select_Default_4) == 0x000060, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Select_Default_5) == 0x000061, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Select_Default_5' has a wrong offset!");

// Function UI_BigGoldButton.UI_BigGoldButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_BigGoldButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_BigGoldButton_C_PreConstruct) == 0x000001, "Wrong alignment on UI_BigGoldButton_C_PreConstruct");
static_assert(sizeof(UI_BigGoldButton_C_PreConstruct) == 0x000001, "Wrong size on UI_BigGoldButton_C_PreConstruct");
static_assert(offsetof(UI_BigGoldButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_BigGoldButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

