#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_BigGoldButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CrewUI_structs.hpp"
#include "CrewUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_BigGoldButton.UI_BigGoldButton_C
// 0x00A0 (0x0F70 - 0x0ED0)
class UUI_BigGoldButton_C final : public UBattlePassCrewPurchaseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0ED8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Empty;                                        // 0x0EE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0EE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0EF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0EF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Button;                                      // 0x0F00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Button_Inner;                                // 0x0F08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CurrencyVBuck;                               // 0x0F10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x0F18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Hover;                                     // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayStationStoreLogo;                              // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Currency;                                 // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilityWidgetLegacy*          Visibility_PlatformImage;                          // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisualAttachment*                Visuals_Glows;                                     // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x0F48(0x0018)(Edit, BlueprintVisible)
	bool                                          Unskew;                                            // 0x0F60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GlowsOff;                                          // 0x0F61(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HoverLightning;                                    // 0x0F62(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void EventHover(bool In);
	void ExecuteUbergraph_UI_BigGoldButton(int32 EntryPoint);
	void OnCurrencyUpdated();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_BigGoldButton_C">();
	}
	static class UUI_BigGoldButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_BigGoldButton_C>();
	}
};
static_assert(alignof(UUI_BigGoldButton_C) == 0x000010, "Wrong alignment on UUI_BigGoldButton_C");
static_assert(sizeof(UUI_BigGoldButton_C) == 0x000F70, "Wrong size on UUI_BigGoldButton_C");
static_assert(offsetof(UUI_BigGoldButton_C, UberGraphFrame) == 0x000ED0, "Member 'UUI_BigGoldButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Hover) == 0x000ED8, "Member 'UUI_BigGoldButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, HBox_Empty) == 0x000EE0, "Member 'UUI_BigGoldButton_C::HBox_Empty' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image) == 0x000EE8, "Member 'UUI_BigGoldButton_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_0) == 0x000EF0, "Member 'UUI_BigGoldButton_C::Image_0' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_1) == 0x000EF8, "Member 'UUI_BigGoldButton_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_Button) == 0x000F00, "Member 'UUI_BigGoldButton_C::Image_Button' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_Button_Inner) == 0x000F08, "Member 'UUI_BigGoldButton_C::Image_Button_Inner' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_CurrencyVBuck) == 0x000F10, "Member 'UUI_BigGoldButton_C::Image_CurrencyVBuck' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_Shadow) == 0x000F18, "Member 'UUI_BigGoldButton_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Overlay_Hover) == 0x000F20, "Member 'UUI_BigGoldButton_C::Overlay_Hover' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, PlayStationStoreLogo) == 0x000F28, "Member 'UUI_BigGoldButton_C::PlayStationStoreLogo' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Switcher_Currency) == 0x000F30, "Member 'UUI_BigGoldButton_C::Switcher_Currency' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Visibility_PlatformImage) == 0x000F38, "Member 'UUI_BigGoldButton_C::Visibility_PlatformImage' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Visuals_Glows) == 0x000F40, "Member 'UUI_BigGoldButton_C::Visuals_Glows' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, ButtonText) == 0x000F48, "Member 'UUI_BigGoldButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Unskew) == 0x000F60, "Member 'UUI_BigGoldButton_C::Unskew' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, GlowsOff) == 0x000F61, "Member 'UUI_BigGoldButton_C::GlowsOff' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, HoverLightning) == 0x000F62, "Member 'UUI_BigGoldButton_C::HoverLightning' has a wrong offset!");

}

