#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Upsell_TutorialTooltip

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "BattlePassBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Upsell_TutorialTooltip.Upsell_TutorialTooltip_C
// 0x0130 (0x03B0 - 0x0280)
class UUpsell_TutorialTooltip_C final : public UFortBattlePassTutorialTooltip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       burstLoop;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxcontent;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x02B0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            In_Brush;                                          // 0x02D0(0x00B0)(Edit, BlueprintVisible, ExposeOnSpawn)
	EHorizontalAlignment                          In_Horizontal_Alignment;                           // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EVerticalAlignment                            In_Vertical_Alignment;                             // 0x0381(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_382[0x2];                                      // 0x0382(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       In_Transform;                                      // 0x0384(0x001C)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	bool                                          Show_Icon;                                         // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Right;                                             // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Upsell_TutorialTooltip(int32 EntryPoint);
	void HideTooltip();
	void PreConstruct(bool IsDesignTime);
	void ShowTooltip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Upsell_TutorialTooltip_C">();
	}
	static class UUpsell_TutorialTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUpsell_TutorialTooltip_C>();
	}
};
static_assert(alignof(UUpsell_TutorialTooltip_C) == 0x000010, "Wrong alignment on UUpsell_TutorialTooltip_C");
static_assert(sizeof(UUpsell_TutorialTooltip_C) == 0x0003B0, "Wrong size on UUpsell_TutorialTooltip_C");
static_assert(offsetof(UUpsell_TutorialTooltip_C, UberGraphFrame) == 0x000280, "Member 'UUpsell_TutorialTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, burstLoop) == 0x000288, "Member 'UUpsell_TutorialTooltip_C::burstLoop' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, Show) == 0x000290, "Member 'UUpsell_TutorialTooltip_C::Show' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, HorizontalBoxcontent) == 0x000298, "Member 'UUpsell_TutorialTooltip_C::HorizontalBoxcontent' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, Icon) == 0x0002A0, "Member 'UUpsell_TutorialTooltip_C::Icon' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, Image_Arrow) == 0x0002A8, "Member 'UUpsell_TutorialTooltip_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, In_Text) == 0x0002B0, "Member 'UUpsell_TutorialTooltip_C::In_Text' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, In_Brush) == 0x0002D0, "Member 'UUpsell_TutorialTooltip_C::In_Brush' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, In_Horizontal_Alignment) == 0x000380, "Member 'UUpsell_TutorialTooltip_C::In_Horizontal_Alignment' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, In_Vertical_Alignment) == 0x000381, "Member 'UUpsell_TutorialTooltip_C::In_Vertical_Alignment' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, In_Transform) == 0x000384, "Member 'UUpsell_TutorialTooltip_C::In_Transform' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, Show_Icon) == 0x0003A0, "Member 'UUpsell_TutorialTooltip_C::Show_Icon' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, Right) == 0x0003A4, "Member 'UUpsell_TutorialTooltip_C::Right' has a wrong offset!");

}

