#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VBucksStoreScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VBucksStoreScreen.VBucksStoreScreen_C
// 0x0088 (0x05D8 - 0x0550)
class UVBucksStoreScreen_C final : public UFortVbucksStoreScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          CurrencyNotificationBorder;                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrencyNotificationText;                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_ExtraContentBottom;                      // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NewNoOffersBox;                                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NewPurchasingDisabledBox;                          // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewSpinner;                                        // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            NewSwitcherItemsProgress;                          // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NewVbuckOffers;                                    // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NewVBuckSection;                                   // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              OfferScaleBoxRoot;                                 // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAudioComponent*                        Ambient_Sound;                                     // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                InitiallyFocusedOffer;                             // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowingCampaignUpsell;                            // 0x05D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseMobileLayout;                                  // 0x05D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ApplyMobileLayout();
	void BP_OnActivated();
	void ExecuteUbergraph_VBucksStoreScreen(int32 EntryPoint);
	void GetVisibilityByChildrenPresence(class UPanelWidget* Panel, ESlateVisibility* NewParam);
	void HandleAllOffersGenerated();
	void HandleBack(bool* PassThrough);
	void HandleRedeem(bool* bPassThrough);
	void NoOffersAvailable();
	void OnOffersGenerated();
	void OnPurchasingDisabled();
	void OnStartReadingOffers();
	void OnTransitionedBySwitcher();
	void OnUpdateOtherPlatformMTXMessage(bool HasOtherPlatformCurrency, const class FText& CurrencyMessageLocText);
	void PlayEquippedLockerMusic();
	void PreConstruct(bool IsDesignTime);
	void UpdateCurrencyNotification();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VBucksStoreScreen_C">();
	}
	static class UVBucksStoreScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVBucksStoreScreen_C>();
	}
};
static_assert(alignof(UVBucksStoreScreen_C) == 0x000008, "Wrong alignment on UVBucksStoreScreen_C");
static_assert(sizeof(UVBucksStoreScreen_C) == 0x0005D8, "Wrong size on UVBucksStoreScreen_C");
static_assert(offsetof(UVBucksStoreScreen_C, UberGraphFrame) == 0x000550, "Member 'UVBucksStoreScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, Intro) == 0x000558, "Member 'UVBucksStoreScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, CurrencyNotificationBorder) == 0x000560, "Member 'UVBucksStoreScreen_C::CurrencyNotificationBorder' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, CurrencyNotificationText) == 0x000568, "Member 'UVBucksStoreScreen_C::CurrencyNotificationText' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, HorizontalBox_0) == 0x000570, "Member 'UVBucksStoreScreen_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, NamedSlot_ExtraContentBottom) == 0x000578, "Member 'UVBucksStoreScreen_C::NamedSlot_ExtraContentBottom' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, NewNoOffersBox) == 0x000580, "Member 'UVBucksStoreScreen_C::NewNoOffersBox' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, NewPurchasingDisabledBox) == 0x000588, "Member 'UVBucksStoreScreen_C::NewPurchasingDisabledBox' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, NewSpinner) == 0x000590, "Member 'UVBucksStoreScreen_C::NewSpinner' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, NewSwitcherItemsProgress) == 0x000598, "Member 'UVBucksStoreScreen_C::NewSwitcherItemsProgress' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, NewVbuckOffers) == 0x0005A0, "Member 'UVBucksStoreScreen_C::NewVbuckOffers' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, NewVBuckSection) == 0x0005A8, "Member 'UVBucksStoreScreen_C::NewVBuckSection' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, OfferScaleBoxRoot) == 0x0005B0, "Member 'UVBucksStoreScreen_C::OfferScaleBoxRoot' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, Overlay_0) == 0x0005B8, "Member 'UVBucksStoreScreen_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, Ambient_Sound) == 0x0005C0, "Member 'UVBucksStoreScreen_C::Ambient_Sound' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, InitiallyFocusedOffer) == 0x0005C8, "Member 'UVBucksStoreScreen_C::InitiallyFocusedOffer' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, bShowingCampaignUpsell) == 0x0005D0, "Member 'UVBucksStoreScreen_C::bShowingCampaignUpsell' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, bUseMobileLayout) == 0x0005D1, "Member 'UVBucksStoreScreen_C::bUseMobileLayout' has a wrong offset!");

}

