#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Violator_ActiveFriends

#include "Basic.hpp"


namespace SDK::Params
{

// Function Violator_ActiveFriends.Violator_ActiveFriends_C.CallOut Hide
// 0x0008 (0x0008 - 0x0000)
struct Violator_ActiveFriends_C_CallOut_Hide final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Violator_ActiveFriends_C_CallOut_Hide) == 0x000008, "Wrong alignment on Violator_ActiveFriends_C_CallOut_Hide");
static_assert(sizeof(Violator_ActiveFriends_C_CallOut_Hide) == 0x000008, "Wrong size on Violator_ActiveFriends_C_CallOut_Hide");
static_assert(offsetof(Violator_ActiveFriends_C_CallOut_Hide, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'Violator_ActiveFriends_C_CallOut_Hide::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function Violator_ActiveFriends.Violator_ActiveFriends_C.CallOut Surface
// 0x0008 (0x0008 - 0x0000)
struct Violator_ActiveFriends_C_CallOut_Surface final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Violator_ActiveFriends_C_CallOut_Surface) == 0x000008, "Wrong alignment on Violator_ActiveFriends_C_CallOut_Surface");
static_assert(sizeof(Violator_ActiveFriends_C_CallOut_Surface) == 0x000008, "Wrong size on Violator_ActiveFriends_C_CallOut_Surface");
static_assert(offsetof(Violator_ActiveFriends_C_CallOut_Surface, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'Violator_ActiveFriends_C_CallOut_Surface::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function Violator_ActiveFriends.Violator_ActiveFriends_C.ExecuteUbergraph_Violator_ActiveFriends
// 0x0008 (0x0008 - 0x0000)
struct Violator_ActiveFriends_C_ExecuteUbergraph_Violator_ActiveFriends final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Violator_ActiveFriends_C_ExecuteUbergraph_Violator_ActiveFriends) == 0x000004, "Wrong alignment on Violator_ActiveFriends_C_ExecuteUbergraph_Violator_ActiveFriends");
static_assert(sizeof(Violator_ActiveFriends_C_ExecuteUbergraph_Violator_ActiveFriends) == 0x000008, "Wrong size on Violator_ActiveFriends_C_ExecuteUbergraph_Violator_ActiveFriends");
static_assert(offsetof(Violator_ActiveFriends_C_ExecuteUbergraph_Violator_ActiveFriends, EntryPoint) == 0x000000, "Member 'Violator_ActiveFriends_C_ExecuteUbergraph_Violator_ActiveFriends::EntryPoint' has a wrong offset!");
static_assert(offsetof(Violator_ActiveFriends_C_ExecuteUbergraph_Violator_ActiveFriends, K2Node_Event_IsDesignTime) == 0x000004, "Member 'Violator_ActiveFriends_C_ExecuteUbergraph_Violator_ActiveFriends::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function Violator_ActiveFriends.Violator_ActiveFriends_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Violator_ActiveFriends_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Violator_ActiveFriends_C_PreConstruct) == 0x000001, "Wrong alignment on Violator_ActiveFriends_C_PreConstruct");
static_assert(sizeof(Violator_ActiveFriends_C_PreConstruct) == 0x000001, "Wrong size on Violator_ActiveFriends_C_PreConstruct");
static_assert(offsetof(Violator_ActiveFriends_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Violator_ActiveFriends_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

