#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Violator_ActiveFriends

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Violator_ActiveFriends.Violator_ActiveFriends_C
// 0x0048 (0x02C0 - 0x0278)
class UViolator_ActiveFriends_C final : public UFortActiveFriendsViolator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Reset_Off;                                         // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Update_Down;                                       // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Update_Up;                                         // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_UpdateFlare;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SocialIcon;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_DeltaChange;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowBox;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void CallOut_Hide();
	void CallOut_Surface();
	void Construct();
	void ExecuteUbergraph_Violator_ActiveFriends(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Violator_ActiveFriends_C">();
	}
	static class UViolator_ActiveFriends_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViolator_ActiveFriends_C>();
	}
};
static_assert(alignof(UViolator_ActiveFriends_C) == 0x000008, "Wrong alignment on UViolator_ActiveFriends_C");
static_assert(sizeof(UViolator_ActiveFriends_C) == 0x0002C0, "Wrong size on UViolator_ActiveFriends_C");
static_assert(offsetof(UViolator_ActiveFriends_C, UberGraphFrame) == 0x000278, "Member 'UViolator_ActiveFriends_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, Reset_Off) == 0x000280, "Member 'UViolator_ActiveFriends_C::Reset_Off' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, Update_Down) == 0x000288, "Member 'UViolator_ActiveFriends_C::Update_Down' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, Update_Up) == 0x000290, "Member 'UViolator_ActiveFriends_C::Update_Up' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, Intro) == 0x000298, "Member 'UViolator_ActiveFriends_C::Intro' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, Image_UpdateFlare) == 0x0002A0, "Member 'UViolator_ActiveFriends_C::Image_UpdateFlare' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, SocialIcon) == 0x0002A8, "Member 'UViolator_ActiveFriends_C::SocialIcon' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, Text_DeltaChange) == 0x0002B0, "Member 'UViolator_ActiveFriends_C::Text_DeltaChange' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, YellowBox) == 0x0002B8, "Member 'UViolator_ActiveFriends_C::YellowBox' has a wrong offset!");

}

